{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个康复中心为残疾人提供全方位的身体功能恢复训练。",
      "sentence_pinyin": "Zhège kāngfù zhōngxīn wèi cánjírén tígōng quánfāngwèi de shēntǐ gōngnéng huīfù xùnliàn.",
      "sentence_fr": "Ce centre de réadaptation offre une formation complète de récupération des fonctions corporelles aux personnes handicapées.",
      "sentence_en": "This rehabilitation center provides comprehensive physical function recovery training for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rehabilitation",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的漫画作品幽默诙谐，深受年轻读者的欢迎。",
      "sentence_pinyin": "Tā de mànhuà zuòpǐn yōumò huīxié, shēn shòu niánqīng dúzhě de huānyíng.",
      "sentence_fr": "Ses œuvres de bande dessinée sont humoristiques et spirituelles, très appréciées des jeunes lecteurs.",
      "sentence_en": "Her comic works are humorous and witty, very popular among young readers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "comics",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧城市项目整合了交通、能源、环境等多个管理系统。",
      "sentence_pinyin": "Zhège zhìhuì chéngshì xiàngmù zhěnghéle jiāotōng, néngyuán, huánjìng děng duō ge guǎnlǐ xìtǒng.",
      "sentence_fr": "Ce projet de ville intelligente intègre plusieurs systèmes de gestion tels que transport, énergie et environnement.",
      "sentence_en": "This smart city project integrates multiple management systems such as transportation, energy, and environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_city_integration",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在戏曲表演中继承和发扬了传统艺术的精髓。",
      "sentence_pinyin": "Tā zài xìqǔ biǎoyǎn zhōng jìchéng hé fāyángle chuántǒng yìshù de jīngsuǐ.",
      "sentence_fr": "Dans sa performance d'opéra traditionnel, il a hérité et promu l'essence de l'art traditionnel.",
      "sentence_en": "In his traditional opera performance, he inherited and promoted the essence of traditional art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "traditional_opera",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个精准扶贫项目帮助贫困家庭实现了脱贫致富。",
      "sentence_pinyin": "Zhège jīngzhǔn fúpín xiàngmù bāngzhù pínkùn jiātíng shíxiànle tuōpín zhìfù.",
      "sentence_fr": "Ce projet de réduction ciblée de la pauvreté a aidé les familles pauvres à sortir de la pauvreté et à s'enrichir.",
      "sentence_en": "This targeted poverty alleviation project helped poor families escape poverty and achieve prosperity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poverty_alleviation",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过瑜伽教学帮助学员改善身体柔韧性和心理状态。",
      "sentence_pinyin": "Tā tōngguò yújiā jiàoxué bāngzhù xuéyuán gǎishàn shēntǐ róurènxìng hé xīnlǐ zhuàngtài.",
      "sentence_fr": "Grâce à son enseignement du yoga, elle aide les étudiants à améliorer leur flexibilité corporelle et leur état psychologique.",
      "sentence_en": "Through yoga teaching, she helps students improve their body flexibility and psychological state.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yoga_teaching",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个图书馆数字化项目将珍贵古籍转化为电子资源永久保存。",
      "sentence_pinyin": "Zhège túshūguǎn shùzìhuà xiàngmù jiāng zhēnguì gǔjí zhuǎnhuà wéi diànzǐ zīyuán yǒngjiǔ bǎocún.",
      "sentence_fr": "Ce projet de numérisation de bibliothèque convertit des livres anciens précieux en ressources numériques pour une conservation permanente.",
      "sentence_en": "This library digitization project converts precious ancient books into digital resources for permanent preservation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_preservation",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在跆拳道比赛中展现了精湛的技术和顽强的斗志。",
      "sentence_pinyin": "Tā zài táiquándào bǐsài zhōng zhǎnxiànle jīngzhàn de jìshù hé wánqiáng de dòuzhì.",
      "sentence_fr": "Il a démontré une technique exquise et un esprit combatif tenace lors de la compétition de taekwondo.",
      "sentence_en": "He demonstrated exquisite technique and tenacious fighting spirit in the taekwondo competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "taekwondo",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个游戏开发工作室制作了多款广受好评的独立游戏。",
      "sentence_pinyin": "Zhège yóuxì kāifā gōngzuòshì zhìzuòle duō kuǎn guǎng shòu hǎopíng de dúlì yóuxì.",
      "sentence_fr": "Ce studio de développement de jeux a créé plusieurs jeux indépendants largement acclamés.",
      "sentence_en": "This game development studio created multiple widely acclaimed indie games.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "indie_games",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在声乐教学中注重培养学生的音乐感受力和表现力。",
      "sentence_pinyin": "Tā zài shēngyuè jiàoxué zhōng zhùzhòng péiyǎng xuésheng de yīnyuè gǎnshòulì hé biǎoxiànlì.",
      "sentence_fr": "Dans l'enseignement du chant, elle met l'accent sur le développement de la sensibilité musicale et de l'expression des étudiants.",
      "sentence_en": "In vocal teaching, she emphasizes developing students' musical sensitivity and expression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vocal_training",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个民宿网络平台连接了旅行者和当地特色住宿。",
      "sentence_pinyin": "Zhège mínsù wǎngluò píngtái liánjiēle lǚxíngzhě hé dāngdì tèsè zhùsù.",
      "sentence_fr": "Cette plateforme de réseau d'hébergements chez l'habitant connecte les voyageurs avec des logements locaux caractéristiques.",
      "sentence_en": "This homestay network platform connects travelers with local characteristic accommodations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "homestay_platforms",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在科技论文写作中严格遵循学术规范和研究伦理。",
      "sentence_pinyin": "Tā zài kējì lùnwén xiězuò zhōng yángé zūnxún xuéshù guīfàn hé yánjiū lúnlǐ.",
      "sentence_fr": "Dans la rédaction d'articles scientifiques, il respecte strictement les normes académiques et l'éthique de la recherche.",
      "sentence_en": "In scientific paper writing, he strictly follows academic standards and research ethics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "academic_integrity",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个儿童剧院为孩子们带来了精彩的童话故事表演。",
      "sentence_pinyin": "Zhège értóng jùyuàn wèi háizimen dàiláile jīngcǎi de tónghuà gùshi biǎoyǎn.",
      "sentence_fr": "Ce théâtre pour enfants apporte aux enfants de merveilleuses performances de contes de fées.",
      "sentence_en": "This children's theater brings wonderful fairy tale performances to children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "childrens_theater",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的篆刻作品刀法娴熟，章法严谨，富有艺术美感。",
      "sentence_pinyin": "Tā de zhuànkè zuòpǐn dāofǎ xiánshú, zhāngfǎ yánjǐn, fùyǒu yìshù měigǎn.",
      "sentence_fr": "Ses œuvres de gravure de sceaux montrent une maîtrise experte du couteau, une composition rigoureuse et un sens esthétique artistique.",
      "sentence_en": "Her seal carving works show skillful knife technique, rigorous composition, and artistic aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "seal_carving",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个云存储服务为用户提供了安全可靠的数据备份解决方案。",
      "sentence_pinyin": "Zhège yún cúnchǔ fúwù wèi yònghù tígōngle ānquán kěkào de shùjù bèifèn jiějué fāng'àn.",
      "sentence_fr": "Ce service de stockage cloud fournit aux utilisateurs des solutions de sauvegarde de données sûres et fiables.",
      "sentence_en": "This cloud storage service provides users with secure and reliable data backup solutions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_storage",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在攀岩运动中锻炼了胆量和身体协调能力。",
      "sentence_pinyin": "Tā zài pānyán yùndòng zhōng duànliànle dǎnliàng hé shēntǐ xiétiáo nénglì.",
      "sentence_fr": "Dans l'escalade, il a développé son courage et sa coordination corporelle.",
      "sentence_en": "In rock climbing, he developed his courage and body coordination.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rock_climbing",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生物多样性保护项目成功恢复了多个濒危物种的种群数量。",
      "sentence_pinyin": "Zhège shēngwù duōyàngxìng bǎohù xiàngmù chénggōng huīfùle duō ge bīnwēi wùzhǒng de zhǒngqún shùliàng.",
      "sentence_fr": "Ce projet de protection de la biodiversité a réussi à restaurer les populations de plusieurs espèces menacées.",
      "sentence_en": "This biodiversity conservation project successfully restored populations of multiple endangered species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biodiversity",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的诗歌朗诵情感饱满，声音富有感染力。",
      "sentence_pinyin": "Tā de shīgē lǎngsòng qínggǎn bǎomǎn, shēngyīn fùyǒu gǎnrǎnlì.",
      "sentence_fr": "Sa récitation de poésie est pleine d'émotion, avec une voix très expressive.",
      "sentence_en": "Her poetry recitation is full of emotion, with a very expressive voice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poetry_recitation",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能农场利用传感器和物联网技术实现精准灌溉。",
      "sentence_pinyin": "Zhège zhìnéng nóngchǎng lìyòng chuángǎnqì hé wùliánwǎng jìshù shíxiàn jīngzhǔn guàngài.",
      "sentence_fr": "Cette ferme intelligente utilise des capteurs et la technologie IoT pour réaliser une irrigation de précision.",
      "sentence_en": "This smart farm uses sensors and IoT technology to achieve precision irrigation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "precision_farming",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在金融投资领域积累了丰富的实战经验和专业知识。",
      "sentence_pinyin": "Tā zài jīnróng tóuzī lǐngyù jīlěile fēngfù de shízhàn jīngyàn hé zhuānyè zhīshi.",
      "sentence_fr": "Il a accumulé une riche expérience pratique et des connaissances professionnelles dans le domaine de l'investissement financier.",
      "sentence_en": "He accumulated rich practical experience and professional knowledge in the financial investment field.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "financial_investment",
      "created_at": "2025-11-20T18:30:00.000Z",
      "updated_at": "2025-11-20T18:30:00.000Z"
    }
  ]
}
