{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能台灯可以根据环境光线自动调节亮度,保护用户视力健康。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng táidēng kěyǐ gēnjù huánjìng guāngxiàn zìdòng tiáojié liàngdù, bǎohù yònghù shìlì jiànkāng.",
      "sentence_fr": "Cette lampe de bureau intelligente ajuste automatiquement la luminosité selon la lumière ambiante pour protéger la vision.",
      "sentence_en": "This smart desk lamp automatically adjusts brightness based on ambient light to protect users' eye health.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_desk_lamps",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳西族的东巴文是世界上唯一仍在使用的象形文字,被称为文字界的活化石。",
      "sentence_pinyin": "Nàxīzú de Dōngbāwén shì shìjiè shàng wéiyī réng zài shǐyòng de xiàngxíng wénzì, bèi chēng wéi wénzìjiè de huóhuàshí.",
      "sentence_fr": "L'écriture Dongba des Naxi est la seule écriture pictographique encore utilisée dans le monde, appelée le fossile vivant de l'écriture.",
      "sentence_en": "The Naxi people's Dongba script is the world's only pictographic writing still in use, called a living fossil of writing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "naxi_dongba_script",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市建设了雨水收集系统,将雨水净化后用于绿化灌溉和道路清洗。",
      "sentence_pinyin": "Chéngshì jiànshè le yǔshuǐ shōují xìtǒng, jiāng yǔshuǐ jìnghuà hòu yòng yú lǜhuà guàngài hé dàolù qīngxǐ.",
      "sentence_fr": "La ville a construit un système de collecte des eaux de pluie pour purifier l'eau et l'utiliser pour l'arrosage des espaces verts et le nettoyage des routes.",
      "sentence_en": "The city built a rainwater collection system to purify rainwater for green space irrigation and road cleaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rainwater_harvesting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拍洋画是过去孩子们喜爱的游戏,用手掌拍打地面上的画片。",
      "sentence_pinyin": "Pāi yánghuà shì guòqù háizimen xǐ'ài de yóuxì, yòng shǒuzhǎng pāidǎ dìmiàn shàng de huàpiàn.",
      "sentence_fr": "Taper sur les cartes illustrées était un jeu populaire parmi les enfants, consistant à frapper les cartes au sol avec la paume.",
      "sentence_en": "Slapping picture cards was a favorite game among children, using palms to hit cards on the ground.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "picture_card_slapping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能门锁支持指纹、密码和人脸识别多种开锁方式。",
      "sentence_pinyin": "Zhège zhìnéng ménsuǒ zhīchí zhǐwén, mìmǎ hé rénliǎn shìbié duō zhǒng kāisuǒ fāngshì.",
      "sentence_fr": "Cette serrure intelligente prend en charge plusieurs méthodes de déverrouillage : empreinte digitale, code et reconnaissance faciale.",
      "sentence_en": "This smart door lock supports multiple unlocking methods including fingerprint, password, and facial recognition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_door_locks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "景颇族的目瑙纵歌节是盛大的集体歌舞节日,参与者可达数万人。",
      "sentence_pinyin": "Jǐngpōzú de Mùnǎozòngējié shì shèngdà de jítǐ gēwǔ jiérì, cānyùzhě kě dá shùwàn rén.",
      "sentence_fr": "Le festival Munao Zongge des Jingpo est une grande fête de chants et danses collectives pouvant réunir des dizaines de milliers de participants.",
      "sentence_en": "The Jingpo people's Munao Zongge Festival is a grand collective singing and dancing festival with participants reaching tens of thousands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jingpo_munao_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展了邻里守望活动,居民互相照应提高安全防范意识。",
      "sentence_pinyin": "Shèqū kāizhǎn le línlǐ shǒuwàng huódòng, jūmín hùxiāng zhàoyìng tígāo ānquán fángfàn yìshí.",
      "sentence_fr": "La communauté a lancé un programme de surveillance de voisinage où les résidents veillent les uns sur les autres pour améliorer la sécurité.",
      "sentence_en": "The community launched a neighborhood watch program where residents look out for each other to improve safety awareness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "neighborhood_watch",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电视支持语音搜索和手势控制,操作更加便捷直观。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànshì zhīchí yǔyīn sōusuǒ hé shǒushì kòngzhì, cāozuò gèngjiā biànjié zhíguān.",
      "sentence_fr": "Cette télévision intelligente prend en charge la recherche vocale et le contrôle gestuel pour une utilisation plus pratique et intuitive.",
      "sentence_en": "This smart TV supports voice search and gesture control for more convenient and intuitive operation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_televisions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拉祜族的芦笙舞是他们最具特色的民间舞蹈,男女老少都能参与。",
      "sentence_pinyin": "Lāhùzú de lúshēngwǔ shì tāmen zuì jù tèsè de mínjiān wǔdǎo, nánnǚ lǎoshào dōu néng cānyù.",
      "sentence_fr": "La danse du lusheng des Lahu est leur danse folklorique la plus caractéristique, à laquelle hommes, femmes et enfants peuvent tous participer.",
      "sentence_en": "The Lahu people's lusheng dance is their most distinctive folk dance, in which men, women, and children of all ages can participate.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lahu_lusheng_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府完善了城市公共自行车系统,市民可以在任意站点借还车辆。",
      "sentence_pinyin": "Zhèngfǔ wánshàn le chéngshì gōnggòng zìxíngchē xìtǒng, shìmín kěyǐ zài rènyì zhàndiǎn jièhuán chēliàng.",
      "sentence_fr": "Le gouvernement a amélioré le système de vélos publics urbains, permettant aux citoyens d'emprunter et de rendre des vélos à n'importe quelle station.",
      "sentence_en": "The government improved the urban public bicycle system, allowing citizens to borrow and return bikes at any station.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_bicycle_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "斗蛐蛐是中国传统民间娱乐活动,需要精心饲养和训练蟋蟀。",
      "sentence_pinyin": "Dòu qūqū shì Zhōngguó chuántǒng mínjiān yúlè huódòng, xūyào jīngxīn sìyǎng hé xùnliàn xīshuài.",
      "sentence_fr": "Le combat de grillons est un divertissement traditionnel chinois nécessitant un élevage et un entraînement soigneux des grillons.",
      "sentence_en": "Cricket fighting is a traditional Chinese folk entertainment requiring careful breeding and training of crickets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cricket_fighting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能净水器能够实时显示水质情况并自动提醒更换滤芯。",
      "sentence_pinyin": "Zhège zhìnéng jìngshuǐqì nénggòu shíshí xiǎnshì shuǐzhì qíngkuàng bìng zìdòng tíxǐng gēnghuàn lǜxīn.",
      "sentence_fr": "Ce purificateur d'eau intelligent affiche la qualité de l'eau en temps réel et rappelle automatiquement de changer le filtre.",
      "sentence_en": "This smart water purifier displays real-time water quality and automatically reminds users to replace filters.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_purifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "佤族的木鼓是他们的神圣器物,制作和祭祀都有严格的仪式。",
      "sentence_pinyin": "Wǎzú de mùgǔ shì tāmen de shénshèng qìwù, zhìzuò hé jìsì dōu yǒu yángé de yíshì.",
      "sentence_fr": "Le tambour en bois des Wa est leur objet sacré, avec des rituels stricts pour sa fabrication et ses cérémonies.",
      "sentence_en": "The Wa people's wooden drum is their sacred object, with strict rituals for its making and worship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wa_wooden_drums",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织了垃圾分类知识竞赛,提高居民的环保意识和分类能力。",
      "sentence_pinyin": "Shèqū zǔzhī le lājī fēnlèi zhīshi jìngsài, tígāo jūmín de huánbǎo yìshí hé fēnlèi nénglì.",
      "sentence_fr": "La communauté a organisé un concours de connaissances sur le tri des déchets pour améliorer la conscience écologique et les compétences de tri des résidents.",
      "sentence_en": "The community organized a waste sorting knowledge competition to improve residents' environmental awareness and sorting skills.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能暖风机可以快速加热房间,还能定时开关节约能源。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng nuǎnfēngjī kěyǐ kuàisù jiārè fángjiān, hái néng dìngshí kāiguān jiéyuē néngyuán.",
      "sentence_fr": "Ce chauffage soufflant intelligent peut chauffer rapidement une pièce et dispose d'une minuterie pour économiser l'énergie.",
      "sentence_en": "This smart fan heater can quickly heat rooms and features timer controls to save energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fan_heaters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "打弹弓曾经是男孩子们最喜欢的户外活动,考验瞄准能力。",
      "sentence_pinyin": "Dǎ dàngōng céngjīng shì nánháizimen zuì xǐhuān de hùwài huódòng, kǎoyàn miáozhǔn nénglì.",
      "sentence_fr": "Tirer au lance-pierres était autrefois l'activité de plein air préférée des garçons, testant leur capacité de visée.",
      "sentence_en": "Slingshot shooting was once boys' favorite outdoor activity, testing their aiming ability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "slingshot_activity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "傈僳族的上刀山下火海是惊险的传统表演,展现了勇气和技艺。",
      "sentence_pinyin": "Lìsùzú de shàngdāoshān xiàhuǒhǎi shì jīngxiǎn de chuántǒng biǎoyǎn, zhǎnxiàn le yǒngqì hé jìyì.",
      "sentence_fr": "L'escalade d'échelles de couteaux et la marche sur le feu des Lisu est une performance traditionnelle audacieuse démontrant courage et habileté.",
      "sentence_en": "The Lisu people's knife-ladder climbing and fire-walking is a thrilling traditional performance showcasing courage and skill.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lisu_knife_fire_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市建设了智慧交通系统,实时调控信号灯缓解交通拥堵问题。",
      "sentence_pinyin": "Chéngshì jiànshè le zhìhuì jiāotōng xìtǒng, shíshí tiáokòng xìnhàodēng huǎnjiě jiāotōng yōngdǔ wèntí.",
      "sentence_fr": "La ville a construit un système de transport intelligent, régulant les feux de signalisation en temps réel pour atténuer les embouteillages.",
      "sentence_en": "The city built a smart transportation system, adjusting traffic lights in real-time to alleviate traffic congestion.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_traffic_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能音箱不仅能播放音乐,还能控制家中其他智能设备。",
      "sentence_pinyin": "Zhège zhìnéng yīnxiāng bùjǐn néng bōfàng yīnyuè, hái néng kòngzhì jiā zhōng qítā zhìnéng shèbèi.",
      "sentence_fr": "Cette enceinte intelligente peut non seulement diffuser de la musique, mais aussi contrôler d'autres appareils intelligents de la maison.",
      "sentence_en": "This smart speaker can not only play music but also control other smart devices in the home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_speakers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈尼族的梯田是人与自然和谐共处的杰作,已被列入世界文化遗产。",
      "sentence_pinyin": "Hānízú de tītián shì rén yǔ zìrán héxié gòngchǔ de jiézuò, yǐ bèi lièrù shìjiè wénhuà yíchǎn.",
      "sentence_fr": "Les rizières en terrasses des Hani sont un chef-d'œuvre d'harmonie entre l'homme et la nature, inscrites au patrimoine mondial.",
      "sentence_en": "The Hani people's terraced rice fields are a masterpiece of harmony between humans and nature, listed as a World Cultural Heritage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hani_rice_terraces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
