{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个乡村振兴项目通过发展特色产业带动了当地经济增长。",
      "sentence_pinyin": "Zhège xiāngcūn zhènxīng xiàngmù tōngguò fāzhǎn tèsè chǎnyè dàidòngle dāngdì jīngjì zēngzhǎng.",
      "sentence_fr": "Ce projet de revitalisation rurale a stimulé la croissance économique locale grâce au développement d'industries caractéristiques.",
      "sentence_en": "This rural revitalization project stimulated local economic growth through developing characteristic industries.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_revitalization",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在唢呐演奏中展现了雄浑有力的音色和娴熟的技巧。",
      "sentence_pinyin": "Tā zài suǒnà yǎnzòu zhōng zhǎnxiànle xiónghún yǒulì de yīnsè hé xiánshú de jìqiǎo.",
      "sentence_fr": "Elle a démontré un timbre puissant et vigoureux et une technique habile dans son jeu de suona.",
      "sentence_en": "She demonstrated a powerful and vigorous timbre and skillful technique in her suona performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_music",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能客流分析系统帮助商场优化人员配置和服务安排。",
      "sentence_pinyin": "Zhège zhìnéng kèliú fēnxī xìtǒng bāngzhù shāngchǎng yōuhuà rényuán pèizhì hé fúwù ānpái.",
      "sentence_fr": "Ce système d'analyse intelligente du flux de clients aide les centres commerciaux à optimiser l'allocation du personnel et l'organisation des services.",
      "sentence_en": "This intelligent customer flow analysis system helps shopping malls optimize staff allocation and service arrangements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "customer_analytics",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在历史小说创作中还原了特定时代的社会风貌和人物命运。",
      "sentence_pinyin": "Tā zài lìshǐ xiǎoshuō chuàngzuò zhōng huányuánle tèdìng shídài de shèhuì fēngmào hé rénwù mìngyùn.",
      "sentence_fr": "Dans la création de romans historiques, il a recréé la physionomie sociale et le destin des personnages d'une époque spécifique.",
      "sentence_en": "In historical novel creation, he recreated the social landscape and character fates of a specific era.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "historical_novels",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个儿童安全教育项目教授孩子们自我保护和应急避险知识。",
      "sentence_pinyin": "Zhège értóng ānquán jiàoyù xiàngmù jiàoshòu háizimen zìwǒ bǎohù hé yìngjí bìxiǎn zhīshi.",
      "sentence_fr": "Ce programme d'éducation à la sécurité des enfants enseigne aux enfants l'auto-protection et les connaissances d'évitement d'urgence.",
      "sentence_en": "This child safety education program teaches children self-protection and emergency avoidance knowledge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "child_safety_education",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的灯光设计为舞台表演营造了丰富的视觉层次和情感氛围。",
      "sentence_pinyin": "Tā de dēngguāng shèjì wèi wǔtái biǎoyǎn yíngzàole fēngfù de shìjué céngcì hé qínggǎn fēnwéi.",
      "sentence_fr": "Sa conception d'éclairage crée de riches couches visuelles et une atmosphère émotionnelle pour les performances scéniques.",
      "sentence_en": "Her lighting design creates rich visual layers and emotional atmosphere for stage performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stage_lighting",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个碳排放监测平台追踪企业的温室气体排放数据。",
      "sentence_pinyin": "Zhège tàn páifàng jiāncè píngtái zhuīzōng qǐyè de wēnshì qìtǐ páifàng shùjù.",
      "sentence_fr": "Cette plateforme de surveillance des émissions de carbone suit les données d'émissions de gaz à effet de serre des entreprises.",
      "sentence_en": "This carbon emission monitoring platform tracks corporate greenhouse gas emission data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "carbon_monitoring",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在田径训练中不断提升速度、力量和爆发力。",
      "sentence_pinyin": "Tā zài tiánjìng xùnliàn zhōng bùduàn tíshēng sùdù, lìliàng hé bàofālì.",
      "sentence_fr": "Lors de l'entraînement d'athlétisme, il améliore constamment sa vitesse, sa force et sa puissance explosive.",
      "sentence_en": "In track and field training, he constantly improves speed, strength, and explosive power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "track_and_field",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区矫正中心帮助服刑人员顺利回归社会并重新就业。",
      "sentence_pinyin": "Zhège shèqū jiǎozhèng zhōngxīn bāngzhù fúxíng rényuán shùnlì huíguī shèhuì bìng chóngxīn jiùyè.",
      "sentence_fr": "Ce centre de correction communautaire aide les détenus à réintégrer la société et à se réemployer.",
      "sentence_en": "This community correction center helps inmates smoothly reintegrate into society and re-employ.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_corrections",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在木雕创作中将传统题材与现代造型语言相结合。",
      "sentence_pinyin": "Tā zài mùdiāo chuàngzuò zhōng jiāng chuántǒng tícái yǔ xiàndài zàoxíng yǔyán xiāng jiéhé.",
      "sentence_fr": "Dans la sculpture sur bois, elle combine des thèmes traditionnels avec un langage sculptural moderne.",
      "sentence_en": "In wood carving creation, she combines traditional themes with modern sculptural language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wood_carving",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个无人值守停车场采用车牌识别和移动支付技术。",
      "sentence_pinyin": "Zhège wúrén zhíshǒu tíngchēchǎng cǎiyòng chēpái shíbié hé yídòng zhīfù jìshù.",
      "sentence_fr": "Ce parking sans surveillance adopte la technologie de reconnaissance de plaques d'immatriculation et de paiement mobile.",
      "sentence_en": "This unmanned parking lot adopts license plate recognition and mobile payment technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "automated_parking",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在扬琴演奏中展现了清脆悦耳的音色和流畅的旋律线条。",
      "sentence_pinyin": "Tā zài yángqín yǎnzòu zhōng zhǎnxiànle qīngcuì yuè'ěr de yīnsè hé liúchàng de xuánlǜ xiàntiáo.",
      "sentence_fr": "Il a démontré un timbre clair et agréable et des lignes mélodiques fluides dans son jeu de yangqin.",
      "sentence_en": "He demonstrated a clear and pleasant timbre and fluid melodic lines in his yangqin performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangqin_music",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个药品监管系统确保了从生产到销售的全程质量控制。",
      "sentence_pinyin": "Zhège yàopǐn jiānguǎn xìtǒng quèbǎole cóng shēngchǎn dào xiāoshòu de quánchéng zhìliàng kòngzhì.",
      "sentence_fr": "Ce système de surveillance pharmaceutique assure un contrôle qualité complet de la production à la vente.",
      "sentence_en": "This pharmaceutical supervision system ensures complete quality control from production to sales.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pharmaceutical_regulation",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的数字绘画作品运用了图层、笔刷和特效等多种创作手法。",
      "sentence_pinyin": "Tā de shùzì huìhuà zuòpǐn yùnyòngle túcéng, bǐshuā hé tèxiào děng duō zhǒng chuàngzuò shǒufǎ.",
      "sentence_fr": "Ses œuvres de peinture numérique utilisent diverses techniques créatives comme les calques, les pinceaux et les effets spéciaux.",
      "sentence_en": "Her digital painting works use various creative techniques such as layers, brushes, and special effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_painting",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个沙漠治理项目通过种植防护林带有效遏制了沙漠化扩展。",
      "sentence_pinyin": "Zhège shāmò zhìlǐ xiàngmù tōngguò zhòngzhí fánghù líndài yǒuxiào èzhìle shāmòhuà kuòzhǎn.",
      "sentence_fr": "Ce projet de contrôle du désert a efficacement freiné l'expansion de la désertification en plantant des ceintures de forêts protectrices.",
      "sentence_en": "This desert control project effectively curbed desertification expansion by planting protective forest belts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "desertification_control",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在剧本创作中注重人物性格塑造和情节冲突设置。",
      "sentence_pinyin": "Tā zài jùběn chuàngzuò zhōng zhùzhòng rénwù xìnggé sùzào hé qíngjié chōngtū shèzhì.",
      "sentence_fr": "Dans la création de scénarios, il met l'accent sur la formation des personnages et la configuration des conflits dramatiques.",
      "sentence_en": "In screenplay creation, he emphasizes character development and plot conflict setup.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "screenwriting",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食品快速检测车在集市和超市开展流动检测服务。",
      "sentence_pinyin": "Zhège shípǐn kuàisù jiǎncè chē zài jíshì hé chāoshì kāizhǎn liúdòng jiǎncè fúwù.",
      "sentence_fr": "Ce véhicule de test alimentaire rapide fournit des services de test mobiles dans les marchés et les supermarchés.",
      "sentence_en": "This rapid food testing vehicle provides mobile testing services in markets and supermarkets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_testing",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在体操训练中练就了柔韧性、平衡感和协调能力。",
      "sentence_pinyin": "Tā zài tǐcāo xùnliàn zhōng liàn jiùle róurènxìng, pínghénggǎn hé xiétiáo nénglì.",
      "sentence_fr": "Lors de l'entraînement de gymnastique, elle a développé sa flexibilité, son sens de l'équilibre et sa coordination.",
      "sentence_en": "During gymnastics training, she developed flexibility, balance, and coordination.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gymnastics",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字人民币试点应用推动了无现金支付的普及。",
      "sentence_pinyin": "Zhège shùzì rénmínbì shìdiǎn yìngyòng tuīdòngle wú xiànjīn zhīfù de pǔjí.",
      "sentence_fr": "Cette application pilote de yuan numérique a promu la popularisation des paiements sans espèces.",
      "sentence_en": "This digital yuan pilot application promoted the popularization of cashless payments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_currency",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在石雕艺术中赋予坚硬的石材以生动的形态和灵动的气韵。",
      "sentence_pinyin": "Tā zài shídiāo yìshù zhōng fùyǔ jiānyìng de shícái yǐ shēngdòng de xíngtài hé língdòng de qìyùn.",
      "sentence_fr": "Dans l'art de la sculpture sur pierre, il donne à la pierre dure des formes vivantes et un esprit dynamique.",
      "sentence_en": "In stone carving art, he endows hard stone with vivid forms and dynamic spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stone_carving",
      "created_at": "2025-11-20T19:20:00.000Z",
      "updated_at": "2025-11-20T19:20:00.000Z"
    }
  ]
}
