{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "情境学习理论认为知识只有在真实情境中应用才能被有效掌握。",
      "sentence_pinyin": "Qíngjìng xuéxí lǐlùn rènwéi zhīshi zhǐyǒu zài zhēnshí qíngjìng zhōng yìngyòng cáinéng bèi yǒuxiào zhǎngwò.",
      "sentence_fr": "La théorie de l'apprentissage situé soutient que les connaissances ne peuvent être maîtrisées efficacement qu'en les appliquant dans des contextes réels.",
      "sentence_en": "Situated learning theory holds that knowledge can only be effectively mastered when applied in authentic contexts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "situated_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能性磁共振成像技术通过测量血流变化来追踪大脑活动模式。",
      "sentence_pinyin": "Gōngnéngxìng cígòngzhèn chéngxiàng jìshù tōngguò cèliáng xuèliú biànhuà lái zhuīzōng dànǎo huódòng móshì.",
      "sentence_fr": "La technologie d'imagerie par résonance magnétique fonctionnelle suit les schémas d'activité cérébrale en mesurant les changements de flux sanguin.",
      "sentence_en": "Functional magnetic resonance imaging technology tracks brain activity patterns by measuring blood flow changes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fmri_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共政策分析评估政府决策对社会福利和经济效率的影响。",
      "sentence_pinyin": "Gōnggòng zhèngcè fēnxī pínggū zhèngfǔ juécè duì shèhuì fúlì hé jīngjì xiàolǜ de yǐngxiǎng.",
      "sentence_fr": "L'analyse des politiques publiques évalue l'impact des décisions gouvernementales sur le bien-être social et l'efficacité économique.",
      "sentence_en": "Public policy analysis evaluates the impact of government decisions on social welfare and economic efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_policy_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "图神经网络能够处理图结构数据并捕获节点和边之间的复杂关系。",
      "sentence_pinyin": "Tú shénjīng wǎngluò nénggòu chǔlǐ tú jiégòu shùjù bìng bǔhuò jiédiǎn hé biān zhījiān de fùzá guānxì.",
      "sentence_fr": "Les réseaux neuronaux de graphes peuvent traiter des données structurées en graphe et capturer les relations complexes entre les nœuds et les arêtes.",
      "sentence_en": "Graph neural networks can process graph-structured data and capture complex relationships between nodes and edges.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "graph_neural_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态修复工程旨在恢复退化生态系统的结构和功能。",
      "sentence_pinyin": "Shēngtài xiūfù gōngchéng zhǐzài huīfù tuìhuà shēngtài xìtǒng de jiégòu hé gōngnéng.",
      "sentence_fr": "Les projets de restauration écologique visent à rétablir la structure et la fonction des écosystèmes dégradés.",
      "sentence_en": "Ecological restoration projects aim to restore the structure and function of degraded ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecological_restoration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "历史社会学研究社会变迁的长期趋势以及历史事件对当代社会的影响。",
      "sentence_pinyin": "Lìshǐ shèhuìxué yánjiū shèhuì biànqiān de chángqī qūshì yǐjí lìshǐ shìjiàn duì dāngdài shèhuì de yǐngxiǎng.",
      "sentence_fr": "La sociologie historique étudie les tendances à long terme du changement social et l'impact des événements historiques sur la société contemporaine.",
      "sentence_en": "Historical sociology studies long-term trends of social change and the impact of historical events on contemporary society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "historical_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "风险评估模型帮助金融机构量化和管理信用风险和市场风险。",
      "sentence_pinyin": "Fēngxiǎn pínggū móxíng bāngzhù jīnróng jīgòu liànghuà hé guǎnlǐ xìnyòng fēngxiǎn hé shìchǎng fēngxiǎn.",
      "sentence_fr": "Les modèles d'évaluation des risques aident les institutions financières à quantifier et à gérer le risque de crédit et le risque de marché.",
      "sentence_en": "Risk assessment models help financial institutions quantify and manage credit risk and market risk.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "risk_assessment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代谢组学研究生物体内小分子代谢物的整体变化以了解生理状态。",
      "sentence_pinyin": "Dàixiè zǔxué yánjiū shēngwùtǐ nèi xiǎo fēnzǐ dàixiè wù de zhěngtǐ biànhuà yǐ liǎojiě shēnglǐ zhuàngtài.",
      "sentence_fr": "La métabolomique étudie les changements globaux des petits métabolites moléculaires dans les organismes pour comprendre l'état physiologique.",
      "sentence_en": "Metabolomics studies the global changes of small molecule metabolites in organisms to understand physiological states.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metabolomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "用户体验设计注重创造直观、高效且令人愉悦的数字产品交互。",
      "sentence_pinyin": "Yònghù tǐyàn shèjì zhùzhòng chuàngzào zhíguān, gāoxiào qiě lìng rén yúyuè de shùzì chǎnpǐn jiāohù.",
      "sentence_fr": "La conception de l'expérience utilisateur se concentre sur la création d'interactions de produits numériques intuitives, efficaces et agréables.",
      "sentence_en": "User experience design focuses on creating intuitive, efficient, and delightful digital product interactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "user_experience_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球化研究分析跨国经济、政治和文化联系如何塑造现代世界。",
      "sentence_pinyin": "Quánqiúhuà yánjiū fēnxī kuàguó jīngjì, zhèngzhì hé wénhuà liánxì rúhé sùzào xiàndài shìjiè.",
      "sentence_fr": "Les études sur la mondialisation analysent comment les liens économiques, politiques et culturels transnationaux façonnent le monde moderne.",
      "sentence_en": "Globalization studies analyze how transnational economic, political, and cultural connections shape the modern world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "globalization_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光伏技术将太阳光直接转换为电能并在可再生能源领域发挥关键作用。",
      "sentence_pinyin": "Guāngfú jìshù jiāng tàiyángguāng zhíjiē zhuǎnhuàn wéi diànnéng bìng zài kě zàishēng néngyuán lǐngyù fāhuī guānjiàn zuòyòng.",
      "sentence_fr": "La technologie photovoltaïque convertit directement la lumière du soleil en électricité et joue un rôle clé dans le domaine des énergies renouvelables.",
      "sentence_en": "Photovoltaic technology directly converts sunlight into electricity and plays a key role in the renewable energy field.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "photovoltaic_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知神经科学研究大脑结构和功能如何产生思维、记忆和意识。",
      "sentence_pinyin": "Rènzhī shénjīng kēxué yánjiū dànǎo jiégòu hé gōngnéng rúhé chǎnshēng sīwéi, jìyì hé yìshí.",
      "sentence_fr": "Les neurosciences cognitives étudient comment la structure et la fonction du cerveau produisent la pensée, la mémoire et la conscience.",
      "sentence_en": "Cognitive neuroscience studies how brain structure and function produce thought, memory, and consciousness.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_neuroscience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "质性研究方法通过访谈和观察深入探索社会现象的意义和背景。",
      "sentence_pinyin": "Zhìxìng yánjiū fāngfǎ tōngguò fǎngtán hé guānchá shēnrù tànsuǒ shèhuì xiànxiàng de yìyì hé bèijǐng.",
      "sentence_fr": "Les méthodes de recherche qualitative explorent en profondeur le sens et le contexte des phénomènes sociaux à travers des entretiens et des observations.",
      "sentence_en": "Qualitative research methods deeply explore the meaning and context of social phenomena through interviews and observations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "qualitative_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式系统设计需要解决数据一致性、容错性和网络延迟等挑战。",
      "sentence_pinyin": "Fēnbùshì xìtǒng shèjì xūyào jiějué shùjù yīzhìxìng, róngcuòxìng hé wǎngluò yánchí děng tiǎozhàn.",
      "sentence_fr": "La conception de systèmes distribués doit relever des défis tels que la cohérence des données, la tolérance aux pannes et la latence du réseau.",
      "sentence_en": "Distributed system design needs to address challenges such as data consistency, fault tolerance, and network latency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市生态学研究城市环境中生物多样性、绿色空间和可持续发展。",
      "sentence_pinyin": "Chéngshì shēngtàixué yánjiū chéngshì huánjìng zhōng shēngwù duōyàngxìng, lǜsè kōngjiān hé kě chíxù fāzhǎn.",
      "sentence_fr": "L'écologie urbaine étudie la biodiversité, les espaces verts et le développement durable dans les environnements urbains.",
      "sentence_en": "Urban ecology studies biodiversity, green spaces, and sustainable development in urban environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "消费者心理学研究购买决策背后的心理因素和营销策略的效果。",
      "sentence_pinyin": "Xiāofèi zhě xīnlǐxué yánjiū gòumǎi juécè bèihòu de xīnlǐ yīnsù hé yíngxiāo cèlüè de xiàoguǒ.",
      "sentence_fr": "La psychologie du consommateur étudie les facteurs psychologiques derrière les décisions d'achat et l'efficacité des stratégies marketing.",
      "sentence_en": "Consumer psychology studies the psychological factors behind purchase decisions and the effectiveness of marketing strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "consumer_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "免疫疗法通过激活患者自身免疫系统来对抗癌症和其他疾病。",
      "sentence_pinyin": "Miǎnyì liáofǎ tōngguò jīhuó huànzhě zìshēn miǎnyì xìtǒng lái duìkàng áizhèng hé qítā jíbìng.",
      "sentence_fr": "L'immunothérapie combat le cancer et d'autres maladies en activant le propre système immunitaire du patient.",
      "sentence_en": "Immunotherapy fights cancer and other diseases by activating the patient's own immune system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immunotherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "音韵学分析语言中语音的组织规则和模式以及历史演变。",
      "sentence_pinyin": "Yīnyùnxué fēnxī yǔyán zhōng yǔyīn de zǔzhī guīzé hé móshì yǐjí lìshǐ yǎnbiàn.",
      "sentence_fr": "La phonologie analyse les règles et les modèles d'organisation des sons dans les langues ainsi que leur évolution historique.",
      "sentence_en": "Phonology analyzes the organizational rules and patterns of sounds in languages and their historical evolution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "phonology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "软件测试自动化减少了重复性测试工作并提高了代码质量保证效率。",
      "sentence_pinyin": "Ruǎnjiàn cèshì zìdònghuà jiǎnshǎole chóngfùxìng cèshì gōngzuò bìng tígāole dàimǎ zhìliàng bǎozhèng xiàolǜ.",
      "sentence_fr": "L'automatisation des tests logiciels réduit le travail de test répétitif et améliore l'efficacité de l'assurance qualité du code.",
      "sentence_en": "Software test automation reduces repetitive testing work and improves code quality assurance efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "test_automation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共卫生干预措施包括疫苗接种、健康教育和环境卫生改善。",
      "sentence_pinyin": "Gōnggòng wèishēng gānyù cuòshī bāokuò yìmiáo jiēzhǒng, jiànkāng jiàoyù hé huánjìng wèishēng gǎishàn.",
      "sentence_fr": "Les interventions de santé publique comprennent la vaccination, l'éducation sanitaire et l'amélioration de l'hygiène environnementale.",
      "sentence_en": "Public health interventions include vaccination, health education, and environmental sanitation improvement.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_health_interventions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
