{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个环保袋推广项目减少了塑料制品的使用并提高了环保意识。",
      "sentence_pinyin": "Zhège huánbǎo dài tuīguǎng xiàngmù jiǎnshǎole sùliào zhìpǐn de shǐyòng bìng tígāole huánbǎo yìshí.",
      "sentence_fr": "Ce projet de promotion des sacs écologiques a réduit l'utilisation de produits en plastique et accru la sensibilisation environnementale.",
      "sentence_en": "This eco-bag promotion project reduced plastic product usage and increased environmental awareness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_campaigns",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在古筝演奏中展现了深厚的传统音乐素养和演奏技巧。",
      "sentence_pinyin": "Tā zài gǔzhēng yǎnzòu zhōng zhǎnxiànle shēnhòu de chuántǒng yīnyuè sùyǎng hé yǎnzòu jìqiǎo.",
      "sentence_fr": "Elle a démontré une profonde culture musicale traditionnelle et une technique de jeu lors de sa performance de guzheng.",
      "sentence_en": "She demonstrated profound traditional music literacy and performance technique in her guzheng playing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能家居控制系统让用户通过语音指令管理所有家电设备。",
      "sentence_pinyin": "Zhège zhìnéng jiājū kòngzhì xìtǒng ràng yònghù tōngguò yǔyīn zhǐlìng guǎnlǐ suǒyǒu jiādiàn shèbèi.",
      "sentence_fr": "Ce système de contrôle de maison intelligente permet aux utilisateurs de gérer tous les appareils électroménagers par commande vocale.",
      "sentence_en": "This smart home control system allows users to manage all home appliances through voice commands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_home",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在建筑设计中注重自然采光和空气流通的优化。",
      "sentence_pinyin": "Tā zài jiànzhù shèjì zhōng zhùzhòng zìrán cǎiguāng hé kōngqì liútōng de yōuhuà.",
      "sentence_fr": "Dans la conception architecturale, il met l'accent sur l'optimisation de l'éclairage naturel et de la circulation de l'air.",
      "sentence_en": "In architectural design, he emphasizes optimizing natural lighting and air circulation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "architecture",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个青少年心理辅导项目帮助孩子们建立积极健康的心态。",
      "sentence_pinyin": "Zhège qīngshàonián xīnlǐ fǔdǎo xiàngmù bāngzhù háizimen jiànlì jījí jiànkāng de xīntài.",
      "sentence_fr": "Ce programme de conseil psychologique pour adolescents aide les jeunes à développer un état d'esprit positif et sain.",
      "sentence_en": "This youth psychological counseling program helps children develop a positive and healthy mindset.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "youth_counseling",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的素描作品线条流畅，准确捕捉了人物的神态特征。",
      "sentence_pinyin": "Tā de sùmiáo zuòpǐn xiàntiáo liúchàng, zhǔnquè bǔzhuōle rénwù de shéntài tèzhēng.",
      "sentence_fr": "Ses dessins au crayon ont des lignes fluides et capturent avec précision les expressions des personnages.",
      "sentence_en": "Her pencil drawings have fluid lines and accurately capture the characters' expressions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sketching",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农业科技示范园推广应用了多项现代化种植技术。",
      "sentence_pinyin": "Zhège nóngyè kējì shìfàn yuán tuīguǎng yìngyòngle duō xiàng xiàndàihuà zhòngzhí jìshù.",
      "sentence_fr": "Ce parc de démonstration de technologie agricole promeut et applique plusieurs techniques de culture modernes.",
      "sentence_en": "This agricultural technology demonstration park promotes and applies multiple modern cultivation techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_technology",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在拳击训练中磨练了意志品质和身体素质。",
      "sentence_pinyin": "Tā zài quánjí xùnliàn zhōng móliànle yìzhì pǐnzhì hé shēntǐ sùzhì.",
      "sentence_fr": "Lors de l'entraînement de boxe, il a forgé sa volonté et sa condition physique.",
      "sentence_en": "During boxing training, he forged his willpower and physical fitness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "boxing",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区图书共享计划让邻里之间互相借阅图书。",
      "sentence_pinyin": "Zhège shèqū túshū gòngxiǎng jìhuà ràng línlǐ zhījiān hùxiāng jièyuè túshū.",
      "sentence_fr": "Ce plan de partage de livres communautaire permet aux voisins d'emprunter des livres entre eux.",
      "sentence_en": "This community book sharing plan allows neighbors to borrow books from each other.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "book_sharing",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在民俗文化研究中记录整理了许多濒临失传的传统习俗。",
      "sentence_pinyin": "Tā zài mínsú wénhuà yánjiū zhōng jìlù zhěnglǐle xǔduō bīnlín shīchuán de chuántǒng xísú.",
      "sentence_fr": "Dans ses recherches sur la culture folklorique, elle a documenté et compilé de nombreuses coutumes traditionnelles en voie de disparition.",
      "sentence_en": "In her folklore research, she documented and compiled many traditional customs on the verge of being lost.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "folklore_research",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能灌溉系统根据土壤湿度自动调节浇水量。",
      "sentence_pinyin": "Zhège zhìnéng guàngài xìtǒng gēnjù tǔrǎng shīdù zìdòng tiáojié jiāoshuǐ liàng.",
      "sentence_fr": "Ce système d'irrigation intelligent ajuste automatiquement la quantité d'eau en fonction de l'humidité du sol.",
      "sentence_en": "This smart irrigation system automatically adjusts water volume based on soil moisture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_irrigation",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在爵士乐演奏中展现了即兴创作的才华和音乐感染力。",
      "sentence_pinyin": "Tā zài juéshìyuè yǎnzòu zhōng zhǎnxiànle jíxìng chuàngzuò de cáihuá hé yīnyuè gǎnrǎnlì.",
      "sentence_fr": "Il a démontré son talent d'improvisation et son pouvoir d'expression musicale lors de sa performance de jazz.",
      "sentence_en": "He demonstrated his improvisation talent and musical expressiveness in his jazz performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jazz_music",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾分类智能回收站通过积分奖励鼓励市民参与环保。",
      "sentence_pinyin": "Zhège lājī fēnlèi zhìnéng huíshōu zhàn tōngguò jīfēn jiǎnglì gǔlì shìmín cānyù huánbǎo.",
      "sentence_fr": "Cette station de recyclage intelligente pour tri des déchets encourage la participation des citoyens à la protection de l'environnement grâce à un système de récompense par points.",
      "sentence_en": "This smart waste sorting recycling station encourages citizens to participate in environmental protection through a points reward system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_recycling",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的服装设计风格简约大方，注重面料质感和剪裁工艺。",
      "sentence_pinyin": "Tā de fúzhuāng shèjì fēnggé jiǎnyuē dàfang, zhùzhòng miànliào zhìgǎn hé jiǎncái gōngyì.",
      "sentence_fr": "Son style de design de vêtements est simple et élégant, mettant l'accent sur la texture des tissus et la technique de coupe.",
      "sentence_en": "Her clothing design style is simple and elegant, emphasizing fabric texture and tailoring technique.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fashion_design",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个企业社会责任项目为贫困地区修建了多所希望小学。",
      "sentence_pinyin": "Zhège qǐyè shèhuì zérèn xiàngmù wèi pínkùn dìqū xiūjiànle duō suǒ xīwàng xiǎoxué.",
      "sentence_fr": "Ce projet de responsabilité sociale d'entreprise a construit plusieurs écoles primaires d'espoir dans les régions pauvres.",
      "sentence_en": "This corporate social responsibility project built multiple hope primary schools in impoverished areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "corporate_responsibility",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在自行车越野赛中克服了复杂地形的挑战。",
      "sentence_pinyin": "Tā zài zìxíngchē yuèyě sài zhōng kèfúle fùzá dìxíng de tiǎozhàn.",
      "sentence_fr": "Il a surmonté les défis du terrain complexe lors de la course de vélo tout-terrain.",
      "sentence_en": "He overcame the challenges of complex terrain in the mountain bike race.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mountain_biking",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线学习平台提供了数千门涵盖各个领域的精品课程。",
      "sentence_pinyin": "Zhège zàixiàn xuéxí píngtái tígōngle shù qiān mén hángài gège lǐngyù de jīngpǐn kèchéng.",
      "sentence_fr": "Cette plateforme d'apprentissage en ligne offre des milliers de cours de qualité couvrant divers domaines.",
      "sentence_en": "This online learning platform offers thousands of quality courses covering various fields.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_learning",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在雕刻艺术中运用传统技法创作出富有现代感的作品。",
      "sentence_pinyin": "Tā zài diāokè yìshù zhōng yùnyòng chuántǒng jìfǎ chuàngzuò chū fùyǒu xiàndàigǎn de zuòpǐn.",
      "sentence_fr": "Dans l'art de la sculpture, elle utilise des techniques traditionnelles pour créer des œuvres au sens moderne.",
      "sentence_en": "In carving art, she uses traditional techniques to create works with a modern sense.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "carving_art",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海洋保护项目致力于修复受损的珊瑚礁生态系统。",
      "sentence_pinyin": "Zhège hǎiyáng bǎohù xiàngmù zhìlì yú xiūfù shòusǔn de shānhú jiāo shēngtài xìtǒng.",
      "sentence_fr": "Ce projet de protection marine s'engage à restaurer les écosystèmes de récifs coralliens endommagés.",
      "sentence_en": "This marine protection project is committed to restoring damaged coral reef ecosystems.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "marine_conservation",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在户外探险活动中学会了野外生存技能和应急处理方法。",
      "sentence_pinyin": "Tā zài hùwài tànxiǎn huódòng zhōng xuéhuìle yěwài shēngcún jìnéng hé yìngjí chǔlǐ fāngfǎ.",
      "sentence_fr": "Lors d'activités d'aventure en plein air, il a appris des compétences de survie en nature et des méthodes de traitement d'urgence.",
      "sentence_en": "During outdoor adventure activities, he learned wilderness survival skills and emergency handling methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "outdoor_adventure",
      "created_at": "2025-11-20T18:55:00.000Z",
      "updated_at": "2025-11-20T18:55:00.000Z"
    }
  ]
}
