{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个项目的成功离不开团队成员的辛勤付出和无私奉献。",
      "sentence_pinyin": "Zhège xiàngmù de chénggōng lí bù kāi tuánduì chéngyuán de xīnqín fùchū hé wúsī fèngxiàn.",
      "sentence_fr": "Le succès de ce projet est indissociable du travail acharné et du dévouement désintéressé des membres de l'équipe.",
      "sentence_en": "The success of this project is inseparable from the team members' hard work and selfless dedication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "teamwork",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在演讲比赛中表现沉稳自信，获得了评委的一致认可。",
      "sentence_pinyin": "Tā zài yǎnjiǎng bǐsài zhōng biǎoxiàn chénwěn zìxìn, huòdéle píngwěi de yīzhì rènkě.",
      "sentence_fr": "Elle s'est montrée calme et confiante lors du concours d'éloquence, obtenant la reconnaissance unanime des juges.",
      "sentence_en": "She appeared calm and confident in the speech contest, receiving unanimous recognition from the judges.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "competitions",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家书店不仅出售图书，还定期举办读书分享会和作家见面会。",
      "sentence_pinyin": "Zhè jiā shūdiàn bùjǐn chūshòu túshū, hái dìngqī jǔbàn dúshū fēnxiǎnghuì hé zuòjiā jiànmiànhuì.",
      "sentence_fr": "Cette librairie ne vend pas seulement des livres, mais organise aussi régulièrement des clubs de lecture et des rencontres avec des auteurs.",
      "sentence_en": "This bookstore not only sells books but also regularly holds reading sharing sessions and author meet-and-greets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他通过网络课程学习了编程技能，现在已经能够独立开发软件。",
      "sentence_pinyin": "Tā tōngguò wǎngluò kèchéng xuéxíle biānchéng jìnéng, xiànzài yǐjīng nénggòu dúlì kāifā ruǎnjiàn.",
      "sentence_fr": "Il a appris la programmation via des cours en ligne et peut maintenant développer des logiciels de manière indépendante.",
      "sentence_en": "He learned programming skills through online courses and can now independently develop software.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个传统节日已经有上千年的历史，承载着丰富的文化内涵。",
      "sentence_pinyin": "Zhège chuántǒng jiérì yǐjīng yǒu shàng qiān nián de lìshǐ, chéngzàizhe fēngfù de wénhuà nèihán.",
      "sentence_fr": "Cette fête traditionnelle a plus de mille ans d'histoire et porte une riche signification culturelle.",
      "sentence_en": "This traditional festival has over a thousand years of history and carries rich cultural connotations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "festivals",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的设计作品融合了传统工艺和现代审美，独具特色。",
      "sentence_pinyin": "Tā de shèjì zuòpǐn rónghéle chuántǒng gōngyì hé xiàndài shěnměi, dú jù tèsè.",
      "sentence_fr": "Ses créations de design fusionnent l'artisanat traditionnel et l'esthétique moderne, avec des caractéristiques uniques.",
      "sentence_en": "Her design works integrate traditional craftsmanship and modern aesthetics with unique characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "design",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医院新增了多个专科门诊，为患者提供更加专业的医疗服务。",
      "sentence_pinyin": "Yīyuàn xīn zēngle duō ge zhuānkē ménzhěn, wèi huànzhě tígōng gèngjiā zhuānyè de yīliáo fúwù.",
      "sentence_fr": "L'hôpital a ajouté plusieurs cliniques spécialisées pour offrir des services médicaux plus professionnels aux patients.",
      "sentence_en": "The hospital added multiple specialized clinics to provide more professional medical services to patients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "healthcare",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电影改编自真实事件，讲述了一个感人至深的故事。",
      "sentence_pinyin": "Zhè bù diànyǐng gǎibiān zì zhēnshí shìjiàn, jiǎngshùle yī ge gǎnrén zhì shēn de gùshi.",
      "sentence_fr": "Ce film est adapté d'événements réels et raconte une histoire profondément émouvante.",
      "sentence_en": "This movie is adapted from real events and tells a deeply moving story.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们在山顶建立了一个气象观测站，用于研究气候变化。",
      "sentence_pinyin": "Tāmen zài shāndǐng jiànlìle yī ge qìxiàng guāncèzhàn, yòngyú yánjiū qìhòu biànhuà.",
      "sentence_fr": "Ils ont établi une station d'observation météorologique au sommet de la montagne pour étudier le changement climatique.",
      "sentence_en": "They established a meteorological observation station on the mountaintop to study climate change.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个品牌的护肤品成分天然温和，适合敏感肌肤使用。",
      "sentence_pinyin": "Zhège pǐnpái de hùfūpǐn chéngfèn tiānrán wēnhé, shìhé mǐngǎn jīfū shǐyòng.",
      "sentence_fr": "Les ingrédients des produits de soin de cette marque sont naturels et doux, adaptés aux peaux sensibles.",
      "sentence_en": "The ingredients of this brand's skincare products are natural and gentle, suitable for sensitive skin.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "beauty",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学校组织学生参观科技馆，激发了他们对科学的兴趣和热情。",
      "sentence_pinyin": "Xuéxiào zǔzhī xuésheng cānguān kējìguǎn, jīfāle tāmen duì kēxué de xìngqù hé rèqíng.",
      "sentence_fr": "L'école a organisé une visite au musée des sciences pour les étudiants, stimulant leur intérêt et passion pour la science.",
      "sentence_en": "The school organized students to visit the science museum, stimulating their interest and passion for science.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区建立了完善的垃圾分类回收系统，提高了环保意识。",
      "sentence_pinyin": "Zhège shèqū jiànlìle wánshàn de lājī fēnlèi huíshōu xìtǒng, tígāole huánbǎo yìshi.",
      "sentence_fr": "Cette communauté a établi un système complet de tri et de recyclage des déchets, renforçant la conscience environnementale.",
      "sentence_en": "This community established a complete waste sorting and recycling system, enhancing environmental awareness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在国际象棋比赛中运用巧妙的战术，最终赢得了冠军。",
      "sentence_pinyin": "Tā zài guójì xiàngqí bǐsài zhōng yùnyòng qiǎomiào de zhànshù, zuìzhōng yíngdéle guànjūn.",
      "sentence_fr": "Il a utilisé des tactiques ingénieuses lors du tournoi d'échecs international et a finalement remporté le championnat.",
      "sentence_en": "He used clever tactics in the international chess tournament and ultimately won the championship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sports",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家公司推出了一款创新产品，引领了行业发展的新趋势。",
      "sentence_pinyin": "Zhè jiā gōngsī tuīchūle yī kuǎn chuàngxīn chǎnpǐn, yǐnlǐngle hángyè fāzhǎn de xīn qūshì.",
      "sentence_fr": "Cette entreprise a lancé un produit innovant qui a mené la nouvelle tendance du développement de l'industrie.",
      "sentence_en": "This company launched an innovative product that led the new trend in industry development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她利用假期时间参加志愿者活动，帮助当地的弱势群体。",
      "sentence_pinyin": "Tā lìyòng jiàqī shíjiān cānjiā zhìyuànzhě huódòng, bāngzhù dāngdì de ruòshì qúntǐ.",
      "sentence_fr": "Elle profite de ses vacances pour participer à des activités de bénévolat et aider les groupes vulnérables locaux.",
      "sentence_en": "She uses her vacation time to participate in volunteer activities and help local vulnerable groups.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volunteering",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐学院培养了许多优秀的演奏家和作曲家。",
      "sentence_pinyin": "Zhège yīnyuè xuéyuàn péiyǎngle xǔduō yōuxiù de yǎnzòujiā hé zuòqǔjiā.",
      "sentence_fr": "Ce conservatoire a formé de nombreux excellents interprètes et compositeurs.",
      "sentence_en": "This music conservatory has cultivated many excellent performers and composers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的坚持和努力最终得到了回报，实现了职业生涯的突破。",
      "sentence_pinyin": "Tā de jiānchí hé nǔlì zuìzhōng dédàole huíbào, shíxiànle zhíyè shēngyá de tūpò.",
      "sentence_fr": "Sa persévérance et ses efforts ont finalement été récompensés, réalisant une percée dans sa carrière.",
      "sentence_en": "His persistence and efforts were finally rewarded, achieving a breakthrough in his career.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "career",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个展览通过多媒体技术呈现了艺术作品的创作过程。",
      "sentence_pinyin": "Zhège zhǎnlǎn tōngguò duō méitǐ jìshù chéngxiànle yìshù zuòpǐn de chuàngzuò guòchéng.",
      "sentence_fr": "Cette exposition présente le processus de création d'œuvres d'art grâce à la technologie multimédia.",
      "sentence_en": "This exhibition presents the creation process of artworks through multimedia technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的美食街汇集了各地的特色小吃和传统菜肴。",
      "sentence_pinyin": "Zhège chéngshì de měishí jiē huìjíle gèdì de tèsè xiǎochī hé chuántǒng càiyáo.",
      "sentence_fr": "La rue gastronomique de cette ville rassemble des spécialités et des plats traditionnels de partout.",
      "sentence_en": "The food street of this city gathers specialty snacks and traditional dishes from various places.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在困境中保持乐观积极的态度，最终战胜了困难。",
      "sentence_pinyin": "Tā zài kùnjìng zhōng bǎochí lèguān jījí de tàidu, zuìzhōng zhànshèngle kùnnan.",
      "sentence_fr": "Elle a maintenu une attitude optimiste et positive face aux difficultés et a finalement surmonté les obstacles.",
      "sentence_en": "She maintained an optimistic and positive attitude in adversity and finally overcame the difficulties.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "perseverance",
      "created_at": "2025-11-20T17:00:00.000Z",
      "updated_at": "2025-11-20T17:00:00.000Z"
    }
  ]
}
