{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个培训项目帮助年轻人提升了职业技能和就业竞争力。",
      "sentence_pinyin": "Zhège péixùn xiàngmù bāngzhù niánqīngrén tíshēngle zhíyè jìnéng hé jiùyè jìngzhēnglì.",
      "sentence_fr": "Ce programme de formation aide les jeunes à améliorer leurs compétences professionnelles et leur compétitivité sur le marché du travail.",
      "sentence_en": "This training program helps young people improve their professional skills and employment competitiveness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的舞蹈表演优雅动人，征服了现场所有的观众。",
      "sentence_pinyin": "Tā de wǔdǎo biǎoyǎn yōuyǎ dòngrén, zhēngfúle xiànchǎng suǒyǒu de guānzhòng.",
      "sentence_fr": "Sa performance de danse élégante et émouvante a conquis tout le public présent.",
      "sentence_en": "Her elegant and moving dance performance conquered all the audience present.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "performing_arts",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地区的空气质量明显改善，蓝天白云的日子越来越多。",
      "sentence_pinyin": "Zhège dìqū de kōngqì zhìliàng míngxiǎn gǎishàn, lántiān báiyún de rìzi yuè lái yuè duō.",
      "sentence_fr": "La qualité de l'air dans cette région s'est nettement améliorée, avec de plus en plus de jours de ciel bleu.",
      "sentence_en": "The air quality in this area has significantly improved, with more and more days of blue skies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他通过阅读大量的专业书籍来不断充实自己的知识储备。",
      "sentence_pinyin": "Tā tōngguò yuèdú dàliàng de zhuānyè shūjí lái bùduàn chōngshí zìjǐ de zhīshi chǔbèi.",
      "sentence_fr": "Il enrichit constamment ses connaissances en lisant de nombreux livres professionnels.",
      "sentence_en": "He constantly enriches his knowledge by reading numerous professional books.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "self_improvement",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家餐厅的装潢古色古香，营造出浓厚的文化氛围。",
      "sentence_pinyin": "Zhè jiā cāntīng de zhuānghuáng gǔsè gǔxiāng, yíngzào chū nónghòu de wénhuà fēnwéi.",
      "sentence_fr": "La décoration de ce restaurant est de style antique, créant une forte atmosphère culturelle.",
      "sentence_en": "The decoration of this restaurant is antique-style, creating a strong cultural atmosphere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dining",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "孩子们在老师的指导下完成了一幅精美的集体画作。",
      "sentence_pinyin": "Háizimen zài lǎoshī de zhǐdǎo xià wánchéngle yī fú jīngměi de jítǐ huàzuò.",
      "sentence_fr": "Les enfants ont réalisé une magnifique peinture collective sous la direction de l'enseignant.",
      "sentence_en": "The children completed a beautiful collective painting under the teacher's guidance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art_education",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个慈善晚会募集了大量善款，用于帮助贫困山区的学生。",
      "sentence_pinyin": "Zhège císhàn wǎnhuì mùjíle dàliàng shànkuǎn, yòngyú bāngzhù pínkùn shānqū de xuésheng.",
      "sentence_fr": "Ce gala de charité a collecté de nombreux dons pour aider les étudiants des régions montagneuses pauvres.",
      "sentence_en": "This charity gala raised a large amount of donations to help students in poor mountainous areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在工作中展现出卓越的领导才能和决策能力。",
      "sentence_pinyin": "Tā zài gōngzuò zhōng zhǎnxiàn chū zhuóyuè de lǐngdǎo cáinéng hé juécè nénglì.",
      "sentence_fr": "Elle démontre d'excellentes capacités de leadership et de prise de décision dans son travail.",
      "sentence_en": "She demonstrates excellent leadership and decision-making abilities at work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐节吸引了来自世界各地的音乐爱好者和乐队。",
      "sentence_pinyin": "Zhège yīnyuèjié xīyǐnle láizì shìjiè gèdì de yīnyuè àihàozhě hé yuèduì.",
      "sentence_fr": "Ce festival de musique attire des passionnés de musique et des groupes du monde entier.",
      "sentence_en": "This music festival attracts music lovers and bands from around the world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他坚持每天写日记，记录生活中的点点滴滴和感悟。",
      "sentence_pinyin": "Tā jiānchí měitiān xiě rìjì, jìlù shēnghuó zhōng de diǎndiǎndīdī hé gǎnwù.",
      "sentence_fr": "Il persiste à écrire un journal tous les jours, enregistrant les détails et les réflexions de sa vie.",
      "sentence_en": "He persists in writing a diary every day, recording the details and insights of life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "habits",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科研项目获得了国家级科技进步奖的认可。",
      "sentence_pinyin": "Zhège kēyán xiàngmù huòdéle guójiājí kējì jìnbù jiǎng de rènkě.",
      "sentence_fr": "Ce projet de recherche a reçu la reconnaissance d'un prix national de progrès scientifique et technologique.",
      "sentence_en": "This research project received recognition from a national science and technology progress award.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的诗歌作品富有想象力，表达了对生活的独特理解。",
      "sentence_pinyin": "Tā de shīgē zuòpǐn fùyǒu xiǎngxiànglì, biǎodále duì shēnghuó de dútè lǐjiě.",
      "sentence_fr": "Ses œuvres poétiques sont pleines d'imagination et expriment une compréhension unique de la vie.",
      "sentence_en": "Her poetry works are full of imagination and express a unique understanding of life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的地铁网络四通八达，极大地方便了市民出行。",
      "sentence_pinyin": "Zhège chéngshì de dìtiě wǎngluò sìtōng bādá, jídà de fāngbiànle shìmín chūxíng.",
      "sentence_fr": "Le réseau de métro de cette ville s'étend dans toutes les directions, facilitant grandement les déplacements des citoyens.",
      "sentence_en": "The subway network of this city extends in all directions, greatly facilitating citizens' travel.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "transportation",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们的婚礼简单而温馨，只邀请了最亲近的家人和朋友。",
      "sentence_pinyin": "Tāmen de hūnlǐ jiǎndān ér wēnxīn, zhǐ yāoqǐngle zuì qīnjìn de jiārén hé péngyou.",
      "sentence_fr": "Leur mariage était simple mais chaleureux, n'invitant que la famille et les amis les plus proches.",
      "sentence_en": "Their wedding was simple but warm, inviting only the closest family and friends.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "celebrations",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个品牌注重产品的环保性能，使用可再生材料进行生产。",
      "sentence_pinyin": "Zhège pǐnpái zhùzhòng chǎnpǐn de huánbǎo xìngnéng, shǐyòng kě zàishēng cáiliào jìnxíng shēngchǎn.",
      "sentence_fr": "Cette marque met l'accent sur la performance écologique des produits et utilise des matériaux renouvelables pour la production.",
      "sentence_en": "This brand emphasizes the environmental performance of products and uses renewable materials for production.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在学术研究方面取得了突出成就，发表了多篇论文。",
      "sentence_pinyin": "Tā zài xuéshù yánjiū fāngmiàn qǔdéle túchū chéngjiù, fābiǎole duō piān lùnwén.",
      "sentence_fr": "Elle a obtenu des résultats remarquables dans la recherche académique et a publié de nombreux articles.",
      "sentence_en": "She achieved outstanding results in academic research and published many papers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "academia",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个游戏的画面精美，玩法创新，深受玩家喜爱。",
      "sentence_pinyin": "Zhège yóuxì de huàmiàn jīngměi, wánfǎ chuàngxīn, shēn shòu wánjiā xǐ'ài.",
      "sentence_fr": "Ce jeu a des graphismes magnifiques et un gameplay innovant, très apprécié des joueurs.",
      "sentence_en": "This game has beautiful graphics and innovative gameplay, very popular among players.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gaming",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位老师用生动的例子和故事使枯燥的课程变得有趣。",
      "sentence_pinyin": "Zhè wèi lǎoshī yòng shēngdòng de lìzi hé gùshi shǐ kūzào de kèchéng biàn de yǒuqù.",
      "sentence_fr": "Ce professeur rend les cours ennuyeux intéressants avec des exemples et des histoires vivants.",
      "sentence_en": "This teacher makes boring courses interesting with vivid examples and stories.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的创新想法为公司开辟了新的业务发展方向。",
      "sentence_pinyin": "Tā de chuàngxīn xiǎngfǎ wèi gōngsī kāipìle xīn de yèwù fāzhǎn fāngxiàng.",
      "sentence_fr": "Ses idées innovantes ont ouvert de nouvelles directions de développement commercial pour l'entreprise.",
      "sentence_en": "His innovative ideas opened up new business development directions for the company.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个自然保护区拥有丰富的动植物资源，是生物多样性的宝库。",
      "sentence_pinyin": "Zhège zìrán bǎohùqū yǒngyǒu fēngfù de dòngzhíwù zīyuán, shì shēngwù duōyàngxìng de bǎokù.",
      "sentence_fr": "Cette réserve naturelle possède de riches ressources animales et végétales et est un trésor de biodiversité.",
      "sentence_en": "This nature reserve has rich animal and plant resources and is a treasury of biodiversity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nature",
      "created_at": "2025-11-20T16:50:00.000Z",
      "updated_at": "2025-11-20T16:50:00.000Z"
    }
  ]
}
