{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "积极组织行为学研究工作场所中促进员工繁荣的因素。",
      "sentence_pinyin": "Jījí zǔzhī xíngwéixué yánjiū gōngzuò chǎngsuǒ zhōng cùjìn yuángōng fánróng de yīnsù.",
      "sentence_fr": "Le comportement organisationnel positif étudie les facteurs qui favorisent l'épanouissement des employés sur le lieu de travail.",
      "sentence_en": "Positive organizational behavior studies factors that promote employee flourishing in the workplace.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "positive_organizational_behavior",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "低温物理学研究接近绝对零度时物质的独特行为和性质。",
      "sentence_pinyin": "Dīwēn wùlǐxué yánjiū jiējìn juéduì língdù shí wùzhì de dútè xíngwéi hé xìngzhì.",
      "sentence_fr": "La physique des basses températures étudie le comportement et les propriétés uniques de la matière près du zéro absolu.",
      "sentence_en": "Low-temperature physics studies the unique behavior and properties of matter near absolute zero.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "low_temperature_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "定价策略平衡市场需求、竞争压力和利润目标以确定产品价格。",
      "sentence_pinyin": "Dìngjià cèlüè pínghéng shìchǎng xūqiú, jìngzhēng yālì hé lìrùn mùbiāo yǐ quèdìng chǎnpǐn jiàgé.",
      "sentence_fr": "Les stratégies de tarification équilibrent la demande du marché, la pression concurrentielle et les objectifs de profit pour déterminer les prix des produits.",
      "sentence_en": "Pricing strategies balance market demand, competitive pressure, and profit goals to determine product prices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pricing_strategies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "端点安全保护个人电脑和移动设备免受网络威胁。",
      "sentence_pinyin": "Duāndiǎn ānquán bǎohù gèrén diànnǎo hé yídòng shèbèi miǎn shòu wǎngluò wēixié.",
      "sentence_fr": "La sécurité des terminaux protège les ordinateurs personnels et les appareils mobiles contre les menaces réseau.",
      "sentence_en": "Endpoint security protects personal computers and mobile devices from network threats.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "endpoint_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "积极心理干预利用科学方法来增强个人的幸福感和心理韧性。",
      "sentence_pinyin": "Jījí xīnlǐ gānyù lìyòng kēxué fāngfǎ lái zēngqiáng gèrén de xìngfúgǎn hé xīnlǐ rènxìng.",
      "sentence_fr": "Les interventions de psychologie positive utilisent des méthodes scientifiques pour améliorer le bien-être et la résilience psychologique des individus.",
      "sentence_en": "Positive psychology interventions use scientific methods to enhance individual well-being and psychological resilience.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "positive_interventions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "激光物理学研究相干光的产生、特性和各种应用。",
      "sentence_pinyin": "Jīguāng wùlǐxué yánjiū xiānggān guāng de chǎnshēng, tèxìng hé gè zhǒng yìngyòng.",
      "sentence_fr": "La physique des lasers étudie la production, les caractéristiques et les diverses applications de la lumière cohérente.",
      "sentence_en": "Laser physics studies the generation, characteristics, and various applications of coherent light.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "laser_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "商业分析利用数据挖掘和统计方法来支持决策制定。",
      "sentence_pinyin": "Shāngyè fēnxī lìyòng shùjù wājué hé tǒngjì fāngfǎ lái zhīchí juécè zhìdìng.",
      "sentence_fr": "L'analyse commerciale utilise l'exploration de données et les méthodes statistiques pour soutenir la prise de décision.",
      "sentence_en": "Business analytics uses data mining and statistical methods to support decision-making.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "business_analytics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "身份和访问管理确保正确的人员能够访问正确的资源。",
      "sentence_pinyin": "Shēnfèn hé fǎngwèn guǎnlǐ quèbǎo zhèngquè de rényuán nénggòu fǎngwèn zhèngquè de zīyuán.",
      "sentence_fr": "La gestion des identités et des accès garantit que les bonnes personnes peuvent accéder aux bonnes ressources.",
      "sentence_en": "Identity and access management ensures the right people can access the right resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "identity_access_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "咨询心理学帮助个人应对日常生活挑战和发展性问题。",
      "sentence_pinyin": "Zīxún xīnlǐxué bāngzhù gèrén yìngduì rìcháng shēnghuó tiǎozhàn hé fāzhǎnxìng wèntí.",
      "sentence_fr": "La psychologie du conseil aide les individus à faire face aux défis de la vie quotidienne et aux problèmes de développement.",
      "sentence_en": "Counseling psychology helps individuals cope with everyday life challenges and developmental issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "counseling_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高能物理学研究粒子加速器中产生的高能量粒子碰撞。",
      "sentence_pinyin": "Gāonéng wùlǐxué yánjiū lìzǐ jiāsùqì zhōng chǎnshēng de gāo néngliàng lìzǐ pèngzhuàng.",
      "sentence_fr": "La physique des hautes énergies étudie les collisions de particules à haute énergie produites dans les accélérateurs de particules.",
      "sentence_en": "High-energy physics studies high-energy particle collisions produced in particle accelerators.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "high_energy_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "财务分析评估公司的盈利能力、流动性和长期偿债能力。",
      "sentence_pinyin": "Cáiwù fēnxī pínggū gōngsī de yínglì nénglì, liúdòngxìng hé chángqī cháng zhài nénglì.",
      "sentence_fr": "L'analyse financière évalue la rentabilité, la liquidité et la solvabilité à long terme d'une entreprise.",
      "sentence_en": "Financial analysis evaluates a company's profitability, liquidity, and long-term solvency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据丢失防护技术监控和保护敏感信息不被泄露。",
      "sentence_pinyin": "Shùjù diūshī fánghù jìshù jiānkòng hé bǎohù mǐngǎn xìnxī bù bèi xièlù.",
      "sentence_fr": "Les technologies de prévention de la perte de données surveillent et protègent les informations sensibles contre les fuites.",
      "sentence_en": "Data loss prevention technologies monitor and protect sensitive information from being leaked.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_loss_prevention",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经心理学评估研究大脑损伤对认知功能的影响。",
      "sentence_pinyin": "Shénjīng xīnlǐxué pínggū yánjiū dànǎo sǔnshāng duì rènzhī gōngnéng de yǐngxiǎng.",
      "sentence_fr": "L'évaluation neuropsychologique étudie l'impact des lésions cérébrales sur les fonctions cognitives.",
      "sentence_en": "Neuropsychological assessment studies the impact of brain damage on cognitive functions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuropsychological_assessment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非线性动力学研究复杂系统中的混沌现象和分岔行为。",
      "sentence_pinyin": "Fēi xiànxìng dònglìxué yánjiū fùzá xìtǒng zhōng de hùndùn xiànxiàng hé fēnchā xíngwéi.",
      "sentence_fr": "La dynamique non linéaire étudie les phénomènes chaotiques et les comportements de bifurcation dans les systèmes complexes.",
      "sentence_en": "Nonlinear dynamics studies chaotic phenomena and bifurcation behavior in complex systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nonlinear_dynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "并购交易涉及公司收购或合并的战略规划和尽职调查。",
      "sentence_pinyin": "Bìnggòu jiāoyì shèjí gōngsī shōugòu huò hébìng de zhànlüè guīhuà hé jìnzhí diàochá.",
      "sentence_fr": "Les transactions de fusions et acquisitions impliquent la planification stratégique et la diligence raisonnable pour les acquisitions ou fusions d'entreprises.",
      "sentence_en": "Mergers and acquisitions transactions involve strategic planning and due diligence for company acquisitions or mergers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mergers_acquisitions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "云安全架构保护云环境中的数据、应用程序和基础设施。",
      "sentence_pinyin": "Yún ānquán jiàgòu bǎohù yún huánjìng zhōng de shùjù, yìngyòng chéngxù hé jīchǔ shèshī.",
      "sentence_fr": "L'architecture de sécurité cloud protège les données, les applications et l'infrastructure dans les environnements cloud.",
      "sentence_en": "Cloud security architecture protects data, applications, and infrastructure in cloud environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cloud_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "康复心理学帮助患者适应慢性疾病和残疾带来的生活变化。",
      "sentence_pinyin": "Kāngfù xīnlǐxué bāngzhù huànzhě shìyìng mànxìng jíbìng hé cánjí dàilái de shēnghuó biànhuà.",
      "sentence_fr": "La psychologie de la réhabilitation aide les patients à s'adapter aux changements de vie causés par les maladies chroniques et les handicaps.",
      "sentence_en": "Rehabilitation psychology helps patients adapt to life changes caused by chronic illness and disability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rehabilitation_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "原子物理学研究原子的结构、电子排布和原子光谱。",
      "sentence_pinyin": "Yuánzǐ wùlǐxué yánjiū yuánzǐ de jiégòu, diànzǐ páibù hé yuánzǐ guāngpǔ.",
      "sentence_fr": "La physique atomique étudie la structure des atomes, la configuration électronique et les spectres atomiques.",
      "sentence_en": "Atomic physics studies the structure of atoms, electron configuration, and atomic spectra.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "atomic_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资本预算决策评估长期投资项目的财务可行性。",
      "sentence_pinyin": "Zīběn yùsuàn juécè pínggū chángqī tóuzī xiàngmù de cáiwù kěxíngxìng.",
      "sentence_fr": "Les décisions de budgétisation du capital évaluent la viabilité financière des projets d'investissement à long terme.",
      "sentence_en": "Capital budgeting decisions evaluate the financial viability of long-term investment projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "capital_budgeting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "应用程序安全测试在软件发布前识别和修复安全漏洞。",
      "sentence_pinyin": "Yìngyòng chéngxù ānquán cèshì zài ruǎnjiàn fābù qián shíbié hé xiūfù ānquán lòudòng.",
      "sentence_fr": "Les tests de sécurité des applications identifient et corrigent les vulnérabilités de sécurité avant la publication du logiciel.",
      "sentence_en": "Application security testing identifies and fixes security vulnerabilities before software release.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "application_security_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
