{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个研究成果为解决能源危机提供了新的思路和方向。",
      "sentence_pinyin": "Zhège yánjiū chéngguǒ wèi jiějué néngyuán wēijī tígōngle xīn de sīlù hé fāngxiàng.",
      "sentence_fr": "Ce résultat de recherche fournit de nouvelles idées et directions pour résoudre la crise énergétique.",
      "sentence_en": "This research result provides new ideas and directions for solving the energy crisis.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的文章观点鲜明，论述清晰，发表后引起了广泛关注。",
      "sentence_pinyin": "Tā de wénzhāng guāndiǎn xiānmíng, lùnshù qīngxī, fābiǎo hòu yǐnqǐle guǎngfàn guānzhù.",
      "sentence_fr": "Son article a des points de vue clairs et une argumentation limpide, attirant une large attention après publication.",
      "sentence_en": "Her article has clear viewpoints and lucid arguments, attracting wide attention after publication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "writing",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家航空公司提供优质的服务和舒适的飞行体验。",
      "sentence_pinyin": "Zhè jiā hángkōng gōngsī tígōng yōuzhì de fúwù hé shūshì de fēixíng tǐyàn.",
      "sentence_fr": "Cette compagnie aérienne offre un service de qualité et une expérience de vol confortable.",
      "sentence_en": "This airline provides quality service and a comfortable flight experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "travel",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他从失败中吸取教训，不断改进自己的工作方法。",
      "sentence_pinyin": "Tā cóng shībài zhōng xīqǔ jiàoxun, bùduàn gǎijìn zìjǐ de gōngzuò fāngfǎ.",
      "sentence_fr": "Il tire des leçons de ses échecs et améliore continuellement ses méthodes de travail.",
      "sentence_en": "He learns from failures and continuously improves his work methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "self_improvement",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农业项目采用了有机种植技术，生产出高品质的农产品。",
      "sentence_pinyin": "Zhège nóngyè xiàngmù cǎiyòngle yǒujī zhòngzhí jìshù, shēngchǎn chū gāo pǐnzhì de nóngchǎnpǐn.",
      "sentence_fr": "Ce projet agricole utilise des techniques de culture biologique pour produire des produits agricoles de haute qualité.",
      "sentence_en": "This agricultural project uses organic farming techniques to produce high-quality agricultural products.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agriculture",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片真实记录了野生动物保护工作者的日常生活。",
      "sentence_pinyin": "Zhè bù jìlùpiàn zhēnshí jìlùle yěshēng dòngwù bǎohù gōngzuòzhě de rìcháng shēnghuó.",
      "sentence_fr": "Ce documentaire enregistre fidèlement la vie quotidienne des travailleurs de la protection de la faune.",
      "sentence_en": "This documentary authentically records the daily life of wildlife conservation workers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wildlife",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学校建立了心理咨询室，为学生提供专业的心理辅导服务。",
      "sentence_pinyin": "Xuéxiào jiànlìle xīnlǐ zīxúnshì, wèi xuésheng tígōng zhuānyè de xīnlǐ fǔdǎo fúwù.",
      "sentence_fr": "L'école a établi un bureau de conseil psychologique pour fournir des services de soutien psychologique professionnels aux étudiants.",
      "sentence_en": "The school established a psychological counseling office to provide professional psychological support services to students.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的创业经历充满了挑战和机遇，最终取得了成功。",
      "sentence_pinyin": "Tā de chuàngyè jīnglì chōngmǎnle tiǎozhàn hé jīyù, zuìzhōng qǔdéle chénggōng.",
      "sentence_fr": "Son parcours entrepreneurial était plein de défis et d'opportunités, et il a finalement réussi.",
      "sentence_en": "His entrepreneurial journey was full of challenges and opportunities, and he ultimately succeeded.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个手机应用可以帮助用户记录和分析自己的运动数据。",
      "sentence_pinyin": "Zhège shǒujī yìngyòng kěyǐ bāngzhù yònghù jìlù hé fēnxī zìjǐ de yùndòng shùjù.",
      "sentence_fr": "Cette application mobile peut aider les utilisateurs à enregistrer et analyser leurs données d'exercice.",
      "sentence_en": "This mobile app can help users record and analyze their exercise data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座图书馆收藏了大量珍贵的古籍和历史文献。",
      "sentence_pinyin": "Zhè zuò túshūguǎn shōucángle dàliàng zhēnguì de gǔjí hé lìshǐ wénxiàn.",
      "sentence_fr": "Cette bibliothèque abrite une vaste collection de livres anciens et de documents historiques précieux.",
      "sentence_en": "This library houses a large collection of precious ancient books and historical documents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过社交媒体平台分享自己的烹饪心得和菜谱。",
      "sentence_pinyin": "Tā tōngguò shèjiāo méitǐ píngtái fēnxiǎng zìjǐ de pēngrèn xīndé hé càipǔ.",
      "sentence_fr": "Elle partage ses expériences culinaires et ses recettes via les plateformes de médias sociaux.",
      "sentence_en": "She shares her cooking experiences and recipes through social media platforms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cooking",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个乐队的演出风格独特，深受年轻观众的喜爱。",
      "sentence_pinyin": "Zhège yuèduì de yǎnchū fēnggé dútè, shēn shòu niánqīng guānzhòng de xǐ'ài.",
      "sentence_fr": "Le style de performance de ce groupe est unique et très apprécié du jeune public.",
      "sentence_en": "This band's performance style is unique and very popular among young audiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府投资建设了多个公共体育设施，方便市民锻炼身体。",
      "sentence_pinyin": "Zhèngfǔ tóuzī jiànshèle duō ge gōnggòng tǐyù shèshī, fāngbiàn shìmín duànliàn shēntǐ.",
      "sentence_fr": "Le gouvernement a investi dans la construction de plusieurs installations sportives publiques pour faciliter l'exercice des citoyens.",
      "sentence_en": "The government invested in building multiple public sports facilities to facilitate citizens' exercise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_services",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的摄影作品捕捉到了城市生活中最真实动人的瞬间。",
      "sentence_pinyin": "Tā de shèyǐng zuòpǐn bǔzhuō dàole chéngshì shēnghuó zhōng zuì zhēnshí dòngrén de shùnjiān.",
      "sentence_fr": "Ses œuvres photographiques capturent les moments les plus authentiques et émouvants de la vie urbaine.",
      "sentence_en": "His photography works capture the most authentic and moving moments of urban life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "photography",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家企业注重员工培训，为每个人提供学习和成长的机会。",
      "sentence_pinyin": "Zhè jiā qǐyè zhùzhòng yuángōng péixùn, wèi měi ge rén tígōng xuéxí hé chéngzhǎng de jīhuì.",
      "sentence_fr": "Cette entreprise met l'accent sur la formation des employés et offre à chacun des opportunités d'apprentissage et de croissance.",
      "sentence_en": "This company emphasizes employee training and provides everyone with learning and growth opportunities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个传统手工艺品制作技艺已被列入非物质文化遗产名录。",
      "sentence_pinyin": "Zhège chuántǒng shǒugōngyìpǐn zhìzuò jìyì yǐ bèi lièrù fēi wùzhì wénhuà yíchǎn mínglù.",
      "sentence_fr": "Cette technique de fabrication artisanale traditionnelle a été inscrite sur la liste du patrimoine culturel immatériel.",
      "sentence_en": "This traditional handicraft making technique has been listed on the intangible cultural heritage list.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在比赛中发挥稳定，凭借出色的表现获得了评委的高分。",
      "sentence_pinyin": "Tā zài bǐsài zhōng fāhuī wěndìng, píngjie chūsè de biǎoxiàn huòdéle píngwěi de gāo fēn.",
      "sentence_fr": "Elle a performé de manière stable lors de la compétition et a obtenu des notes élevées des juges grâce à son excellente performance.",
      "sentence_en": "She performed steadily in the competition and received high scores from judges with her excellent performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "competitions",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线平台为创作者提供了展示作品和交流经验的空间。",
      "sentence_pinyin": "Zhège zàixiàn píngtái wèi chuàngzuòzhě tígōngle zhǎnshì zuòpǐn hé jiāoliú jīngyàn de kōngjiān.",
      "sentence_fr": "Cette plateforme en ligne offre aux créateurs un espace pour présenter leurs œuvres et échanger des expériences.",
      "sentence_en": "This online platform provides creators with a space to showcase works and exchange experiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在工作之余还坚持写作，已经出版了三本小说。",
      "sentence_pinyin": "Tā zài gōngzuò zhī yú hái jiānchí xiězuò, yǐjīng chūbǎnle sān běn xiǎoshuō.",
      "sentence_fr": "En dehors de son travail, il continue d'écrire et a déjà publié trois romans.",
      "sentence_en": "Outside of work, he continues to write and has already published three novels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个健康管理系统能够实时监测用户的身体指标和健康状况。",
      "sentence_pinyin": "Zhège jiànkāng guǎnlǐ xìtǒng nénggòu shíshí jiāncè yònghù de shēntǐ zhǐbiāo hé jiànkāng zhuàngkuàng.",
      "sentence_fr": "Ce système de gestion de la santé peut surveiller en temps réel les indicateurs corporels et l'état de santé des utilisateurs.",
      "sentence_en": "This health management system can monitor users' body indicators and health status in real time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health",
      "created_at": "2025-11-20T17:05:00.000Z",
      "updated_at": "2025-11-20T17:05:00.000Z"
    }
  ]
}
