{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能养殖场利用物联网技术实时监测牲畜的健康状况和生长情况。",
      "sentence_pinyin": "Zhège zhìnéng yǎngzhíchǎng lìyòng wùliánwǎng jìshù shíshí jiāncè shēngchù de jiànkāng zhuàngkuàng hé shēngzhǎng qíngkuàng.",
      "sentence_fr": "Cette ferme d'élevage intelligente utilise la technologie IoT pour surveiller en temps réel l'état de santé et la croissance du bétail.",
      "sentence_en": "This smart livestock farm uses IoT technology to monitor the health status and growth of livestock in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_livestock_farming",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笛子的笛膜需要定期更换,以保持最佳的音色效果。",
      "sentence_pinyin": "Dízǐ de dímó xūyào dìngqī gēnghuàn, yǐ bǎochí zuìjiā de yīnsè xiàoguǒ.",
      "sentence_fr": "La membrane du dizi doit être régulièrement remplacée pour maintenir le meilleur effet sonore.",
      "sentence_en": "The dizi's membrane needs to be replaced regularly to maintain the best tonal effect.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dizi_maintenance",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新能源汽车共享平台为市民提供了便捷的绿色出行选择。",
      "sentence_pinyin": "Zhège xīn néngyuán qìchē gòngxiǎng píngtái wèi shìmín tígōngle biànjié de lǜsè chūxíng xuǎnzé.",
      "sentence_fr": "Cette plateforme de partage de véhicules à énergie nouvelle offre aux citoyens une option de transport vert pratique.",
      "sentence_en": "This new energy vehicle sharing platform provides citizens with convenient green transportation options.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_sharing",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "剪绣艺术结合了剪纸和刺绣两种传统工艺的精华。",
      "sentence_pinyin": "Jiǎnxiù yìshù jiéhéle jiǎnzhǐ hé cìxiù liǎng zhǒng chuántǒng gōngyì de jīnghuá.",
      "sentence_fr": "L'art de la broderie découpée combine l'essence de deux artisanats traditionnels : le découpage et la broderie.",
      "sentence_en": "Cut embroidery art combines the essence of two traditional crafts: paper cutting and embroidery.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cut_embroidery",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能宠物喂食器可以定时定量自动投放宠物食物。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chǒngwù wèishíqì kěyǐ dìngshí dìngliàng zìdòng tóufàng chǒngwù shíwù.",
      "sentence_fr": "Ce distributeur de nourriture intelligent pour animaux peut distribuer automatiquement la nourriture à des heures et quantités prédéfinies.",
      "sentence_en": "This smart pet feeder can automatically dispense pet food at scheduled times and quantities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_feeders",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区卫生服务站为居民提供了基本医疗和公共卫生服务。",
      "sentence_pinyin": "Zhège shèqū wèishēng fúwù zhàn wèi jūmín tígōngle jīběn yīliào hé gōnggòng wèishēng fúwù.",
      "sentence_fr": "Cette station de services de santé communautaire fournit des soins médicaux de base et des services de santé publique aux résidents.",
      "sentence_en": "This community health service station provides residents with basic medical care and public health services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_health_stations",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "扬琴的琴弦有几十根,需要定期调音以保持准确的音高。",
      "sentence_pinyin": "Yángqín de qínxián yǒu jǐshí gēn, xūyào dìngqī tiáoyīn yǐ bǎochí zhǔnquè de yīngāo.",
      "sentence_fr": "Le yangqin a plusieurs dizaines de cordes qui doivent être accordées régulièrement pour maintenir une hauteur précise.",
      "sentence_en": "The yangqin has dozens of strings that need regular tuning to maintain accurate pitch.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangqin_tuning",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线签约平台让合同签署可以远程完成,提高了商务效率。",
      "sentence_pinyin": "Zhège zàixiàn qiānyuē píngtái ràng hétong qiānshǔ kěyǐ yuǎnchéng wánchéng, tígāole shāngwù xiàolǜ.",
      "sentence_fr": "Cette plateforme de signature en ligne permet de signer des contrats à distance, améliorant l'efficacité commerciale.",
      "sentence_en": "This online signing platform allows contracts to be signed remotely, improving business efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "e_signature_platforms",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "香云纱是广东特有的丝绸织品,制作工艺复杂独特。",
      "sentence_pinyin": "Xiāngyúnshā shì Guǎngdōng tèyǒu de sīchóu zhīpǐn, zhìzuò gōngyì fùzá dútè.",
      "sentence_fr": "Le xiangyunsha est un tissu de soie unique au Guangdong, avec un processus de fabrication complexe et unique.",
      "sentence_en": "Xiangyunsha is a silk fabric unique to Guangdong, with a complex and unique manufacturing process.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiangyunsha_silk",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能扫地机器人可以自动识别地面材质并调整清洁方式。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng sǎodì jīqìrén kěyǐ zìdòng shíbié dìmiàn cáizhì bìng tiáozhěng qīngjié fāngshì.",
      "sentence_fr": "Ce robot aspirateur intelligent peut identifier automatiquement les types de sol et ajuster le mode de nettoyage.",
      "sentence_en": "This smart sweeping robot can automatically identify floor materials and adjust cleaning methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_cleaning_robots",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生态修复项目成功恢复了受污染河流的自净能力。",
      "sentence_pinyin": "Zhège shēngtài xiūfù xiàngmù chénggōng huīfùle shòu wūrǎn héliú de zìjìng nénglì.",
      "sentence_fr": "Ce projet de restauration écologique a réussi à restaurer la capacité d'auto-purification de la rivière polluée.",
      "sentence_en": "This ecological restoration project successfully restored the self-purification capacity of the polluted river.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "river_restoration",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐在北方农村的婚庆仪式上是不可或缺的乐器。",
      "sentence_pinyin": "Suǒnà zài běifāng nóngcūn de hūnqìng yíshì shàng shì bùkě huòquē de yuèqì.",
      "sentence_fr": "Le suona est un instrument indispensable lors des cérémonies de mariage dans les zones rurales du nord.",
      "sentence_en": "The suona is an indispensable instrument in wedding ceremonies in northern rural areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_traditions",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字人民币试点项目让市民可以使用电子货币进行日常消费。",
      "sentence_pinyin": "Zhège shùzì rénmínbì shìdiǎn xiàngmù ràng shìmín kěyǐ shǐyòng diànzǐ huòbì jìnxíng rìcháng xiāofèi.",
      "sentence_fr": "Ce projet pilote de yuan numérique permet aux citoyens d'utiliser la monnaie électronique pour leurs dépenses quotidiennes.",
      "sentence_en": "This digital yuan pilot project allows citizens to use electronic currency for daily consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_currency",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蓝染工艺使用天然植物染料,制作出独特的蓝色图案。",
      "sentence_pinyin": "Lánrǎn gōngyì shǐyòng tiānrán zhíwù rǎnliào, zhìzuò chū dútè de lánsè tú'àn.",
      "sentence_fr": "L'artisanat de la teinture indigo utilise des colorants végétaux naturels pour créer des motifs bleus uniques.",
      "sentence_en": "Indigo dyeing craftsmanship uses natural plant dyes to create unique blue patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "indigo_dyeing",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能跑步机可以根据用户的心率自动调节速度和坡度。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng pǎobùjī kěyǐ gēnjù yònghù de xīnlǜ zìdòng tiáojié sùdù hé pōdù.",
      "sentence_fr": "Ce tapis de course intelligent peut ajuster automatiquement la vitesse et l'inclinaison en fonction de la fréquence cardiaque de l'utilisateur.",
      "sentence_en": "This smart treadmill can automatically adjust speed and incline based on the user's heart rate.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_treadmills",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个残疾人就业帮扶中心为残疾人提供了职业技能培训和就业推荐服务。",
      "sentence_pinyin": "Zhège cánjírén jiùyè bāngfú zhōngxīn wèi cánjírén tígōngle zhíyè jìnéng péixùn hé jiùyè tuījiàn fúwù.",
      "sentence_fr": "Ce centre d'aide à l'emploi des personnes handicapées offre formation professionnelle et services de recommandation d'emploi aux personnes handicapées.",
      "sentence_en": "This disability employment assistance center provides vocational skills training and job referral services for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disability_employment_centers",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古琴曲《高山流水》寓意知音难觅,是中国古典音乐的代表作。",
      "sentence_pinyin": "Gǔqín qǔ 'Gāoshān liúshuǐ' yùyì zhīyīn nánmì, shì Zhōngguó gǔdiǎn yīnyuè de dàibiǎozuò.",
      "sentence_fr": "La pièce de guqin 'Hautes montagnes et eaux courantes' symbolise la difficulté de trouver un ami intime, c'est un chef-d'œuvre de la musique classique chinoise.",
      "sentence_en": "The guqin piece 'High Mountains and Flowing Water' symbolizes the difficulty of finding a kindred spirit and is a masterpiece of Chinese classical music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_repertoire",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧停车系统可以实时显示附近停车场的空位数量。",
      "sentence_pinyin": "Zhège zhìhuì tíngchē xìtǒng kěyǐ shíshí xiǎnshì fùjìn tíngchēchǎng de kòngwèi shùliàng.",
      "sentence_fr": "Ce système de stationnement intelligent peut afficher en temps réel le nombre de places disponibles dans les parkings à proximité.",
      "sentence_en": "This smart parking system can display the number of available spaces in nearby parking lots in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking_systems",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "贝壳工艺将天然贝壳打磨镶嵌成精美的首饰和装饰品。",
      "sentence_pinyin": "Bèiké gōngyì jiāng tiānrán bèiké dǎmó xiāngqiàn chéng jīngměi de shǒushì hé zhuāngshìpǐn.",
      "sentence_fr": "L'artisanat des coquillages polit et incruste des coquillages naturels en bijoux et décorations exquis.",
      "sentence_en": "Shell craftsmanship polishes and inlays natural shells into exquisite jewelry and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shell_crafts",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能鱼缸可以自动调节水温、过滤水质并定时喂食。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yúgāng kěyǐ zìdòng tiáojié shuǐwēn, guòlǜ shuǐzhì bìng dìngshí wèishí.",
      "sentence_fr": "Cet aquarium intelligent peut réguler automatiquement la température de l'eau, filtrer la qualité de l'eau et nourrir les poissons à heures fixes.",
      "sentence_en": "This smart fish tank can automatically regulate water temperature, filter water quality, and feed fish on schedule.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_aquariums",
      "created_at": "2025-11-20T21:50:00.000Z",
      "updated_at": "2025-11-20T21:50:00.000Z"
    }
  ]
}
