{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "信息架构设计组织网站和应用程序内容以优化用户导航和信息发现。",
      "sentence_pinyin": "Xìnxī jiàgòu shèjì zǔzhī wǎngzhàn hé yìngyòng chéngxù nèiróng yǐ yōuhuà yònghù dǎoháng hé xìnxī fāxiàn.",
      "sentence_fr": "La conception de l'architecture de l'information organise le contenu des sites web et des applications pour optimiser la navigation et la découverte d'informations.",
      "sentence_en": "Information architecture design organizes website and application content to optimize user navigation and information discovery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "information_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经经济学结合神经科学和经济学来研究大脑如何做出经济决策。",
      "sentence_pinyin": "Shénjīng jīngjìxué jiéhé shénjīng kēxué hé jīngjìxué lái yánjiū dànǎo rúhé zuòchū jīngjì juécè.",
      "sentence_fr": "La neuroéconomie combine les neurosciences et l'économie pour étudier comment le cerveau prend des décisions économiques.",
      "sentence_en": "Neuroeconomics combines neuroscience and economics to study how the brain makes economic decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroeconomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "湿地保护对于维持生物多样性和提供关键生态系统服务至关重要。",
      "sentence_pinyin": "Shīdì bǎohù duìyú wéichí shēngwù duōyàngxìng hé tígōng guānjiàn shēngtài xìtǒng fúwù zhìguān zhòngyào.",
      "sentence_fr": "La protection des zones humides est cruciale pour maintenir la biodiversité et fournir des services écosystémiques essentiels.",
      "sentence_en": "Wetland protection is crucial for maintaining biodiversity and providing critical ecosystem services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wetland_conservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "历史语言学通过比较方法重建古代语言和追溯语言的演变历史。",
      "sentence_pinyin": "Lìshǐ yǔyánxué tōngguò bǐjiào fāngfǎ chóngjiàn gǔdài yǔyán hé zhuīsù yǔyán de yǎnbiàn lìshǐ.",
      "sentence_fr": "La linguistique historique reconstruit les langues anciennes et retrace l'évolution des langues à travers la méthode comparative.",
      "sentence_en": "Historical linguistics reconstructs ancient languages and traces the evolutionary history of languages through comparative methods.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "historical_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "缓存策略是提高应用程序性能和减少数据库负载的关键技术。",
      "sentence_pinyin": "Huǎncún cèlüè shì tígāo yìngyòng chéngxù xìngnéng hé jiǎnshǎo shùjùkù fùzài de guānjiàn jìshù.",
      "sentence_fr": "Les stratégies de mise en cache sont des techniques clés pour améliorer les performances des applications et réduire la charge de la base de données.",
      "sentence_en": "Caching strategies are key techniques for improving application performance and reducing database load.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "caching_strategies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "媒体心理学研究媒体内容和技术如何影响人类思维和行为。",
      "sentence_pinyin": "Méitǐ xīnlǐxué yánjiū méitǐ nèiróng hé jìshù rúhé yǐngxiǎng rénlèi sīwéi hé xíngwéi.",
      "sentence_fr": "La psychologie des médias étudie comment le contenu et la technologie des médias affectent la pensée et le comportement humains.",
      "sentence_en": "Media psychology studies how media content and technology affect human thinking and behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "media_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "癌症基因组学研究肿瘤的遗传变异以开发个性化治疗方案。",
      "sentence_pinyin": "Áizhèng jīyīn zǔxué yánjiū zhǒngliú de yíchuán biànyì yǐ kāifā gèxìnghuà zhìliáo fāng'àn.",
      "sentence_fr": "La génomique du cancer étudie les variations génétiques des tumeurs pour développer des traitements personnalisés.",
      "sentence_en": "Cancer genomics studies genetic variations in tumors to develop personalized treatment plans.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cancer_genomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际贸易理论解释了国家之间专业化和贸易的经济基础。",
      "sentence_pinyin": "Guójì màoyì lǐlùn jiěshìle guójiā zhījiān zhuānyèhuà hé màoyì de jīngjì jīchǔ.",
      "sentence_fr": "La théorie du commerce international explique les fondements économiques de la spécialisation et du commerce entre les nations.",
      "sentence_en": "International trade theory explains the economic basis of specialization and trade between nations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_trade_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情感分析技术从文本中自动识别和提取用户的情感倾向和观点。",
      "sentence_pinyin": "Qínggǎn fēnxī jìshù cóng wénběn zhōng zìdòng shíbié hé tíqǔ yònghù de qínggǎn qīngxiàng hé guāndiǎn.",
      "sentence_fr": "La technologie d'analyse des sentiments identifie et extrait automatiquement les tendances émotionnelles et les opinions des utilisateurs à partir du texte.",
      "sentence_en": "Sentiment analysis technology automatically identifies and extracts users' emotional tendencies and opinions from text.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sentiment_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境法规定了污染控制、资源管理和生态保护的法律标准。",
      "sentence_pinyin": "Huánjìng fǎ guīdìngle wūrǎn kòngzhì, zīyuán guǎnlǐ hé shēngtài bǎohù de fǎlǜ biāozhǔn.",
      "sentence_fr": "Le droit de l'environnement établit les normes juridiques pour le contrôle de la pollution, la gestion des ressources et la protection écologique.",
      "sentence_en": "Environmental law establishes legal standards for pollution control, resource management, and ecological protection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经影像学技术提供了关于大脑结构和功能的非侵入性观察方法。",
      "sentence_pinyin": "Shénjīng yǐngxiàngxué jìshù tígōngle guānyú dànǎo jiégòu hé gōngnéng de fēi qīnrùxìng guānchá fāngfǎ.",
      "sentence_fr": "Les techniques de neuro-imagerie fournissent des méthodes d'observation non invasives de la structure et de la fonction cérébrales.",
      "sentence_en": "Neuroimaging techniques provide non-invasive observation methods for brain structure and function.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroimaging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "负载均衡技术将网络流量分配到多个服务器以提高可用性和响应速度。",
      "sentence_pinyin": "Fùzài jūnhéng jìshù jiāng wǎngluò liúliàng fēnpèi dào duō gè fúwùqì yǐ tígāo kěyòngxìng hé xiǎngyìng sùdù.",
      "sentence_fr": "La technologie d'équilibrage de charge distribue le trafic réseau sur plusieurs serveurs pour améliorer la disponibilité et la vitesse de réponse.",
      "sentence_en": "Load balancing technology distributes network traffic across multiple servers to improve availability and response speed.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "load_balancing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会福利政策旨在保障公民的基本生活需求和促进社会公平。",
      "sentence_pinyin": "Shèhuì fúlì zhèngcè zhǐzài bǎozhàng gōngmín de jīběn shēnghuó xūqiú hé cùjìn shèhuì gōngpíng.",
      "sentence_fr": "Les politiques de protection sociale visent à garantir les besoins fondamentaux des citoyens et à promouvoir l'équité sociale.",
      "sentence_en": "Social welfare policies aim to guarantee citizens' basic living needs and promote social equity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_welfare_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋生物学研究海洋生态系统中的生物多样性、分布和相互作用。",
      "sentence_pinyin": "Hǎiyáng shēngwùxué yánjiū hǎiyáng shēngtài xìtǒng zhōng de shēngwù duōyàngxìng, fēnbù hé xiānghù zuòyòng.",
      "sentence_fr": "La biologie marine étudie la biodiversité, la distribution et les interactions dans les écosystèmes marins.",
      "sentence_en": "Marine biology studies biodiversity, distribution, and interactions in marine ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "对比语言学比较不同语言的结构以揭示共同特征和独特差异。",
      "sentence_pinyin": "Duìbǐ yǔyánxué bǐjiào bùtóng yǔyán de jiégòu yǐ jiēshì gòngtóng tèzhēng hé dútè chāyì.",
      "sentence_fr": "La linguistique contrastive compare les structures de différentes langues pour révéler les caractéristiques communes et les différences uniques.",
      "sentence_en": "Contrastive linguistics compares the structures of different languages to reveal common features and unique differences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contrastive_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "版本控制系统跟踪代码变更历史并支持多人协作开发项目。",
      "sentence_pinyin": "Bǎnběn kòngzhì xìtǒng zhuīzōng dàimǎ biàngēng lìshǐ bìng zhīchí duō rén xiézuò kāifā xiàngmù.",
      "sentence_fr": "Les systèmes de contrôle de version suivent l'historique des modifications de code et supportent le développement collaboratif multi-utilisateurs.",
      "sentence_en": "Version control systems track code change history and support multi-person collaborative development projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "version_control",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "运动心理学研究心理因素如何影响运动表现和竞技状态。",
      "sentence_pinyin": "Yùndòng xīnlǐxué yánjiū xīnlǐ yīnsù rúhé yǐngxiǎng yùndòng biǎoxiàn hé jìngjì zhuàngtài.",
      "sentence_fr": "La psychologie du sport étudie comment les facteurs psychologiques affectent la performance sportive et l'état compétitif.",
      "sentence_en": "Sports psychology studies how psychological factors affect athletic performance and competitive state.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sports_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "药物设计利用计算模型来预测候选分子与生物靶点的相互作用。",
      "sentence_pinyin": "Yàowù shèjì lìyòng jìsuàn móxíng lái yùcè hòuxuǎn fēnzǐ yǔ shēngwù bǎdiǎn de xiānghù zuòyòng.",
      "sentence_fr": "La conception de médicaments utilise des modèles computationnels pour prédire les interactions entre les molécules candidates et les cibles biologiques.",
      "sentence_en": "Drug design uses computational models to predict interactions between candidate molecules and biological targets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "drug_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市交通规划致力于减少拥堵并促进可持续的出行方式。",
      "sentence_pinyin": "Chéngshì jiāotōng guīhuà zhìlì yú jiǎnshǎo yōngdǔ bìng cùjìn kě chíxù de chūxíng fāngshì.",
      "sentence_fr": "La planification du transport urbain vise à réduire la congestion et à promouvoir des modes de déplacement durables.",
      "sentence_en": "Urban transportation planning is dedicated to reducing congestion and promoting sustainable travel modes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_transportation_planning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宗教社会学研究宗教在社会生活中的功能、组织形式和变迁过程。",
      "sentence_pinyin": "Zōngjiào shèhuìxué yánjiū zōngjiào zài shèhuì shēnghuó zhōng de gōngnéng, zǔzhī xíngshì hé biànqiān guòchéng.",
      "sentence_fr": "La sociologie des religions étudie les fonctions, les formes d'organisation et les processus de changement de la religion dans la vie sociale.",
      "sentence_en": "Sociology of religion studies the functions, organizational forms, and change processes of religion in social life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sociology_of_religion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
