{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "中微子几乎不与物质相互作用因此极难被探测器捕获。",
      "sentence_pinyin": "Zhōngwéizǐ jīhū bù yǔ wùzhì xiānghù zuòyòng yīncǐ jí nán bèi tàncèqì bǔhuò.",
      "sentence_fr": "Les neutrinos n'interagissent presque pas avec la matière, ce qui les rend extrêmement difficiles à capturer par les détecteurs.",
      "sentence_en": "Neutrinos barely interact with matter, making them extremely difficult to capture by detectors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neutrino_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "财政政策通过政府支出和税收调节总需求水平。",
      "sentence_pinyin": "Cáizhèng zhèngcè tōngguò zhèngfǔ zhīchū hé shuìshōu tiáojié zǒng xūqiú shuǐpíng.",
      "sentence_fr": "La politique budgétaire régule le niveau de la demande globale par les dépenses publiques et les impôts.",
      "sentence_en": "Fiscal policy regulates the level of aggregate demand through government spending and taxation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fiscal_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "云安全架构需要考虑共享责任模型和数据主权问题。",
      "sentence_pinyin": "Yún ānquán jiàgòu xūyào kǎolǜ gòngxiǎng zérèn móxíng hé shùjù zhǔquán wèntí.",
      "sentence_fr": "L'architecture de sécurité cloud doit prendre en compte le modèle de responsabilité partagée et les questions de souveraineté des données.",
      "sentence_en": "Cloud security architecture needs to consider the shared responsibility model and data sovereignty issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cloud_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "本体论研究存在和实在的根本性质及其分类。",
      "sentence_pinyin": "Běntǐlùn yánjiū cúnzài hé shízài de gēnběn xìngzhì jí qí fēnlèi.",
      "sentence_fr": "L'ontologie étudie la nature fondamentale de l'être et de la réalité ainsi que leur classification.",
      "sentence_en": "Ontology studies the fundamental nature of being and reality and their classification.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ontology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多模态学习整合来自不同感官模态的信息进行联合推理。",
      "sentence_pinyin": "Duō mótài xuéxí zhěnghé láizì bùtóng gǎnguān mótài de xìnxī jìnxíng liánhé tuīlǐ.",
      "sentence_fr": "L'apprentissage multimodal intègre des informations provenant de différentes modalités sensorielles pour un raisonnement conjoint.",
      "sentence_en": "Multimodal learning integrates information from different sensory modalities for joint reasoning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multimodal_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超新星爆发释放的能量可以短暂超过整个星系的亮度。",
      "sentence_pinyin": "Chāoxīnxīng bàofā shìfàng de néngliàng kěyǐ duǎnzàn chāoguò zhěnggè xīngxì de liàngdù.",
      "sentence_fr": "L'énergie libérée par une explosion de supernova peut brièvement dépasser la luminosité d'une galaxie entière.",
      "sentence_en": "The energy released by a supernova explosion can briefly exceed the brightness of an entire galaxy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supernova_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际收支平衡表记录一国与世界其他国家的经济交易。",
      "sentence_pinyin": "Guójì shōuzhī pínghéngbiǎo jìlù yī guó yǔ shìjiè qítā guójiā de jīngjì jiāoyì.",
      "sentence_fr": "La balance des paiements enregistre les transactions économiques d'un pays avec le reste du monde.",
      "sentence_en": "The balance of payments records a country's economic transactions with the rest of the world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "balance_of_payments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "漏洞赏金计划激励安全研究人员报告发现的系统缺陷。",
      "sentence_pinyin": "Lòudòng shǎngjīn jìhuà jīlì ānquán yánjiū rényuán bàogào fāxiàn de xìtǒng quēxiàn.",
      "sentence_fr": "Les programmes de récompense des bogues encouragent les chercheurs en sécurité à signaler les failles système découvertes.",
      "sentence_en": "Bug bounty programs incentivize security researchers to report discovered system flaws.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bug_bounty_programs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "形而上学探究超越物理经验的终极实在和基本原理。",
      "sentence_pinyin": "Xíng'érshàngxué tànjiū chāoyuè wùlǐ jīngyàn de zhōngjí shízài hé jīběn yuánlǐ.",
      "sentence_fr": "La métaphysique explore la réalité ultime et les principes fondamentaux au-delà de l'expérience physique.",
      "sentence_en": "Metaphysics explores ultimate reality and fundamental principles beyond physical experience.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metaphysics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识蒸馏将大型教师模型的知识转移到小型学生模型。",
      "sentence_pinyin": "Zhīshì zhēngliù jiāng dàxíng jiàoshī móxíng de zhīshì zhuǎnyí dào xiǎoxíng xuéshēng móxíng.",
      "sentence_fr": "La distillation des connaissances transfère les connaissances d'un grand modèle enseignant vers un petit modèle étudiant.",
      "sentence_en": "Knowledge distillation transfers knowledge from a large teacher model to a small student model.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "knowledge_distillation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "脉冲星是高速旋转的中子星发出规律的电磁脉冲信号。",
      "sentence_pinyin": "Màichōngxīng shì gāosù xuánzhuǎn de zhōngzǐxīng fāchū guīlǜ de diàncí màichōng xìnhào.",
      "sentence_fr": "Les pulsars sont des étoiles à neutrons en rotation rapide émettant des signaux d'impulsion électromagnétique réguliers.",
      "sentence_en": "Pulsars are rapidly rotating neutron stars that emit regular electromagnetic pulse signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pulsar_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "汇率波动对进出口企业的成本和利润产生直接影响。",
      "sentence_pinyin": "Huìlǜ bōdòng duì jìnchūkǒu qǐyè de chéngběn hé lìrùn chǎnshēng zhíjiē yǐngxiǎng.",
      "sentence_fr": "Les fluctuations des taux de change ont un impact direct sur les coûts et les bénéfices des entreprises d'import-export.",
      "sentence_en": "Exchange rate fluctuations have a direct impact on the costs and profits of import-export companies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "exchange_rate_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络隔离策略将关键系统与普通网络环境分离保护。",
      "sentence_pinyin": "Wǎngluò gélí cèlüè jiāng guānjiàn xìtǒng yǔ pǔtōng wǎngluò huánjìng fēnlí bǎohù.",
      "sentence_fr": "Les stratégies de segmentation réseau isolent les systèmes critiques de l'environnement réseau ordinaire pour les protéger.",
      "sentence_en": "Network segmentation strategies separate critical systems from the ordinary network environment for protection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_segmentation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "逻辑实证主义认为只有可验证的命题才具有认知意义。",
      "sentence_pinyin": "Luójí shízhèng zhǔyì rènwéi zhǐyǒu kě yànzhèng de mìngtí cái jùyǒu rènzhī yìyì.",
      "sentence_fr": "Le positivisme logique soutient que seules les propositions vérifiables ont une signification cognitive.",
      "sentence_en": "Logical positivism holds that only verifiable propositions have cognitive meaning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "logical_positivism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "元学习研究如何让机器学习算法学会学习新任务。",
      "sentence_pinyin": "Yuán xuéxí yánjiū rúhé ràng jīqì xuéxí suànfǎ xuéhuì xuéxí xīn rènwù.",
      "sentence_fr": "Le méta-apprentissage étudie comment permettre aux algorithmes d'apprentissage automatique d'apprendre à apprendre de nouvelles tâches.",
      "sentence_en": "Meta-learning studies how to enable machine learning algorithms to learn to learn new tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "meta_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类星体是宇宙中最明亮的天体由超大质量黑洞驱动。",
      "sentence_pinyin": "Lèixīngtǐ shì yǔzhòu zhōng zuì míngliàng de tiāntǐ yóu chāodà zhìliàng hēidòng qūdòng.",
      "sentence_fr": "Les quasars sont les objets les plus brillants de l'univers, alimentés par des trous noirs supermassifs.",
      "sentence_en": "Quasars are the brightest objects in the universe, powered by supermassive black holes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quasar_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "通货紧缩会抑制消费支出并加剧经济衰退的风险。",
      "sentence_pinyin": "Tōnghuò jǐnsuō huì yìzhì xiāofèi zhīchū bìng jiājù jīngjì shuāituì de fēngxiǎn.",
      "sentence_fr": "La déflation supprime les dépenses de consommation et aggrave le risque de récession économique.",
      "sentence_en": "Deflation suppresses consumer spending and exacerbates the risk of economic recession.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deflation_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全编码标准帮助开发人员避免常见的软件漏洞。",
      "sentence_pinyin": "Ānquán biānmǎ biāozhǔn bāngzhù kāifā rényuán bìmiǎn chángjiàn de ruǎnjiàn lòudòng.",
      "sentence_fr": "Les normes de codage sécurisé aident les développeurs à éviter les vulnérabilités logicielles courantes.",
      "sentence_en": "Secure coding standards help developers avoid common software vulnerabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "secure_coding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "辩证法通过正题反题和合题的过程理解概念发展。",
      "sentence_pinyin": "Biànzhèngfǎ tōngguò zhèngtí fǎntí hé hétí de guòchéng lǐjiě gàiniàn fāzhǎn.",
      "sentence_fr": "La dialectique comprend le développement des concepts à travers le processus de thèse, antithèse et synthèse.",
      "sentence_en": "Dialectics understands conceptual development through the process of thesis, antithesis, and synthesis.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dialectical_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "对比学习通过比较相似和不相似样本来学习有效表征。",
      "sentence_pinyin": "Duìbǐ xuéxí tōngguò bǐjiào xiāngsì hé bù xiāngsì yàngběn lái xuéxí yǒuxiào biǎozhēng.",
      "sentence_fr": "L'apprentissage contrastif apprend des représentations efficaces en comparant des échantillons similaires et dissimilaires.",
      "sentence_en": "Contrastive learning learns effective representations by comparing similar and dissimilar samples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contrastive_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
