{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "多巴胺奖励系统在成瘾行为和动机驱动中发挥着核心作用。",
      "sentence_pinyin": "Duōbā'àn jiǎnglì xìtǒng zài chéngyǐn xíngwéi hé dòngjī qūdòng zhōng fāhuī zhe héxīn zuòyòng.",
      "sentence_fr": "Le système de récompense dopaminergique joue un rôle central dans les comportements addictifs et la motivation.",
      "sentence_en": "The dopamine reward system plays a central role in addictive behaviors and motivation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dopamine_system",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字遗产管理涉及如何处理去世者在网络上留下的数字资产和账户。",
      "sentence_pinyin": "Shùzì yíchǎn guǎnlǐ shèjí rúhé chǔlǐ qùshì zhě zài wǎngluò shàng liú xià de shùzì zīchǎn hé zhànghù.",
      "sentence_fr": "La gestion du patrimoine numérique concerne le traitement des actifs numériques et des comptes laissés en ligne par les personnes décédées.",
      "sentence_en": "Digital legacy management involves how to handle the digital assets and accounts left online by deceased individuals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_legacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超导材料在极低温度下表现出零电阻特性，具有巨大的能源应用潜力。",
      "sentence_pinyin": "Chāodǎo cáiliào zài jí dī wēndù xià biǎoxiàn chū líng diànzǔ tèxìng, jùyǒu jùdà de néngyuán yìngyòng qiánlì.",
      "sentence_fr": "Les matériaux supraconducteurs présentent une résistance électrique nulle à très basse température, avec un énorme potentiel d'application énergétique.",
      "sentence_en": "Superconducting materials exhibit zero electrical resistance at extremely low temperatures, with enormous energy application potential.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "superconductors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "食物系统转型需要从生产、加工到消费的全链条协调变革。",
      "sentence_pinyin": "Shíwù xìtǒng zhuǎnxíng xūyào cóng shēngchǎn, jiāgōng dào xiāofèi de quán liàntiáo xiétiáo biàngé.",
      "sentence_fr": "La transformation des systèmes alimentaires nécessite un changement coordonné tout au long de la chaîne, de la production à la transformation et à la consommation.",
      "sentence_en": "Food system transformation requires coordinated changes throughout the entire chain from production, processing, to consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_system_transformation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "批判种族理论分析种族主义如何嵌入法律制度和社会结构之中。",
      "sentence_pinyin": "Pīpàn zhǒngzú lǐlùn fēnxī zhǒngzú zhǔyì rúhé qiànrù fǎlǜ zhìdù hé shèhuì jiégòu zhīzhōng.",
      "sentence_fr": "La théorie critique de la race analyse comment le racisme est intégré dans les systèmes juridiques et les structures sociales.",
      "sentence_en": "Critical race theory analyzes how racism is embedded in legal systems and social structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "critical_race_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然语言处理技术使计算机能够理解、解释和生成人类语言。",
      "sentence_pinyin": "Zìrán yǔyán chǔlǐ jìshù shǐ jìsuànjī nénggòu lǐjiě, jiěshì hé shēngchéng rénlèi yǔyán.",
      "sentence_fr": "La technologie de traitement du langage naturel permet aux ordinateurs de comprendre, d'interpréter et de générer le langage humain.",
      "sentence_en": "Natural language processing technology enables computers to understand, interpret, and generate human language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "natural_language_processing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "恢复性司法强调通过对话和调解来修复犯罪造成的伤害。",
      "sentence_pinyin": "Huīfù xìng sīfǎ qiángdiào tōngguò duìhuà hé tiáojiě lái xiūfù fànzuì zàochéng de shānghài.",
      "sentence_fr": "La justice restaurative met l'accent sur la réparation des préjudices causés par le crime par le dialogue et la médiation.",
      "sentence_en": "Restorative justice emphasizes repairing the harm caused by crime through dialogue and mediation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "restorative_justice",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "热泵技术利用环境热能为建筑供暖和制冷，能效远超传统系统。",
      "sentence_pinyin": "Rèbèng jìshù lìyòng huánjìng rènéng wèi jiànzhù gōngnuǎn hé zhìlěng, néngxiào yuǎn chāo chuántǒng xìtǒng.",
      "sentence_fr": "La technologie des pompes à chaleur utilise l'énergie thermique ambiante pour le chauffage et la climatisation des bâtiments, avec une efficacité énergétique bien supérieure aux systèmes traditionnels.",
      "sentence_en": "Heat pump technology uses ambient thermal energy for building heating and cooling, with energy efficiency far exceeding traditional systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "heat_pump_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球健康安全议程致力于增强各国预防和应对传染病暴发的能力。",
      "sentence_pinyin": "Quánqiú jiànkāng ānquán yìchéng zhìlì yú zēngqiáng gè guó yùfáng hé yìngduì chuánrǎn bìng bàofā de nénglì.",
      "sentence_fr": "L'agenda de sécurité sanitaire mondiale s'efforce de renforcer la capacité des pays à prévenir et à répondre aux épidémies de maladies infectieuses.",
      "sentence_en": "The global health security agenda aims to strengthen countries' capacity to prevent and respond to infectious disease outbreaks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "global_health_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "博物馆学研究博物馆的社会功能、收藏管理和展览设计原则。",
      "sentence_pinyin": "Bówùguǎn xué yánjiū bówùguǎn de shèhuì gōngnéng, shōucáng guǎnlǐ hé zhǎnlǎn shèjì yuánzé.",
      "sentence_fr": "La muséologie étudie les fonctions sociales des musées, la gestion des collections et les principes de conception des expositions.",
      "sentence_en": "Museology studies the social functions of museums, collection management, and exhibition design principles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "museology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "容器化技术使应用程序能够在不同计算环境之间无缝迁移和运行。",
      "sentence_pinyin": "Róngqì huà jìshù shǐ yìngyòng chéngxù nénggòu zài bùtóng jìsuàn huánjìng zhījiān wúfèng qiānyí hé yùnxíng.",
      "sentence_fr": "La technologie de conteneurisation permet aux applications de migrer et de fonctionner de manière transparente entre différents environnements de calcul.",
      "sentence_en": "Containerization technology enables applications to seamlessly migrate and run across different computing environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "containerization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "老龄化社会的到来对养老金制度和医疗保健系统提出了严峻挑战。",
      "sentence_pinyin": "Lǎolíng huà shèhuì de dàolái duì yǎnglǎo jīn zhìdù hé yīliáo bǎojiàn xìtǒng tíchū le yánjùn tiǎozhàn.",
      "sentence_fr": "L'avènement d'une société vieillissante pose de sérieux défis aux systèmes de retraite et de santé.",
      "sentence_en": "The arrival of an aging society poses serious challenges to pension systems and healthcare systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "aging_society",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "植物激素调控种子萌发、器官发育和应激响应等关键生理过程。",
      "sentence_pinyin": "Zhíwù jīsù tiáokòng zhǒngzǐ méngfā, qìguān fāyù hé yìngjī xiǎngyìng děng guānjiàn shēnglǐ guòchéng.",
      "sentence_fr": "Les hormones végétales régulent des processus physiologiques clés tels que la germination des graines, le développement des organes et les réponses au stress.",
      "sentence_en": "Plant hormones regulate key physiological processes such as seed germination, organ development, and stress responses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plant_hormones",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会影响债券将私人投资与公共服务成果挂钩，创新了社会问题的融资模式。",
      "sentence_pinyin": "Shèhuì yǐngxiǎng zhàiquàn jiāng sīrén tóuzī yǔ gōnggòng fúwù chéngguǒ guàgōu, chuàngxīn le shèhuì wèntí de róngzī móshì.",
      "sentence_fr": "Les obligations à impact social lient l'investissement privé aux résultats des services publics, innovant ainsi les modèles de financement des problèmes sociaux.",
      "sentence_en": "Social impact bonds link private investment to public service outcomes, innovating financing models for social issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_impact_bonds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "脑机接口技术为瘫痪患者恢复运动功能和语言能力带来了希望。",
      "sentence_pinyin": "Nǎojī jiēkǒu jìshù wèi tānhuàn huànzhě huīfù yùndòng gōngnéng hé yǔyán nénglì dàilái le xīwàng.",
      "sentence_fr": "La technologie d'interface cerveau-machine apporte de l'espoir aux patients paralysés pour la récupération des fonctions motrices et des capacités linguistiques.",
      "sentence_en": "Brain-computer interface technology brings hope for paralyzed patients to recover motor functions and language abilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "brain_computer_interface",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境伦理学探讨人类对自然界的道德责任和生态价值观念。",
      "sentence_pinyin": "Huánjìng lúnlǐ xué tàntǎo rénlèi duì zìrán jiè de dàodé zérèn hé shēngtài jiàzhí guānniàn.",
      "sentence_fr": "L'éthique environnementale explore la responsabilité morale de l'humanité envers la nature et les concepts de valeurs écologiques.",
      "sentence_en": "Environmental ethics explores humanity's moral responsibility toward nature and concepts of ecological values.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "预测性维护系统利用机器学习算法预测设备故障，减少意外停机时间。",
      "sentence_pinyin": "Yùcè xìng wéihù xìtǒng lìyòng jīqì xuéxí suànfǎ yùcè shèbèi gùzhàng, jiǎnshǎo yìwài tíngjī shíjiān.",
      "sentence_fr": "Les systèmes de maintenance prédictive utilisent des algorithmes d'apprentissage automatique pour prédire les pannes d'équipement et réduire les temps d'arrêt imprévus.",
      "sentence_en": "Predictive maintenance systems use machine learning algorithms to predict equipment failures and reduce unexpected downtime.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "predictive_maintenance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言习得关键期假说认为儿童学习语言的最佳时期是有时间限制的。",
      "sentence_pinyin": "Yǔyán xídé guānjiàn qī jiǎshuō rènwéi értóng xuéxí yǔyán de zuìjiā shíqī shì yǒu shíjiān xiànzhì de.",
      "sentence_fr": "L'hypothèse de la période critique d'acquisition du langage suggère que la période optimale pour l'apprentissage des langues chez les enfants est limitée dans le temps.",
      "sentence_en": "The critical period hypothesis for language acquisition suggests that children's optimal period for learning language is time-limited.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "critical_period_hypothesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "共享经济模式通过优化闲置资源的利用改变了传统的消费和所有权观念。",
      "sentence_pinyin": "Gòngxiǎng jīngjì móshì tōngguò yōuhuà xiánzhì zīyuán de lìyòng gǎibiàn le chuántǒng de xiāofèi hé suǒyǒu quán guānniàn.",
      "sentence_fr": "Le modèle de l'économie de partage modifie les notions traditionnelles de consommation et de propriété en optimisant l'utilisation des ressources inutilisées.",
      "sentence_en": "The sharing economy model changes traditional concepts of consumption and ownership by optimizing the use of idle resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sharing_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "湿地生态系统在碳储存、水质净化和洪水调节方面发挥着不可替代的作用。",
      "sentence_pinyin": "Shīdì shēngtài xìtǒng zài tàn chǔcún, shuǐzhì jìnghuà hé hóngshuǐ tiáojié fāngmiàn fāhuī zhe bùkě tìdài de zuòyòng.",
      "sentence_fr": "Les écosystèmes de zones humides jouent un rôle irremplaçable dans le stockage du carbone, la purification de l'eau et la régulation des inondations.",
      "sentence_en": "Wetland ecosystems play an irreplaceable role in carbon storage, water purification, and flood regulation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wetland_ecosystems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
