{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能农场利用物联网技术实现了温度、湿度和光照的自动化控制。",
      "sentence_pinyin": "Zhège zhìnéng nóngchǎng lìyòng wùliánwǎng jìshù shíxiànle wēndù, shīdù hé guāngzhào de zìdònghuà kòngzhì.",
      "sentence_fr": "Cette ferme intelligente utilise la technologie IoT pour réaliser le contrôle automatisé de la température, de l'humidité et de l'éclairage.",
      "sentence_en": "This smart farm uses IoT technology to achieve automated control of temperature, humidity, and lighting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_farming",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡的琴弓由马尾制成,演奏时能够发出哀婉动人的音色。",
      "sentence_pinyin": "Èrhú de qíngōng yóu mǎwěi zhìchéng, yǎnzòu shí nénggòu fāchū āiwǎn dòngrén de yīnsè.",
      "sentence_fr": "L'archet de l'erhu est fait de crins de cheval et produit un son mélancolique et émouvant lors de l'interprétation.",
      "sentence_en": "The bow of the erhu is made of horsehair and produces a melancholic and moving tone when played.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_music",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家初创公司专注于开发可生物降解的包装材料,减少塑料污染。",
      "sentence_pinyin": "Zhè jiā chūchuàng gōngsī zhuānzhù yú kāifā kě shēngwù jiàngjiě de bāozhuāng cáiliào, jiǎnshǎo sùliào wūrǎn.",
      "sentence_fr": "Cette startup se concentre sur le développement de matériaux d'emballage biodégradables pour réduire la pollution plastique.",
      "sentence_en": "This startup focuses on developing biodegradable packaging materials to reduce plastic pollution.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biodegradable_packaging",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "儿童福利院为孤儿和弃婴提供生活照料、教育和心理辅导。",
      "sentence_pinyin": "Értóng fúlìyuàn wèi gū'ér hé qìyīng tígōng shēnghuó zhàoliào, jiàoyù hé xīnlǐ fǔdǎo.",
      "sentence_fr": "L'orphelinat fournit soins quotidiens, éducation et soutien psychologique aux orphelins et aux enfants abandonnés.",
      "sentence_en": "The children's welfare home provides daily care, education, and psychological counseling for orphans and abandoned children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "orphanages",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "篆刻艺术将书法和雕刻完美结合,每一枚印章都凝聚了艺术家的心血。",
      "sentence_pinyin": "Zhuànkè yìshù jiāng shūfǎ hé diāokè wánměi jiéhé, měi yī méi yìnzhāng dōu níngjùle yìshùjiā de xīnxuè.",
      "sentence_fr": "L'art de la gravure de sceaux combine parfaitement calligraphie et sculpture, chaque sceau incarne le travail acharné de l'artiste.",
      "sentence_en": "The art of seal carving perfectly combines calligraphy and sculpture, with each seal embodying the artist's dedication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "seal_carving",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众筹平台帮助了数千个创意项目从构想变成现实。",
      "sentence_pinyin": "Zhège zhòngchóu píngtái bāngzhùle shù qiān gè chuàngyì xiàngmù cóng gòuxiǎng biànchéng xiànshí.",
      "sentence_fr": "Cette plateforme de financement participatif a aidé des milliers de projets créatifs à passer de l'idée à la réalité.",
      "sentence_en": "This crowdfunding platform has helped thousands of creative projects turn from ideas into reality.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crowdfunding",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水墨画讲究用墨的浓淡变化来表现物体的质感和空间层次。",
      "sentence_pinyin": "Shuǐmòhuà jiǎngjiù yòng mò de nóngdàn biànhuà lái biǎoxiàn wùtǐ de zhìgǎn hé kōngjiān céngcì.",
      "sentence_fr": "La peinture à l'encre de Chine met l'accent sur les variations de tonalité de l'encre pour exprimer la texture des objets et les niveaux spatiaux.",
      "sentence_en": "Ink wash painting emphasizes the use of ink shade variations to express the texture of objects and spatial layers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ink_painting",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能手环可以记录用户的步数、心率和睡眠质量,帮助改善健康状况。",
      "sentence_pinyin": "Zhìnéng shǒuhuán kěyǐ jìlù yònghù de bùshù, xīnlǜ hé shuìmián zhìliàng, bāngzhù gǎishàn jiànkāng zhuàngkuàng.",
      "sentence_fr": "Le bracelet intelligent peut enregistrer les pas, le rythme cardiaque et la qualité du sommeil de l'utilisateur pour aider à améliorer la santé.",
      "sentence_en": "Smart bracelets can record users' steps, heart rate, and sleep quality to help improve health conditions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness_trackers",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个公益项目为贫困山区的学校捐赠了大量图书和教学设备。",
      "sentence_pinyin": "Zhège gōngyì xiàngmù wèi pínkùn shānqū de xuéxiào juānzèngle dàliàng túshū hé jiàoxué shèbèi.",
      "sentence_fr": "Ce projet caritatif a fait don de nombreux livres et équipements pédagogiques aux écoles des régions montagneuses pauvres.",
      "sentence_en": "This charity project has donated a large number of books and teaching equipment to schools in poor mountainous areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "educational_charity",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙是一种簧管乐器,能够同时吹奏和声,在民乐合奏中起着重要作用。",
      "sentence_pinyin": "Shēng shì yī zhǒng huángguǎn yuèqì, nénggòu tóngshí chuīzòu héshēng, zài mínyuè hézòu zhōng qǐzhe zhòngyào zuòyòng.",
      "sentence_fr": "Le sheng est un instrument à anche qui peut jouer des harmonies simultanément et joue un rôle important dans les ensembles de musique traditionnelle.",
      "sentence_en": "The sheng is a reed instrument that can play harmonies simultaneously and plays an important role in traditional music ensembles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_music",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "云计算技术让企业无需购买昂贵的服务器就能获得强大的计算能力。",
      "sentence_pinyin": "Yún jìsuàn jìshù ràng qǐyè wúxū gòumǎi ángguì de fúwùqì jiù néng huòdé qiángdà de jìsuàn nénglì.",
      "sentence_fr": "La technologie de cloud computing permet aux entreprises d'obtenir une puissante capacité de calcul sans acheter de serveurs coûteux.",
      "sentence_en": "Cloud computing technology allows companies to obtain powerful computing capabilities without purchasing expensive servers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_computing",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个湿地公园既保护了珍稀水禽的栖息地,又为市民提供了休闲场所。",
      "sentence_pinyin": "Zhège shīdì gōngyuán jì bǎohùle zhēnxī shuǐqín de qīxīdì, yòu wèi shìmín tígōngle xiūxián chǎngsuǒ.",
      "sentence_fr": "Ce parc de zones humides protège à la fois l'habitat des oiseaux aquatiques rares et offre un lieu de loisirs aux citoyens.",
      "sentence_en": "This wetland park both protects the habitat of rare waterfowl and provides a leisure place for citizens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wetland_parks",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "青铜器铸造技术在商周时期达到了极高的艺术和技术水平。",
      "sentence_pinyin": "Qīngtóngqì zhùzào jìshù zài Shāng Zhōu shíqī dádàole jí gāo de yìshù hé jìshù shuǐpíng.",
      "sentence_fr": "La technique de coulée du bronze a atteint un niveau artistique et technique extrêmement élevé pendant les dynasties Shang et Zhou.",
      "sentence_en": "Bronze casting technology reached an extremely high artistic and technical level during the Shang and Zhou dynasties.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bronze_casting",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款语言学习应用采用了游戏化设计,让用户在娱乐中提升语言能力。",
      "sentence_pinyin": "Zhè kuǎn yǔyán xuéxí yìngyòng cǎiyòngle yóuxìhuà shèjì, ràng yònghù zài yúlè zhōng tíshēng yǔyán nénglì.",
      "sentence_fr": "Cette application d'apprentissage des langues adopte une conception ludique permettant aux utilisateurs d'améliorer leurs compétences linguistiques en s'amusant.",
      "sentence_en": "This language learning app adopts gamified design, allowing users to improve their language skills while having fun.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "language_apps",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区志愿者定期为独居老人送餐,并陪他们聊天解闷。",
      "sentence_pinyin": "Shèqū zhìyuànzhě dìngqī wèi dújū lǎorén sòngcān, bìng péi tāmen liáotiān jiěmèn.",
      "sentence_fr": "Les bénévoles communautaires livrent régulièrement des repas aux personnes âgées vivant seules et leur tiennent compagnie pour discuter.",
      "sentence_en": "Community volunteers regularly deliver meals to elderly people living alone and keep them company for conversation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_volunteers",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶演奏技法丰富多样,既能表现激昂的战斗场面,也能描绘细腻的情感。",
      "sentence_pinyin": "Pípá yǎnzòu jìfǎ fēngfù duōyàng, jì néng biǎoxiàn jī'áng de zhàndòu chǎngmiàn, yě néng miáohuì xìnì de qínggǎn.",
      "sentence_fr": "Les techniques de jeu du pipa sont riches et variées, pouvant à la fois exprimer des scènes de bataille passionnantes et dépeindre des émotions délicates.",
      "sentence_en": "The playing techniques of the pipa are rich and diverse, able to both express passionate battle scenes and depict delicate emotions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_music",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动驾驶技术的发展将彻底改变人们的出行方式和城市交通格局。",
      "sentence_pinyin": "Zìdòng jiàshǐ jìshù de fāzhǎn jiāng chèdǐ gǎibiàn rénmen de chūxíng fāngshì hé chéngshì jiāotōng géjú.",
      "sentence_fr": "Le développement de la technologie de conduite autonome transformera complètement les modes de déplacement des gens et la configuration du transport urbain.",
      "sentence_en": "The development of autonomous driving technology will completely transform people's transportation methods and urban traffic patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "autonomous_driving",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个非营利组织致力于保护濒危物种,已经成功拯救了多个物种免于灭绝。",
      "sentence_pinyin": "Zhège fēi yínglì zǔzhī zhìlì yú bǎohù bīnwēi wùzhǒng, yǐjīng chénggōng zhěngjiùle duō gè wùzhǒng miǎnyú mièjué.",
      "sentence_fr": "Cette organisation à but non lucratif se consacre à la protection des espèces menacées et a réussi à sauver plusieurs espèces de l'extinction.",
      "sentence_en": "This non-profit organization is dedicated to protecting endangered species and has successfully saved multiple species from extinction.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "conservation_organizations",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "泥塑艺术用普通的黏土创造出栩栩如生的人物和动物形象。",
      "sentence_pinyin": "Nísù yìshù yòng pǔtōng de niántǔ chuàngzào chū xǔxǔ rúshēng de rénwù hé dòngwù xíngxiàng.",
      "sentence_fr": "L'art de la sculpture en argile crée des personnages et des animaux remarquablement vivants avec de l'argile ordinaire.",
      "sentence_en": "Clay sculpture art creates remarkably lifelike human and animal figures using ordinary clay.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "clay_sculpture",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "在线问诊平台让患者足不出户就能咨询专业医生,获得初步诊断建议。",
      "sentence_pinyin": "Zàixiàn wènzhěn píngtái ràng huànzhě zú bù chū hù jiù néng zīxún zhuānyè yīshēng, huòdé chūbù zhěnduàn jiànyì.",
      "sentence_fr": "Les plateformes de consultation médicale en ligne permettent aux patients de consulter des médecins professionnels sans sortir de chez eux et d'obtenir des conseils de diagnostic préliminaires.",
      "sentence_en": "Online medical consultation platforms allow patients to consult professional doctors without leaving home and receive preliminary diagnostic advice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_medical_consultation",
      "created_at": "2025-11-20T20:30:00.000Z",
      "updated_at": "2025-11-20T20:30:00.000Z"
    }
  ]
}
