{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个农机租赁合作社为小农户提供了农业机械共享服务。",
      "sentence_pinyin": "Zhège nóngjī zūlìn hézuòshè wèi xiǎo nónghù tígōngle nóngyè jīxiè gòngxiǎng fúwù.",
      "sentence_fr": "Cette coopérative de location de machines agricoles fournit des services de partage de machines agricoles aux petits agriculteurs.",
      "sentence_en": "This agricultural machinery rental cooperative provides agricultural machinery sharing services to small farmers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_cooperatives",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在沪剧表演中展现了细腻柔美的江南韵味和地方特色。",
      "sentence_pinyin": "Tā zài hùjù biǎoyǎn zhōng zhǎnxiànle xìnì róuměi de Jiāngnán yùnwèi hé dìfāng tèsè.",
      "sentence_fr": "Dans sa performance d'opéra de Shanghai, elle a démontré le charme délicat et doux de Jiangnan et les caractéristiques locales.",
      "sentence_en": "In her Shanghai Opera performance, she demonstrated the delicate and soft Jiangnan charm and local characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shanghai_opera",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能燃气表实现了用气安全监测和远程管控功能。",
      "sentence_pinyin": "Zhège zhìnéng ránqì biǎo shíxiànle yòngqì ānquán jiāncè hé yuǎnchéng guǎnkòng gōngnéng.",
      "sentence_fr": "Ce compteur de gaz intelligent réalise la surveillance de la sécurité de l'utilisation du gaz et les fonctions de contrôle à distance.",
      "sentence_en": "This smart gas meter achieves gas usage safety monitoring and remote control functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_gas_meters",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在杂文写作中用犀利的笔锋针砭时弊并引发社会思考。",
      "sentence_pinyin": "Tā zài záwén xiězuò zhōng yòng xīlì de bǐfēng zhēnbiān shíbì bìng yǐnfā shèhuì sīkǎo.",
      "sentence_fr": "Dans l'écriture d'essais critiques, il utilise une plume acérée pour critiquer les maux contemporains et susciter la réflexion sociale.",
      "sentence_en": "In critical essay writing, he uses a sharp pen to criticize contemporary ills and provoke social reflection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "critical_essays",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个留守儿童关爱中心为农村儿童提供课后辅导和心理疏导。",
      "sentence_pinyin": "Zhège liúshǒu értóng guān'ài zhōngxīn wèi nóngcūn értóng tígōng kèhòu fǔdǎo hé xīnlǐ shūdǎo.",
      "sentence_fr": "Ce centre de soins pour enfants laissés pour compte fournit des cours de soutien après l'école et un soutien psychologique aux enfants ruraux.",
      "sentence_en": "This left-behind children care center provides after-school tutoring and psychological support to rural children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "child_welfare",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的品牌标识设计简洁有力，准确传达了企业的核心价值。",
      "sentence_pinyin": "Tā de pǐnpái biāozhì shèjì jiǎnjié yǒulì, zhǔnquè chuándále qǐyè de héxīn jiàzhí.",
      "sentence_fr": "Sa conception d'identité de marque est simple et puissante, transmettant avec précision les valeurs fondamentales de l'entreprise.",
      "sentence_en": "Her brand identity design is simple and powerful, accurately conveying the core values of the enterprise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "brand_identity",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个野生动植物保护区建立了完善的巡护和监测体系。",
      "sentence_pinyin": "Zhège yěshēng dòngzhíwù bǎohù qū jiànlìle wánshàn de xúnhù hé jiāncè tǐxì.",
      "sentence_fr": "Cette réserve de faune et de flore sauvages a établi un système complet de patrouille et de surveillance.",
      "sentence_en": "This wildlife reserve established a complete patrol and monitoring system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wildlife_reserves",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在软式网球比赛中展现了灵活的步伐和多变的战术。",
      "sentence_pinyin": "Tā zài ruǎnshì wǎngqiú bǐsài zhōng zhǎnxiànle línghuó de bùfá hé duōbiàn de zhànshù.",
      "sentence_fr": "Il a démontré des pas flexibles et des tactiques variées lors du match de soft tennis.",
      "sentence_en": "He demonstrated flexible footwork and varied tactics in the soft tennis match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "soft_tennis",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区矫正中心帮助服刑人员改造思想并重新回归社会。",
      "sentence_pinyin": "Zhège shèqū jiǎozhèng zhōngxīn bāngzhù fúxíng rényuán gǎizào sīxiǎng bìng chóngxīn huíguī shèhuì.",
      "sentence_fr": "Ce centre de correction communautaire aide les détenus à réformer leur pensée et à réintégrer la société.",
      "sentence_en": "This community correction center helps inmates reform their thinking and reintegrate into society.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "correctional_centers",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在藤编工艺中编织出了坚固耐用又美观大方的家居用品。",
      "sentence_pinyin": "Tā zài téngbiān gōngyì zhōng biānzhī chūle jiāngù nàiyòng yòu měiguān dàfāng de jiājū yòngpǐn.",
      "sentence_fr": "Dans l'artisanat de tressage de rotin, elle a tissé des articles ménagers solides, durables et esthétiquement agréables.",
      "sentence_en": "In rattan weaving craftsmanship, she wove household items that are sturdy, durable, and aesthetically pleasing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rattan_weaving",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能垃圾桶能够自动感应开盖并对垃圾进行分类识别。",
      "sentence_pinyin": "Zhège zhìnéng lājī tǒng nénggòu zìdòng gǎnyìng kāigài bìng duì lājī jìnxíng fēnlèi shíbié.",
      "sentence_fr": "Cette poubelle intelligente peut automatiquement détecter et ouvrir le couvercle et identifier le tri des déchets.",
      "sentence_en": "This smart trash bin can automatically sense and open the lid and identify waste sorting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_trash_bins",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在中阮演奏中展现了浑厚圆润的音色和深沉的韵味。",
      "sentence_pinyin": "Tā zài zhōngruǎn yǎnzòu zhōng zhǎnxiànle húnhòu yuánrùn de yīnsè hé shēnchén de yùnwèi.",
      "sentence_fr": "Il a démontré un timbre riche et rond et un charme profond dans son jeu de zhongruan.",
      "sentence_en": "He demonstrated a rich and round timbre and profound charm in his zhongruan performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhongruan_music",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个有害生物防治中心提供专业的虫害检测和治理服务。",
      "sentence_pinyin": "Zhège yǒuhài shēngwù fángzhì zhōngxīn tígōng zhuānyè de chónghài jiǎncè hé zhìlǐ fúwù.",
      "sentence_fr": "Ce centre de lutte contre les organismes nuisibles fournit des services professionnels de détection et de contrôle des parasites.",
      "sentence_en": "This pest control center provides professional pest detection and control services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pest_control",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的生态艺术作品探讨了人类与自然环境的共生关系。",
      "sentence_pinyin": "Tā de shēngtài yìshù zuòpǐn tàntǎole rénlèi yǔ zìrán huánjìng de gòngshēng guānxi.",
      "sentence_fr": "Ses œuvres d'art écologique explorent la relation symbiotique entre l'humanité et l'environnement naturel.",
      "sentence_en": "Her ecological art works explore the symbiotic relationship between humanity and the natural environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecological_art",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个冰雪灾害应急系统快速响应并组织道路除冰和救援工作。",
      "sentence_pinyin": "Zhège bīngxuě zāihài yìngjí xìtǒng kuàisù xiǎngyìng bìng zǔzhī dàolù chúbīng hé jiùyuán gōngzuò.",
      "sentence_fr": "Ce système d'urgence pour catastrophes de neige et de glace répond rapidement et organise le dégivrage des routes et le travail de sauvetage.",
      "sentence_en": "This ice and snow disaster emergency system responds quickly and organizes road de-icing and rescue work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "winter_emergency",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在音效设计工作中为影视作品创造了真实的声音环境。",
      "sentence_pinyin": "Tā zài yīnxiào shèjì gōngzuò zhōng wèi yǐngshì zuòpǐn chuàngzàole zhēnshí de shēngyīn huánjìng.",
      "sentence_fr": "Dans son travail de conception sonore, il crée des environnements sonores réalistes pour les œuvres audiovisuelles.",
      "sentence_en": "In his sound design work, he creates realistic sound environments for audiovisual works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sound_design",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个医养结合机构为老年人提供医疗和养老一体化服务。",
      "sentence_pinyin": "Zhège yīyǎng jiéhé jīgòu wèi lǎoniánrén tígōng yīliáo hé yǎnglǎo yītǐhuà fúwù.",
      "sentence_fr": "Cette institution combinant soins médicaux et soins aux personnes âgées fournit des services intégrés de santé et de soins aux personnes âgées.",
      "sentence_en": "This medical-care integrated institution provides integrated healthcare and elderly care services to senior citizens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "integrated_care",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在冰壶比赛中展现了精准的投壶和战术判断能力。",
      "sentence_pinyin": "Tā zài bīnghú bǐsài zhōng zhǎnxiànle jīngzhǔn de tóuhú hé zhànshù pànduàn nénglì.",
      "sentence_fr": "Elle a démontré une précision de lancer et une capacité de jugement tactique lors de la compétition de curling.",
      "sentence_en": "She demonstrated precise stone delivery and tactical judgment ability in the curling competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "curling",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创业培训项目教授学员商业模式设计和市场营销知识。",
      "sentence_pinyin": "Zhège chuàngyè péixùn xiàngmù jiàoshòu xuéyuán shāngyè móshì shèjì hé shìchǎng yíngxiāo zhīshi.",
      "sentence_fr": "Ce programme de formation à l'entrepreneuriat enseigne aux apprenants la conception de modèles commerciaux et les connaissances en marketing.",
      "sentence_en": "This entrepreneurship training program teaches trainees business model design and marketing knowledge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entrepreneurship_training",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在铜器铸造中运用了失蜡法等传统工艺技术。",
      "sentence_pinyin": "Tā zài tóngqì zhùzào zhōng yùnyòngle shīlàfǎ děng chuántǒng gōngyì jìshù.",
      "sentence_fr": "Dans la fonte du bronze, il a utilisé des techniques artisanales traditionnelles comme la cire perdue.",
      "sentence_en": "In bronze casting, he used traditional craft techniques such as the lost-wax method.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bronze_casting",
      "created_at": "2025-11-20T19:55:00.000Z",
      "updated_at": "2025-11-20T19:55:00.000Z"
    }
  ]
}
