{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能加湿器可以根据室内湿度自动调节出雾量,保持舒适环境。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng jiāshīqì kěyǐ gēnjù shìnèi shīdù zìdòng tiáojié chūwùliàng, bǎochí shūshì huánjìng.",
      "sentence_fr": "Cet humidificateur intelligent ajuste automatiquement le débit de vapeur selon l'humidité intérieure pour un environnement confortable.",
      "sentence_en": "This smart humidifier automatically adjusts mist output based on indoor humidity to maintain a comfortable environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_humidifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阿昌族的户撒刀锻造技艺精湛,是国家级非物质文化遗产项目。",
      "sentence_pinyin": "Āchāngzú de Hùsādāo duànzào jìyì jīngzhàn, shì guójiājí fēi wùzhì wénhuà yíchǎn xiàngmù.",
      "sentence_fr": "L'artisanat de forge des couteaux Husa des Achang est exquis et inscrit au patrimoine culturel immatériel national.",
      "sentence_en": "The Achang people's Husa knife forging craft is exquisite and a national intangible cultural heritage item.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "achang_husa_knives",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施了医疗保险异地结算政策,方便流动人口就医报销。",
      "sentence_pinyin": "Zhèngfǔ shíshī le yīliáo bǎoxiǎn yìdì jiésuàn zhèngcè, fāngbiàn liúdòng rénkǒu jiùyī bàoxiāo.",
      "sentence_fr": "Le gouvernement a mis en place une politique de règlement inter-régional de l'assurance maladie pour faciliter le remboursement médical des populations mobiles.",
      "sentence_en": "The government implemented cross-regional medical insurance settlement policy to facilitate medical reimbursement for mobile populations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cross_regional_healthcare",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "丢沙包是一种考验反应速度的游戏,两边的人向中间的人投掷沙包。",
      "sentence_pinyin": "Diū shābāo shì yī zhǒng kǎoyàn fǎnyìng sùdù de yóuxì, liǎng biān de rén xiàng zhōngjiān de rén tóuzhì shābāo.",
      "sentence_fr": "Le lancer de sacs de sable est un jeu testant la réactivité, où les joueurs des deux côtés lancent des sacs vers ceux du milieu.",
      "sentence_en": "Sandbag toss is a game testing reaction speed, where people on both sides throw sandbags at those in the middle.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sandbag_toss_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能烘干机可以根据衣物材质自动选择烘干程序和温度。",
      "sentence_pinyin": "Zhège zhìnéng hōnggānjī kěyǐ gēnjù yīwù cáizhì zìdòng xuǎnzé hōnggān chéngxù hé wēndù.",
      "sentence_fr": "Ce sèche-linge intelligent sélectionne automatiquement le programme et la température selon le tissu des vêtements.",
      "sentence_en": "This smart dryer automatically selects drying programs and temperatures based on fabric type.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dryers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基诺族的大鼓舞是他们最隆重的祭祀舞蹈,每年祭祀太阳鼓时表演。",
      "sentence_pinyin": "Jīnuòzú de dàgǔwǔ shì tāmen zuì lóngzhòng de jìsì wǔdǎo, měi nián jìsì tàiyánggǔ shí biǎoyǎn.",
      "sentence_fr": "La danse du grand tambour des Jino est leur danse rituelle la plus solennelle, exécutée lors du culte annuel du tambour du soleil.",
      "sentence_en": "The Jino people's big drum dance is their most solemn ritual dance, performed during the annual sun drum worship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jino_big_drum_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开设了四点半课堂,解决双职工家庭孩子放学后无人照看的问题。",
      "sentence_pinyin": "Shèqū kāishè le sì diǎn bàn kètáng, jiějué shuāng zhígōng jiātíng háizi fàngxué hòu wú rén zhàokàn de wèntí.",
      "sentence_fr": "La communauté a créé des classes de 16h30 pour résoudre le problème de garde des enfants après l'école pour les familles à double revenu.",
      "sentence_en": "The community established 4:30 PM classes to solve the after-school childcare problem for dual-income families.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "after_school_care",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能吹风机可以检测发质并自动调节温度,避免高温损伤头发。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuīfēngjī kěyǐ jiǎncè fàzhì bìng zìdòng tiáojié wēndù, bìmiǎn gāowēn sǔnshāng tóufà.",
      "sentence_fr": "Ce sèche-cheveux intelligent détecte la qualité des cheveux et ajuste automatiquement la température pour éviter les dommages.",
      "sentence_en": "This smart hair dryer detects hair quality and automatically adjusts temperature to avoid heat damage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_hair_dryers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "珞巴族的竹编工艺独特,竹篓和竹筐既实用又具有艺术价值。",
      "sentence_pinyin": "Luòbāzú de zhúbiān gōngyì dútè, zhúlǒu hé zhúkuāng jì shíyòng yòu jùyǒu yìshù jiàzhí.",
      "sentence_fr": "L'artisanat de vannerie en bambou des Lhoba est unique, les paniers en bambou étant à la fois pratiques et artistiques.",
      "sentence_en": "The Lhoba people's bamboo weaving craft is unique, with bamboo baskets being both practical and artistic.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lhoba_bamboo_weaving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跳皮筋是女孩子们最喜欢的课间游戏,可以锻炼身体协调性。",
      "sentence_pinyin": "Tiào píjīn shì nǚháizimen zuì xǐhuān de kèjiān yóuxì, kěyǐ duànliàn shēntǐ xiétiáoxìng.",
      "sentence_fr": "Sauter à l'élastique est le jeu préféré des filles pendant la récréation, permettant d'exercer la coordination corporelle.",
      "sentence_en": "Rubber band jumping is girls' favorite recess game, which can exercise body coordination.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rubber_band_jumping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市推行共享单车服务,有效解决了市民出行最后一公里的问题。",
      "sentence_pinyin": "Chéngshì tuīxíng gòngxiǎng dānchē fúwù, yǒuxiào jiějué le shìmín chūxíng zuìhòu yī gōnglǐ de wèntí.",
      "sentence_fr": "La ville a déployé des services de vélos en libre-service, résolvant efficacement le problème du dernier kilomètre pour les citoyens.",
      "sentence_en": "The city promotes bike-sharing services, effectively solving the last-mile problem for citizens' travel.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bike_sharing_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能血压计可以连接手机应用,长期记录和分析血压变化趋势。",
      "sentence_pinyin": "Zhège zhìnéng xuèyājì kěyǐ liánjiē shǒujī yìngyòng, chángqī jìlù hé fēnxī xuèyā biànhuà qūshì.",
      "sentence_fr": "Ce tensiomètre intelligent se connecte à une application mobile pour enregistrer et analyser les tendances de pression artérielle à long terme.",
      "sentence_en": "This smart blood pressure monitor connects to phone apps to record and analyze long-term blood pressure trends.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_blood_pressure_monitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "门巴族的木碗制作工艺精细,是西藏地区著名的手工艺品之一。",
      "sentence_pinyin": "Ménbāzú de mùwǎn zhìzuò gōngyì jīngxì, shì Xīzàng dìqū zhùmíng de shǒugōngyìpǐn zhī yī.",
      "sentence_fr": "L'artisanat des bols en bois des Monba est délicat, étant l'un des plus célèbres artisanats de la région du Tibet.",
      "sentence_en": "The Monba people's wooden bowl craftsmanship is delicate, being one of the famous handicrafts of the Tibet region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "monba_wooden_bowls",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区设置了宠物便便清理站,提供免费塑料袋和处理设施。",
      "sentence_pinyin": "Shèqū shèzhì le chǒngwù biànbiàn qīnglǐ zhàn, tígōng miǎnfèi sùliàodài hé chǔlǐ shèshī.",
      "sentence_fr": "La communauté a installé des stations de nettoyage pour les excréments d'animaux, fournissant des sacs plastiques gratuits et des installations de traitement.",
      "sentence_en": "The community has set up pet waste cleanup stations, providing free plastic bags and disposal facilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pet_waste_stations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电蒸锅有多层设计,可以同时蒸煮多种食物节省时间。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànzhēngguō yǒu duō céng shèjì, kěyǐ tóngshí zhēngzhǔ duō zhǒng shíwù jiéshěng shíjiān.",
      "sentence_fr": "Ce cuiseur vapeur intelligent à plusieurs niveaux permet de cuire simultanément différents aliments pour gagner du temps.",
      "sentence_en": "This smart electric steamer has a multi-tier design, allowing simultaneous steaming of multiple foods to save time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_electric_steamers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "木马是游乐场最经典的设施之一,承载了几代人的童年快乐记忆。",
      "sentence_pinyin": "Mùmǎ shì yóulèchǎng zuì jīngdiǎn de shèshī zhī yī, chéngzài le jǐ dài rén de tóngnián kuàilè jìyì.",
      "sentence_fr": "Le cheval de bois est l'une des installations les plus classiques des aires de jeux, portant les souvenirs joyeux d'enfance de plusieurs générations.",
      "sentence_en": "The rocking horse is one of the most classic playground facilities, carrying happy childhood memories of several generations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "playground_rocking_horse",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "裕固族的帐篷装饰图案精美,反映了他们游牧生活的传统审美。",
      "sentence_pinyin": "Yùgùzú de zhàngpéng zhuāngshì tú'àn jīngměi, fǎnyìng le tāmen yóumù shēnghuó de chuántǒng shěnměi.",
      "sentence_fr": "Les motifs décoratifs des tentes des Yugur sont exquis, reflétant l'esthétique traditionnelle de leur vie nomade.",
      "sentence_en": "The Yugur people's tent decorative patterns are exquisite, reflecting the traditional aesthetics of their nomadic life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yugur_tent_decorations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推动城市综合管廊建设,将各种管线集中布置于地下通道。",
      "sentence_pinyin": "Zhèngfǔ tuīdòng chéngshì zōnghé guǎnláng jiànshè, jiāng gèzhǒng guǎnxiàn jízhōng bùzhì yú dìxià tōngdào.",
      "sentence_fr": "Le gouvernement promeut la construction de galeries urbaines intégrées, regroupant diverses canalisations dans des tunnels souterrains.",
      "sentence_en": "The government promotes urban utility tunnel construction, centralizing various pipelines in underground passages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_utility_tunnels",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能咖啡机可以记住每个家庭成员的口味偏好,一键制作专属咖啡。",
      "sentence_pinyin": "Zhège zhìnéng kāfēijī kěyǐ jìzhù měi gè jiātíng chéngyuán de kǒuwèi piānhào, yī jiàn zhìzuò zhuānshǔ kāfēi.",
      "sentence_fr": "Cette machine à café intelligente mémorise les préférences de chaque membre de la famille et prépare un café personnalisé en une touche.",
      "sentence_en": "This smart coffee machine remembers each family member's taste preferences and makes personalized coffee with one touch.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_coffee_machines",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "保安族的腰刀制作传承百年,每把刀都是手工打造的精品。",
      "sentence_pinyin": "Bǎo'ānzú de yāodāo zhìzuò chuánchéng bǎi nián, měi bǎ dāo dōu shì shǒugōng dǎzào de jīngpǐn.",
      "sentence_fr": "La fabrication de couteaux de ceinture des Bonan est transmise depuis des siècles, chaque couteau étant un chef-d'œuvre artisanal.",
      "sentence_en": "The Bonan people's waist knife making has been passed down for centuries, with each knife being a handcrafted masterpiece.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bonan_waist_knives",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
