{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个机器人可以自动完成复杂的组装和检测工作。",
      "sentence_pinyin": "Zhège jīqìrén kěyǐ zìdòng wánchéng fùzá de zǔzhuāng hé jiǎncè gōngzuò.",
      "sentence_fr": "Ce robot peut automatiquement effectuer des travaux complexes d'assemblage et d'inspection.",
      "sentence_en": "This robot can automatically perform complex assembly and inspection work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "robotics",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的小说情节紧凑，人物形象生动鲜明。",
      "sentence_pinyin": "Tā de xiǎoshuō qíngjié jǐncòu, rénwù xíngxiàng shēngdòng xiānmíng.",
      "sentence_fr": "Son roman a une intrigue compacte et des personnages vivants et distincts.",
      "sentence_en": "Her novel has a compact plot and vivid, distinct characters.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市建立了完善的垃圾分类和回收处理系统。",
      "sentence_pinyin": "Zhège chéngshì jiànlìle wánshàn de lājī fēnlèi hé huíshōu chǔlǐ xìtǒng.",
      "sentence_fr": "Cette ville a établi un système complet de tri et de recyclage des déchets.",
      "sentence_en": "This city established a comprehensive waste sorting and recycling system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_management",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在退休后积极参与社区志愿服务，帮助邻里解决困难。",
      "sentence_pinyin": "Tā zài tuìxiū hòu jījí cānyù shèqū zhìyuàn fúwù, bāngzhù línlǐ jiějué kùnnan.",
      "sentence_fr": "Après sa retraite, il participe activement aux services bénévoles communautaires, aidant les voisins à résoudre leurs difficultés.",
      "sentence_en": "After retirement, he actively participates in community volunteer services, helping neighbors solve their difficulties.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_service",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐剧融合了流行音乐、舞蹈和戏剧表演元素。",
      "sentence_pinyin": "Zhège yīnyuèjù rónghéle liúxíng yīnyuè, wǔdǎo hé xìjù biǎoyǎn yuánsù.",
      "sentence_fr": "Cette comédie musicale fusionne des éléments de musique populaire, de danse et de performance théâtrale.",
      "sentence_en": "This musical integrates elements of popular music, dance, and theatrical performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "musicals",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她每周参加绘画班，不断提高自己的艺术创作水平。",
      "sentence_pinyin": "Tā měi zhōu cānjiā huìhuàbān, bùduàn tígāo zìjǐ de yìshù chuàngzuò shuǐpíng.",
      "sentence_fr": "Elle participe à des cours de peinture chaque semaine, améliorant constamment son niveau de création artistique.",
      "sentence_en": "She attends painting classes every week, constantly improving her artistic creation level.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art_classes",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个云计算平台为企业提供了灵活高效的数据存储解决方案。",
      "sentence_pinyin": "Zhège yún jìsuàn píngtái wèi qǐyè tígōngle línghuó gāoxiào de shùjù cúnchǔ jiějué fāng'àn.",
      "sentence_fr": "Cette plateforme de cloud computing offre aux entreprises des solutions de stockage de données flexibles et efficaces.",
      "sentence_en": "This cloud computing platform provides enterprises with flexible and efficient data storage solutions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_computing",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在工作中秉持诚信原则，赢得了客户的长期信任。",
      "sentence_pinyin": "Tā zài gōngzuò zhōng bǐngchí chéngxìn yuánzé, yíngdéle kèhù de chángqī xìnrèn.",
      "sentence_fr": "Il adhère au principe d'intégrité dans son travail, gagnant la confiance à long terme des clients.",
      "sentence_en": "He adheres to the principle of integrity in his work, winning long-term trust from clients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business_ethics",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海洋保护项目致力于恢复珊瑚礁生态系统。",
      "sentence_pinyin": "Zhège hǎiyáng bǎohù xiàngmù zhìlì yú huīfù shānhú jiāo shēngtài xìtǒng.",
      "sentence_fr": "Ce projet de protection marine s'engage à restaurer l'écosystème des récifs coralliens.",
      "sentence_en": "This marine protection project is committed to restoring coral reef ecosystems.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "marine_conservation",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的舞台表演充满激情和感染力，打动了现场每一位观众。",
      "sentence_pinyin": "Tā de wǔtái biǎoyǎn chōngmǎn jīqíng hé gǎnrǎnlì, dǎdòngle xiànchǎng měi yī wèi guānzhòng.",
      "sentence_fr": "Sa performance sur scène est pleine de passion et de pouvoir émotionnel, touchant chaque spectateur présent.",
      "sentence_en": "Her stage performance is full of passion and emotional power, moving every audience member present.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stage_performance",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创业孵化器为初创企业提供资金、场地和导师支持。",
      "sentence_pinyin": "Zhège chuàngyè fūhuàqì wèi chūchuàng qǐyè tígōng zījīn, chǎngdì hé dǎoshī zhīchí.",
      "sentence_fr": "Cet incubateur d'entreprises fournit aux startups des fonds, des locaux et un soutien de mentors.",
      "sentence_en": "This business incubator provides startups with funding, space, and mentor support.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startup_incubators",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的摄影技术精湛，能够捕捉到最美的光影瞬间。",
      "sentence_pinyin": "Tā de shèyǐng jìshù jīngzhàn, nénggòu bǔzhuō dào zuì měi de guāngyǐng shùnjiān.",
      "sentence_fr": "Sa technique photographique est excellente, capable de capturer les plus beaux moments de lumière et d'ombre.",
      "sentence_en": "His photography technique is excellent, able to capture the most beautiful moments of light and shadow.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "photography",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个线上课程平台采用直播和录播相结合的教学模式。",
      "sentence_pinyin": "Zhège xiànshàng kèchéng píngtái cǎiyòng zhíbō hé lùbō xiāng jiéhé de jiàoxué móshì.",
      "sentence_fr": "Cette plateforme de cours en ligne adopte un modèle d'enseignement combinant diffusion en direct et enregistrements.",
      "sentence_en": "This online course platform adopts a teaching model combining live streaming and recordings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_learning",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在社交媒体上分享健康饮食和运动心得，影响了许多人。",
      "sentence_pinyin": "Tā zài shèjiāo méitǐ shàng fēnxiǎng jiànkāng yǐnshí hé yùndòng xīndé, yǐngxiǎngle xǔduō rén.",
      "sentence_fr": "Elle partage des conseils sur une alimentation saine et l'exercice sur les réseaux sociaux, influençant de nombreuses personnes.",
      "sentence_en": "She shares healthy eating and exercise tips on social media, influencing many people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_media_influence",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农业科技项目利用无人机进行精准农业管理。",
      "sentence_pinyin": "Zhège nóngyè kējì xiàngmù lìyòng wúrénjī jìnxíng jīngzhǔn nóngyè guǎnlǐ.",
      "sentence_fr": "Ce projet de technologie agricole utilise des drones pour une gestion agricole de précision.",
      "sentence_en": "This agricultural technology project uses drones for precision agricultural management.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_technology",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在演讲中用真实的案例和数据支持自己的观点。",
      "sentence_pinyin": "Tā zài yǎnjiǎng zhōng yòng zhēnshí de ànlì hé shùjù zhīchí zìjǐ de guāndiǎn.",
      "sentence_fr": "Dans son discours, il soutient ses points de vue avec des cas réels et des données.",
      "sentence_en": "In his speech, he supports his viewpoints with real cases and data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_speaking",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个工业园区实现了生产过程的自动化和智能化。",
      "sentence_pinyin": "Zhège gōngyè yuánqū shíxiànle shēngchǎn guòchéng de zìdònghuà hé zhìnénghuà.",
      "sentence_fr": "Ce parc industriel a réalisé l'automatisation et l'intelligence du processus de production.",
      "sentence_en": "This industrial park achieved automation and intelligence of the production process.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "industrial_automation",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的教育理念强调培养学生的批判性思维和创新能力。",
      "sentence_pinyin": "Tā de jiàoyù lǐniàn qiángdiào péiyǎng xuésheng de pīpànxìng sīwéi hé chuàngxīn nénglì.",
      "sentence_fr": "Sa philosophie éducative met l'accent sur le développement de la pensée critique et des capacités d'innovation des étudiants.",
      "sentence_en": "Her educational philosophy emphasizes developing students' critical thinking and innovation abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "educational_philosophy",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个咖啡品牌坚持公平贸易原则，直接从农户采购咖啡豆。",
      "sentence_pinyin": "Zhège kāfēi pǐnpái jiānchí gōngpíng màoyì yuánzé, zhíjiē cóng nónghù cǎigòu kāfēi dòu.",
      "sentence_fr": "Cette marque de café adhère aux principes du commerce équitable, achetant directement les grains de café auprès des agriculteurs.",
      "sentence_en": "This coffee brand adheres to fair trade principles, purchasing coffee beans directly from farmers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fair_trade",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在企业管理中注重建立良好的企业文化和团队氛围。",
      "sentence_pinyin": "Tā zài qǐyè guǎnlǐ zhōng zhùzhòng jiànlì liánghǎo de qǐyè wénhuà hé tuánduì fēnwéi.",
      "sentence_fr": "Dans la gestion d'entreprise, il met l'accent sur l'établissement d'une bonne culture d'entreprise et d'une atmosphère d'équipe.",
      "sentence_en": "In business management, he emphasizes establishing a good corporate culture and team atmosphere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "corporate_culture",
      "created_at": "2025-11-20T17:40:00.000Z",
      "updated_at": "2025-11-20T17:40:00.000Z"
    }
  ]
}
