{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "社会学习理论认为人们通过观察和模仿他人的行为来学习新技能。",
      "sentence_pinyin": "Shèhuì xuéxí lǐlùn rènwéi rénmen tōngguò guānchá hé mófǎng tārén de xíngwéi lái xuéxí xīn jìnéng.",
      "sentence_fr": "La théorie de l'apprentissage social suggère que les gens apprennent de nouvelles compétences en observant et en imitant le comportement des autres.",
      "sentence_en": "Social learning theory suggests that people learn new skills by observing and imitating others' behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_learning_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳米机器人研究致力于开发可以在人体内执行医疗任务的微型机器。",
      "sentence_pinyin": "Nàmǐ jīqìrén yánjiū zhìlì yú kāifā kěyǐ zài réntǐ nèi zhíxíng yīliáo rènwù de wēixíng jīqì.",
      "sentence_fr": "La recherche sur les nanorobots s'efforce de développer des machines miniatures capables d'effectuer des tâches médicales à l'intérieur du corps humain.",
      "sentence_en": "Nanorobotics research strives to develop tiny machines that can perform medical tasks inside the human body.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nanorobotics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代际公平原则要求当代人在使用资源时考虑到未来世代的需求。",
      "sentence_pinyin": "Dàijì gōngpíng yuánzé yāoqiú dāngdài rén zài shǐyòng zīyuán shí kǎolǜ dào wèilái shìdài de xūqiú.",
      "sentence_fr": "Le principe d'équité intergénérationnelle exige que la génération actuelle tienne compte des besoins des générations futures lors de l'utilisation des ressources.",
      "sentence_en": "The intergenerational equity principle requires the current generation to consider future generations' needs when using resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intergenerational_equity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分子影像技术允许在活体内可视化和追踪生物分子活动。",
      "sentence_pinyin": "Fēnzǐ yǐngxiàng jìshù yǔnxǔ zài huótǐ nèi kěshì huà hé zhuīzōng shēngwù fēnzǐ huódòng.",
      "sentence_fr": "La technologie d'imagerie moléculaire permet de visualiser et de suivre l'activité des biomolécules in vivo.",
      "sentence_en": "Molecular imaging technology allows visualization and tracking of biomolecular activity in living organisms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "molecular_imaging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识转化研究探讨如何将科研成果有效转化为实际应用和政策。",
      "sentence_pinyin": "Zhīshi zhuǎnhuà yánjiū tàntǎo rúhé jiāng kēyán chéngguǒ yǒuxiào zhuǎnhuà wéi shíjì yìngyòng hé zhèngcè.",
      "sentence_fr": "La recherche sur le transfert des connaissances explore comment transformer efficacement les résultats de la recherche scientifique en applications pratiques et en politiques.",
      "sentence_en": "Knowledge translation research explores how to effectively transform research findings into practical applications and policies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "knowledge_translation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "等离子体物理学研究是开发核聚变能源的基础科学支撑。",
      "sentence_pinyin": "Děnglízǐtǐ wùlǐ xué yánjiū shì kāifā hé jùbiàn néngyuán de jīchǔ kēxué zhīchēng.",
      "sentence_fr": "La recherche en physique des plasmas est le fondement scientifique du développement de l'énergie de fusion nucléaire.",
      "sentence_en": "Plasma physics research is the foundational science supporting nuclear fusion energy development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plasma_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "符号互动论分析人们如何通过日常交流创造和解释社会意义。",
      "sentence_pinyin": "Fúhào hùdòng lùn fēnxī rénmen rúhé tōngguò rìcháng jiāoliú chuàngzào hé jiěshì shèhuì yìyì.",
      "sentence_fr": "L'interactionnisme symbolique analyse comment les gens créent et interprètent le sens social à travers la communication quotidienne.",
      "sentence_en": "Symbolic interactionism analyzes how people create and interpret social meaning through everyday communication.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "symbolic_interactionism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物传感器技术将生物识别元件与电子信号转换系统结合起来。",
      "sentence_pinyin": "Shēngwù chuángǎnqì jìshù jiāng shēngwù shìbié yuánjiàn yǔ diànzǐ xìnhào zhuǎnhuàn xìtǒng jiéhé qǐlái.",
      "sentence_fr": "La technologie des biocapteurs combine des éléments de reconnaissance biologique avec des systèmes de conversion de signaux électroniques.",
      "sentence_en": "Biosensor technology combines biological recognition elements with electronic signal conversion systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biosensors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳中和承诺推动各国制定更加雄心勃勃的气候行动计划。",
      "sentence_pinyin": "Tàn zhōnghé chéngnuò tuīdòng gè guó zhìdìng gèngjiā xióngxīn bóbó de qìhòu xíngdòng jìhuà.",
      "sentence_fr": "Les engagements de neutralité carbone poussent les pays à élaborer des plans d'action climatique plus ambitieux.",
      "sentence_en": "Carbon neutrality commitments are pushing countries to develop more ambitious climate action plans.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_neutrality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "触觉反馈技术增强了虚拟现实和远程操作系统的沉浸感和精确度。",
      "sentence_pinyin": "Chùjué fǎnkuì jìshù zēngqiáng le xūnǐ xiànshí hé yuǎnchéng cāozuò xìtǒng de chénjìn gǎn hé jīngquè dù.",
      "sentence_fr": "La technologie de retour haptique améliore l'immersion et la précision des systèmes de réalité virtuelle et de téléopération.",
      "sentence_en": "Haptic feedback technology enhances immersion and precision in virtual reality and remote operation systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "haptic_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "劳动经济学研究工资决定、就业模式和劳动力市场政策的效果。",
      "sentence_pinyin": "Láodòng jīngjì xué yánjiū gōngzī juédìng, jiùyè móshì hé láodòng lì shìchǎng zhèngcè de xiàoguǒ.",
      "sentence_fr": "L'économie du travail étudie la détermination des salaires, les modèles d'emploi et l'efficacité des politiques du marché du travail.",
      "sentence_en": "Labor economics studies wage determination, employment patterns, and labor market policy effects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "labor_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极端微生物研究揭示了生命在极端环境下生存的非凡适应机制。",
      "sentence_pinyin": "Jíduān wéishēngwù yánjiū jiēshì le shēngmìng zài jíduān huánjìng xià shēngcún de fēifán shìyìng jīzhì.",
      "sentence_fr": "La recherche sur les micro-organismes extrêmophiles révèle les mécanismes d'adaptation extraordinaires de la vie dans des environnements extrêmes.",
      "sentence_en": "Extremophile research reveals life's extraordinary adaptation mechanisms for survival in extreme environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "extremophiles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络舆情分析帮助政府和企业了解公众情绪和社会趋势。",
      "sentence_pinyin": "Wǎngluò yúqíng fēnxī bāngzhù zhèngfǔ hé qǐyè liǎojiě gōngzhòng qíngxù hé shèhuì qūshì.",
      "sentence_fr": "L'analyse de l'opinion publique en ligne aide les gouvernements et les entreprises à comprendre le sentiment du public et les tendances sociales.",
      "sentence_en": "Online public opinion analysis helps governments and businesses understand public sentiment and social trends.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "online_sentiment_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "晶体管尺寸持续缩小正在接近物理极限，推动新型计算架构的探索。",
      "sentence_pinyin": "Jīngtǐguǎn chǐcùn chíxù suōxiǎo zhèngzài jiējìn wùlǐ jíxiàn, tuīdòng xīnxíng jìsuàn jiàgòu de tànsuǒ.",
      "sentence_fr": "La réduction continue de la taille des transistors approche des limites physiques, stimulant l'exploration de nouvelles architectures de calcul.",
      "sentence_en": "Continuous transistor size reduction is approaching physical limits, driving exploration of new computing architectures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transistor_scaling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医疗人类学研究不同文化中健康、疾病和治疗的概念和实践。",
      "sentence_pinyin": "Yīliáo rénlèi xué yánjiū bùtóng wénhuà zhōng jiànkāng, jíbìng hé zhìliáo de gàiniàn hé shíjiàn.",
      "sentence_fr": "L'anthropologie médicale étudie les concepts et les pratiques de santé, de maladie et de guérison dans différentes cultures.",
      "sentence_en": "Medical anthropology studies concepts and practices of health, illness, and healing in different cultures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "medical_anthropology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全开发生命周期将安全考虑整合到软件开发的每个阶段。",
      "sentence_pinyin": "Ānquán kāifā shēngmìng zhōuqī jiāng ānquán kǎolǜ zhěnghé dào ruǎnjiàn kāifā de měi gè jiēduàn.",
      "sentence_fr": "Le cycle de vie du développement sécurisé intègre les considérations de sécurité à chaque étape du développement logiciel.",
      "sentence_en": "Secure development lifecycle integrates security considerations into every stage of software development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "secure_development_lifecycle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "外来物种入侵对本土生态系统和生物多样性构成严重威胁。",
      "sentence_pinyin": "Wàilái wùzhǒng rùqīn duì běntǔ shēngtài xìtǒng hé shēngwù duōyàng xìng gòuchéng yánzhòng wēixié.",
      "sentence_fr": "L'invasion d'espèces exotiques constitue une menace sérieuse pour les écosystèmes indigènes et la biodiversité.",
      "sentence_en": "Invasive species pose serious threats to native ecosystems and biodiversity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "invasive_species",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "服务设计方法论帮助组织创建以用户为中心的无缝服务体验。",
      "sentence_pinyin": "Fúwù shèjì fāngfǎ lùn bāngzhù zǔzhī chuàngjiàn yǐ yònghù wéi zhōngxīn de wúfèng fúwù tǐyàn.",
      "sentence_fr": "La méthodologie de conception de services aide les organisations à créer des expériences de service fluides centrées sur l'utilisateur.",
      "sentence_en": "Service design methodology helps organizations create user-centered seamless service experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "service_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "药物基因组学根据个体基因特征优化药物选择和剂量。",
      "sentence_pinyin": "Yàowù jīyīn zǔ xué gēnjù gètǐ jīyīn tèzhēng yōuhuà yàowù xuǎnzé hé jìliàng.",
      "sentence_fr": "La pharmacogénomique optimise le choix des médicaments et les dosages en fonction des caractéristiques génétiques individuelles.",
      "sentence_en": "Pharmacogenomics optimizes drug selection and dosing based on individual genetic characteristics.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pharmacogenomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于场景的设计方法通过构想用户使用情境来指导产品开发决策。",
      "sentence_pinyin": "Jīyú chǎngjǐng de shèjì fāngfǎ tōngguò gòuxiǎng yònghù shǐyòng qíngjìng lái zhǐdǎo chǎnpǐn kāifā juécè.",
      "sentence_fr": "La méthode de conception basée sur les scénarios guide les décisions de développement de produits en imaginant les contextes d'utilisation.",
      "sentence_en": "Scenario-based design methods guide product development decisions by envisioning user usage contexts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "scenario_based_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
