{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "弦理论假设基本粒子是振动的一维弦而非点状物体。",
      "sentence_pinyin": "Xián lǐlùn jiǎshè jīběn lìzǐ shì zhèndòng de yī wéi xián ér fēi diǎnzhuàng wùtǐ.",
      "sentence_fr": "La théorie des cordes suppose que les particules fondamentales sont des cordes unidimensionnelles vibrantes plutôt que des objets ponctuels.",
      "sentence_en": "String theory hypothesizes that fundamental particles are vibrating one-dimensional strings rather than point-like objects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "string_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "风险投资基金专注于高成长潜力的早期创业公司。",
      "sentence_pinyin": "Fēngxiǎn tóuzī jījīn zhuānzhù yú gāo chéngzhǎng qiánlì de zǎoqī chuàngyè gōngsī.",
      "sentence_fr": "Les fonds de capital-risque se concentrent sur les startups en phase de démarrage à fort potentiel de croissance.",
      "sentence_en": "Venture capital funds focus on early-stage startups with high growth potential.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "venture_capital",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "渗透测试模拟恶意攻击以识别系统中的安全漏洞。",
      "sentence_pinyin": "Shèntòu cèshì mónǐ èyì gōngjī yǐ shìbié xìtǒng zhōng de ānquán lòudòng.",
      "sentence_fr": "Les tests de pénétration simulent des attaques malveillantes pour identifier les vulnérabilités de sécurité dans les systèmes.",
      "sentence_en": "Penetration testing simulates malicious attacks to identify security vulnerabilities in systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "penetration_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "解构主义挑战文本中二元对立的固有等级结构。",
      "sentence_pinyin": "Jiěgòu zhǔyì tiǎozhàn wénběn zhōng èryuán duìlì de gùyǒu děngjí jiégòu.",
      "sentence_fr": "Le déconstructionnisme remet en question la hiérarchie inhérente des oppositions binaires dans les textes.",
      "sentence_en": "Deconstructionism challenges the inherent hierarchical structure of binary oppositions in texts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deconstructionism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然语言处理技术使计算机能够理解和生成人类语言。",
      "sentence_pinyin": "Zìrán yǔyán chǔlǐ jìshù shǐ jìsuànjī nénggòu lǐjiě hé shēngchéng rénlèi yǔyán.",
      "sentence_fr": "Les technologies de traitement du langage naturel permettent aux ordinateurs de comprendre et de générer le langage humain.",
      "sentence_en": "Natural language processing technologies enable computers to understand and generate human language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "natural_language_processing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子场论统一了量子力学与狭义相对论的基本框架。",
      "sentence_pinyin": "Liàngzǐ chǎnglùn tǒngyī le liàngzǐ lìxué yǔ xiáyì xiāngduìlùn de jīběn kuàngjià.",
      "sentence_fr": "La théorie quantique des champs unifie les cadres fondamentaux de la mécanique quantique et de la relativité restreinte.",
      "sentence_en": "Quantum field theory unifies the fundamental frameworks of quantum mechanics and special relativity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_field_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资产配置策略根据投资者的风险偏好分散投资组合。",
      "sentence_pinyin": "Zīchǎn pèizhì cèlüè gēnjù tóuzīzhě de fēngxiǎn piānhào fēnsàn tóuzī zǔhé.",
      "sentence_fr": "Les stratégies d'allocation d'actifs diversifient les portefeuilles en fonction de l'appétit pour le risque des investisseurs.",
      "sentence_en": "Asset allocation strategies diversify portfolios according to investors' risk appetites.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "asset_allocation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全信息和事件管理系统聚合分析来自多个来源的日志数据。",
      "sentence_pinyin": "Ānquán xìnxī hé shìjiàn guǎnlǐ xìtǒng jùhé fēnxī láizì duō gè láiyuán de rìzhì shùjù.",
      "sentence_fr": "Les systèmes de gestion des informations et des événements de sécurité agrègent et analysent les données de journal provenant de multiples sources.",
      "sentence_en": "Security information and event management systems aggregate and analyze log data from multiple sources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "siem_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "批判理论分析社会权力结构和意识形态对个体的影响。",
      "sentence_pinyin": "Pīpàn lǐlùn fēnxī shèhuì quánlì jiégòu hé yìshí xíngtài duì gètǐ de yǐngxiǎng.",
      "sentence_fr": "La théorie critique analyse les structures de pouvoir social et l'influence de l'idéologie sur les individus.",
      "sentence_en": "Critical theory analyzes social power structures and the influence of ideology on individuals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "critical_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "强化学习算法通过奖励信号指导智能体的决策行为。",
      "sentence_pinyin": "Qiánghuà xuéxí suànfǎ tōngguò jiǎnglì xìnhào zhǐdǎo zhìnéngtǐ de juécè xíngwéi.",
      "sentence_fr": "Les algorithmes d'apprentissage par renforcement guident le comportement décisionnel des agents par des signaux de récompense.",
      "sentence_en": "Reinforcement learning algorithms guide agent decision-making behavior through reward signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reinforcement_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "广义相对论将引力描述为时空弯曲的几何效应。",
      "sentence_pinyin": "Guǎngyì xiāngduìlùn jiāng yǐnlì miáoshù wéi shíkōng wānqū de jǐhé xiàoyìng.",
      "sentence_fr": "La relativité générale décrit la gravité comme un effet géométrique de la courbure de l'espace-temps.",
      "sentence_en": "General relativity describes gravity as a geometric effect of space-time curvature.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "general_relativity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "衍生品定价模型量化期权和期货合约的公允价值。",
      "sentence_pinyin": "Yǎnshēngpǐn dìngjià móxíng liànghuà qīquán hé qīhuò héyuē de gōngyǔn jiàzhí.",
      "sentence_fr": "Les modèles d'évaluation des dérivés quantifient la juste valeur des options et des contrats à terme.",
      "sentence_en": "Derivatives pricing models quantify the fair value of options and futures contracts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "derivatives_pricing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "端点检测与响应解决方案实时监控终端设备的可疑活动。",
      "sentence_pinyin": "Duāndiǎn jiǎncè yǔ xiǎngyìng jiějué fāng'àn shíshí jiānkòng zhōngduān shèbèi de kěyí huódòng.",
      "sentence_fr": "Les solutions de détection et réponse aux terminaux surveillent en temps réel les activités suspectes sur les appareils.",
      "sentence_en": "Endpoint detection and response solutions monitor suspicious activities on terminal devices in real time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "endpoint_detection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "实用主义哲学以行动效果和实际后果来评判思想价值。",
      "sentence_pinyin": "Shíyòng zhǔyì zhéxué yǐ xíngdòng xiàoguǒ hé shíjì hòuguǒ lái píngjià sīxiǎng jiàzhí.",
      "sentence_fr": "La philosophie pragmatiste évalue la valeur des idées par leurs effets pratiques et leurs conséquences réelles.",
      "sentence_en": "Pragmatist philosophy evaluates the value of ideas by their practical effects and actual consequences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pragmatist_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "迁移学习允许将预训练模型的知识应用于新任务。",
      "sentence_pinyin": "Qiānyí xuéxí yǔnxǔ jiāng yù xùnliàn móxíng de zhīshì yìngyòng yú xīn rènwù.",
      "sentence_fr": "L'apprentissage par transfert permet d'appliquer les connaissances des modèles pré-entraînés à de nouvelles tâches.",
      "sentence_en": "Transfer learning allows applying knowledge from pre-trained models to new tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transfer_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "希格斯玻色子的发现证实了粒子获得质量的机制。",
      "sentence_pinyin": "Xīgésī bōsèzǐ de fāxiàn zhèngshí le lìzǐ huòdé zhìliàng de jīzhì.",
      "sentence_fr": "La découverte du boson de Higgs a confirmé le mécanisme par lequel les particules acquièrent leur masse.",
      "sentence_en": "The discovery of the Higgs boson confirmed the mechanism by which particles acquire mass.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "higgs_boson",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量化宽松政策通过央行购买资产向经济注入流动性。",
      "sentence_pinyin": "Liànghuà kuānsōng zhèngcè tōngguò yāngháng gòumǎi zīchǎn xiàng jīngjì zhùrù liúdòngxìng.",
      "sentence_fr": "La politique d'assouplissement quantitatif injecte des liquidités dans l'économie par l'achat d'actifs par la banque centrale.",
      "sentence_en": "Quantitative easing policy injects liquidity into the economy through central bank asset purchases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantitative_easing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "威胁情报共享平台促进安全社区之间的信息交流。",
      "sentence_pinyin": "Wēixié qíngbào gòngxiǎng píngtái cùjìn ānquán shèqū zhījiān de xìnxī jiāoliú.",
      "sentence_fr": "Les plateformes de partage de renseignements sur les menaces facilitent l'échange d'informations entre les communautés de sécurité.",
      "sentence_en": "Threat intelligence sharing platforms facilitate information exchange between security communities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "threat_intelligence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功利主义伦理学以行为产生的最大幸福来衡量道德性。",
      "sentence_pinyin": "Gōnglì zhǔyì lúnlǐxué yǐ xíngwéi chǎnshēng de zuìdà xìngfú lái héngliáng dàodéxìng.",
      "sentence_fr": "L'éthique utilitariste mesure la moralité par le plus grand bonheur produit par les actions.",
      "sentence_en": "Utilitarian ethics measures morality by the greatest happiness produced by actions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "utilitarian_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "注意力机制使神经网络能够聚焦于输入序列的相关部分。",
      "sentence_pinyin": "Zhùyìlì jīzhì shǐ shénjīng wǎngluò nénggòu jùjiāo yú shūrù xùliè de xiāngguān bùfèn.",
      "sentence_fr": "Les mécanismes d'attention permettent aux réseaux neuronaux de se concentrer sur les parties pertinentes de la séquence d'entrée.",
      "sentence_en": "Attention mechanisms enable neural networks to focus on relevant parts of the input sequence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "attention_mechanisms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
