{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能安防系统可以实时监控家中情况,发现异常立即报警。",
      "sentence_pinyin": "Zhège zhìnéng ānfáng xìtǒng kěyǐ shíshí jiānkòng jiā zhōng qíngkuàng, fāxiàn yìcháng lìjí bàojǐng.",
      "sentence_fr": "Ce système de sécurité intelligent peut surveiller la maison en temps réel et déclencher immédiatement une alarme en cas d'anomalie.",
      "sentence_en": "This smart security system can monitor home conditions in real-time and immediately alert when detecting anomalies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_security_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "傩戏是中国最古老的戏剧形式之一,带有浓厚的祭祀色彩。",
      "sentence_pinyin": "Nuóxì shì Zhōngguó zuì gǔlǎo de xìjù xíngshì zhī yī, dàiyǒu nónghòu de jìsì sècǎi.",
      "sentence_fr": "L'opéra Nuo est l'une des formes théâtrales les plus anciennes de Chine, avec une forte coloration rituelle.",
      "sentence_en": "Nuo opera is one of China's oldest theatrical forms, with strong ritual coloring.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nuo_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的河道治理工程使曾经污染严重的河流恢复了清澈。",
      "sentence_pinyin": "Chéngshì de hédào zhìlǐ gōngchéng shǐ céngjīng wūrǎn yánzhòng de héliú huīfù le qīngchè.",
      "sentence_fr": "Le projet de gestion des cours d'eau urbains a restauré la clarté des rivières autrefois gravement polluées.",
      "sentence_en": "The city's river management project has restored clarity to rivers that were once heavily polluted.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "river_restoration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能早教机可以根据孩子的年龄推荐适合的学习内容和游戏。",
      "sentence_pinyin": "Zhìnéng zǎojiàojī kěyǐ gēnjù háizi de niánlíng tuījiàn shìhé de xuéxí nèiróng hé yóuxì.",
      "sentence_fr": "La tablette éducative intelligente peut recommander du contenu d'apprentissage et des jeux adaptés à l'âge de l'enfant.",
      "sentence_en": "The smart early education device can recommend learning content and games suitable for the child's age.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_education_toys",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的墨制作以徽墨最为著名,黑如漆,光如镜。",
      "sentence_pinyin": "Zhōngguó chuántǒng de mò zhìzuò yǐ Huīmò zuìwéi zhùmíng, hēi rú qī, guāng rú jìng.",
      "sentence_fr": "La fabrication traditionnelle chinoise d'encre est la plus célèbre pour l'encre Hui, noire comme la laque et brillante comme un miroir.",
      "sentence_en": "Traditional Chinese ink making is most famous for Hui ink, black as lacquer and shiny as a mirror.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ink_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能翻译机可以实时翻译多种语言,方便出国旅行时交流。",
      "sentence_pinyin": "Zhìnéng fānyìjī kěyǐ shíshí fānyì duō zhǒng yǔyán, fāngbiàn chūguó lǚxíng shí jiāoliú.",
      "sentence_fr": "Le traducteur intelligent peut traduire plusieurs langues en temps réel, facilitant la communication lors de voyages à l'étranger.",
      "sentence_en": "The smart translator can translate multiple languages in real-time, facilitating communication during overseas travel.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_translators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "歌仔戏是台湾和福建的地方戏曲,唱腔优美,表演生动活泼。",
      "sentence_pinyin": "Gēzǎixì shì Táiwān hé Fújiàn de dìfāng xìqǔ, chàngqiāng yōuměi, biǎoyǎn shēngdòng huópō.",
      "sentence_fr": "L'opéra Gezai est un opéra régional de Taiwan et du Fujian, avec un chant gracieux et des performances vivantes.",
      "sentence_en": "Gezai opera is a regional opera of Taiwan and Fujian, with beautiful singing and lively performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gezai_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的职业技能培训项目帮助失业人员掌握新技能重新就业。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de zhíyè jìnéng péixùn xiàngmù bāngzhù shīyè rényuán zhǎngwò xīn jìnéng chóngxīn jiùyè.",
      "sentence_fr": "Le programme de formation professionnelle lancé par le gouvernement aide les chômeurs à acquérir de nouvelles compétences pour retrouver un emploi.",
      "sentence_en": "The government's vocational training program helps unemployed people master new skills to re-enter the workforce.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vocational_training",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电炖锅可以长时间慢炖食物,保留食材的营养和鲜味。",
      "sentence_pinyin": "Zhìnéng diàn dùnguō kěyǐ cháng shíjiān màn dùn shíwù, bǎoliú shícái de yíngyǎng hé xiānwèi.",
      "sentence_fr": "Le mijoteur électrique intelligent peut cuire lentement les aliments pendant longtemps, préservant les nutriments et la saveur des ingrédients.",
      "sentence_en": "The smart electric slow cooker can simmer food for a long time, preserving the nutrition and flavor of ingredients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_slow_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的油纸伞以杭州和四川的最为著名,工艺精美。",
      "sentence_pinyin": "Zhōngguó chuántǒng de yóuzhǐsǎn yǐ Hángzhōu hé Sìchuān de zuìwéi zhùmíng, gōngyì jīngměi.",
      "sentence_fr": "Les parapluies en papier huilé traditionnels chinois sont les plus célèbres pour ceux de Hangzhou et du Sichuan, avec un artisanat exquis.",
      "sentence_en": "Traditional Chinese oil-paper umbrellas are most famous for those from Hangzhou and Sichuan, with exquisite craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "oil_paper_umbrellas",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能衣物护理机可以对衣服进行蒸汽熨烫、杀菌和除味处理。",
      "sentence_pinyin": "Zhìnéng yīwù hùlǐjī kěyǐ duì yīfú jìnxíng zhēngqì yùntàng, shājūn hé chúwèi chǔlǐ.",
      "sentence_fr": "La machine de soin des vêtements intelligente peut repasser à la vapeur, stériliser et désodoriser les vêtements.",
      "sentence_en": "The smart garment care machine can steam iron, sterilize, and deodorize clothes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_garment_care",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "四平调是河南的地方戏曲,以平稳流畅的唱腔著称。",
      "sentence_pinyin": "Sìpíngdiào shì Hénán de dìfāng xìqǔ, yǐ píngwěn liúchàng de chàngqiāng zhùchēng.",
      "sentence_fr": "L'opéra Sipingdiao est un opéra régional du Henan, réputé pour son chant stable et fluide.",
      "sentence_en": "Sipingdiao opera is a regional opera of Henan, renowned for its stable and flowing singing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sipingdiao_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的慢行系统为行人和骑行者提供了安全舒适的出行环境。",
      "sentence_pinyin": "Chéngshì de mànxíng xìtǒng wèi xíngrén hé qíxíngzhě tígōng le ānquán shūshì de chūxíng huánjìng.",
      "sentence_fr": "Le système de mobilité douce de la ville offre un environnement de déplacement sûr et confortable pour les piétons et les cyclistes.",
      "sentence_en": "The city's slow mobility system provides a safe and comfortable travel environment for pedestrians and cyclists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "slow_mobility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能钢琴可以追踪手指位置,指导初学者正确弹奏。",
      "sentence_pinyin": "Zhìnéng gāngqín kěyǐ zhuīzōng shǒuzhǐ wèizhì, zhǐdǎo chūxuézhě zhèngquè tánzòu.",
      "sentence_fr": "Le piano intelligent peut suivre la position des doigts et guider les débutants pour jouer correctement.",
      "sentence_en": "The smart piano can track finger positions and guide beginners to play correctly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pianos",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的印章篆刻艺术融合了书法和雕刻的精髓。",
      "sentence_pinyin": "Zhōngguó chuántǒng de yìnzhāng zhuànkè yìshù rónghé le shūfǎ hé diāokè de jīngsuǐ.",
      "sentence_fr": "L'art traditionnel chinois de la gravure de sceaux combine l'essence de la calligraphie et de la sculpture.",
      "sentence_en": "Traditional Chinese seal carving art combines the essence of calligraphy and sculpture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "seal_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物定位器可以实时追踪宠物的位置,防止宠物走失。",
      "sentence_pinyin": "Zhìnéng chǒngwù dìngwèiqì kěyǐ shíshí zhuīzōng chǒngwù de wèizhì, fángzhǐ chǒngwù zǒushī.",
      "sentence_fr": "Le traceur GPS intelligent pour animaux peut suivre la position de l'animal en temps réel, évitant qu'il se perde.",
      "sentence_en": "The smart pet tracker can track the pet's position in real-time, preventing the pet from getting lost.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_trackers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "滇剧是云南的地方戏曲,融合了多种民族音乐元素,风格独特。",
      "sentence_pinyin": "Diānjù shì Yúnnán de dìfāng xìqǔ, rónghé le duō zhǒng mínzú yīnyuè yuánsù, fēnggé dútè.",
      "sentence_fr": "L'opéra Dian est un opéra régional du Yunnan, combinant divers éléments musicaux ethniques avec un style unique.",
      "sentence_en": "Dian opera is a regional opera of Yunnan, combining various ethnic musical elements with a unique style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dian_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开设的便民服务点可以办理水电费缴纳和快递代收等业务。",
      "sentence_pinyin": "Shèqū kāishè de biànmín fúwù diǎn kěyǐ bànlǐ shuǐdiànfèi jiǎonà hé kuàidì dàishōu děng yèwù.",
      "sentence_fr": "Les points de service de proximité de la communauté permettent de payer les factures d'eau et d'électricité et de recevoir des colis.",
      "sentence_en": "Community convenience service points can handle utility bill payments and package collection services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电火锅可以精准控温,自动保温,方便家庭聚餐使用。",
      "sentence_pinyin": "Zhìnéng diàn huǒguō kěyǐ jīngzhǔn kòngwēn, zìdòng bǎowēn, fāngbiàn jiātíng jùcān shǐyòng.",
      "sentence_fr": "Le hot-pot électrique intelligent peut contrôler précisément la température et maintenir au chaud automatiquement, pratique pour les repas en famille.",
      "sentence_en": "The smart electric hot pot can precisely control temperature and automatically keep warm, convenient for family gatherings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_hot_pots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的茶道文化讲究泡茶的技艺、品茶的礼仪和茶具的选择。",
      "sentence_pinyin": "Zhōngguó chuántǒng de chádào wénhuà jiǎngjiù pàochá de jìyì, pǐnchá de lǐyí hé chájù de xuǎnzé.",
      "sentence_fr": "La culture traditionnelle chinoise du thé met l'accent sur l'art de l'infusion, l'étiquette de la dégustation et le choix des ustensiles.",
      "sentence_en": "Traditional Chinese tea ceremony culture emphasizes tea brewing skills, tea tasting etiquette, and teaware selection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tea_ceremony",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
