{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能水表可以远程抄表,自动检测漏水情况并发送警报。",
      "sentence_pinyin": "Zhège zhìnéng shuǐbiǎo kěyǐ yuǎnchéng chāobiǎo, zìdòng jiǎncè lòushuǐ qíngkuàng bìng fāsòng jǐngbào.",
      "sentence_fr": "Ce compteur d'eau intelligent peut être relevé à distance et détecter automatiquement les fuites d'eau en envoyant des alertes.",
      "sentence_en": "This smart water meter can be read remotely, automatically detect water leaks, and send alerts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_meters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "壮剧是广西壮族的传统戏剧,具有浓郁的民族特色和艺术魅力。",
      "sentence_pinyin": "Zhuàngjù shì Guǎngxī Zhuàngzú de chuántǒng xìjù, jùyǒu nóngyù de mínzú tèsè hé yìshù mèilì.",
      "sentence_fr": "L'opéra Zhuang est un théâtre traditionnel de l'ethnie Zhuang du Guangxi, avec un charme artistique et ethnique prononcé.",
      "sentence_en": "Zhuang opera is a traditional theater of the Zhuang ethnic group in Guangxi, with strong ethnic characteristics and artistic charm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhuang_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的屋顶花园不仅美化环境,还能降低建筑能耗。",
      "sentence_pinyin": "Chéngshì de wūdǐng huāyuán bùjǐn měihuà huánjìng, hái néng jiàngdī jiànzhù néngháo.",
      "sentence_fr": "Les jardins sur les toits urbains embellissent non seulement l'environnement, mais réduisent aussi la consommation énergétique des bâtiments.",
      "sentence_en": "Urban rooftop gardens not only beautify the environment but also reduce building energy consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rooftop_gardens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能婴儿监视器可以监测宝宝的睡眠状态和呼吸情况。",
      "sentence_pinyin": "Zhìnéng yīng'ér jiānshìqì kěyǐ jiāncè bǎobao de shuìmián zhuàngtài hé hūxī qíngkuàng.",
      "sentence_fr": "Le moniteur pour bébé intelligent peut surveiller l'état de sommeil et la respiration du bébé.",
      "sentence_en": "The smart baby monitor can monitor the baby's sleep state and breathing condition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_baby_monitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的古琴制作需要选用上等的桐木和梓木作为材料。",
      "sentence_pinyin": "Zhōngguó chuántǒng de gǔqín zhìzuò xūyào xuǎnyòng shàngděng de tóngmù hé zǐmù zuòwéi cáiliào.",
      "sentence_fr": "La fabrication traditionnelle chinoise du guqin nécessite du bois de paulownia et de catalpa de qualité supérieure.",
      "sentence_en": "Traditional Chinese guqin making requires using top-quality paulownia and catalpa wood as materials.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能厕所可以自动冲水、除臭和清洁,保持卫生间的整洁。",
      "sentence_pinyin": "Zhìnéng cèsuǒ kěyǐ zìdòng chōngshuǐ, chúchòu hé qīngjié, bǎochí wèishēngjiān de zhěngjié.",
      "sentence_fr": "Les toilettes intelligentes peuvent tirer la chasse, désodoriser et se nettoyer automatiquement, gardant les sanitaires propres.",
      "sentence_en": "Smart toilets can automatically flush, deodorize, and clean, keeping the bathroom tidy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toilets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "布依戏是贵州布依族的传统戏剧,唱腔悠扬,表演朴实。",
      "sentence_pinyin": "Bùyīxì shì Guìzhōu Bùyīzú de chuántǒng xìjù, chàngqiāng yōuyáng, biǎoyǎn pǔshí.",
      "sentence_fr": "L'opéra Buyi est un théâtre traditionnel de l'ethnie Buyi du Guizhou, avec un chant mélodieux et des performances simples.",
      "sentence_en": "Buyi opera is a traditional theater of the Buyi ethnic group in Guizhou, with melodious singing and simple performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "buyi_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施的乡村道路硬化项目改善了农村的交通条件。",
      "sentence_pinyin": "Zhèngfǔ shíshī de xiāngcūn dàolù yìnghuà xiàngmù gǎishàn le nóngcūn de jiāotōng tiáojiàn.",
      "sentence_fr": "Le projet de pavage des routes rurales mis en œuvre par le gouvernement a amélioré les conditions de transport dans les campagnes.",
      "sentence_en": "The government's rural road paving project has improved transportation conditions in rural areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_roads",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电磁炉可以精准控制火力大小,适合各种烹饪需求。",
      "sentence_pinyin": "Zhìnéng diàncílú kěyǐ jīngzhǔn kòngzhì huǒlì dàxiǎo, shìhé gèzhǒng pēngrèn xūqiú.",
      "sentence_fr": "La plaque à induction intelligente peut contrôler précisément la puissance, adaptée à tous les besoins culinaires.",
      "sentence_en": "The smart induction cooker can precisely control heat levels, suitable for various cooking needs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_induction_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的陶艺制作讲究拉坯、修坯、施釉和烧制等工序。",
      "sentence_pinyin": "Zhōngguó chuántǒng de táoyì zhìzuò jiǎngjiù lāpī, xiūpī, shīyòu hé shāozhì děng gōngxù.",
      "sentence_fr": "L'artisanat traditionnel chinois de la poterie met l'accent sur le façonnage, la finition, l'émaillage et la cuisson.",
      "sentence_en": "Traditional Chinese pottery making emphasizes throwing, trimming, glazing, and firing processes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pottery_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能运动手表可以记录运动轨迹、心率和消耗的卡路里。",
      "sentence_pinyin": "Zhìnéng yùndòng shǒubiǎo kěyǐ jìlù yùndòng guǐjì, xīnlǜ hé xiāohào de kǎlùlǐ.",
      "sentence_fr": "La montre de sport intelligente peut enregistrer le parcours, la fréquence cardiaque et les calories brûlées.",
      "sentence_en": "The smart sports watch can record exercise routes, heart rate, and calories burned.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sports_watches",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "侗戏是贵州侗族的传统戏剧,融合了歌舞和戏剧表演。",
      "sentence_pinyin": "Dòngxì shì Guìzhōu Dòngzú de chuántǒng xìjù, rónghé le gēwǔ hé xìjù biǎoyǎn.",
      "sentence_fr": "L'opéra Dong est un théâtre traditionnel de l'ethnie Dong du Guizhou, combinant chant, danse et performance théâtrale.",
      "sentence_en": "Dong opera is a traditional theater of the Dong ethnic group in Guizhou, combining song, dance, and theatrical performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dong_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市森林公园为市民提供了亲近大自然的休闲空间。",
      "sentence_pinyin": "Chéngshì sēnlín gōngyuán wèi shìmín tígōng le qīnjìn dàzìrán de xiūxián kōngjiān.",
      "sentence_fr": "Les parcs forestiers urbains offrent aux citadins un espace de loisirs proche de la nature.",
      "sentence_en": "Urban forest parks provide residents with leisure spaces close to nature.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "forest_parks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能点读笔可以帮助儿童学习语言,点到哪里读到哪里。",
      "sentence_pinyin": "Zhìnéng diǎndúbǐ kěyǐ bāngzhù értóng xuéxí yǔyán, diǎn dào nǎlǐ dú dào nǎlǐ.",
      "sentence_fr": "Le stylo lecteur intelligent peut aider les enfants à apprendre les langues en lisant ce qu'ils pointent.",
      "sentence_en": "The smart reading pen can help children learn languages by reading wherever they point.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_reading_pens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的扇面书画艺术将书法和绘画融入折扇或团扇之中。",
      "sentence_pinyin": "Zhōngguó chuántǒng de shànmiàn shūhuà yìshù jiāng shūfǎ hé huìhuà róngrù zhéshàn huò tuánshàn zhī zhōng.",
      "sentence_fr": "L'art traditionnel chinois de la peinture et calligraphie sur éventail intègre ces arts sur des éventails pliants ou ronds.",
      "sentence_en": "Traditional Chinese fan painting and calligraphy art integrates calligraphy and painting into folding or round fans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fan_painting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能血糖仪可以无痛测量血糖,并自动记录到手机应用中。",
      "sentence_pinyin": "Zhìnéng xuètángyí kěyǐ wútòng cèliáng xuètáng, bìng zìdòng jìlù dào shǒujī yìngyòng zhōng.",
      "sentence_fr": "Le glucomètre intelligent peut mesurer la glycémie sans douleur et enregistrer automatiquement les données dans une application mobile.",
      "sentence_en": "The smart blood glucose meter can painlessly measure blood sugar and automatically record it in a phone app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_glucose_meters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "白剧是云南大理白族的传统戏剧,唱腔优美,舞蹈动人。",
      "sentence_pinyin": "Báijù shì Yúnnán Dàlǐ Báizú de chuántǒng xìjù, chàngqiāng yōuměi, wǔdǎo dòngrén.",
      "sentence_fr": "L'opéra Bai est un théâtre traditionnel de l'ethnie Bai de Dali au Yunnan, avec un chant gracieux et des danses émouvantes.",
      "sentence_en": "Bai opera is a traditional theater of the Bai ethnic group in Dali, Yunnan, with beautiful singing and moving dances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bai_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区为困难家庭提供的临时救助帮助他们度过了难关。",
      "sentence_pinyin": "Shèqū wèi kùnnán jiātíng tígōng de línshí jiùzhù bāngzhù tāmen dùguò le nánguān.",
      "sentence_fr": "L'aide temporaire fournie par la communauté aux familles en difficulté les a aidées à surmonter leurs épreuves.",
      "sentence_en": "The community's temporary assistance for families in difficulty has helped them through hard times.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_assistance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能酸奶机可以自动控温发酵,在家就能做出美味的酸奶。",
      "sentence_pinyin": "Zhìnéng suānnǎijī kěyǐ zìdòng kòngwēn fājiào, zài jiā jiù néng zuòchū měiwèi de suānnǎi.",
      "sentence_fr": "La yaourtière intelligente peut contrôler automatiquement la température de fermentation, permettant de faire du yaourt délicieux à la maison.",
      "sentence_en": "The smart yogurt maker can automatically control fermentation temperature, making delicious yogurt at home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_yogurt_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的香囊制作将多种香料装入精美的刺绣袋中。",
      "sentence_pinyin": "Zhōngguó chuántǒng de xiāngnáng zhìzuò jiāng duō zhǒng xiāngliào zhuāngrù jīngměi de cìxiù dài zhōng.",
      "sentence_fr": "La fabrication traditionnelle chinoise de sachets parfumés place diverses épices dans des sacs brodés exquis.",
      "sentence_en": "Traditional Chinese sachet making places various spices into exquisitely embroidered bags.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sachet_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
