{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这位作家的新书一经发售就登上了畅销书排行榜。",
      "sentence_pinyin": "Zhè wèi zuòjiā de xīn shū yī jīng fāshòu jiù dēngshàngle chàngxiāoshū páihángbǎng.",
      "sentence_fr": "Le nouveau livre de cet auteur a grimpé au sommet des best-sellers dès sa sortie.",
      "sentence_en": "This author's new book topped the bestseller list as soon as it was released.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过不懈的努力，终于实现了自己的留学梦想。",
      "sentence_pinyin": "Tā tōngguò bùxiè de nǔlì, zhōngyú shíxiànle zìjǐ de liúxué mèngxiǎng.",
      "sentence_fr": "Grâce à ses efforts inlassables, elle a finalement réalisé son rêve d'étudier à l'étranger.",
      "sentence_en": "Through unremitting efforts, she finally realized her dream of studying abroad.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个项目的成功离不开全体成员的共同努力和密切合作。",
      "sentence_pinyin": "Zhège xiàngmù de chénggōng lí bù kāi quántǐ chéngyuán de gòngtóng nǔlì hé mìqiè hézuò.",
      "sentence_fr": "Le succès de ce projet est indissociable des efforts conjoints et de la coopération étroite de tous les membres.",
      "sentence_en": "The success of this project is inseparable from the joint efforts and close cooperation of all members.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "teamwork",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "今天下午有一场重要的商务洽谈会，请务必准时参加。",
      "sentence_pinyin": "Jīntiān xiàwǔ yǒu yī chǎng zhòngyào de shāngwù qiàtánhuì, qǐng wùbì zhǔnshí cānjiā.",
      "sentence_fr": "Il y a une importante réunion d'affaires cet après-midi, veuillez y assister à l'heure.",
      "sentence_en": "There's an important business meeting this afternoon, please attend on time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座古镇保存完好，吸引了众多摄影爱好者前来采风。",
      "sentence_pinyin": "Zhè zuò gǔ zhèn bǎocún wánhǎo, xīyǐnle zhòngduō shèyǐng àihàozhě qiánlái cǎifēng.",
      "sentence_fr": "Cette vieille ville bien préservée attire de nombreux passionnés de photographie.",
      "sentence_en": "This well-preserved ancient town attracts many photography enthusiasts to visit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tourism",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的演讲激情澎湃，鼓舞了在场的每一位听众。",
      "sentence_pinyin": "Tā de yǎnjiǎng jīqíng péngpài, gǔwǔle zàichǎng de měi yī wèi tīngzhòng.",
      "sentence_fr": "Son discours passionné a inspiré chaque membre du public présent.",
      "sentence_en": "His passionate speech inspired every member of the audience present.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "communication",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家餐厅的招牌菜是北京烤鸭，每天都吸引很多食客。",
      "sentence_pinyin": "Zhè jiā cāntīng de zhāopáicài shì Běijīng kǎoyā, měitiān dōu xīyǐn hěn duō shíkè.",
      "sentence_fr": "Le plat signature de ce restaurant est le canard laqué de Pékin, qui attire de nombreux clients chaque jour.",
      "sentence_en": "The signature dish of this restaurant is Beijing roast duck, which attracts many diners every day.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在国际钢琴比赛中获得了金奖，为国家争得了荣誉。",
      "sentence_pinyin": "Tā zài guójì gāngqín bǐsài zhōng huòdéle jīnjiǎng, wèi guójiā zhēng déle róngyù.",
      "sentence_fr": "Elle a remporté la médaille d'or au concours international de piano et a fait honneur à son pays.",
      "sentence_en": "She won the gold medal in the international piano competition and brought honor to her country.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区定期组织各种文化活动，丰富居民的业余生活。",
      "sentence_pinyin": "Zhège shèqū dìngqī zǔzhī gèzhǒng wénhuà huódòng, fēngfù jūmín de yèyú shēnghuó.",
      "sentence_fr": "Cette communauté organise régulièrement diverses activités culturelles pour enrichir la vie de loisirs des résidents.",
      "sentence_en": "This community regularly organizes various cultural activities to enrich residents' leisure life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在困难时期没有放弃，凭借坚强的意志力战胜了挑战。",
      "sentence_pinyin": "Tā zài kùnnan shíqī méiyǒu fàngqì, píngjie jiānqiáng de yìzhìlì zhànshèngle tiǎozhàn.",
      "sentence_fr": "Il n'a pas abandonné pendant les moments difficiles et a surmonté les défis grâce à sa forte volonté.",
      "sentence_en": "He didn't give up during difficult times and overcame challenges with strong willpower.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "perseverance",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电影的特效制作精良，给观众带来了震撼的视觉体验。",
      "sentence_pinyin": "Zhè bù diànyǐng de tèxiào zhìzuò jīngliáng, gěi guānzhòng dàiláile zhènhàn de shìjué tǐyàn.",
      "sentence_fr": "Les effets spéciaux de ce film sont excellents et offrent une expérience visuelle époustouflante au public.",
      "sentence_en": "The special effects of this movie are excellent and bring a stunning visual experience to the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "孩子们需要充足的睡眠和营养均衡的饮食来保证健康成长。",
      "sentence_pinyin": "Háizimen xūyào chōngzú de shuìmián hé yíngyǎng jūnhéng de yǐnshí lái bǎozhèng jiànkāng chéngzhǎng.",
      "sentence_fr": "Les enfants ont besoin de suffisamment de sommeil et d'une alimentation équilibrée pour grandir en bonne santé.",
      "sentence_en": "Children need adequate sleep and balanced nutrition to ensure healthy growth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技园区聚集了许多创新型企业和研发团队。",
      "sentence_pinyin": "Zhège kējì yuánqū jùjíle xǔduō chuàngxīnxíng qǐyè hé yánfā tuánduì.",
      "sentence_fr": "Ce parc technologique rassemble de nombreuses entreprises innovantes et équipes de recherche.",
      "sentence_en": "This technology park gathers many innovative enterprises and R&D teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的绘画风格独特，作品中融入了东西方文化的元素。",
      "sentence_pinyin": "Tā de huìhuà fēnggé dútè, zuòpǐn zhōng róngrùle dōngxīfāng wénhuà de yuánsù.",
      "sentence_fr": "Son style de peinture est unique et ses œuvres intègrent des éléments culturels orientaux et occidentaux.",
      "sentence_en": "Her painting style is unique and her works incorporate elements of Eastern and Western culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这次会议讨论的主要议题是如何提高工作效率和服务质量。",
      "sentence_pinyin": "Zhè cì huìyì tǎolùn de zhǔyào yìtí shì rúhé tígāo gōngzuò xiàolǜ hé fúwù zhìliàng.",
      "sentence_fr": "Le sujet principal de cette réunion est comment améliorer l'efficacité du travail et la qualité du service.",
      "sentence_en": "The main topic of this meeting is how to improve work efficiency and service quality.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们在山区建立了多所希望小学，帮助贫困儿童接受教育。",
      "sentence_pinyin": "Tāmen zài shānqū jiànlìle duō suǒ xīwàng xiǎoxué, bāngzhù pínkùn értóng jiēshòu jiàoyù.",
      "sentence_fr": "Ils ont établi plusieurs écoles primaires d'espoir dans les zones montagneuses pour aider les enfants pauvres à recevoir une éducation.",
      "sentence_en": "They established several Hope primary schools in mountainous areas to help poor children receive education.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个品牌的衣服设计时尚，质地舒适，深受年轻人喜爱。",
      "sentence_pinyin": "Zhège pǐnpái de yīfu shèjì shíshàng, zhìdì shūshì, shēn shòu niánqīngrén xǐ'ài.",
      "sentence_fr": "Les vêtements de cette marque ont un design tendance et une texture confortable, très appréciés des jeunes.",
      "sentence_en": "The clothes of this brand have fashionable designs and comfortable texture, very popular among young people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fashion",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "随着技术的进步，远程办公已经成为一种新的工作模式。",
      "sentence_pinyin": "Suízhe jìshù de jìnbù, yuǎnchéng bàngōng yǐjīng chéngwéi yī zhǒng xīn de gōngzuò móshì.",
      "sentence_fr": "Avec les progrès technologiques, le télétravail est devenu un nouveau mode de travail.",
      "sentence_en": "With technological advancement, remote work has become a new work mode.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个历史博物馆通过现代科技手段展示了丰富的文物和史料。",
      "sentence_pinyin": "Zhège lìshǐ bówùguǎn tōngguò xiàndài kējì shǒuduàn zhǎnshìle fēngfù de wénwù hé shǐliào.",
      "sentence_fr": "Ce musée d'histoire présente une riche collection d'artefacts et de documents historiques grâce aux moyens technologiques modernes.",
      "sentence_en": "This history museum showcases a rich collection of artifacts and historical materials through modern technological means.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在学校里不仅成绩优秀，还积极参与各种社会实践活动。",
      "sentence_pinyin": "Tā zài xuéxiào lǐ bùjǐn chéngjì yōuxiù, hái jījí cānyù gèzhǒng shèhuì shíjiàn huódòng.",
      "sentence_fr": "À l'école, elle a non seulement d'excellents résultats, mais participe aussi activement à diverses activités de pratique sociale.",
      "sentence_en": "At school, she not only has excellent grades but also actively participates in various social practice activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:35:00.000Z",
      "updated_at": "2025-11-20T16:35:00.000Z"
    }
  ]
}
