{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能仓储系统利用机器人完成货物的分拣、搬运和上架工作。",
      "sentence_pinyin": "Zhège zhìnéng cāngchǔ xìtǒng lìyòng jīqìrén wánchéng huòwù de fēnjiǎn, bānyùn hé shàngjià gōngzuò.",
      "sentence_fr": "Ce système d'entreposage intelligent utilise des robots pour effectuer le tri, le transport et la mise en rayon des marchandises.",
      "sentence_en": "This smart warehousing system uses robots to complete goods sorting, transportation, and shelving work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_warehousing",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "扬琴的演奏使用两根琴竹敲击琴弦,音色清脆明亮。",
      "sentence_pinyin": "Yángqín de yǎnzòu shǐyòng liǎng gēn qínzhú qiāojī qínxián, yīnsè qīngcuì míngliàng.",
      "sentence_fr": "Le yangqin se joue en frappant les cordes avec deux baguettes de bambou, produisant un son clair et brillant.",
      "sentence_en": "The yangqin is played by striking the strings with two bamboo mallets, producing a clear and bright tone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangqin_techniques",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的海绵城市建设有效缓解了暴雨期间的内涝问题。",
      "sentence_pinyin": "Zhège chéngshì de hǎimián chéngshì jiànshè yǒuxiào huǎnjiěle bàoyǔ qījiān de nèilào wèntí.",
      "sentence_fr": "La construction de ville éponge de cette ville a efficacement atténué les problèmes d'inondation lors des fortes pluies.",
      "sentence_en": "This city's sponge city construction has effectively alleviated waterlogging problems during heavy rains.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sponge_cities",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "锡器工艺将锡金属打造成各种精美的茶具和装饰品。",
      "sentence_pinyin": "Xīqì gōngyì jiāng xī jīnshǔ dǎzào chéng gèzhǒng jīngměi de chájù hé zhuāngshìpǐn.",
      "sentence_fr": "L'artisanat de l'étain forge le métal étain en divers services à thé et décorations exquis.",
      "sentence_en": "Pewter craftsmanship forges tin metal into various exquisite tea sets and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pewter_crafts",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能体温计可以非接触式测量体温并自动记录数据。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng tǐwēnjì kěyǐ fēi jiēchùshì cèliáng tǐwēn bìng zìdòng jìlù shùjù.",
      "sentence_fr": "Ce thermomètre intelligent peut mesurer la température corporelle sans contact et enregistrer automatiquement les données.",
      "sentence_en": "This smart thermometer can measure body temperature contactlessly and automatically record data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_thermometers",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区日间照料中心为失能老人提供康复训练和日常护理。",
      "sentence_pinyin": "Zhège shèqū rìjiān zhàoliào zhōngxīn wèi shīnéng lǎorén tígōng kāngfù xùnliàn hé rìcháng hùlǐ.",
      "sentence_fr": "Ce centre de soins de jour communautaire offre rééducation et soins quotidiens aux personnes âgées dépendantes.",
      "sentence_en": "This community day care center provides rehabilitation training and daily care for disabled elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "day_care_centers",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笛子的音域宽广,既能演奏高亢激昂的曲调,也能表现婉转柔美的旋律。",
      "sentence_pinyin": "Dízǐ de yīnyù kuānguǎng, jì néng yǎnzòu gāokàng jī'áng de qǔdiào, yě néng biǎoxiàn wǎnzhuǎn róuměi de xuánlǜ.",
      "sentence_fr": "La flûte dizi a une large tessiture, capable de jouer des airs élevés et passionnés ainsi que des mélodies douces et gracieuses.",
      "sentence_en": "The dizi has a wide range, capable of playing high-spirited tunes as well as soft and graceful melodies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dizi_range",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线会计平台帮助中小企业实现了财务管理的自动化。",
      "sentence_pinyin": "Zhège zàixiàn kuàijì píngtái bāngzhù zhōngxiǎo qǐyè shíxiànle cáiwù guǎnlǐ de zìdònghuà.",
      "sentence_fr": "Cette plateforme de comptabilité en ligne aide les PME à automatiser leur gestion financière.",
      "sentence_en": "This online accounting platform helps small and medium enterprises achieve automated financial management.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_accounting",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "布贴画利用各种花布剪裁拼贴,创作出色彩丰富的装饰画。",
      "sentence_pinyin": "Bùtiēhuà lìyòng gèzhǒng huābù jiǎncái pīntiē, chuàngzuò chū sècǎi fēngfù de zhuāngshì huà.",
      "sentence_fr": "La peinture en tissu collé utilise divers tissus imprimés découpés et assemblés pour créer des peintures décoratives colorées.",
      "sentence_en": "Fabric collage art uses various patterned fabrics cut and assembled to create colorful decorative paintings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fabric_collage",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能空调可以根据室内人数自动调节温度和风速。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng kōngtiáo kěyǐ gēnjù shìnèi rénshù zìdòng tiáojié wēndù hé fēngsù.",
      "sentence_fr": "Ce climatiseur intelligent peut ajuster automatiquement la température et la vitesse du vent selon le nombre de personnes dans la pièce.",
      "sentence_en": "This smart air conditioner can automatically adjust temperature and fan speed based on the number of people indoors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_conditioners",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生态农业园区实现了种养结合的循环农业模式。",
      "sentence_pinyin": "Zhège shēngtài nóngyè yuánqū shíxiànle zhǒngyǎng jiéhé de xúnhuán nóngyè móshì.",
      "sentence_fr": "Ce parc agricole écologique a réalisé un modèle d'agriculture circulaire combinant culture et élevage.",
      "sentence_en": "This ecological agricultural park has achieved a circular agriculture model combining planting and breeding.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "circular_agriculture",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阮的形制圆润,音色柔和饱满,在民乐合奏中担任重要角色。",
      "sentence_pinyin": "Ruǎn de xíngzhì yuánrùn, yīnsè róuhé bǎomǎn, zài mínyuè hézòu zhōng dānrèn zhòngyào juésè.",
      "sentence_fr": "Le ruan a une forme arrondie et un son doux et plein, jouant un rôle important dans les ensembles de musique traditionnelle.",
      "sentence_en": "The ruan has a round shape and a soft, full tone, playing an important role in traditional music ensembles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ruan_music",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能家政服务平台连接了家政服务人员和有需求的家庭。",
      "sentence_pinyin": "Zhège zhìnéng jiāzhèng fúwù píngtái liánjiēle jiāzhèng fúwù rényuán hé yǒu xūqiú de jiātíng.",
      "sentence_fr": "Cette plateforme intelligente de services domestiques relie le personnel de service domestique aux familles qui en ont besoin.",
      "sentence_en": "This smart home service platform connects domestic service personnel with families in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "home_services_platforms",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玉石雕刻讲究因材施艺,充分利用玉石本身的色彩和纹理。",
      "sentence_pinyin": "Yùshí diāokè jiǎngjiù yīncái-shīyì, chōngfèn lìyòng yùshí běnshēn de sècǎi hé wénlǐ.",
      "sentence_fr": "La sculpture sur jade met l'accent sur l'adaptation de l'art au matériau, utilisant pleinement les couleurs et textures naturelles du jade.",
      "sentence_en": "Jade carving emphasizes adapting art to the material, fully utilizing the jade's own colors and textures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jade_carving_philosophy",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能净水器可以实时显示水质状况并自动提醒更换滤芯。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng jìngshuǐqì kěyǐ shíshí xiǎnshì shuǐzhì zhuàngkuàng bìng zìdòng tíxǐng gēnghuàn lǜxīn.",
      "sentence_fr": "Ce purificateur d'eau intelligent peut afficher en temps réel la qualité de l'eau et rappeler automatiquement de remplacer le filtre.",
      "sentence_en": "This smart water purifier can display water quality status in real-time and automatically remind to replace the filter.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_purifiers",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾焚烧发电厂每天处理数千吨生活垃圾,产生的电能供应周边居民。",
      "sentence_pinyin": "Zhège lājī fénshāo fādiànchǎng měi tiān chǔlǐ shù qiān dūn shēnghuó lājī, chǎnshēng de diànnéng gōngyìng zhōubiān jūmín.",
      "sentence_fr": "Cette centrale d'incinération de déchets traite des milliers de tonnes de déchets ménagers par jour, l'électricité produite alimente les résidents voisins.",
      "sentence_en": "This waste incineration power plant processes thousands of tons of household waste daily, with the generated electricity supplying nearby residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_incineration",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古琴的琴弦由丝线制成,音色古朴淳厚,余音悠长。",
      "sentence_pinyin": "Gǔqín de qínxián yóu sīxiàn zhìchéng, yīnsè gǔpǔ chúnhòu, yúyīn yōucháng.",
      "sentence_fr": "Les cordes du guqin sont faites de fils de soie, avec un son antique et riche, et une résonance prolongée.",
      "sentence_en": "The guqin's strings are made of silk threads, with an antique and rich tone and a prolonged resonance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_strings",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线设计平台为用户提供了丰富的模板和设计工具。",
      "sentence_pinyin": "Zhège zàixiàn shèjì píngtái wèi yònghù tígōngle fēngfù de múbǎn hé shèjì gōngjù.",
      "sentence_fr": "Cette plateforme de conception en ligne offre aux utilisateurs de nombreux modèles et outils de conception.",
      "sentence_en": "This online design platform provides users with rich templates and design tools.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_design_platforms",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内画艺术在小小的玻璃瓶内部绘制精美的图案,技艺精湛。",
      "sentence_pinyin": "Nèihuà yìshù zài xiǎoxiǎo de bōli píng nèibù huìzhì jīngměi de tú'àn, jìyì jīngzhàn.",
      "sentence_fr": "L'art de la peinture intérieure peint de beaux motifs à l'intérieur de petites bouteilles en verre, démontrant une technique exquise.",
      "sentence_en": "Interior painting art paints exquisite patterns inside small glass bottles, demonstrating superb craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "interior_painting",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能投影仪可以自动对焦和校正画面,操作简便。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng tóuyǐngyí kěyǐ zìdòng duìjiāo hé jiàozhèng huàmiàn, cāozuò jiǎnbiàn.",
      "sentence_fr": "Ce projecteur intelligent peut effectuer automatiquement la mise au point et la correction d'image, avec une utilisation simple.",
      "sentence_en": "This smart projector can automatically focus and correct the image, with easy operation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_projectors",
      "created_at": "2025-11-20T21:35:00.000Z",
      "updated_at": "2025-11-20T21:35:00.000Z"
    }
  ]
}
