{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能体感游戏机可以通过捕捉身体动作来控制游戏角色。",
      "sentence_pinyin": "Zhège zhìnéng tǐgǎn yóuxìjī kěyǐ tōngguò bǔzhuō shēntǐ dòngzuò lái kòngzhì yóuxì juésè.",
      "sentence_fr": "Cette console de jeu à détection de mouvement intelligente peut contrôler les personnages en capturant les mouvements du corps.",
      "sentence_en": "This smart motion-sensing game console can control game characters by capturing body movements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_motion_gaming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "裕固族的民歌是甘肃河西走廊独特的民间音乐形式。",
      "sentence_pinyin": "Yùgùzú de míngē shì Gānsù Héxī Zǒuláng dútè de mínjiān yīnyuè xíngshì.",
      "sentence_fr": "Les chants populaires de l'ethnie Yugur sont une forme unique de musique folklorique du corridor de Hexi au Gansu.",
      "sentence_en": "Yugur ethnic group's folk songs are a unique folk music form of Gansu's Hexi Corridor.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yugur_folk_songs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的无障碍设施建设为残疾人和老年人提供了便利。",
      "sentence_pinyin": "Chéngshì de wúzhàng'ài shèshī jiànshè wèi cánjírén hé lǎoniánrén tígōng le biànlì.",
      "sentence_fr": "La construction d'installations accessibles en ville offre des commodités aux personnes handicapées et aux personnes âgées.",
      "sentence_en": "Urban accessible facility construction provides convenience for disabled and elderly people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "accessible_facilities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子烟感器可以及时检测到烟雾并自动触发消防系统。",
      "sentence_pinyin": "Zhìnéng diànzǐ yāngǎnqì kěyǐ jíshí jiǎncè dào yānwù bìng zìdòng chùfā xiāofáng xìtǒng.",
      "sentence_fr": "Le détecteur de fumée électronique intelligent peut détecter la fumée à temps et déclencher automatiquement le système anti-incendie.",
      "sentence_en": "The smart electronic smoke detector can detect smoke in time and automatically trigger the fire system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_smoke_detectors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的拜年习俗是春节期间亲友之间相互祝福的重要方式。",
      "sentence_pinyin": "Zhōngguó chuántǒng de bàinián xísú shì Chūnjié qījiān qīnyǒu zhījiān xiānghù zhùfú de zhòngyào fāngshì.",
      "sentence_fr": "La coutume traditionnelle chinoise des vœux du Nouvel An est une façon importante de se souhaiter mutuellement entre amis et famille.",
      "sentence_en": "The traditional Chinese New Year greeting custom is an important way for relatives and friends to exchange blessings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_year_greetings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能助眠仪可以通过白噪音和脑波音乐帮助用户入睡。",
      "sentence_pinyin": "Zhìnéng zhùmiányí kěyǐ tōngguò báizàoyīn hé nǎobō yīnyuè bāngzhù yònghù rùshuì.",
      "sentence_fr": "L'appareil d'aide au sommeil intelligent peut aider les utilisateurs à s'endormir grâce au bruit blanc et à la musique d'ondes cérébrales.",
      "sentence_en": "The smart sleep aid device can help users fall asleep through white noise and brainwave music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sleep_aids",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "保安族的腰刀制作工艺是甘肃地区独特的非物质文化遗产。",
      "sentence_pinyin": "Bǎo'ānzú de yāodāo zhìzuò gōngyì shì Gānsù dìqū dútè de fēi wùzhì wénhuà yíchǎn.",
      "sentence_fr": "L'artisanat de fabrication de couteaux de ceinture de l'ethnie Bonan est un patrimoine culturel immatériel unique de la région du Gansu.",
      "sentence_en": "The Bonan ethnic group's waist knife making craft is a unique intangible cultural heritage of Gansu region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bonan_knife_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推行的义务教育减负政策减轻了学生的课业负担。",
      "sentence_pinyin": "Zhèngfǔ tuīxíng de yìwù jiàoyù jiǎnfù zhèngcè jiǎnqīng le xuéshēng de kèyè fùdān.",
      "sentence_fr": "La politique d'allègement de l'éducation obligatoire promue par le gouvernement a réduit la charge scolaire des élèves.",
      "sentence_en": "The government's compulsory education burden reduction policy has lightened students' academic workload.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education_reform",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电动牙膏挤压器可以自动定量挤出牙膏,方便又卫生。",
      "sentence_pinyin": "Zhìnéng diàndòng yágāo jǐyāqì kěyǐ zìdòng dìngliàng jǐchū yágāo, fāngbiàn yòu wèishēng.",
      "sentence_fr": "Le distributeur de dentifrice électrique intelligent peut distribuer automatiquement une quantité fixe, pratique et hygiénique.",
      "sentence_en": "The smart electric toothpaste dispenser can automatically squeeze out a fixed amount, convenient and hygienic.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toothpaste_dispensers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的舞龙表演在节庆活动中象征着祈求风调雨顺。",
      "sentence_pinyin": "Zhōngguó chuántǒng de wǔlóng biǎoyǎn zài jiéqìng huódòng zhōng xiàngzhēng zhe qíqiú fēngtiáo yǔshùn.",
      "sentence_fr": "La danse du dragon traditionnelle chinoise symbolise les prières pour un temps favorable lors des célébrations festives.",
      "sentence_en": "Traditional Chinese dragon dance performances symbolize prayers for favorable weather during festive activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dragon_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子名片可以通过扫码或碰一碰快速交换联系信息。",
      "sentence_pinyin": "Zhìnéng diànzǐ míngpiàn kěyǐ tōngguò sǎomǎ huò pèng yī pèng kuàisù jiāohuàn liánxì xìnxī.",
      "sentence_fr": "La carte de visite électronique intelligente peut échanger rapidement des coordonnées par code QR ou NFC.",
      "sentence_en": "The smart electronic business card can quickly exchange contact information through scanning or tapping.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_business_cards",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "东乡族的花儿是甘肃临夏地区流传的独特山歌形式。",
      "sentence_pinyin": "Dōngxiāngzú de huā'er shì Gānsù Línxià dìqū liúchuán de dútè shāngē xíngshì.",
      "sentence_fr": "Le Hua'er de l'ethnie Dongxiang est une forme unique de chant de montagne transmise dans la région de Linxia au Gansu.",
      "sentence_en": "The Dongxiang ethnic group's Hua'er is a unique mountain song form passed down in Gansu's Linxia region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dongxiang_huaer",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的地下综合管廊解决了反复开挖道路的问题。",
      "sentence_pinyin": "Chéngshì de dìxià zònghé guǎnláng jiějué le fǎnfù kāiwā dàolù de wèntí.",
      "sentence_fr": "Les galeries techniques souterraines urbaines ont résolu le problème de l'excavation répétée des routes.",
      "sentence_en": "Urban underground utility tunnels have solved the problem of repeatedly digging up roads.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "utility_tunnels",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子体温枪可以快速无接触测量体温,适合公共场所使用。",
      "sentence_pinyin": "Zhìnéng diànzǐ tǐwēnqiāng kěyǐ kuàisù wú jiēchù cèliáng tǐwēn, shìhé gōnggòng chǎngsuǒ shǐyòng.",
      "sentence_fr": "Le thermomètre infrarouge intelligent peut mesurer rapidement et sans contact la température, adapté aux lieux publics.",
      "sentence_en": "The smart electronic temperature gun can quickly measure temperature contactlessly, suitable for public places.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_temp_guns",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的年画张贴习俗为新年增添了喜庆和吉祥的氛围。",
      "sentence_pinyin": "Zhōngguó chuántǒng de niánhuà zhāngtiē xísú wèi xīnnián zēngtiān le xǐqìng hé jíxiáng de fēnwéi.",
      "sentence_fr": "La coutume traditionnelle chinoise d'afficher des peintures du Nouvel An ajoute une atmosphère festive et de bon augure.",
      "sentence_en": "The traditional Chinese New Year painting posting custom adds a festive and auspicious atmosphere to the new year.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_year_painting_custom",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能冰酒器可以快速将葡萄酒降到适饮温度,提升品酒体验。",
      "sentence_pinyin": "Zhìnéng bīngjiǔqì kěyǐ kuàisù jiāng pútaojiǔ jiàng dào shìyǐn wēndù, tíshēng pǐnjiǔ tǐyàn.",
      "sentence_fr": "Le refroidisseur de vin intelligent peut rapidement refroidir le vin à la température de dégustation idéale, améliorant l'expérience.",
      "sentence_en": "The smart wine chiller can quickly cool wine to drinking temperature, enhancing the wine tasting experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_wine_chillers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "撒拉族的骆驼泉传说是青海循化地区流传的民间故事。",
      "sentence_pinyin": "Sālāzú de luòtuo quán chuánshuō shì Qīnghǎi Xúnhuà dìqū liúchuán de mínjiān gùshì.",
      "sentence_fr": "La légende de la source du chameau de l'ethnie Salar est un conte populaire transmis dans la région de Xunhua au Qinghai.",
      "sentence_en": "The Salar ethnic group's Camel Spring legend is a folk story passed down in Qinghai's Xunhua region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "salar_legends",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织的技能培训班帮助居民提升就业竞争力。",
      "sentence_pinyin": "Shèqū zǔzhī de jìnéng péixùnbān bāngzhù jūmín tíshēng jiùyè jìngzhēnglì.",
      "sentence_fr": "Les cours de formation professionnelle organisés par la communauté aident les résidents à améliorer leur compétitivité sur le marché du travail.",
      "sentence_en": "Community-organized skill training classes help residents improve their employment competitiveness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "skill_training",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子血氧仪可以快速测量血氧饱和度,监测呼吸健康。",
      "sentence_pinyin": "Zhìnéng diànzǐ xuèyǎngyí kěyǐ kuàisù cèliáng xuèyǎng bǎohédù, jiāncè hūxī jiànkāng.",
      "sentence_fr": "L'oxymètre de pouls intelligent peut mesurer rapidement la saturation en oxygène sanguin, surveillant la santé respiratoire.",
      "sentence_en": "The smart pulse oximeter can quickly measure blood oxygen saturation, monitoring respiratory health.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pulse_oximeters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的团圆饭习俗是除夕夜家人欢聚一堂的重要时刻。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tuányuánfàn xísú shì chúxīyè jiārén huānjù yītáng de zhòngyào shíkè.",
      "sentence_fr": "La coutume traditionnelle chinoise du repas de réunion est un moment important où la famille se retrouve la veille du Nouvel An.",
      "sentence_en": "The traditional Chinese reunion dinner custom is an important moment for family gatherings on New Year's Eve.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "reunion_dinner",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
