{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这家科技馆的互动展品让孩子们能够亲手体验科学原理的奥妙。",
      "sentence_pinyin": "Zhè jiā kējìguǎn de hùdòng zhǎnpǐn ràng háizimen nénggòu qīnshǒu tǐyàn kēxué yuánlǐ de àomiào.",
      "sentence_fr": "Les expositions interactives de ce musée des sciences permettent aux enfants de découvrir les merveilles des principes scientifiques par eux-mêmes.",
      "sentence_en": "The interactive exhibits at this science museum allow children to experience the wonders of scientific principles firsthand.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science_museums",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "扬琴是一种击弦乐器,音色清脆明亮,常用于民乐合奏和独奏。",
      "sentence_pinyin": "Yángqín shì yī zhǒng jīxián yuèqì, yīnsè qīngcuì míngliàng, cháng yòng yú mínyuè hézòu hé dúzòu.",
      "sentence_fr": "Le yangqin est un instrument à cordes frappées au son clair et brillant, souvent utilisé dans les ensembles de musique traditionnelle et en solo.",
      "sentence_en": "The yangqin is a struck string instrument with a clear and bright tone, often used in traditional music ensembles and solos.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangqin_music",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个快递公司使用智能分拣系统,大幅提高了包裹处理速度。",
      "sentence_pinyin": "Zhège kuàidì gōngsī shǐyòng zhìnéng fēnjiǎn xìtǒng, dàfú tígāole bāoguǒ chǔlǐ sùdù.",
      "sentence_fr": "Cette entreprise de livraison utilise un système de tri intelligent qui améliore considérablement la vitesse de traitement des colis.",
      "sentence_en": "This delivery company uses an intelligent sorting system that significantly improves package processing speed.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_logistics",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "刺绣工艺需要极高的耐心和细致,一幅精美的作品可能需要数月才能完成。",
      "sentence_pinyin": "Cìxiù gōngyì xūyào jí gāo de nàixīn hé xìzhì, yī fú jīngměi de zuòpǐn kěnéng xūyào shù yuè cái néng wánchéng.",
      "sentence_fr": "L'art de la broderie exige une grande patience et minutie, une belle œuvre peut prendre plusieurs mois à compléter.",
      "sentence_en": "Embroidery craftsmanship requires great patience and meticulousness, and a beautiful work may take several months to complete.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "embroidery",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物识别技术在手机解锁、支付认证等场景中得到了广泛应用。",
      "sentence_pinyin": "Shēngwù shíbié jìshù zài shǒujī jiěsuǒ, zhīfù rènzhèng děng chǎngjǐng zhōng dédàole guǎngfàn yìngyòng.",
      "sentence_fr": "La technologie de reconnaissance biométrique est largement utilisée dans des scénarios tels que le déverrouillage de téléphone et l'authentification de paiement.",
      "sentence_en": "Biometric recognition technology is widely applied in scenarios such as phone unlocking and payment authentication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biometric_technology",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家社会企业为残疾人提供职业培训和就业机会,帮助他们融入社会。",
      "sentence_pinyin": "Zhè jiā shèhuì qǐyè wèi cánjírén tígōng zhíyè péixùn hé jiùyè jīhuì, bāngzhù tāmen róngrù shèhuì.",
      "sentence_fr": "Cette entreprise sociale offre formation professionnelle et opportunités d'emploi aux personnes handicapées pour les aider à s'intégrer dans la société.",
      "sentence_en": "This social enterprise provides vocational training and employment opportunities for people with disabilities to help them integrate into society.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disability_employment",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "年画是中国民间艺术的瑰宝,色彩鲜艳,寓意吉祥,深受人们喜爱。",
      "sentence_pinyin": "Niánhuà shì Zhōngguó mínjiān yìshù de guībǎo, sècǎi xiānyàn, yùyì jíxiáng, shēn shòu rénmen xǐ'ài.",
      "sentence_fr": "Les estampes du Nouvel An sont un trésor de l'art populaire chinois, avec des couleurs vives et des significations auspicieuses, très appréciées des gens.",
      "sentence_en": "New Year prints are a treasure of Chinese folk art, with bright colors and auspicious meanings, much loved by people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_year_prints",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保项目通过收集厨余垃圾制作有机肥料,实现了废物的循环利用。",
      "sentence_pinyin": "Zhège huánbǎo xiàngmù tōngguò shōují chúyú lājī zhìzuò yǒujī féiliào, shíxiànle fèiwù de xúnhuán lìyòng.",
      "sentence_fr": "Ce projet écologique réalise le recyclage des déchets en collectant les restes de cuisine pour fabriquer des engrais organiques.",
      "sentence_en": "This environmental project achieves waste recycling by collecting kitchen waste to make organic fertilizer.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "organic_composting",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝演奏时指法变化多端,既能表现轻柔委婉,也能展现铿锵有力。",
      "sentence_pinyin": "Gǔzhēng yǎnzòu shí zhǐfǎ biànhuà duōduān, jì néng biǎoxiàn qīngróu wěiwǎn, yě néng zhǎnxiàn kēngqiāng yǒulì.",
      "sentence_fr": "Les techniques de doigté du guzheng sont très variées, pouvant exprimer à la fois la douceur délicate et la puissance vigoureuse.",
      "sentence_en": "The guzheng's fingering techniques are highly varied, able to express both gentle delicacy and vigorous power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_music",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能眼镜可以实时翻译外语对话,帮助用户跨越语言障碍。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yǎnjìng kěyǐ shíshí fānyì wàiyǔ duìhuà, bāngzhù yònghù kuàyuè yǔyán zhàng'ài.",
      "sentence_fr": "Ces lunettes intelligentes peuvent traduire les conversations en langues étrangères en temps réel, aidant les utilisateurs à surmonter les barrières linguistiques.",
      "sentence_en": "These smart glasses can translate foreign language conversations in real-time, helping users overcome language barriers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_glasses",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座城市正在建设地下综合管廊,将各类管线集中管理,便于维护和检修。",
      "sentence_pinyin": "Zhè zuò chéngshì zhèngzài jiànshè dìxià zōnghé guǎnláng, jiāng gè lèi guǎnxiàn jízhōng guǎnlǐ, biànyú wéihù hé jiǎnxiū.",
      "sentence_fr": "Cette ville construit des galeries techniques souterraines pour gérer de manière centralisée divers types de conduites, facilitant l'entretien et les réparations.",
      "sentence_en": "This city is building underground utility tunnels to centrally manage various types of pipelines, facilitating maintenance and repairs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "utility_tunnels",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "木版水印结合了绘画、雕刻和印刷三种技艺,是一门综合性的传统艺术。",
      "sentence_pinyin": "Mùbǎn shuǐyìn jiéhéle huìhuà, diāokè hé yìnshuā sān zhǒng jìyì, shì yī mén zōnghéxìng de chuántǒng yìshù.",
      "sentence_fr": "L'impression sur bois à l'eau combine trois techniques : peinture, sculpture et impression, c'est un art traditionnel complet.",
      "sentence_en": "Woodblock watercolor printing combines three techniques - painting, carving, and printing - making it a comprehensive traditional art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "woodblock_printing",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个医疗数据平台利用区块链技术保护患者隐私,同时实现数据共享。",
      "sentence_pinyin": "Zhège yīliào shùjù píngtái lìyòng qūkuàiliàn jìshù bǎohù huànzhě yǐnsī, tóngshí shíxiàn shùjù gòngxiǎng.",
      "sentence_fr": "Cette plateforme de données médicales utilise la technologie blockchain pour protéger la vie privée des patients tout en permettant le partage des données.",
      "sentence_en": "This medical data platform uses blockchain technology to protect patient privacy while enabling data sharing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_data_platforms",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "农村电商的发展为偏远地区的特色农产品打开了广阔的销售市场。",
      "sentence_pinyin": "Nóngcūn diànshāng de fāzhǎn wèi piānyuǎn dìqū de tèsè nóngchǎnpǐn dǎkāile guǎngkuò de xiāoshòu shìchǎng.",
      "sentence_fr": "Le développement du commerce électronique rural a ouvert un vaste marché de vente pour les produits agricoles spéciaux des régions éloignées.",
      "sentence_en": "The development of rural e-commerce has opened up a vast sales market for specialty agricultural products from remote areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_ecommerce",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "箜篌是一种古老的弹拨乐器,经过现代改良后重新焕发了生机。",
      "sentence_pinyin": "Kōnghóu shì yī zhǒng gǔlǎo de tánbō yuèqì, jīngguò xiàndài gǎiliáng hòu chóngxīn huànfāle shēngjī.",
      "sentence_fr": "Le konghou est un ancien instrument à cordes pincées qui a retrouvé une nouvelle vitalité après des améliorations modernes.",
      "sentence_en": "The konghou is an ancient plucked string instrument that has regained vitality after modern improvements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "konghou_music",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧养老平台整合了健康监测、紧急呼叫和生活服务等多项功能。",
      "sentence_pinyin": "Zhège zhìhuì yǎnglǎo píngtái zhěnghéle jiànkāng jiāncè, jǐnjí hūjiào hé shēnghuó fúwù děng duō xiàng gōngnéng.",
      "sentence_fr": "Cette plateforme de soins intelligents pour personnes âgées intègre plusieurs fonctions telles que surveillance de la santé, appel d'urgence et services de vie.",
      "sentence_en": "This smart elderly care platform integrates multiple functions such as health monitoring, emergency calls, and life services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_elderly_care",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传统木匠技艺注重榫卯结构,不用一钉一胶就能制作出坚固耐用的家具。",
      "sentence_pinyin": "Chuántǒng mùjiàng jìyì zhùzhòng sǔnmǎo jiégòu, bùyòng yī dīng yī jiāo jiù néng zhìzuò chū jiāngù nàiyòng de jiājù.",
      "sentence_fr": "L'artisanat traditionnel de menuiserie met l'accent sur les structures à tenon et mortaise, permettant de fabriquer des meubles solides et durables sans clou ni colle.",
      "sentence_en": "Traditional carpentry craftsmanship emphasizes mortise and tenon structures, able to create sturdy and durable furniture without a single nail or glue.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "traditional_carpentry",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款健康管理应用能够根据用户的身体数据定制个性化的运动和饮食方案。",
      "sentence_pinyin": "Zhè kuǎn jiànkāng guǎnlǐ yìngyòng nénggòu gēnjù yònghù de shēntǐ shùjù dìngzhì gèxìnghuà de yùndòng hé yǐnshí fāng'àn.",
      "sentence_fr": "Cette application de gestion de la santé peut personnaliser des programmes d'exercice et d'alimentation en fonction des données physiques de l'utilisateur.",
      "sentence_en": "This health management app can customize personalized exercise and diet programs based on users' physical data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_apps",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋牧场通过人工鱼礁建设和科学养殖,修复了受损的海洋生态系统。",
      "sentence_pinyin": "Hǎiyáng mùchǎng tōngguò réngōng yújiāo jiànshè hé kēxué yǎngzhí, xiūfùle shòusǔn de hǎiyáng shēngtài xìtǒng.",
      "sentence_fr": "Les ranchs marins ont restauré les écosystèmes océaniques endommagés grâce à la construction de récifs artificiels et à l'aquaculture scientifique.",
      "sentence_en": "Ocean ranches have restored damaged marine ecosystems through artificial reef construction and scientific aquaculture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ocean_ranching",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "面塑艺术用面粉捏制出各种栩栩如生的人物和动物造型,既能观赏又能食用。",
      "sentence_pinyin": "Miànsù yìshù yòng miànfěn niēzhì chū gèzhǒng xǔxǔ rúshēng de rénwù hé dòngwù zàoxíng, jì néng guānshǎng yòu néng shíyòng.",
      "sentence_fr": "L'art de la sculpture en pâte façonne diverses formes vivantes de personnages et d'animaux avec de la farine, à la fois décoratives et comestibles.",
      "sentence_en": "Dough sculpture art creates various lifelike human and animal figures from flour, both decorative and edible.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dough_sculpture",
      "created_at": "2025-11-20T20:35:00.000Z",
      "updated_at": "2025-11-20T20:35:00.000Z"
    }
  ]
}
