{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能窗户可以根据室外光线强度自动调节透明度,节省空调能耗。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuānghù kěyǐ gēnjù shìwài guāngxiàn qiángdù zìdòng tiáojié tòumíngdù, jiéshěng kòngtiáo néngháo.",
      "sentence_fr": "Cette fenêtre intelligente ajuste automatiquement sa transparence selon l'intensité lumineuse extérieure, économisant l'énergie de climatisation.",
      "sentence_en": "This smart window automatically adjusts its transparency based on outdoor light intensity, saving air conditioning energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_windows",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "乌孜别克族的手抓饭是他们待客的最高礼遇,用羊肉和胡萝卜烹制而成。",
      "sentence_pinyin": "Wūzībiékèzú de shǒuzhuāfàn shì tāmen dàikè de zuìgāo lǐyù, yòng yángròu hé húluóbo pēngzhì ér chéng.",
      "sentence_fr": "Le pilaf des Ouzbeks est leur plus grand honneur pour les invités, préparé avec de l'agneau et des carottes.",
      "sentence_en": "The Uzbek people's pilaf is their highest honor for guests, prepared with lamb and carrots.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "uzbek_pilaf_culture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市推行垃圾分类政策以来,居民的环保意识得到了显著提升。",
      "sentence_pinyin": "Chéngshì tuīxíng lājī fēnlèi zhèngcè yǐlái, jūmín de huánbǎo yìshí dédào le xiǎnzhù tíshēng.",
      "sentence_fr": "Depuis la mise en place de la politique de tri des déchets, la conscience environnementale des résidents s'est considérablement améliorée.",
      "sentence_en": "Since the city implemented the waste sorting policy, residents' environmental awareness has significantly improved.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "抓石子是一种传统的手眼协调游戏,考验玩家的敏捷度和反应速度。",
      "sentence_pinyin": "Zhuā shízǐ shì yī zhǒng chuántǒng de shǒu yǎn xiétiáo yóuxì, kǎoyàn wánjiā de mǐnjiédù hé fǎnyìng sùdù.",
      "sentence_fr": "Attraper les cailloux est un jeu traditionnel de coordination œil-main qui teste l'agilité et la rapidité de réaction des joueurs.",
      "sentence_en": "Catching pebbles is a traditional hand-eye coordination game that tests players' agility and reaction speed.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pebble_catching_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能烤箱配备了多种烹饪模式,还能通过语音控制调节温度和时间。",
      "sentence_pinyin": "Zhège zhìnéng kǎoxiāng pèibèi le duō zhǒng pēngrèn móshì, hái néng tōngguò yǔyīn kòngzhì tiáojié wēndù hé shíjiān.",
      "sentence_fr": "Ce four intelligent dispose de plusieurs modes de cuisson et permet de régler la température et le temps par commande vocale.",
      "sentence_en": "This smart oven features multiple cooking modes and allows voice-controlled temperature and time adjustments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_ovens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柯尔克孜族的《玛纳斯》史诗是世界上最长的史诗之一,代代口耳相传。",
      "sentence_pinyin": "Kē'ěrkèzīzú de Mǎnàsī shǐshī shì shìjiè shàng zuì cháng de shǐshī zhī yī, dàidài kǒu'ěr xiāngchuán.",
      "sentence_fr": "L'épopée Manas des Kirghiz est l'une des plus longues au monde, transmise oralement de génération en génération.",
      "sentence_en": "The Manas epic of the Kyrgyz people is one of the longest epics in the world, passed down orally through generations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kyrgyz_manas_epic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开设了免费的职业技能培训班,帮助失业人员重新就业。",
      "sentence_pinyin": "Shèqū kāishè le miǎnfèi de zhíyè jìnéng péixùnbān, bāngzhù shīyè rényuán chóngxīn jiùyè.",
      "sentence_fr": "La communauté propose des formations professionnelles gratuites pour aider les chômeurs à retrouver un emploi.",
      "sentence_en": "The community offers free vocational training classes to help unemployed people find new jobs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_job_training",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能床垫可以监测睡眠质量,并根据睡姿自动调节软硬程度。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuángdiàn kěyǐ jiāncè shuìmián zhìliàng, bìng gēnjù shuìzī zìdòng tiáojié ruǎnyìng chéngdù.",
      "sentence_fr": "Ce matelas intelligent surveille la qualité du sommeil et ajuste automatiquement sa fermeté selon la position de sommeil.",
      "sentence_en": "This smart mattress monitors sleep quality and automatically adjusts firmness based on sleeping position.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mattresses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "斗百草是古代文人雅士喜爱的游戏,比较各种草木的种类和名称。",
      "sentence_pinyin": "Dòu bǎicǎo shì gǔdài wénrén yǎshì xǐ'ài de yóuxì, bǐjiào gèzhǒng cǎomù de zhǒnglèi hé míngchēng.",
      "sentence_fr": "Le combat d'herbes était un jeu apprécié des lettrés anciens, consistant à comparer les variétés et noms de plantes.",
      "sentence_en": "Grass fighting was a game beloved by ancient scholars, comparing various types and names of plants.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grass_fighting_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "塔吉克族的鹰舞模仿雄鹰翱翔的姿态,展现了高原民族的豪迈气质。",
      "sentence_pinyin": "Tǎjíkèzú de yīngwǔ mófǎng xióng yīng áoxiáng de zītài, zhǎnxiàn le gāoyuán mínzú de háomài qìzhì.",
      "sentence_fr": "La danse de l'aigle des Tadjiks imite le vol majestueux de l'aigle, reflétant le caractère fier des peuples des hauts plateaux.",
      "sentence_en": "The eagle dance of the Tajik people imitates the soaring posture of eagles, showcasing the bold spirit of highland peoples.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tajik_eagle_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出了廉租房政策,为低收入家庭提供负担得起的住房选择。",
      "sentence_pinyin": "Zhèngfǔ tuīchū le liánzūfáng zhèngcè, wèi dī shōurù jiātíng tígōng fùdān de qǐ de zhùfáng xuǎnzé.",
      "sentence_fr": "Le gouvernement a lancé une politique de logements à loyer modéré pour offrir des options de logement abordables aux familles à faible revenu.",
      "sentence_en": "The government launched an affordable housing policy to provide low-income families with affordable housing options.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "affordable_housing_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能淋浴系统可以预设水温和出水量,还能播放音乐放松身心。",
      "sentence_pinyin": "Zhège zhìnéng línyù xìtǒng kěyǐ yùshè shuǐwēn hé chūshuǐliàng, hái néng bōfàng yīnyuè fàngsōng shēnxīn.",
      "sentence_fr": "Ce système de douche intelligent permet de prédéfinir la température et le débit d'eau, et peut diffuser de la musique pour se détendre.",
      "sentence_en": "This smart shower system can preset water temperature and flow, and can play music for relaxation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_shower_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "锡伯族至今保留着完整的满文,是研究满语的活化石民族群体。",
      "sentence_pinyin": "Xíbózú zhìjīn bǎoliú zhe wánzhěng de Mǎnwén, shì yánjiū Mǎnyǔ de huóhuàshí mínzú qúntǐ.",
      "sentence_fr": "Les Xibe ont conservé l'écriture mandchoue complète jusqu'à aujourd'hui, formant un groupe ethnique fossile vivant pour l'étude du mandchou.",
      "sentence_en": "The Xibe people have preserved the complete Manchu script to this day, serving as a living fossil ethnic group for Manchu language studies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xibe_manchu_script",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "打弹珠是几代人共同的童年回忆,虽然简单却充满了竞技乐趣。",
      "sentence_pinyin": "Dǎ dànzhū shì jǐ dài rén gòngtóng de tóngnián huíyì, suīrán jiǎndān què chōngmǎn le jìngjì lèqù.",
      "sentence_fr": "Jouer aux billes est un souvenir d'enfance partagé par plusieurs générations, simple mais plein de plaisir compétitif.",
      "sentence_en": "Playing marbles is a shared childhood memory across generations, simple yet full of competitive fun.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "marble_playing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区设立了心理咨询室,为有需要的居民提供免费的心理健康服务。",
      "sentence_pinyin": "Shèqū shèlì le xīnlǐ zīxúnshì, wèi yǒu xūyào de jūmín tígōng miǎnfèi de xīnlǐ jiànkāng fúwù.",
      "sentence_fr": "La communauté a établi un bureau de consultation psychologique pour offrir des services de santé mentale gratuits aux résidents qui en ont besoin.",
      "sentence_en": "The community has established a counseling room to provide free mental health services to residents in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_mental_health",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能冰箱可以识别食材并推荐食谱,还能提醒食物即将过期。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng bīngxiāng kěyǐ shìbié shícái bìng tuījiàn shípǔ, hái néng tíxǐng shíwù jíjiāng guòqī.",
      "sentence_fr": "Ce réfrigérateur intelligent peut identifier les ingrédients, suggérer des recettes et alerter lorsque les aliments sont sur le point de périmer.",
      "sentence_en": "This smart refrigerator can identify ingredients, recommend recipes, and alert when food is about to expire.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_refrigerators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仫佬族的依饭节是祭祀祖先和神灵的重要节日,持续三天三夜。",
      "sentence_pinyin": "Mùlǎozú de yīfàn jié shì jìsì zǔxiān hé shénlíng de zhòngyào jiérì, chíxù sān tiān sān yè.",
      "sentence_fr": "Le festival Yifan des Mulao est une fête importante de culte des ancêtres et des esprits, durant trois jours et trois nuits.",
      "sentence_en": "The Yifan Festival of the Mulao people is an important festival for worshipping ancestors and spirits, lasting three days and nights.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mulao_yifan_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市推广新能源公交车,减少了尾气排放对空气质量的影响。",
      "sentence_pinyin": "Chéngshì tuīguǎng xīn néngyuán gōngjiāochē, jiǎnshǎo le wěiqì páifàng duì kōngqì zhìliàng de yǐngxiǎng.",
      "sentence_fr": "La ville promeut les bus à énergie nouvelle, réduisant l'impact des émissions de gaz d'échappement sur la qualité de l'air.",
      "sentence_en": "The city promotes new energy buses, reducing the impact of exhaust emissions on air quality.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_energy_buses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "翻花绳是一种需要两人配合的传统游戏,可以翻出各种有趣的图案。",
      "sentence_pinyin": "Fān huāshéng shì yī zhǒng xūyào liǎng rén pèihé de chuántǒng yóuxì, kěyǐ fān chū gèzhǒng yǒuqù de tú'àn.",
      "sentence_fr": "La ficelle est un jeu traditionnel à deux joueurs permettant de créer divers motifs intéressants.",
      "sentence_en": "Cat's cradle is a traditional two-player game that can create various interesting patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cats_cradle_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "毛南族的花竹帽编织工艺精湛,是赠送给心上人的定情信物。",
      "sentence_pinyin": "Máonánzú de huā zhúmào biānzhī gōngyì jīngzhàn, shì zèngsòng gěi xīnshàngrén de dìngqíng xìnwù.",
      "sentence_fr": "L'artisanat de tissage des chapeaux de bambou fleuris des Maonan est exquis, offert comme gage d'amour à l'être aimé.",
      "sentence_en": "The Maonan people's flower bamboo hat weaving craft is exquisite, given as a token of love to sweethearts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maonan_bamboo_hats",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
