{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个数字藏品平台利用区块链技术保证艺术品的唯一性和所有权。",
      "sentence_pinyin": "Zhège shùzì cángpǐn píngtái lìyòng qūkuàiliàn jìshù bǎozhèng yìshùpǐn de wéiyīxìng hé suǒyǒuquán.",
      "sentence_fr": "Cette plateforme de collections numériques utilise la technologie blockchain pour garantir l'unicité et la propriété des œuvres d'art.",
      "sentence_en": "This digital collectibles platform uses blockchain technology to ensure the uniqueness and ownership of artworks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nft_platforms",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙的每根笙管都有簧片和音孔,通过按孔吹气来发声。",
      "sentence_pinyin": "Shēng de měi gēn shēngguǎn dōu yǒu huángpiàn hé yīnkǒng, tōngguò ànkǒng chuīqì lái fāshēng.",
      "sentence_fr": "Chaque tube du sheng a une anche et un trou sonore, produisant le son en soufflant tout en bouchant les trous.",
      "sentence_en": "Each sheng pipe has a reed and a sound hole, producing sound by blowing while covering the holes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_structure",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个无人农场利用农业机器人完成播种、施肥和收割等全部农事活动。",
      "sentence_pinyin": "Zhège wúrén nóngchǎng lìyòng nóngyè jīqìrén wánchéng bōzhǒng, shīféi hé shōugē děng quánbù nóngshì huódòng.",
      "sentence_fr": "Cette ferme sans personnel utilise des robots agricoles pour accomplir toutes les activités agricoles telles que semer, fertiliser et récolter.",
      "sentence_en": "This unmanned farm uses agricultural robots to complete all farming activities such as sowing, fertilizing, and harvesting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "unmanned_farms",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "葫芦丝的演奏姿势和指法都相对简单,适合初学者入门学习。",
      "sentence_pinyin": "Húlúsī de yǎnzòu zīshì hé zhǐfǎ dōu xiāngduì jiǎndān, shìhé chūxuézhě rùmén xuéxí.",
      "sentence_fr": "La posture de jeu et le doigté du hulusi sont relativement simples, adaptés aux débutants.",
      "sentence_en": "The playing posture and fingering of the hulusi are relatively simple, suitable for beginners to learn.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hulusi_learning",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋壳画利用鸡蛋壳作为画布,绘制出精美细腻的图案。",
      "sentence_pinyin": "Dànké huà lìyòng jīdàn ké zuòwéi huàbù, huìzhì chū jīngměi xìnì de tú'àn.",
      "sentence_fr": "La peinture sur coquille d'œuf utilise des coquilles d'œuf comme toile pour peindre des motifs fins et exquis.",
      "sentence_en": "Eggshell painting uses eggshells as canvas to paint exquisite and delicate patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "eggshell_painting",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能镜子可以显示天气、日程和健康数据,同时还能正常照镜。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng jìngzi kěyǐ xiǎnshì tiānqì, rìchéng hé jiànkāng shùjù, tóngshí hái néng zhèngcháng zhàojìng.",
      "sentence_fr": "Ce miroir intelligent peut afficher la météo, l'agenda et les données de santé tout en fonctionnant comme un miroir normal.",
      "sentence_en": "This smart mirror can display weather, schedule, and health data while still functioning as a normal mirror.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mirrors",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区公益超市为困难家庭提供低价或免费的生活必需品。",
      "sentence_pinyin": "Zhège shèqū gōngyì chāoshì wèi kùnnán jiātíng tígōng dījià huò miǎnfèi de shēnghuó bìxūpǐn.",
      "sentence_fr": "Ce supermarché communautaire caritatif offre des produits de première nécessité à bas prix ou gratuits aux familles en difficulté.",
      "sentence_en": "This community charity supermarket provides low-cost or free daily necessities to families in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity_supermarkets",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡的弓子由马尾制成,需要定期涂抹松香增加摩擦力。",
      "sentence_pinyin": "Èrhú de gōngzi yóu mǎwěi zhìchéng, xūyào dìngqī túmǒ sōngxiāng zēngjiā mócālì.",
      "sentence_fr": "L'archet de l'erhu est fait de crins de cheval et doit être régulièrement enduit de colophane pour augmenter la friction.",
      "sentence_en": "The erhu bow is made of horsehair and needs to be regularly coated with rosin to increase friction.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_maintenance",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线问诊系统利用人工智能进行初步诊断,提高了诊疗效率。",
      "sentence_pinyin": "Zhège zàixiàn wènzhěn xìtǒng lìyòng réngōng zhìnéng jìnxíng chūbù zhěnduàn, tígāole zhěnliáo xiàolǜ.",
      "sentence_fr": "Ce système de consultation en ligne utilise l'intelligence artificielle pour effectuer des diagnostics préliminaires, améliorant l'efficacité du traitement.",
      "sentence_en": "This online consultation system uses artificial intelligence for preliminary diagnosis, improving treatment efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_diagnosis",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "面人制作需要用特制的面团快速捏塑出各种人物和动物形象。",
      "sentence_pinyin": "Miànrén zhìzuò xūyào yòng tèzhì de miàntuán kuàisù niēsù chū gèzhǒng rénwù hé dòngwù xíngxiàng.",
      "sentence_fr": "La fabrication de figurines en pâte nécessite de sculpter rapidement diverses figures de personnages et d'animaux avec une pâte spéciale.",
      "sentence_en": "Dough figurine making requires quickly sculpting various human and animal figures with special dough.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dough_figurines",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能温控系统可以为每个房间设置不同的温度和湿度。",
      "sentence_pinyin": "Zhège zhìnéng wēnkòng xìtǒng kěyǐ wèi měi gè fángjiān shèzhì bùtóng de wēndù hé shīdù.",
      "sentence_fr": "Ce système de contrôle de température intelligent peut régler différentes températures et humidités pour chaque pièce.",
      "sentence_en": "This smart temperature control system can set different temperatures and humidity levels for each room.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_climate_control",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市森林公园为市民提供了亲近自然、休闲锻炼的好去处。",
      "sentence_pinyin": "Zhège chéngshì sēnlín gōngyuán wèi shìmín tígōngle qīnjìn zìrán, xiūxián duànliàn de hǎo qùchù.",
      "sentence_fr": "Ce parc forestier urbain offre aux citoyens un excellent endroit pour se rapprocher de la nature et faire de l'exercice.",
      "sentence_en": "This urban forest park provides citizens with a great place to get close to nature and exercise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_forest_parks",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古琴的演奏讲究意境深远,追求天人合一的艺术境界。",
      "sentence_pinyin": "Gǔqín de yǎnzòu jiǎngjiù yìjìng shēnyuǎn, zhuīqiú tiānrén héyī de yìshù jìngjiè.",
      "sentence_fr": "Le jeu du guqin met l'accent sur une ambiance profonde, poursuivant le royaume artistique de l'harmonie entre l'homme et la nature.",
      "sentence_en": "Guqin playing emphasizes profound artistic conception, pursuing the artistic realm of harmony between man and nature.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_philosophy",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个健康码系统在疫情防控中发挥了重要作用,方便了人员流动管理。",
      "sentence_pinyin": "Zhège jiànkāng mǎ xìtǒng zài yìqíng fángkòng zhōng fāhuīle zhòngyào zuòyòng, fāngbiànle rényuán liúdòng guǎnlǐ.",
      "sentence_fr": "Ce système de code santé a joué un rôle important dans la prévention épidémique, facilitant la gestion des déplacements de personnes.",
      "sentence_en": "This health code system played an important role in epidemic prevention, facilitating the management of population movement.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_code_systems",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "树皮画利用天然树皮的纹理和色彩,创作出独特的装饰艺术品。",
      "sentence_pinyin": "Shùpí huà lìyòng tiānrán shùpí de wénlǐ hé sècǎi, chuàngzuò chū dútè de zhuāngshì yìshùpǐn.",
      "sentence_fr": "La peinture sur écorce utilise les textures et couleurs naturelles de l'écorce pour créer des œuvres d'art décoratives uniques.",
      "sentence_en": "Bark painting uses the natural textures and colors of tree bark to create unique decorative artworks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bark_painting",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能洗衣机可以自动识别衣物材质,选择最佳洗涤程序。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xǐyījī kěyǐ zìdòng shíbié yīwù cáizhì, xuǎnzé zuìjiā xǐdí chéngxù.",
      "sentence_fr": "Cette machine à laver intelligente peut identifier automatiquement les matériaux des vêtements et sélectionner le meilleur programme de lavage.",
      "sentence_en": "This smart washing machine can automatically identify clothing materials and select the best washing program.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_washers",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个老年大学开设了书法、绘画、声乐等多种课程,丰富老年人的精神生活。",
      "sentence_pinyin": "Zhège lǎonián dàxué kāishèle shūfǎ, huìhuà, shēngyuè děng duō zhǒng kèchéng, fēngfù lǎoniánrén de jīngshén shēnghuó.",
      "sentence_fr": "Cette université pour personnes âgées propose divers cours tels que calligraphie, peinture et chant, enrichissant la vie spirituelle des personnes âgées.",
      "sentence_en": "This senior university offers various courses such as calligraphy, painting, and vocal music, enriching the spiritual life of the elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "senior_universities",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶的弹挑轮拂等技法能够表现出丰富多变的音色效果。",
      "sentence_pinyin": "Pípá de tán tiāo lún fú děng jìfǎ nénggòu biǎoxiàn chū fēngfù duōbiàn de yīnsè xiàoguǒ.",
      "sentence_fr": "Les techniques du pipa comme le pincement, le grattage, le roulement et le balayage peuvent produire des effets sonores riches et variés.",
      "sentence_en": "Pipa techniques such as plucking, picking, rolling, and brushing can produce rich and varied tonal effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_techniques",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个云端存储服务为用户提供了安全可靠的数据备份和同步功能。",
      "sentence_pinyin": "Zhège yúnduān cúnchǔ fúwù wèi yònghù tígōngle ānquán kěkào de shùjù bèifèn hé tóngbù gōngnéng.",
      "sentence_fr": "Ce service de stockage cloud offre aux utilisateurs des fonctions de sauvegarde et de synchronisation de données sûres et fiables.",
      "sentence_en": "This cloud storage service provides users with safe and reliable data backup and synchronization functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_storage",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "皮影的制作需要经过选皮、雕刻、上色和组装等多道工序。",
      "sentence_pinyin": "Píyǐng de zhìzuò xūyào jīngguò xuǎnpí, diāokè, shàngsè hé zǔzhuāng děng duō dào gōngxù.",
      "sentence_fr": "La fabrication de marionnettes d'ombres nécessite plusieurs étapes telles que la sélection de la peau, la sculpture, la coloration et l'assemblage.",
      "sentence_en": "Shadow puppet making requires multiple steps such as leather selection, carving, coloring, and assembly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shadow_puppet_making",
      "created_at": "2025-11-20T21:25:00.000Z",
      "updated_at": "2025-11-20T21:25:00.000Z"
    }
  ]
}
