{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子SWAP门交换两个量子比特的状态。",
      "sentence_pinyin": "Liàngzǐ SWAP mén jiāohuàn liǎng gè liàngzǐ bǐtè de zhuàngtài.",
      "sentence_fr": "La porte SWAP quantique échange les états de deux qubits.",
      "sentence_en": "Quantum SWAP gate exchanges the states of two qubits.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "swap_gate",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识提取器从交互协议中提取证明者的秘密知识。",
      "sentence_pinyin": "Zhīshì tíqǔqì cóng jiāohù xiéyì zhōng tíqǔ zhèngmíngzhě de mìmì zhīshì.",
      "sentence_fr": "Les extracteurs de connaissance extraient la connaissance secrète du prouveur des protocoles interactifs.",
      "sentence_en": "Knowledge extractors extract the prover's secret knowledge from interactive protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "knowledge_extractors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "最大不动点定义余归纳类型捕捉潜在无限行为。",
      "sentence_pinyin": "Zuìdà bùdòngdiǎn dìngyì yú guīnà lèixíng bǔzhuō qiánzài wúxiàn xíngwéi.",
      "sentence_fr": "Les plus grands points fixes définissent les types coinductifs capturant les comportements potentiellement infinis.",
      "sentence_en": "Greatest fixed points define coinductive types capturing potentially infinite behaviors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "greatest_fixed_points",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "克莱因瓶是无法嵌入三维空间的四维非定向曲面。",
      "sentence_pinyin": "Kèláiyīn píng shì wúfǎ qiànrù sānwéi kōngjiān de sìwéi fēi dìngxiàng qūmiàn.",
      "sentence_fr": "La bouteille de Klein est une surface non orientable en quatre dimensions qui ne peut pas être intégrée dans un espace tridimensionnel.",
      "sentence_en": "Klein bottle is a four-dimensional non-orientable surface that cannot be embedded in three-dimensional space.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "klein_bottle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子Toffoli门是可逆计算中的通用三量子比特门。",
      "sentence_pinyin": "Liàngzǐ Toffoli mén shì kě nì jìsuàn zhōng de tōngyòng sān liàngzǐ bǐtè mén.",
      "sentence_fr": "La porte Toffoli quantique est une porte universelle à trois qubits en calcul réversible.",
      "sentence_en": "Quantum Toffoli gate is a universal three-qubit gate in reversible computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "toffoli_gate",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识模拟器生成与真实交互不可区分的模拟视图。",
      "sentence_pinyin": "Líng zhīshì mónǐqì shēngchéng yǔ zhēnshí jiāohù bùkě qūfēn de mónǐ shìtú.",
      "sentence_fr": "Les simulateurs à connaissance nulle génèrent des vues simulées indistinguables des interactions réelles.",
      "sentence_en": "Zero-knowledge simulators generate simulated views indistinguishable from real interactions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "zk_simulators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型宇宙分层避免类型论中的悖论。",
      "sentence_pinyin": "Lèixíng yǔzhòu fēncéng bìmiǎn lèixíng lùn zhōng de bèilùn.",
      "sentence_fr": "La stratification des univers de types évite les paradoxes en théorie des types.",
      "sentence_en": "Type universe stratification avoids paradoxes in type theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universe_stratification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同调类代表拓扑空间中同等级洞的等价类。",
      "sentence_pinyin": "Tóngdiào lèi dàibiǎo tuòpū kōngjiān zhōng tóng děngjí dòng de děngjià lèi.",
      "sentence_fr": "Les classes d'homologie représentent des classes d'équivalence de trous de même dimension dans les espaces topologiques.",
      "sentence_en": "Homology classes represent equivalence classes of holes of the same dimension in topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homology_classes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子哈达玛门创建均匀叠加态是量子算法的基础。",
      "sentence_pinyin": "Liàngzǐ Hādámǎ mén chuàngjiàn jūnyún diéjiā tài shì liàngzǐ suànfǎ de jīchǔ.",
      "sentence_fr": "La porte de Hadamard quantique créant des états de superposition uniforme est fondamentale pour les algorithmes quantiques.",
      "sentence_en": "Quantum Hadamard gate creating uniform superposition states is fundamental to quantum algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hadamard_gate",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可靠性承诺保证承诺打开后的值与原始承诺一致。",
      "sentence_pinyin": "Kěkàoxìng chéngnuò bǎozhèng chéngnuò dǎkāi hòu de zhí yǔ yuánshǐ chéngnuò yīzhì.",
      "sentence_fr": "L'engagement fiable garantit que la valeur révélée correspond à l'engagement original.",
      "sentence_en": "Binding commitment guarantees the revealed value matches the original commitment.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "binding_commitment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型的规范化确保类型表达式具有唯一的规范形式。",
      "sentence_pinyin": "Lèixíng de guīfànhuà quèbǎo lèixíng biǎodáshì jùyǒu wéiyī de guīfàn xíngshì.",
      "sentence_fr": "La normalisation des types garantit que les expressions de type ont une forme canonique unique.",
      "sentence_en": "Type normalization ensures type expressions have a unique canonical form.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_normalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "上同调环结构编码拓扑空间的乘法信息。",
      "sentence_pinyin": "Shàng tóngdiào huán jiégòu biānmǎ tuòpū kōngjiān de chéngfǎ xìnxī.",
      "sentence_fr": "La structure d'anneau de cohomologie encode les informations multiplicatives des espaces topologiques.",
      "sentence_en": "Cohomology ring structure encodes multiplicative information of topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cohomology_ring",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子相位门对量子态引入可控的相位旋转。",
      "sentence_pinyin": "Liàngzǐ xiàngwèi mén duì liàngzǐ tài yǐnrù kěkòng de xiàngwèi xuánzhuǎn.",
      "sentence_fr": "Les portes de phase quantiques introduisent des rotations de phase contrôlables sur les états quantiques.",
      "sentence_en": "Quantum phase gates introduce controllable phase rotations on quantum states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "phase_gates",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "隐藏性承诺保证承诺不泄露被承诺值的信息。",
      "sentence_pinyin": "Yǐncángxìng chéngnuò bǎozhèng chéngnuò bù xièlòu bèi chéngnuò zhí de xìnxī.",
      "sentence_fr": "L'engagement cachant garantit que l'engagement ne révèle pas d'information sur la valeur engagée.",
      "sentence_en": "Hiding commitment guarantees commitment reveals no information about committed value.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hiding_commitment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型的可判定性决定类型等价性能否算法判定。",
      "sentence_pinyin": "Lèixíng de kě pàndìngxìng juédìng lèixíng děngjià xìng néng fǒu suànfǎ pàndìng.",
      "sentence_fr": "La décidabilité des types détermine si l'équivalence de type peut être décidée algorithmiquement.",
      "sentence_en": "Type decidability determines whether type equivalence can be algorithmically decided.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_decidability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "万有同伦等价是同伦理论中的核心构造。",
      "sentence_pinyin": "Wànyǒu tónglún děngjià shì tónglún lǐlùn zhōng de héxīn gòuzào.",
      "sentence_fr": "L'équivalence d'homotopie universelle est une construction centrale en théorie de l'homotopie.",
      "sentence_en": "Universal homotopy equivalence is a central construction in homotopy theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_homotopy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子测量反馈利用测量结果动态调整后续操作。",
      "sentence_pinyin": "Liàngzǐ cèliáng fǎnkuì lìyòng cèliáng jiéguǒ dòngtài tiáozhěng hòuxù cāozuò.",
      "sentence_fr": "Le retour de mesure quantique utilise les résultats de mesure pour ajuster dynamiquement les opérations suivantes.",
      "sentence_en": "Quantum measurement feedback uses measurement results to dynamically adjust subsequent operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "measurement_feedback",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全归约将新协议的安全性归结到已知困难问题。",
      "sentence_pinyin": "Ānquán guīyuē jiāng xīn xiéyì de ānquánxìng guījié dào yǐzhī kùnnán wèntí.",
      "sentence_fr": "Les réductions de sécurité ramènent la sécurité de nouveaux protocoles à des problèmes difficiles connus.",
      "sentence_en": "Security reductions reduce new protocol security to known hard problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "security_reductions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "强归一化保证所有良类型项的求值都会终止。",
      "sentence_pinyin": "Qiáng guīyīhuà bǎozhèng suǒyǒu liáng lèixíng xiàng de qiúzhí dōu huì zhōngzhǐ.",
      "sentence_fr": "La normalisation forte garantit que l'évaluation de tous les termes bien typés se termine.",
      "sentence_en": "Strong normalization guarantees evaluation of all well-typed terms terminates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "strong_normalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑不变量在同胚变换下保持不变。",
      "sentence_pinyin": "Tuòpū bùbiànliàng zài tóngpēi biànhuàn xià bǎochí bù biàn.",
      "sentence_fr": "Les invariants topologiques restent inchangés sous les transformations homéomorphes.",
      "sentence_en": "Topological invariants remain unchanged under homeomorphic transformations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_invariants",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
