{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "随着人工智能技术的不断发展,越来越多的传统行业正在经历深刻的数字化转型。",
      "sentence_pinyin": "Suízhe réngōng zhìnéng jìshù de bùduàn fāzhǎn, yuèláiyuè duō de chuántǒng hángyè zhèngzài jīnglì shēnkè de shùzìhuà zhuǎnxíng.",
      "sentence_fr": "Avec le développement continu de l'intelligence artificielle, de plus en plus d'industries traditionnelles connaissent une profonde transformation numérique.",
      "sentence_en": "With the continuous development of artificial intelligence technology, more and more traditional industries are undergoing profound digital transformation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_transformation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位著名经济学家的研究表明,收入不平等会对社会流动性产生长期负面影响。",
      "sentence_pinyin": "Zhè wèi zhùmíng jīngjìxuéjiā de yánjiū biǎomíng, shōurù bù píngděng huì duì shèhuì liúdòngxìng chǎnshēng chángqī fùmiàn yǐngxiǎng.",
      "sentence_fr": "Les recherches de cet économiste renommé montrent que l'inégalité des revenus a des effets négatifs à long terme sur la mobilité sociale.",
      "sentence_en": "This renowned economist's research shows that income inequality has long-term negative effects on social mobility.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "economic_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传统中医强调辨证施治的理念,根据患者的具体情况制定个性化的治疗方案。",
      "sentence_pinyin": "Chuántǒng zhōngyī qiángdiào biànzhèng shīzhì de lǐniàn, gēnjù huànzhě de jùtǐ qíngkuàng zhìdìng gèxìnghuà de zhìliáo fāng'àn.",
      "sentence_fr": "La médecine traditionnelle chinoise met l'accent sur le concept de diagnostic différentiel, établissant des plans de traitement personnalisés selon la situation spécifique du patient.",
      "sentence_en": "Traditional Chinese medicine emphasizes the concept of differential diagnosis and treatment, formulating personalized treatment plans based on each patient's specific situation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "traditional_chinese_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片深入探讨了城市化进程中传统村落文化保护面临的挑战与机遇。",
      "sentence_pinyin": "Zhè bù jìlùpiàn shēnrù tàntǎo le chéngshìhuà jìnchéng zhōng chuántǒng cūnluò wénhuà bǎohù miànlín de tiǎozhàn yǔ jīyù.",
      "sentence_fr": "Ce documentaire explore en profondeur les défis et opportunités de la préservation de la culture villageoise traditionnelle face à l'urbanisation.",
      "sentence_en": "This documentary deeply explores the challenges and opportunities facing traditional village cultural preservation in the process of urbanization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_preservation_documentary",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "气候变化导致的极端天气事件频发,迫使各国政府重新审视环境保护政策。",
      "sentence_pinyin": "Qìhòu biànhuà dǎozhì de jíduān tiānqì shìjiàn pínfā, pòshǐ gèguó zhèngfǔ chóngxīn shěnshì huánjìng bǎohù zhèngcè.",
      "sentence_fr": "La fréquence accrue des événements météorologiques extrêmes dus au changement climatique oblige les gouvernements à revoir leurs politiques environnementales.",
      "sentence_en": "The increasing frequency of extreme weather events caused by climate change is forcing governments to reassess environmental protection policies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "climate_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现代量子计算技术的突破有望彻底改变密码学和信息安全领域的格局。",
      "sentence_pinyin": "Xiàndài liàngzǐ jìsuàn jìshù de tūpò yǒuwàng chèdǐ gǎibiàn mìmǎxué hé xìnxī ānquán lǐngyù de géjú.",
      "sentence_fr": "Les percées dans la technologie de l'informatique quantique moderne sont susceptibles de transformer radicalement les domaines de la cryptographie et de la sécurité de l'information.",
      "sentence_en": "Breakthroughs in modern quantum computing technology are poised to fundamentally transform the landscape of cryptography and information security.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位年轻企业家凭借其创新的商业模式成功吸引了数亿美元的风险投资。",
      "sentence_pinyin": "Zhè wèi niánqīng qǐyèjiā píngjie qí chuàngxīn de shāngyè móshì chénggōng xīyǐn le shù yì měiyuán de fēngxiǎn tóuzī.",
      "sentence_fr": "Ce jeune entrepreneur a réussi à attirer des centaines de millions de dollars en capital-risque grâce à son modèle commercial innovant.",
      "sentence_en": "This young entrepreneur successfully attracted hundreds of millions of dollars in venture capital with their innovative business model.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "venture_capital",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经科学的最新研究发现,长期冥想练习可以改变大脑结构并增强认知功能。",
      "sentence_pinyin": "Shénjīng kēxué de zuìxīn yánjiū fāxiàn, chángqī míngxiǎng liànxí kěyǐ gǎibiàn dànǎo jiégòu bìng zēngqiáng rènzhī gōngnéng.",
      "sentence_fr": "Les dernières recherches en neurosciences révèlent que la pratique régulière de la méditation peut modifier la structure cérébrale et améliorer les fonctions cognitives.",
      "sentence_en": "The latest neuroscience research finds that long-term meditation practice can change brain structure and enhance cognitive function.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroscience_meditation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球供应链的脆弱性在疫情期间暴露无遗,促使企业重新思考生产布局策略。",
      "sentence_pinyin": "Quánqiú gōngyìngliàn de cuìruòxìng zài yìqíng qījiān bàolù wúyí, cùshǐ qǐyè chóngxīn sīkǎo shēngchǎn bùjú cèlüè.",
      "sentence_fr": "La fragilité des chaînes d'approvisionnement mondiales a été pleinement exposée pendant la pandémie, poussant les entreprises à repenser leurs stratégies de production.",
      "sentence_en": "The vulnerability of global supply chains was fully exposed during the pandemic, prompting companies to rethink their production layout strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supply_chain_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这场关于基因编辑伦理问题的辩论引发了科学界和公众的广泛关注与讨论。",
      "sentence_pinyin": "Zhè chǎng guānyú jīyīn biānjí lúnlǐ wèntí de biànlùn yǐnfā le kēxuéjiè hé gōngzhòng de guǎngfàn guānzhù yǔ tǎolùn.",
      "sentence_fr": "Ce débat sur les questions éthiques de l'édition génétique a suscité une attention et une discussion généralisées dans la communauté scientifique et le public.",
      "sentence_en": "This debate on the ethical issues of gene editing has sparked widespread attention and discussion among scientists and the public.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bioethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市规划专家建议采用混合用途开发模式来打造更具活力的社区环境。",
      "sentence_pinyin": "Chéngshì guīhuà zhuānjiā jiànyì cǎiyòng hùnhé yòngtú kāifā móshì lái dǎzào gèng jù huólì de shèqū huánjìng.",
      "sentence_fr": "Les experts en urbanisme recommandent d'adopter un modèle de développement à usage mixte pour créer des environnements communautaires plus dynamiques.",
      "sentence_en": "Urban planning experts suggest adopting mixed-use development models to create more vibrant community environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可再生能源的成本持续下降,使其在与传统化石燃料的竞争中越来越具优势。",
      "sentence_pinyin": "Kě zàishēng néngyuán de chéngběn chíxù xiàjiàng, shǐ qí zài yǔ chuántǒng huàshí ránliào de jìngzhēng zhōng yuèláiyuè jù yōushì.",
      "sentence_fr": "La baisse continue du coût des énergies renouvelables les rend de plus en plus compétitives face aux combustibles fossiles traditionnels.",
      "sentence_en": "The continuously decreasing cost of renewable energy is making it increasingly competitive against traditional fossil fuels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "renewable_energy_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位心理学教授的研究揭示了社交媒体使用与青少年心理健康之间的复杂关系。",
      "sentence_pinyin": "Zhè wèi xīnlǐxué jiàoshòu de yánjiū jiēshì le shèjiāo méitǐ shǐyòng yǔ qīngshàonián xīnlǐ jiànkāng zhījiān de fùzá guānxì.",
      "sentence_fr": "Les recherches de ce professeur de psychologie révèlent la relation complexe entre l'utilisation des réseaux sociaux et la santé mentale des adolescents.",
      "sentence_en": "This psychology professor's research reveals the complex relationship between social media use and adolescent mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_media_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨国公司在进入新市场时需要充分了解当地的法律法规和文化习俗。",
      "sentence_pinyin": "Kuàguó gōngsī zài jìnrù xīn shìchǎng shí xūyào chōngfèn liǎojiě dāngdì de fǎlǜ fǎguī hé wénhuà xísú.",
      "sentence_fr": "Les multinationales doivent bien comprendre les lois, réglementations et coutumes culturelles locales lorsqu'elles pénètrent de nouveaux marchés.",
      "sentence_en": "Multinational corporations need to thoroughly understand local laws, regulations, and cultural customs when entering new markets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_business",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项突破性的医学研究为攻克某些遗传性疾病提供了新的治疗思路。",
      "sentence_pinyin": "Zhè xiàng tūpòxìng de yīxué yánjiū wèi gōngkè mǒuxiē yíchuánxìng jíbìng tígōng le xīn de zhìliáo sīlù.",
      "sentence_fr": "Cette recherche médicale révolutionnaire offre de nouvelles pistes de traitement pour vaincre certaines maladies génétiques.",
      "sentence_en": "This groundbreaking medical research provides new treatment approaches for overcoming certain genetic diseases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "genetic_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "大数据分析技术的应用正在帮助零售企业更精准地预测消费者需求变化。",
      "sentence_pinyin": "Dà shùjù fēnxī jìshù de yìngyòng zhèngzài bāngzhù língshòu qǐyè gèng jīngzhǔn de yùcè xiāofèizhě xūqiú biànhuà.",
      "sentence_fr": "L'application des technologies d'analyse de big data aide les entreprises de vente au détail à prédire plus précisément les changements dans la demande des consommateurs.",
      "sentence_en": "The application of big data analytics is helping retail companies more accurately predict changes in consumer demand.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "retail_analytics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座历史悠久的古城成功地将文化遗产保护与现代旅游业发展相结合。",
      "sentence_pinyin": "Zhè zuò lìshǐ yōujiǔ de gǔchéng chénggōng de jiāng wénhuà yíchǎn bǎohù yǔ xiàndài lǚyóuyè fāzhǎn xiāng jiéhé.",
      "sentence_fr": "Cette ancienne ville historique a réussi à combiner la préservation du patrimoine culturel avec le développement du tourisme moderne.",
      "sentence_en": "This historic ancient city has successfully combined cultural heritage preservation with modern tourism development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "heritage_tourism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "金融科技的快速发展正在重塑传统银行业的服务模式和竞争格局。",
      "sentence_pinyin": "Jīnróng kējì de kuàisù fāzhǎn zhèngzài chóngsù chuántǒng yínhángyè de fúwù móshì hé jìngzhēng géjú.",
      "sentence_fr": "Le développement rapide de la fintech remodèle les modèles de service et le paysage concurrentiel de la banque traditionnelle.",
      "sentence_en": "The rapid development of fintech is reshaping the service models and competitive landscape of traditional banking.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fintech_banking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境保护主义者呼吁政府采取更严格的措施来遏制塑料污染问题。",
      "sentence_pinyin": "Huánjìng bǎohùzhǔyìzhě hūyù zhèngfǔ cǎiqǔ gèng yángé de cuòshī lái èzhì sùliào wūrǎn wèntí.",
      "sentence_fr": "Les écologistes appellent le gouvernement à prendre des mesures plus strictes pour endiguer le problème de la pollution plastique.",
      "sentence_en": "Environmentalists are calling on the government to take stricter measures to curb the plastic pollution problem.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plastic_pollution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
