{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个乡村旅游示范村打造了民宿、采摘和农事体验等特色项目。",
      "sentence_pinyin": "Zhège xiāngcūn lǚyóu shìfàn cūn dǎzàole mínsù, cǎizhāi hé nóngshì tǐyàn děng tèsè xiàngmù.",
      "sentence_fr": "Ce village modèle de tourisme rural a développé des projets caractéristiques comme les maisons d'hôtes, la cueillette et les expériences agricoles.",
      "sentence_en": "This rural tourism model village developed characteristic projects such as homestays, fruit picking, and farming experiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_tourism",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在黄梅戏表演中以细腻的表演和优美的唱腔打动了观众。",
      "sentence_pinyin": "Tā zài huángméixì biǎoyǎn zhōng yǐ xìnì de biǎoyǎn hé yōuměi de chàngqiāng dǎdòngle guānzhòng.",
      "sentence_fr": "Dans sa performance d'opéra Huangmei, elle a touché le public avec un jeu délicat et une voix belle.",
      "sentence_en": "In her Huangmei Opera performance, she touched the audience with delicate acting and beautiful singing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huangmei_opera",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能抄表系统实现了水电气表的自动抄读和数据分析。",
      "sentence_pinyin": "Zhège zhìnéng chāobiǎo xìtǒng shíxiànle shuǐdiànqì biǎo de zìdòng chāodú hé shùjù fēnxī.",
      "sentence_fr": "Ce système de lecture automatique de compteurs réalise la lecture automatique et l'analyse des données des compteurs d'eau, d'électricité et de gaz.",
      "sentence_en": "This smart meter reading system achieves automatic reading and data analysis of water, electricity, and gas meters.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "automatic_meter_reading",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在民间故事整理中收集了大量珍贵的口头文学资料。",
      "sentence_pinyin": "Tā zài mínjiān gùshi zhěnglǐ zhōng shōujíle dàliàng zhēnguì de kǒutóu wénxué zīliào.",
      "sentence_fr": "Dans la compilation de contes populaires, il a collecté un grand nombre de précieux matériaux de littérature orale.",
      "sentence_en": "In folk tale compilation, he collected a large amount of precious oral literature materials.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "folklore_collection",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个孤独症儿童康复中心采用专业的干预训练方法帮助孩子成长。",
      "sentence_pinyin": "Zhège gūdúzhèng értóng kāngfù zhōngxīn cǎiyòng zhuānyè de gānyù xùnliàn fāngfǎ bāngzhù háizi chéngzhǎng.",
      "sentence_fr": "Ce centre de réadaptation pour enfants autistes adopte des méthodes d'intervention et de formation professionnelles pour aider les enfants à grandir.",
      "sentence_en": "This autism children's rehabilitation center adopts professional intervention and training methods to help children grow.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "autism_centers",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的书籍装帧设计将传统工艺与现代审美完美结合。",
      "sentence_pinyin": "Tā de shūjí zhuāngzhēn shèjì jiāng chuántǒng gōngyì yǔ xiàndài shěnměi wánměi jiéhé.",
      "sentence_fr": "Sa conception de reliure de livres combine parfaitement l'artisanat traditionnel et l'esthétique moderne.",
      "sentence_en": "Her book binding design perfectly combines traditional craftsmanship and modern aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "book_binding",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个湖泊生态修复工程净化了水质并恢复了水生生物多样性。",
      "sentence_pinyin": "Zhège húpō shēngtài xiūfù gōngchéng jìnghuàle shuǐzhì bìng huīfùle shuǐshēng shēngwù duōyàngxìng.",
      "sentence_fr": "Ce projet de restauration écologique du lac a purifié la qualité de l'eau et restauré la biodiversité aquatique.",
      "sentence_en": "This lake ecological restoration project purified water quality and restored aquatic biodiversity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lake_restoration",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在滑翔伞运动中体验了自由翱翔天空的快乐和刺激。",
      "sentence_pinyin": "Tā zài huáxiángshǎn yùndòng zhōng tǐyànle zìyóu áoxiáng tiānkōng de kuàilè hé cìjī.",
      "sentence_fr": "Dans le parapente, il a vécu le bonheur et l'excitation de voler librement dans le ciel.",
      "sentence_en": "In paragliding, he experienced the joy and thrill of flying freely in the sky.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "paragliding",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个红十字会救护站为社区居民提供了急救培训和医疗救助。",
      "sentence_pinyin": "Zhège hóngshízìhuì jiùhù zhàn wèi shèqū jūmín tígōngle jíjiù péixùn hé yīliáo jiùzhù.",
      "sentence_fr": "Ce poste de secours de la Croix-Rouge fournit une formation aux premiers secours et une assistance médicale aux résidents de la communauté.",
      "sentence_en": "This Red Cross aid station provides first aid training and medical assistance to community residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "red_cross_stations",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在棕编工艺中编织出了精致实用的日常生活用品。",
      "sentence_pinyin": "Tā zài zōngbiān gōngyì zhōng biānzhī chūle jīngzhì shíyòng de rìcháng shēnghuó yòngpǐn.",
      "sentence_fr": "Dans l'artisanat de tressage de palmier, elle a tissé des articles de la vie quotidienne raffinés et pratiques.",
      "sentence_en": "In palm weaving craftsmanship, she wove refined and practical daily living items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "palm_weaving",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能门锁支持指纹、密码和刷卡等多种开锁方式。",
      "sentence_pinyin": "Zhège zhìnéng ménsuǒ zhīchí zhǐwén, mìmǎ hé shuākǎ děng duō zhǒng kāisuǒ fāngshì.",
      "sentence_fr": "Cette serrure intelligente prend en charge plusieurs méthodes de déverrouillage comme les empreintes digitales, les mots de passe et les cartes.",
      "sentence_en": "This smart door lock supports multiple unlocking methods such as fingerprints, passwords, and card swiping.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_locks",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在三弦演奏中展现了粗犷豪放的音乐风格和扎实的技巧。",
      "sentence_pinyin": "Tā zài sānxián yǎnzòu zhōng zhǎnxiànle cūguǎng háofàng de yīnyuè fēnggé hé zhāshi de jìqiǎo.",
      "sentence_fr": "Il a démontré un style musical vigoureux et audacieux et des techniques solides dans son jeu de sanxian.",
      "sentence_en": "He demonstrated a vigorous and bold musical style and solid techniques in his sanxian performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sanxian_music",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职业病防治中心为高危行业从业者提供健康监护服务。",
      "sentence_pinyin": "Zhège zhíyèbìng fángzhì zhōngxīn wèi gāowēi hángyè cóngyèzhě tígōng jiànkāng jiānhù fúwù.",
      "sentence_fr": "Ce centre de prévention des maladies professionnelles fournit des services de surveillance de santé aux travailleurs des industries à haut risque.",
      "sentence_en": "This occupational disease prevention center provides health monitoring services to high-risk industry workers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "occupational_disease",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的观念摄影作品用影像传达了对社会现象的批判性思考。",
      "sentence_pinyin": "Tā de guānniàn shèyǐng zuòpǐn yòng yǐngxiàng chuándále duì shèhuì xiànxiàng de pīpànxìng sīkǎo.",
      "sentence_fr": "Ses œuvres de photographie conceptuelle transmettent une réflexion critique sur les phénomènes sociaux à travers les images.",
      "sentence_en": "Her conceptual photography works convey critical thinking about social phenomena through images.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "conceptual_photography",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个霾污染监测系统分析PM2.5浓度和空气污染成因。",
      "sentence_pinyin": "Zhège mái wūrǎn jiāncè xìtǒng fēnxī PM2.5 nóngdù hé kōngqì wūrǎn chéngyīn.",
      "sentence_fr": "Ce système de surveillance de la pollution par le smog analyse la concentration de PM2.5 et les causes de la pollution atmosphérique.",
      "sentence_en": "This smog pollution monitoring system analyzes PM2.5 concentration and causes of air pollution.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smog_monitoring",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在音频编辑工作中处理了录音的降噪、均衡和压缩。",
      "sentence_pinyin": "Tā zài yīnpín biānjí gōngzuò zhōng chǔlǐle lùyīn de jiàngzào, jūnhéng hé yāsuō.",
      "sentence_fr": "Dans son travail d'édition audio, il a traité la réduction du bruit, l'égalisation et la compression des enregistrements.",
      "sentence_en": "In his audio editing work, he handled noise reduction, equalization, and compression of recordings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "audio_editing",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个时间银行项目鼓励志愿者用服务时间换取养老服务。",
      "sentence_pinyin": "Zhège shíjiān yínháng xiàngmù gǔlì zhìyuànzhě yòng fúwù shíjiān huànqǔ yǎnglǎo fúwù.",
      "sentence_fr": "Ce projet de banque du temps encourage les bénévoles à échanger du temps de service contre des services de soins aux personnes âgées.",
      "sentence_en": "This time bank project encourages volunteers to exchange service time for elderly care services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "time_banking",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在单板滑雪比赛中展现了潇洒的动作和出色的平衡能力。",
      "sentence_pinyin": "Tā zài dānbǎn huáxuě bǐsài zhōng zhǎnxiànle xiāosǎ de dòngzuò hé chūsè de pínghéng nénglì.",
      "sentence_fr": "Elle a démontré des mouvements élégants et une excellente capacité d'équilibre lors de la compétition de snowboard.",
      "sentence_en": "She demonstrated stylish movements and excellent balance ability in the snowboard competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "snowboarding",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创新创业孵化园为初创团队提供了全方位的创业支持。",
      "sentence_pinyin": "Zhège chuàngxīn chuàngyè fūhuà yuán wèi chūchuàng tuánduì tígōngle quánfāngwèi de chuàngyè zhīchí.",
      "sentence_fr": "Ce parc d'incubation d'innovation et d'entrepreneuriat fournit un soutien entrepreneurial complet aux équipes de startups.",
      "sentence_en": "This innovation and entrepreneurship incubation park provides comprehensive entrepreneurial support to startup teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startup_parks",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在铁艺制作中锻打焊接出了美观实用的铁艺装饰品。",
      "sentence_pinyin": "Tā zài tiěyì zhìzuò zhōng duàndǎ hànjiē chūle měiguān shíyòng de tiěyì zhuāngshìpǐn.",
      "sentence_fr": "Dans la fabrication de ferronnerie, il a forgé et soudé des décorations en fer esthétiquement agréables et pratiques.",
      "sentence_en": "In ironwork making, he forged and welded aesthetically pleasing and practical iron decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ironwork",
      "created_at": "2025-11-20T20:05:00.000Z",
      "updated_at": "2025-11-20T20:05:00.000Z"
    }
  ]
}
