{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "社会比较理论解释了人们如何通过与他人比较来评估自己的能力和观点。",
      "sentence_pinyin": "Shèhuì bǐjiào lǐlùn jiěshì le rénmen rúhé tōngguò yǔ tārén bǐjiào lái pínggū zìjǐ de nénglì hé guāndiǎn.",
      "sentence_fr": "La théorie de la comparaison sociale explique comment les gens évaluent leurs propres capacités et opinions en se comparant aux autres.",
      "sentence_en": "Social comparison theory explains how people evaluate their own abilities and opinions by comparing themselves to others.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_comparison_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同位素示踪技术帮助科学家追踪地球化学循环和生态系统物质流动。",
      "sentence_pinyin": "Tóngwèisù shìzōng jìshù bāngzhù kēxué jiā zhuīzōng dìqiú huàxué xúnhuán hé shēngtài xìtǒng wùzhì liúdòng.",
      "sentence_fr": "Les techniques de traçage isotopique aident les scientifiques à suivre les cycles géochimiques et les flux de matière dans les écosystèmes.",
      "sentence_en": "Isotope tracing techniques help scientists track geochemical cycles and material flows in ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "isotope_tracing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沉浸式新闻将虚拟现实技术应用于新闻报道以增强观众的情感连接。",
      "sentence_pinyin": "Chénjìn shì xīnwén jiāng xūnǐ xiànshí jìshù yìngyòng yú xīnwén bàodào yǐ zēngqiáng guānzhòng de qínggǎn liánjiē.",
      "sentence_fr": "Le journalisme immersif applique la technologie de réalité virtuelle aux reportages pour renforcer la connexion émotionnelle du public.",
      "sentence_en": "Immersive journalism applies virtual reality technology to news reporting to enhance audience emotional connection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immersive_journalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多组学整合分析结合基因组、转录组和蛋白质组数据以全面理解生物系统。",
      "sentence_pinyin": "Duō zǔ xué zhěnghé fēnxī jiéhé jīyīn zǔ, zhuǎnlù zǔ hé dànbáizhì zǔ shùjù yǐ quánmiàn lǐjiě shēngwù xìtǒng.",
      "sentence_fr": "L'analyse intégrative multi-omique combine les données génomiques, transcriptomiques et protéomiques pour comprendre de manière exhaustive les systèmes biologiques.",
      "sentence_en": "Multi-omics integrative analysis combines genomic, transcriptomic, and proteomic data to comprehensively understand biological systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multi_omics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市物流优化对于减少配送车辆排放和交通拥堵至关重要。",
      "sentence_pinyin": "Chéngshì wùliú yōuhuà duìyú jiǎnshǎo pèisòng chēliàng páifàng hé jiāotōng yōngdǔ zhìguān zhòngyào.",
      "sentence_fr": "L'optimisation de la logistique urbaine est cruciale pour réduire les émissions des véhicules de livraison et la congestion du trafic.",
      "sentence_en": "Urban logistics optimization is crucial for reducing delivery vehicle emissions and traffic congestion.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_logistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "集体记忆研究探讨社会群体如何共同构建和维护关于过去的叙事。",
      "sentence_pinyin": "Jítǐ jìyì yánjiū tàntǎo shèhuì qúntǐ rúhé gòngtóng jiàngòu hé wéihù guānyú guòqù de xùshì.",
      "sentence_fr": "La recherche sur la mémoire collective explore comment les groupes sociaux construisent et maintiennent collectivement des récits sur le passé.",
      "sentence_en": "Collective memory research explores how social groups collectively construct and maintain narratives about the past.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "collective_memory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分子模拟技术帮助药物研发人员预测药物与靶点蛋白的相互作用。",
      "sentence_pinyin": "Fēnzǐ mónǐ jìshù bāngzhù yàowù yánfā rényuán yùcè yàowù yǔ bǎdiǎn dànbái de xiānghù zuòyòng.",
      "sentence_fr": "Les techniques de simulation moléculaire aident les développeurs de médicaments à prédire les interactions entre les médicaments et les protéines cibles.",
      "sentence_en": "Molecular simulation techniques help drug developers predict interactions between drugs and target proteins.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "molecular_simulation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "众筹平台为创新项目和创业者提供了传统融资渠道的替代选择。",
      "sentence_pinyin": "Zhòngchóu píngtái wèi chuàngxīn xiàngmù hé chuàngyè zhě tígōng le chuántǒng róngzī qúdào de tìdài xuǎnzé.",
      "sentence_fr": "Les plateformes de financement participatif offrent aux projets innovants et aux entrepreneurs des alternatives aux canaux de financement traditionnels.",
      "sentence_en": "Crowdfunding platforms provide innovative projects and entrepreneurs with alternatives to traditional financing channels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "crowdfunding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土壤碳固存潜力使农业成为应对气候变化的重要解决方案。",
      "sentence_pinyin": "Tǔrǎng tàn gù cún qiánlì shǐ nóngyè chéngwéi yìngduì qìhòu biànhuà de zhòngyào jiějué fāng'àn.",
      "sentence_fr": "Le potentiel de séquestration du carbone dans les sols fait de l'agriculture une solution importante pour lutter contre le changement climatique.",
      "sentence_en": "Soil carbon sequestration potential makes agriculture an important solution for addressing climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soil_carbon_sequestration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算神经科学使用数学模型来模拟和理解大脑的信息处理机制。",
      "sentence_pinyin": "Jìsuàn shénjīng kēxué shǐyòng shùxué móxíng lái mónǐ hé lǐjiě dànǎo de xìnxī chǔlǐ jīzhì.",
      "sentence_fr": "Les neurosciences computationnelles utilisent des modèles mathématiques pour simuler et comprendre les mécanismes de traitement de l'information du cerveau.",
      "sentence_en": "Computational neuroscience uses mathematical models to simulate and understand the brain's information processing mechanisms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computational_neuroscience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无人机送货服务正在改变最后一公里配送的传统模式。",
      "sentence_pinyin": "Wúrénjī sòng huò fúwù zhèngzài gǎibiàn zuìhòu yī gōnglǐ pèisòng de chuántǒng móshì.",
      "sentence_fr": "Les services de livraison par drone transforment les modes traditionnels de livraison du dernier kilomètre.",
      "sentence_en": "Drone delivery services are changing traditional last-mile delivery models.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "drone_delivery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "符号学分析揭示了视觉符号和文本如何在文化语境中产生意义。",
      "sentence_pinyin": "Fúhào xué fēnxī jiēshì le shìjué fúhào hé wénběn rúhé zài wénhuà yǔjìng zhōng chǎnshēng yìyì.",
      "sentence_fr": "L'analyse sémiotique révèle comment les signes visuels et les textes produisent du sens dans un contexte culturel.",
      "sentence_en": "Semiotic analysis reveals how visual signs and texts produce meaning within cultural contexts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semiotics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋能源开发利用潮汐和波浪等可再生能源进行发电。",
      "sentence_pinyin": "Hǎiyáng néngyuán kāifā lìyòng cháoxī hé bōlàng děng kě zàishēng néngyuán jìnxíng fādiàn.",
      "sentence_fr": "Le développement de l'énergie marine utilise des énergies renouvelables comme les marées et les vagues pour produire de l'électricité.",
      "sentence_en": "Marine energy development uses renewable energy sources like tides and waves for power generation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "建设性新闻运动倡导报道解决方案和积极社会变革而非仅关注问题。",
      "sentence_pinyin": "Jiànshè xìng xīnwén yùndòng chàngdǎo bàodào jiějué fāng'àn hé jījí shèhuì biàngé ér fēi jǐn guānzhù wèntí.",
      "sentence_fr": "Le mouvement du journalisme constructif préconise de couvrir les solutions et les changements sociaux positifs plutôt que de se concentrer uniquement sur les problèmes.",
      "sentence_en": "The constructive journalism movement advocates reporting on solutions and positive social change rather than just focusing on problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "constructive_journalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人工授粉技术在传粉昆虫数量下降的地区变得越来越重要。",
      "sentence_pinyin": "Réngōng shòufěn jìshù zài chuánfěn kūnchóng shùliàng xiàjiàng de dìqū biàn de yuèláiyuè zhòngyào.",
      "sentence_fr": "Les techniques de pollinisation artificielle deviennent de plus en plus importantes dans les régions où les populations d'insectes pollinisateurs déclinent.",
      "sentence_en": "Artificial pollination techniques are becoming increasingly important in regions where pollinator populations are declining.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "artificial_pollination",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模因理论将文化元素视为可以在人群中复制和传播的信息单位。",
      "sentence_pinyin": "Mó yīn lǐlùn jiāng wénhuà yuánsù shì wéi kěyǐ zài rénqún zhōng fùzhì hé chuánbō de xìnxī dānwèi.",
      "sentence_fr": "La théorie des mèmes considère les éléments culturels comme des unités d'information pouvant être répliquées et diffusées parmi les populations.",
      "sentence_en": "Meme theory views cultural elements as units of information that can be replicated and spread among populations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "meme_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动驾驶汽车的伦理困境涉及在紧急情况下如何做出生死决策。",
      "sentence_pinyin": "Zìdòng jiàshǐ qìchē de lúnlǐ kùnjìng shèjí zài jǐnjí qíngkuàng xià rúhé zuòchū shēngsǐ juécè.",
      "sentence_fr": "Les dilemmes éthiques des véhicules autonomes concernent la prise de décisions de vie ou de mort dans les situations d'urgence.",
      "sentence_en": "Ethical dilemmas of autonomous vehicles involve how to make life-and-death decisions in emergency situations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "autonomous_vehicle_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "迁移学习使机器学习模型能够将从一个任务学到的知识应用于相关任务。",
      "sentence_pinyin": "Qiānyí xuéxí shǐ jīqì xuéxí móxíng nénggòu jiāng cóng yīgè rènwù xué dào de zhīshi yìngyòng yú xiāngguān rènwù.",
      "sentence_fr": "L'apprentissage par transfert permet aux modèles d'apprentissage automatique d'appliquer les connaissances acquises d'une tâche à des tâches connexes.",
      "sentence_en": "Transfer learning enables machine learning models to apply knowledge learned from one task to related tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transfer_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "运动控制研究帮助康复专家为神经损伤患者设计更有效的治疗方案。",
      "sentence_pinyin": "Yùndòng kòngzhì yánjiū bāngzhù kāngfù zhuānjiā wèi shénjīng sǔnshāng huànzhě shèjì gèng yǒuxiào de zhìliáo fāng'àn.",
      "sentence_fr": "La recherche sur le contrôle moteur aide les spécialistes de la réadaptation à concevoir des traitements plus efficaces pour les patients souffrant de lésions neurologiques.",
      "sentence_en": "Motor control research helps rehabilitation specialists design more effective treatments for patients with neurological injuries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "motor_control_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代币经济学研究加密代币如何在区块链生态系统中创造和分配价值。",
      "sentence_pinyin": "Dàibì jīngjì xué yánjiū jiāmì dàibì rúhé zài qūkuài liàn shēngtài xìtǒng zhōng chuàngzào hé fēnpèi jiàzhí.",
      "sentence_fr": "La tokenomique étudie comment les jetons cryptographiques créent et distribuent de la valeur dans les écosystèmes blockchain.",
      "sentence_en": "Tokenomics studies how crypto tokens create and distribute value in blockchain ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tokenomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
