{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能空气检测仪能够实时监测室内空气质量,包括甲醛和PM2.5含量。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng kōngqì jiǎncèyí nénggòu shíshí jiāncè shìnèi kōngqì zhìliàng, bāokuò jiǎquán hé PM2.5 hánliàng.",
      "sentence_fr": "Ce détecteur d'air intelligent peut surveiller en temps réel la qualité de l'air intérieur, y compris les niveaux de formaldéhyde et de PM2.5.",
      "sentence_en": "This smart air detector can monitor indoor air quality in real-time, including formaldehyde and PM2.5 levels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_detectors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "赫哲族的鱼皮画工艺独特,用鱼皮制作各种精美的装饰品和实用品。",
      "sentence_pinyin": "Hèzhézú de yúpíhuà gōngyì dútè, yòng yúpí zhìzuò gèzhǒng jīngměi de zhuāngshìpǐn hé shíyòngpǐn.",
      "sentence_fr": "L'artisanat de peinture sur peau de poisson des Hezhe est unique, utilisant la peau de poisson pour créer divers ornements délicats et objets utilitaires.",
      "sentence_en": "The Hezhe people's fish skin painting craft is unique, using fish skin to create various exquisite ornaments and practical items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hezhe_fish_skin_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区定期举办邻里节活动,促进居民之间的相互了解和友好往来。",
      "sentence_pinyin": "Shèqū dìngqī jǔbàn línlǐ jié huódòng, cùjìn jūmín zhījiān de xiānghù liǎojiě hé yǒuhǎo wǎnglái.",
      "sentence_fr": "La communauté organise régulièrement des festivals de voisinage pour favoriser la compréhension mutuelle et les échanges amicaux entre résidents.",
      "sentence_en": "The community regularly holds neighborhood festivals to promote mutual understanding and friendly exchanges among residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "neighborhood_festivals",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能宠物摄像头可以远程观察宠物动态,还能通过双向语音互动。",
      "sentence_pinyin": "Zhège zhìnéng chǒngwù shèxiàngtóu kěyǐ yuǎnchéng guānchá chǒngwù dòngtài, hái néng tōngguò shuāngxiàng yǔyīn hùdòng.",
      "sentence_fr": "Cette caméra intelligente pour animaux permet d'observer son animal à distance et d'interagir via audio bidirectionnel.",
      "sentence_en": "This smart pet camera allows remote observation of pets and two-way voice interaction.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_cameras",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "踢毽子是中国传统体育游戏,讲究脚法灵活和动作协调优美。",
      "sentence_pinyin": "Tī jiànzi shì Zhōngguó chuántǒng tǐyù yóuxì, jiǎngjiu jiǎofǎ línghuó hé dòngzuò xiétiáo yōuměi.",
      "sentence_fr": "Le jianzi est un jeu sportif traditionnel chinois qui met l'accent sur l'agilité des pieds et l'élégance des mouvements.",
      "sentence_en": "Jianzi is a traditional Chinese sport that emphasizes flexible footwork and graceful, coordinated movements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shuttlecock_kicking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "鄂温克族以驯鹿为伴,被誉为中国最后的使鹿部落民族。",
      "sentence_pinyin": "Èwēnkèzú yǐ xùnlù wéi bàn, bèi yù wéi Zhōngguó zuìhòu de shǐlù bùluò mínzú.",
      "sentence_fr": "Les Ewenki vivent avec les rennes et sont considérés comme le dernier peuple éleveur de rennes de Chine.",
      "sentence_en": "The Ewenki people live alongside reindeer and are known as China's last reindeer-herding tribe.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ewenki_reindeer_culture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市规划部门正在推进海绵城市建设,增强城市防洪排涝能力。",
      "sentence_pinyin": "Chéngshì guīhuà bùmén zhèngzài tuījìn hǎimián chéngshì jiànshè, zēngqiáng chéngshì fánghóng páilào nénglì.",
      "sentence_fr": "Le département d'urbanisme promeut la construction de villes éponges pour renforcer les capacités de prévention des inondations.",
      "sentence_en": "The urban planning department is promoting sponge city construction to enhance flood prevention and drainage capabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sponge_city_construction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能体重秤不仅能测量体重,还能分析体脂率和肌肉含量等数据。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng tǐzhòngchèng bùjǐn néng cèliáng tǐzhòng, hái néng fēnxī tǐzhīlǜ hé jīròu hánliàng děng shùjù.",
      "sentence_fr": "Cette balance intelligente mesure non seulement le poids, mais analyse aussi le taux de graisse corporelle et la masse musculaire.",
      "sentence_en": "This smart scale not only measures weight but also analyzes body fat percentage and muscle mass data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_body_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "鄂伦春族擅长制作桦树皮器具,这是他们适应森林生活的智慧结晶。",
      "sentence_pinyin": "Èlúnchūnzú shàncháng zhìzuò huàshùpí qìjù, zhè shì tāmen shìyìng sēnlín shēnghuó de zhìhuì jiéjīng.",
      "sentence_fr": "Les Oroqen excellent dans la fabrication d'ustensiles en écorce de bouleau, reflet de leur sagesse d'adaptation à la vie forestière.",
      "sentence_en": "The Oroqen people excel at making birch bark utensils, reflecting their wisdom in adapting to forest life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "oroqen_birch_bark_craft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "滚铁环曾是孩子们最喜爱的游戏之一,现在成为怀旧的童年记忆。",
      "sentence_pinyin": "Gǔn tiěhuán céng shì háizimen zuì xǐ'ài de yóuxì zhī yī, xiànzài chéngwéi huáijiù de tóngnián jìyì.",
      "sentence_fr": "Rouler un cerceau de fer était autrefois un des jeux préférés des enfants, devenu aujourd'hui un souvenir nostalgique d'enfance.",
      "sentence_en": "Rolling an iron hoop was once one of children's favorite games, now a nostalgic childhood memory.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "iron_hoop_rolling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区为独居老人提供定期上门探访服务,关心他们的身心健康状况。",
      "sentence_pinyin": "Shèqū wèi dújū lǎorén tígōng dìngqī shàngmén tànfǎng fúwù, guānxīn tāmen de shēnxīn jiànkāng zhuàngkuàng.",
      "sentence_fr": "La communauté offre des visites régulières à domicile aux personnes âgées vivant seules pour veiller sur leur santé physique et mentale.",
      "sentence_en": "The community provides regular home visit services for elderly people living alone to care for their physical and mental health.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_home_visits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能花盆能根据土壤湿度自动浇水,非常适合经常出差的植物爱好者。",
      "sentence_pinyin": "Zhège zhìnéng huāpén néng gēnjù tǔrǎng shīdù zìdòng jiāoshuǐ, fēicháng shìhé jīngcháng chūchāi de zhíwù àihàozhě.",
      "sentence_fr": "Ce pot intelligent arrose automatiquement selon l'humidité du sol, parfait pour les amateurs de plantes souvent en déplacement.",
      "sentence_en": "This smart flowerpot waters automatically based on soil moisture, perfect for plant lovers who travel frequently.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_flowerpots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "达斡尔族的曲棍球运动历史悠久,被认为是现代曲棍球运动的起源之一。",
      "sentence_pinyin": "Dáwò'ěrzú de qūgùnqiú yùndòng lìshǐ yōujiǔ, bèi rènwéi shì xiàndài qūgùnqiú yùndòng de qǐyuán zhī yī.",
      "sentence_fr": "Le hockey des Daur a une longue histoire et est considéré comme l'une des origines du hockey moderne.",
      "sentence_en": "The Daur people's field hockey has a long history and is considered one of the origins of modern hockey.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "daur_field_hockey",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府正在完善城市无障碍设施建设,方便残障人士出行和生活。",
      "sentence_pinyin": "Zhèngfǔ zhèngzài wánshàn chéngshì wú zhàng'ài shèshī jiànshè, fāngbiàn cánzhàng rénshì chūxíng hé shēnghuó.",
      "sentence_fr": "Le gouvernement améliore les installations d'accessibilité urbaine pour faciliter les déplacements et la vie des personnes handicapées.",
      "sentence_en": "The government is improving urban accessibility facilities to make travel and life easier for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_accessibility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能香薰机可以通过手机设置香味浓度和工作时间,营造舒适氛围。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xiāngxūnjī kěyǐ tōngguò shǒujī shèzhì xiāngwèi nóngdù hé gōngzuò shíjiān, yíngzào shūshì fēnwéi.",
      "sentence_fr": "Ce diffuseur d'arômes intelligent permet de régler l'intensité du parfum et la durée via smartphone pour créer une atmosphère agréable.",
      "sentence_en": "This smart aroma diffuser allows phone-controlled fragrance intensity and duration settings to create a comfortable atmosphere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_aroma_diffusers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跳房子是一种简单有趣的儿童游戏,只需要粉笔和一块石子就能玩。",
      "sentence_pinyin": "Tiào fángzi shì yī zhǒng jiǎndān yǒuqù de értóng yóuxì, zhǐ xūyào fěnbǐ hé yī kuài shízǐ jiù néng wán.",
      "sentence_fr": "La marelle est un jeu d'enfants simple et amusant qui ne nécessite qu'une craie et un caillou pour jouer.",
      "sentence_en": "Hopscotch is a simple and fun children's game that only requires chalk and a pebble to play.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hopscotch_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "俄罗斯族的巴扬手风琴演奏技艺独特,是他们文化传承的重要组成部分。",
      "sentence_pinyin": "Éluósīzú de bāyáng shǒufēngqín yǎnzòu jìyì dútè, shì tāmen wénhuà chuánchéng de zhòngyào zǔchéng bùfèn.",
      "sentence_fr": "La technique de jeu du bayan des Russes de Chine est unique et constitue une part importante de leur héritage culturel.",
      "sentence_en": "The Russian ethnic group's bayan accordion playing technique is unique and an important part of their cultural heritage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "russian_bayan_accordion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区图书馆开设了数字阅读区,居民可以免费使用电子书和在线学习资源。",
      "sentence_pinyin": "Shèqū túshūguǎn kāishè le shùzì yuèdú qū, jūmín kěyǐ miǎnfèi shǐyòng diànzǐshū hé zàixiàn xuéxí zīyuán.",
      "sentence_fr": "La bibliothèque communautaire a créé un espace de lecture numérique où les résidents peuvent accéder gratuitement aux livres électroniques et ressources d'apprentissage en ligne.",
      "sentence_en": "The community library has set up a digital reading area where residents can freely access e-books and online learning resources.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_digital_libraries",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能药盒会在服药时间提醒用户,并记录每次服药情况方便查看。",
      "sentence_pinyin": "Zhège zhìnéng yàohé huì zài fúyào shíjiān tíxǐng yònghù, bìng jìlù měi cì fúyào qíngkuàng fāngbiàn chákàn.",
      "sentence_fr": "Cette boîte à médicaments intelligente rappelle l'heure de prise des médicaments et enregistre chaque prise pour un suivi facile.",
      "sentence_en": "This smart pill box reminds users when to take medicine and records each dose for easy tracking.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pill_boxes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "塔塔尔族的撒班节是他们最重要的传统节日,人们欢聚一堂庆祝春播结束。",
      "sentence_pinyin": "Tǎtǎ'ěrzú de sābān jié shì tāmen zuì zhòngyào de chuántǒng jiérì, rénmen huānjù yītáng qìngzhù chūnbō jiéshù.",
      "sentence_fr": "Le festival Saban des Tatars est leur fête traditionnelle la plus importante, où les gens se rassemblent pour célébrer la fin des semailles de printemps.",
      "sentence_en": "The Saban Festival is the most important traditional holiday of the Tatar people, where people gather to celebrate the end of spring sowing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tatar_saban_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
