{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个无人便利店通过人脸识别和自助结账系统实现了24小时营业。",
      "sentence_pinyin": "Zhège wúrén biànlìdiàn tōngguò rénliǎn shíbié hé zìzhù jiézhàng xìtǒng shíxiànle èrshísì xiǎoshí yíngyè.",
      "sentence_fr": "Ce magasin de proximité sans personnel fonctionne 24 heures sur 24 grâce à la reconnaissance faciale et au système de paiement en libre-service.",
      "sentence_en": "This unmanned convenience store operates 24 hours through facial recognition and self-checkout systems.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "unmanned_retail",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "萧的吹奏需要掌握正确的口风和气息控制技巧。",
      "sentence_pinyin": "Xiāo de chuīzòu xūyào zhǎngwò zhèngquè de kǒufēng hé qìxī kòngzhì jìqiǎo.",
      "sentence_fr": "Jouer du xiao nécessite de maîtriser les bonnes techniques d'embouchure et de contrôle de la respiration.",
      "sentence_en": "Playing the xiao requires mastering correct embouchure and breath control techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiao_techniques",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的地下综合管廊有效避免了道路频繁开挖的问题。",
      "sentence_pinyin": "Zhège chéngshì de dìxià zōnghé guǎnláng yǒuxiào bìmiǎnle dàolù pínfán kāiwā de wèntí.",
      "sentence_fr": "Les galeries souterraines intégrées de cette ville évitent efficacement les problèmes de creusement fréquent des routes.",
      "sentence_en": "This city's underground utility tunnels effectively avoid the problem of frequent road excavation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "utility_tunnels",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "铁艺工匠将普通的铁条锻造成精美的栏杆、门窗和装饰品。",
      "sentence_pinyin": "Tiěyì gōngjiàng jiāng pǔtōng de tiětiáo duànzào chéng jīngměi de lángān, ménchuāng hé zhuāngshìpǐn.",
      "sentence_fr": "Les artisans forgerons transforment des barres de fer ordinaires en belles balustrades, portes et fenêtres, et décorations.",
      "sentence_en": "Ironwork craftsmen forge ordinary iron bars into beautiful railings, doors and windows, and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ironwork",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能睡眠监测仪可以分析睡眠质量并提供改善建议。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng shuìmián jiāncè yí kěyǐ fēnxī shuìmián zhìliàng bìng tígōng gǎishàn jiànyì.",
      "sentence_fr": "Ce moniteur de sommeil intelligent peut analyser la qualité du sommeil et fournir des conseils d'amélioration.",
      "sentence_en": "This smart sleep monitor can analyze sleep quality and provide improvement suggestions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sleep_monitors",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区互助养老模式让健康老人帮助照顾失能老人,储存服务时间。",
      "sentence_pinyin": "Zhège shèqū hùzhù yǎnglǎo móshì ràng jiànkāng lǎorén bāngzhù zhàogù shīnéng lǎorén, chǔcún fúwù shíjiān.",
      "sentence_fr": "Ce modèle d'entraide communautaire pour les personnes âgées permet aux personnes âgées en bonne santé d'aider à prendre soin des personnes âgées dépendantes et d'accumuler du temps de service.",
      "sentence_en": "This community mutual aid elderly care model allows healthy elderly to help care for disabled elderly while saving service time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mutual_aid_elderly_care",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "三弦的琴身由蟒蛇皮蒙制,音色独特粗犷。",
      "sentence_pinyin": "Sānxián de qínshēn yóu mǎngshépí méngzhì, yīnsè dútè cūguǎng.",
      "sentence_fr": "Le corps du sanxian est recouvert de peau de python, lui donnant un son unique et robuste.",
      "sentence_en": "The sanxian's body is covered with python skin, giving it a unique and robust sound.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sanxian_construction",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线翻译平台支持实时语音翻译,方便跨国交流。",
      "sentence_pinyin": "Zhège zàixiàn fānyì píngtái zhīchí shíshí yǔyīn fānyì, fāngbiàn kuàguó jiāoliú.",
      "sentence_fr": "Cette plateforme de traduction en ligne prend en charge la traduction vocale en temps réel, facilitant la communication internationale.",
      "sentence_en": "This online translation platform supports real-time voice translation, facilitating cross-border communication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "translation_platforms",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "苗族银饰工艺精湛,每一件作品都蕴含着丰富的民族文化内涵。",
      "sentence_pinyin": "Miáozú yínshì gōngyì jīngzhàn, měi yī jiàn zuòpǐn dōu yùnhánzhe fēngfù de mínzú wénhuà nèihán.",
      "sentence_fr": "L'artisanat de la bijouterie en argent Miao est exquis, chaque pièce contient une riche signification culturelle ethnique.",
      "sentence_en": "Miao silver jewelry craftsmanship is exquisite, with each piece containing rich ethnic cultural significance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "miao_silver_jewelry",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电视可以通过语音控制换台、调节音量和搜索内容。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànshì kěyǐ tōngguò yǔyīn kòngzhì huàntái, tiáojié yīnliàng hé sōusuǒ nèiróng.",
      "sentence_fr": "Ce téléviseur intelligent peut changer de chaîne, régler le volume et rechercher du contenu par commande vocale.",
      "sentence_en": "This smart TV can change channels, adjust volume, and search content through voice control.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_tvs",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市绿道系统连接了公园、社区和商业区,方便市民步行和骑行。",
      "sentence_pinyin": "Zhège chéngshì lǜdào xìtǒng liánjiēle gōngyuán, shèqū hé shāngyèqū, fāngbiàn shìmín bùxíng hé qíxíng.",
      "sentence_fr": "Ce système de voies vertes urbaines relie parcs, quartiers résidentiels et zones commerciales, facilitant la marche et le vélo pour les citoyens.",
      "sentence_en": "This urban greenway system connects parks, communities, and commercial areas, facilitating walking and cycling for citizens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_greenways",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶的四根弦能够演奏出非常丰富的音色变化。",
      "sentence_pinyin": "Pípá de sì gēn xián nénggòu yǎnzòu chū fēicháng fēngfù de yīnsè biànhuà.",
      "sentence_fr": "Les quatre cordes du pipa peuvent produire des variations de timbre très riches.",
      "sentence_en": "The pipa's four strings can produce very rich tonal variations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_strings",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个远程办公系统让员工能够在家高效完成工作任务。",
      "sentence_pinyin": "Zhège yuǎnchéng bàngōng xìtǒng ràng yuángōng nénggòu zài jiā gāoxiào wánchéng gōngzuò rènwù.",
      "sentence_fr": "Ce système de télétravail permet aux employés d'accomplir efficacement leurs tâches depuis chez eux.",
      "sentence_en": "This remote working system allows employees to efficiently complete work tasks from home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "remote_work_systems",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "竹根雕利用竹根的天然形态,雕刻出各种造型独特的艺术品。",
      "sentence_pinyin": "Zhúgēn diāo lìyòng zhúgēn de tiānrán xíngtài, diāokè chū gèzhǒng zàoxíng dútè de yìshùpǐn.",
      "sentence_fr": "La sculpture sur racine de bambou utilise les formes naturelles des racines de bambou pour sculpter divers objets d'art aux formes uniques.",
      "sentence_en": "Bamboo root carving uses the natural forms of bamboo roots to carve various uniquely shaped artworks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_root_carving",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能吸尘器可以自动规划清扫路径并返回充电座充电。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xīchénqì kěyǐ zìdòng guīhuà qīngsǎo lùjìng bìng fǎnhuí chōngdiànzuò chōngdiàn.",
      "sentence_fr": "Cet aspirateur intelligent peut planifier automatiquement le parcours de nettoyage et retourner à la station de charge.",
      "sentence_en": "This smart vacuum cleaner can automatically plan cleaning paths and return to the charging dock to charge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "robotic_vacuums",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区康复站为慢性病患者提供了健康管理和康复指导服务。",
      "sentence_pinyin": "Zhège shèqū kāngfù zhàn wèi mànxìngbìng huànzhě tígōngle jiànkāng guǎnlǐ hé kāngfù zhǐdǎo fúwù.",
      "sentence_fr": "Cette station de réadaptation communautaire offre des services de gestion de la santé et de conseil en rééducation aux patients atteints de maladies chroniques.",
      "sentence_en": "This community rehabilitation station provides health management and rehabilitation guidance services for chronic disease patients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_rehabilitation",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙的演奏可以吸气和呼气同时发声,这是其他管乐器所没有的特点。",
      "sentence_pinyin": "Shēng de yǎnzòu kěyǐ xīqì hé hūqì tóngshí fāshēng, zhè shì qítā guǎn yuèqì suǒ méiyǒu de tèdiǎn.",
      "sentence_fr": "Le sheng peut produire du son à la fois en inspirant et en expirant, une caractéristique unique parmi les instruments à vent.",
      "sentence_en": "The sheng can produce sound while both inhaling and exhaling, a feature unique among wind instruments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_breathing",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能客服系统能够理解自然语言并自动回答常见问题。",
      "sentence_pinyin": "Zhège zhìnéng kèfú xìtǒng nénggòu lǐjiě zìrán yǔyán bìng zìdòng huídá chángjiàn wèntí.",
      "sentence_fr": "Ce système de service client intelligent peut comprendre le langage naturel et répondre automatiquement aux questions fréquentes.",
      "sentence_en": "This intelligent customer service system can understand natural language and automatically answer common questions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_customer_service",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "面具艺术在不同文化中都有悠久的历史,具有丰富的象征意义。",
      "sentence_pinyin": "Miànjù yìshù zài bùtóng wénhuà zhōng dōu yǒu yōujiǔ de lìshǐ, jùyǒu fēngfù de xiàngzhēng yìyì.",
      "sentence_fr": "L'art du masque a une longue histoire dans différentes cultures et possède une riche signification symbolique.",
      "sentence_en": "Mask art has a long history in different cultures and possesses rich symbolic meaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mask_art",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能加湿器可以根据室内湿度自动调节喷雾量。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng jiāshīqì kěyǐ gēnjù shìnèi shīdù zìdòng tiáojié pēnwùliàng.",
      "sentence_fr": "Cet humidificateur intelligent peut ajuster automatiquement la quantité de brume en fonction de l'humidité intérieure.",
      "sentence_en": "This smart humidifier can automatically adjust mist output based on indoor humidity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_humidifiers",
      "created_at": "2025-11-20T21:40:00.000Z",
      "updated_at": "2025-11-20T21:40:00.000Z"
    }
  ]
}
