{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "规范场论统一描述电磁力弱核力和强核力的数学框架。",
      "sentence_pinyin": "Guīfàn chǎnglùn tǒngyī miáoshù diàncílì ruò hélì hé qiáng hélì de shùxué kuàngjià.",
      "sentence_fr": "La théorie de jauge fournit un cadre mathématique unifié décrivant les forces électromagnétique, nucléaire faible et nucléaire forte.",
      "sentence_en": "Gauge theory provides a unified mathematical framework describing electromagnetic, weak nuclear, and strong nuclear forces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "gauge_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可证明安全加密方案将密码系统的安全性归约到数学难题。",
      "sentence_pinyin": "Kě zhèngmíng ānquán jiāmì fāng'àn jiāng mìmǎ xìtǒng de ānquánxìng guīyuē dào shùxué nántí.",
      "sentence_fr": "Les schémas de chiffrement à sécurité prouvable réduisent la sécurité des cryptosystèmes à des problèmes mathématiques difficiles.",
      "sentence_en": "Provably secure encryption schemes reduce cryptosystem security to mathematical hard problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "provable_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "λ演算是函数式编程语言和类型理论的理论基础。",
      "sentence_pinyin": "Lambda yǎnsuàn shì hánshùshì biānchéng yǔyán hé lèixíng lǐlùn de lǐlùn jīchǔ.",
      "sentence_fr": "Le lambda-calcul est le fondement théorique des langages de programmation fonctionnelle et de la théorie des types.",
      "sentence_en": "Lambda calculus is the theoretical foundation for functional programming languages and type theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lambda_calculus",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "辛几何为经典力学和量子力学提供了统一的数学语言。",
      "sentence_pinyin": "Xīn jǐhé wèi jīngdiǎn lìxué hé liàngzǐ lìxué tígōng le tǒngyī de shùxué yǔyán.",
      "sentence_fr": "La géométrie symplectique fournit un langage mathématique unifié pour la mécanique classique et quantique.",
      "sentence_en": "Symplectic geometry provides a unified mathematical language for classical and quantum mechanics.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "symplectic_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子霸权指量子计算机执行特定任务超越所有经典计算机的能力。",
      "sentence_pinyin": "Liàngzǐ bàquán zhǐ liàngzǐ jìsuànjī zhíxíng tèdìng rènwù chāoyuè suǒyǒu jīngdiǎn jìsuànjī de nénglì.",
      "sentence_fr": "La suprématie quantique désigne la capacité d'un ordinateur quantique à exécuter certaines tâches au-delà de tous les ordinateurs classiques.",
      "sentence_en": "Quantum supremacy refers to a quantum computer's ability to perform specific tasks beyond all classical computers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_supremacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格密码学基于格问题的计算困难性抵抗量子计算攻击。",
      "sentence_pinyin": "Gé mìmǎxué jīyú gé wèntí de jìsuàn kùnnánxìng dǐkàng liàngzǐ jìsuàn gōngjī.",
      "sentence_fr": "La cryptographie sur les réseaux euclidiens résiste aux attaques quantiques grâce à la difficulté calculatoire des problèmes de réseau.",
      "sentence_en": "Lattice cryptography resists quantum computing attacks based on the computational hardness of lattice problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lattice_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦类型论将类型解释为空间并建立了逻辑与拓扑的对应。",
      "sentence_pinyin": "Tónglún lèixíng lùn jiāng lèixíng jiěshì wéi kōngjiān bìng jiànlì le luójí yǔ tuòpū de duìyìng.",
      "sentence_fr": "La théorie des types homotopiques interprète les types comme des espaces et établit une correspondance entre logique et topologie.",
      "sentence_en": "Homotopy type theory interprets types as spaces and establishes a correspondence between logic and topology.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homotopy_type_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微分几何研究光滑流形上的曲率张量和联络结构。",
      "sentence_pinyin": "Wēifēn jǐhé yánjiū guānghuá liúxíng shàng de qūlǜ zhāngliàng hé liánluò jiégòu.",
      "sentence_fr": "La géométrie différentielle étudie les tenseurs de courbure et les structures de connexion sur les variétés lisses.",
      "sentence_en": "Differential geometry studies curvature tensors and connection structures on smooth manifolds.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "differential_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绝热量子计算通过系统哈密顿量的缓慢演化求解优化问题。",
      "sentence_pinyin": "Juérè liàngzǐ jìsuàn tōngguò xìtǒng Hāmìdùnliàng de huǎnmàn yǎnhuà qiújiě yōuhuà wèntí.",
      "sentence_fr": "Le calcul quantique adiabatique résout des problèmes d'optimisation par l'évolution lente du hamiltonien du système.",
      "sentence_en": "Adiabatic quantum computing solves optimization problems through slow evolution of the system Hamiltonian.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "adiabatic_quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后量子密码算法旨在抵御未来量子计算机的密码破解能力。",
      "sentence_pinyin": "Hòu liàngzǐ mìmǎ suànfǎ zhǐ zài dǐyù wèilái liàngzǐ jìsuànjī de mìmǎ pòjiě nénglì.",
      "sentence_fr": "Les algorithmes cryptographiques post-quantiques visent à résister aux capacités de déchiffrement des futurs ordinateurs quantiques.",
      "sentence_en": "Post-quantum cryptographic algorithms aim to resist the cryptographic breaking capabilities of future quantum computers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "post_quantum_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "依赖类型系统允许类型表达复杂的值约束和不变量。",
      "sentence_pinyin": "Yīlài lèixíng xìtǒng yǔnxǔ lèixíng biǎodá fùzá de zhí yuēshù hé bù biànliàng.",
      "sentence_fr": "Les systèmes de types dépendants permettent aux types d'exprimer des contraintes de valeur complexes et des invariants.",
      "sentence_en": "Dependent type systems allow types to express complex value constraints and invariants.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "dependent_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纤维丛理论为粒子物理学中的规范场提供几何描述。",
      "sentence_pinyin": "Xiānwéi cù lǐlùn wèi lìzǐ wùlǐxué zhōng de guīfàn chǎng tígōng jǐhé miáoshù.",
      "sentence_fr": "La théorie des fibrés fournit une description géométrique des champs de jauge en physique des particules.",
      "sentence_en": "Fiber bundle theory provides geometric descriptions for gauge fields in particle physics.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "fiber_bundle_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑量子计算利用任意子的编织操作实现容错量子门。",
      "sentence_pinyin": "Tuòpū liàngzǐ jìsuàn lìyòng rènyìzǐ de biānzhī cāozuò shíxiàn róngcuò liàngzǐ mén.",
      "sentence_fr": "L'informatique quantique topologique utilise les opérations de tressage d'anyons pour réaliser des portes quantiques tolérantes aux erreurs.",
      "sentence_en": "Topological quantum computing uses anyon braiding operations to achieve fault-tolerant quantum gates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "椭圆曲线密码学利用有限域上椭圆曲线群的离散对数问题。",
      "sentence_pinyin": "Tuǒyuán qūxiàn mìmǎxué lìyòng yǒuxiàn yù shàng tuǒyuán qūxiàn qún de lísàn duìshù wèntí.",
      "sentence_fr": "La cryptographie sur courbes elliptiques exploite le problème du logarithme discret dans les groupes de courbes elliptiques sur corps finis.",
      "sentence_en": "Elliptic curve cryptography exploits the discrete logarithm problem in elliptic curve groups over finite fields.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "elliptic_curve_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柯里-霍华德同构揭示了命题逻辑与类型化λ演算的对应关系。",
      "sentence_pinyin": "Kēlǐ-Huòhuádé tónggòu jiēshì le mìngtí luójí yǔ lèixínghuà Lambda yǎnsuàn de duìyìng guānxì.",
      "sentence_fr": "L'isomorphisme de Curry-Howard révèle la correspondance entre la logique propositionnelle et le lambda-calcul typé.",
      "sentence_en": "The Curry-Howard isomorphism reveals the correspondence between propositional logic and typed lambda calculus.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "curry_howard_isomorphism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "李群和李代数是研究连续对称性的核心数学工具。",
      "sentence_pinyin": "Lǐ qún hé Lǐ dàishù shì yánjiū liánxù duìchènxìng de héxīn shùxué gōngjù.",
      "sentence_fr": "Les groupes de Lie et les algèbres de Lie sont des outils mathématiques essentiels pour étudier les symétries continues.",
      "sentence_en": "Lie groups and Lie algebras are core mathematical tools for studying continuous symmetries.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lie_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子门电路模型是实现通用量子计算的标准计算模型。",
      "sentence_pinyin": "Liàngzǐ mén diànlù móxíng shì shíxiàn tōngyòng liàngzǐ jìsuàn de biāozhǔn jìsuàn móxíng.",
      "sentence_fr": "Le modèle de circuit à portes quantiques est le modèle de calcul standard pour réaliser l'informatique quantique universelle.",
      "sentence_en": "The quantum gate circuit model is the standard computational model for implementing universal quantum computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_circuit_model",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于身份的加密允许使用任意字符串作为公钥进行加密。",
      "sentence_pinyin": "Jīyú shēnfèn de jiāmì yǔnxǔ shǐyòng rènyì zìfú chuàn zuòwéi gōngyào jìnxíng jiāmì.",
      "sentence_fr": "Le chiffrement basé sur l'identité permet d'utiliser des chaînes arbitraires comme clés publiques pour le chiffrement.",
      "sentence_en": "Identity-based encryption allows using arbitrary strings as public keys for encryption.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "identity_based_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模型检测自动验证有限状态系统是否满足时序逻辑规约。",
      "sentence_pinyin": "Móxíng jiǎncè zìdòng yànzhèng yǒuxiàn zhuàngtài xìtǒng shìfǒu mǎnzú shíxù luójí guīyuē.",
      "sentence_fr": "La vérification de modèle vérifie automatiquement si les systèmes à états finis satisfont les spécifications de logique temporelle.",
      "sentence_en": "Model checking automatically verifies whether finite state systems satisfy temporal logic specifications.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "model_checking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表示论研究群和代数结构在向量空间上的线性作用。",
      "sentence_pinyin": "Biǎoshìlùn yánjiū qún hé dàishù jiégòu zài xiàngliàng kōngjiān shàng de xiànxìng zuòyòng.",
      "sentence_fr": "La théorie des représentations étudie les actions linéaires des groupes et des structures algébriques sur les espaces vectoriels.",
      "sentence_en": "Representation theory studies linear actions of groups and algebraic structures on vector spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "representation_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
