{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "系外行星探测技术揭示了宇宙中行星系统的多样性。",
      "sentence_pinyin": "Xìwài xíngxīng tàncè jìshù jiēshì le yǔzhòu zhōng xíngxīng xìtǒng de duōyàngxìng.",
      "sentence_fr": "Les techniques de détection des exoplanètes révèlent la diversité des systèmes planétaires dans l'univers.",
      "sentence_en": "Exoplanet detection techniques reveal the diversity of planetary systems in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "exoplanet_detection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "系统性风险是影响整个金融系统稳定性的全局性风险。",
      "sentence_pinyin": "Xìtǒngxìng fēngxiǎn shì yǐngxiǎng zhěnggè jīnróng xìtǒng wěndìngxìng de quánjúxìng fēngxiǎn.",
      "sentence_fr": "Le risque systémique est un risque global affectant la stabilité de l'ensemble du système financier.",
      "sentence_en": "Systemic risk is a global risk affecting the stability of the entire financial system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "systemic_risk",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "业务连续性计划确保组织在灾难后能够快速恢复运营。",
      "sentence_pinyin": "Yèwù liánxùxìng jìhuà quèbǎo zǔzhī zài zāinàn hòu nénggòu kuàisù huīfù yùnyíng.",
      "sentence_fr": "Les plans de continuité des activités garantissent qu'une organisation peut reprendre rapidement ses opérations après une catastrophe.",
      "sentence_en": "Business continuity plans ensure that an organization can quickly resume operations after a disaster.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "business_continuity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自由意志问题探讨人类行为是否真正自主还是被决定的。",
      "sentence_pinyin": "Zìyóu yìzhì wèntí tàntǎo rénlèi xíngwéi shìfǒu zhēnzhèng zìzhǔ háishì bèi juédìng de.",
      "sentence_fr": "Le problème du libre arbitre explore si le comportement humain est véritablement autonome ou déterminé.",
      "sentence_en": "The problem of free will explores whether human behavior is truly autonomous or determined.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "free_will_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式系统架构通过冗余设计提高服务的可用性和容错性。",
      "sentence_pinyin": "Fēnbùshì xìtǒng jiàgòu tōngguò róngyú shèjì tígāo fúwù de kěyòngxìng hé róngcuòxìng.",
      "sentence_fr": "L'architecture des systèmes distribués améliore la disponibilité et la tolérance aux pannes des services par une conception redondante.",
      "sentence_en": "Distributed system architecture improves service availability and fault tolerance through redundant design.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳风是从太阳日冕层持续流出的带电粒子流。",
      "sentence_pinyin": "Tàiyáng fēng shì cóng tàiyáng rìmiǎn céng chíxù liúchū de dàidiàn lìzǐ liú.",
      "sentence_fr": "Le vent solaire est un flux continu de particules chargées s'échappant de la couronne solaire.",
      "sentence_en": "The solar wind is a continuous flow of charged particles streaming from the sun's corona.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_wind",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "影子银行系统在传统银行监管框架之外提供信贷中介服务。",
      "sentence_pinyin": "Yǐngzi yínháng xìtǒng zài chuántǒng yínháng jiānguǎn kuàngjià zhīwài tígōng xìndài zhōngjiè fúwù.",
      "sentence_fr": "Le système bancaire parallèle fournit des services d'intermédiation de crédit en dehors du cadre réglementaire bancaire traditionnel.",
      "sentence_en": "The shadow banking system provides credit intermediation services outside the traditional banking regulatory framework.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "shadow_banking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "灾难恢复站点提供关键系统和数据的异地备份保护。",
      "sentence_pinyin": "Zāinàn huīfù zhàndiǎn tígōng guānjiàn xìtǒng hé shùjù de yìdì bèifèn bǎohù.",
      "sentence_fr": "Les sites de reprise après sinistre fournissent une protection par sauvegarde hors site des systèmes et données critiques.",
      "sentence_en": "Disaster recovery sites provide off-site backup protection for critical systems and data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "disaster_recovery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "决定论认为所有事件都是由先前原因必然导致的结果。",
      "sentence_pinyin": "Juédìnglùn rènwéi suǒyǒu shìjiàn dōu shì yóu xiānqián yuányīn bìrán dǎozhì de jiéguǒ.",
      "sentence_fr": "Le déterminisme soutient que tous les événements sont des résultats nécessairement causés par des causes antérieures.",
      "sentence_en": "Determinism holds that all events are results necessarily caused by prior causes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "determinism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微服务架构将应用程序拆分为独立部署的小型服务单元。",
      "sentence_pinyin": "Wēi fúwù jiàgòu jiāng yìngyòng chéngxù chāifēn wéi dúlì bùshǔ de xiǎoxíng fúwù dānyuán.",
      "sentence_fr": "L'architecture de microservices divise les applications en petites unités de service déployables indépendamment.",
      "sentence_en": "Microservices architecture splits applications into independently deployable small service units.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microservices_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "磁层是行星磁场控制的区域保护其免受太阳风侵蚀。",
      "sentence_pinyin": "Cícéng shì xíngxīng cíchǎng kòngzhì de qūyù bǎohù qí miǎn shòu tàiyáng fēng qīnshí.",
      "sentence_fr": "La magnétosphère est la région contrôlée par le champ magnétique planétaire, protégeant contre l'érosion du vent solaire.",
      "sentence_en": "The magnetosphere is the region controlled by a planet's magnetic field, protecting it from solar wind erosion.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "magnetosphere",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "道德风险是指当事人因风险转移而改变行为的倾向。",
      "sentence_pinyin": "Dàodé fēngxiǎn shì zhǐ dāngshìrén yīn fēngxiǎn zhuǎnyí ér gǎibiàn xíngwéi de qīngxiàng.",
      "sentence_fr": "L'aléa moral désigne la tendance des parties à modifier leur comportement en raison du transfert de risque.",
      "sentence_en": "Moral hazard refers to parties' tendency to change behavior due to risk transfer.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "moral_hazard",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "容器编排平台自动化管理大规模容器化应用的部署。",
      "sentence_pinyin": "Róngqì biānpái píngtái zìdònghuà guǎnlǐ dà guīmó róngqìhuà yìngyòng de bùshǔ.",
      "sentence_fr": "Les plateformes d'orchestration de conteneurs automatisent la gestion du déploiement d'applications conteneurisées à grande échelle.",
      "sentence_en": "Container orchestration platforms automate the management of large-scale containerized application deployment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "container_orchestration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唯物主义认为物质是构成现实的根本基础和本质。",
      "sentence_pinyin": "Wéiwù zhǔyì rènwéi wùzhì shì gòuchéng xiànshí de gēnběn jīchǔ hé běnzhì.",
      "sentence_fr": "Le matérialisme soutient que la matière est la base fondamentale et l'essence de la réalité.",
      "sentence_en": "Materialism holds that matter is the fundamental basis and essence of reality.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "materialism_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "区块链技术通过分布式账本实现去中心化的信任机制。",
      "sentence_pinyin": "Qūkuàiliàn jìshù tōngguò fēnbùshì zhàngběn shíxiàn qù zhōngxīnhuà de xìnrèn jīzhì.",
      "sentence_fr": "La technologie blockchain réalise un mécanisme de confiance décentralisé grâce à un registre distribué.",
      "sentence_en": "Blockchain technology achieves a decentralized trust mechanism through distributed ledgers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "blockchain_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "日冕物质抛射可能导致地球上的地磁暴和通信干扰。",
      "sentence_pinyin": "Rìmiǎn wùzhì pāoshè kěnéng dǎozhì dìqiú shàng de dìcí bào hé tōngxìn gānrǎo.",
      "sentence_fr": "Les éjections de masse coronale peuvent provoquer des tempêtes géomagnétiques et des perturbations des communications sur Terre.",
      "sentence_en": "Coronal mass ejections can cause geomagnetic storms and communication disruptions on Earth.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "coronal_mass_ejections",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "逆向选择问题导致市场中信息不对称的交易效率低下。",
      "sentence_pinyin": "Nìxiàng xuǎnzé wèntí dǎozhì shìchǎng zhōng xìnxī bù duìchèn de jiāoyì xiàolǜ dīxià.",
      "sentence_fr": "Le problème de sélection adverse entraîne une inefficacité des transactions due à l'asymétrie d'information sur les marchés.",
      "sentence_en": "The adverse selection problem leads to transaction inefficiency due to information asymmetry in markets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "adverse_selection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "持续集成实践要求开发人员频繁合并代码变更并自动测试。",
      "sentence_pinyin": "Chíxù jíchéng shíjiàn yāoqiú kāifā rényuán pínfán hébìng dàimǎ biàngēng bìng zìdòng cèshì.",
      "sentence_fr": "Les pratiques d'intégration continue exigent que les développeurs fusionnent fréquemment les modifications de code et effectuent des tests automatisés.",
      "sentence_en": "Continuous integration practices require developers to frequently merge code changes and run automated tests.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "continuous_integration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唯心主义认为意识或精神是构成现实的首要元素。",
      "sentence_pinyin": "Wéixīn zhǔyì rènwéi yìshí huò jīngshén shì gòuchéng xiànshí de shǒuyào yuánsù.",
      "sentence_fr": "L'idéalisme soutient que la conscience ou l'esprit est l'élément primaire constituant la réalité.",
      "sentence_en": "Idealism holds that consciousness or mind is the primary element constituting reality.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "idealism_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "服务网格提供微服务之间通信的可观测性和安全管理。",
      "sentence_pinyin": "Fúwù wǎnggé tígōng wēi fúwù zhījiān tōngxìn de kě guāncèxìng hé ānquán guǎnlǐ.",
      "sentence_fr": "Le maillage de services fournit l'observabilité et la gestion de la sécurité des communications entre microservices.",
      "sentence_en": "Service mesh provides observability and security management for communication between microservices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "service_mesh",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
