{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个扶贫车间把生产线建在了村里，让村民在家门口就业。",
      "sentence_pinyin": "Zhège fúpín chējiān bǎ shēngchǎn xiàn jiàn zàile cūn lǐ, ràng cūnmín zài jiāménkǒu jiùyè.",
      "sentence_fr": "Cet atelier de réduction de la pauvreté a installé la chaîne de production au village, permettant aux villageois de trouver un emploi à leur porte.",
      "sentence_en": "This poverty alleviation workshop built the production line in the village, allowing villagers to find employment at their doorstep.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poverty_alleviation_workshops",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在秦腔表演中展现了高亢激昂的唱腔和粗犷豪放的表演风格。",
      "sentence_pinyin": "Tā zài qínqiāng biǎoyǎn zhōng zhǎnxiànle gāokàng jī'áng de chàngqiāng hé cūguǎng háofàng de biǎoyǎn fēnggé.",
      "sentence_fr": "Dans sa performance d'opéra Qin, elle a démontré une voix haute et passionnée et un style de jeu vigoureux et audacieux.",
      "sentence_en": "In her Qin Opera performance, she demonstrated a high-pitched and passionate voice and a vigorous and bold performance style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qin_opera",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能温控系统能够自动调节室内温度并节约能源消耗。",
      "sentence_pinyin": "Zhège zhìnéng wēnkòng xìtǒng nénggòu zìdòng tiáojié shìnèi wēndù bìng jiéyuē néngyuán xiāohào.",
      "sentence_fr": "Ce système de contrôle de température intelligent peut automatiquement ajuster la température intérieure et économiser la consommation d'énergie.",
      "sentence_en": "This smart temperature control system can automatically adjust indoor temperature and save energy consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_climate_control",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在游记散文写作中记录了旅途见闻和心灵感悟。",
      "sentence_pinyin": "Tā zài yóujì sǎnwén xiězuò zhōng jìlùle lǚtú jiànwén hé xīnlíng gǎnwù.",
      "sentence_fr": "Dans l'écriture de récits de voyage, il a enregistré les observations de voyage et les réflexions spirituelles.",
      "sentence_en": "In travel essay writing, he recorded travel observations and spiritual insights.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "travel_writing",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个儿童福利院为孤儿提供了温暖的生活环境和教育机会。",
      "sentence_pinyin": "Zhège értóng fúlì yuàn wèi gū'ér tígōngle wēnnuǎn de shēnghuó huánjìng hé jiàoyù jīhuì.",
      "sentence_fr": "Cet orphelinat fournit un environnement de vie chaleureux et des opportunités éducatives aux orphelins.",
      "sentence_en": "This children's welfare home provides a warm living environment and educational opportunities for orphans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "orphanages",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的展示设计为展览营造了富有感染力的视觉和空间体验。",
      "sentence_pinyin": "Tā de zhǎnshì shèjì wèi zhǎnlǎn yíngzàole fùyǒu gǎnrǎnlì de shìjué hé kōngjiān tǐyàn.",
      "sentence_fr": "Sa conception d'exposition crée une expérience visuelle et spatiale impressionnante pour l'exposition.",
      "sentence_en": "Her exhibition design creates an impressive visual and spatial experience for the exhibition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "exhibition_design",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个黑土地保护工程通过秸秆还田恢复了土壤肥力。",
      "sentence_pinyin": "Zhège hēitǔdì bǎohù gōngchéng tōngguò jiēgǎn huántián huīfùle tǔrǎng féilì.",
      "sentence_fr": "Ce projet de protection des terres noires a restauré la fertilité du sol en retournant les résidus de paille aux champs.",
      "sentence_en": "This black soil protection project restored soil fertility by returning straw residues to fields.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "soil_conservation",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在曲棍球比赛中展现了灵活的走位和精准的传球能力。",
      "sentence_pinyin": "Tā zài qūgùnqiú bǐsài zhōng zhǎnxiànle línghuó de zǒuwèi hé jīngzhǔn de chuánqiú nénglì.",
      "sentence_fr": "Il a démontré un positionnement flexible et une capacité de passe précise lors du match de hockey sur gazon.",
      "sentence_en": "He demonstrated flexible positioning and precise passing ability in the field hockey match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "field_hockey",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区便民服务站提供代办证件和生活缴费等便民服务。",
      "sentence_pinyin": "Zhège shèqū biànmín fúwù zhàn tígōng dàibàn zhèngjiàn hé shēnghuó jiǎofèi děng biànmín fúwù.",
      "sentence_fr": "Ce poste de services de proximité communautaire fournit des services pratiques comme le traitement de documents et le paiement de factures.",
      "sentence_en": "This community convenience service station provides convenient services such as document processing and bill payments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_services",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在蜡染工艺中用蜡刀和染料创作了独特的纹样图案。",
      "sentence_pinyin": "Tā zài làrǎn gōngyì zhōng yòng làdāo hé rǎnliào chuàngzuòle dútè de wényàng tú'àn.",
      "sentence_fr": "Dans l'artisanat de batik, elle a créé des motifs uniques avec un couteau à cire et des teintures.",
      "sentence_en": "In batik craftsmanship, she created unique pattern designs with a wax knife and dyes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "batik_art",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能健身房配备了可以记录运动数据的健身器材。",
      "sentence_pinyin": "Zhège zhìnéng jiànshēn fáng pèibèile kěyǐ jìlù yùndòng shùjù de jiànshēn qìcái.",
      "sentence_fr": "Cette salle de sport intelligente est équipée d'équipements de fitness pouvant enregistrer les données d'exercice.",
      "sentence_en": "This smart gym is equipped with fitness equipment that can record exercise data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_gyms",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在管子演奏中展现了嘹亮高亢的音色和丰富的表现力。",
      "sentence_pinyin": "Tā zài guǎnzi yǎnzòu zhōng zhǎnxiànle liáoliàng gāokàng de yīnsè hé fēngfù de biǎoxiànlì.",
      "sentence_fr": "Il a démontré un timbre clair et aigu et une riche expressivité dans son jeu de guanzi.",
      "sentence_en": "He demonstrated a clear and high-pitched timbre and rich expressiveness in his guanzi performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guanzi_music",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个建筑垃圾资源化处理厂将废弃混凝土转化为再生骨料。",
      "sentence_pinyin": "Zhège jiànzhù lājī zīyuánhuà chǔlǐ chǎng jiāng fèiqì hùnníngtǔ zhuǎnhuà wéi zàishēng gǔliào.",
      "sentence_fr": "Cette usine de traitement de valorisation des déchets de construction transforme le béton usagé en granulats recyclés.",
      "sentence_en": "This construction waste recycling plant transforms waste concrete into recycled aggregates.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "construction_waste",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的互动艺术作品邀请观众参与并成为作品的一部分。",
      "sentence_pinyin": "Tā de hùdòng yìshù zuòpǐn yāoqǐng guānzhòng cānyù bìng chéngwéi zuòpǐn de yī bùfen.",
      "sentence_fr": "Ses œuvres d'art interactives invitent le public à participer et à devenir partie intégrante de l'œuvre.",
      "sentence_en": "Her interactive art works invite the audience to participate and become part of the artwork.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "interactive_art",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个台风路径预报系统提前预测台风移动方向和登陆地点。",
      "sentence_pinyin": "Zhège táifēng lùjìng yùbào xìtǒng tíqián yùcè táifēng yídòng fāngxiàng hé dēnglù dìdiǎn.",
      "sentence_fr": "Ce système de prévision de trajectoire de typhons prédit à l'avance la direction du mouvement et le lieu d'atterrissage des typhons.",
      "sentence_en": "This typhoon path forecasting system predicts typhoon movement direction and landing location in advance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "typhoon_forecasting",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在文艺评论工作中坚持客观公正和学术独立的原则。",
      "sentence_pinyin": "Tā zài wényì pínglùn gōngzuò zhōng jiānchí kèguān gōngzhèng hé xuéshù dúlì de yuánzé.",
      "sentence_fr": "Dans son travail de critique littéraire et artistique, il adhère aux principes d'objectivité, d'équité et d'indépendance académique.",
      "sentence_en": "In his literary and art criticism work, he adheres to principles of objectivity, fairness, and academic independence.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art_criticism",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个养老护理员培训基地提升了从业人员的专业技能水平。",
      "sentence_pinyin": "Zhège yǎnglǎo hùlǐ yuán péixùn jīdì tíshēngle cóngyè rényuán de zhuānyè jìnéng shuǐpíng.",
      "sentence_fr": "Cette base de formation des soignants pour personnes âgées a amélioré le niveau de compétences professionnelles du personnel.",
      "sentence_en": "This elderly care worker training base improved the professional skill level of practitioners.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "caregiver_training",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在跳水比赛中完成了难度系数极高的翻腾动作。",
      "sentence_pinyin": "Tā zài tiàoshuǐ bǐsài zhōng wánchéngle nándù xìshù jí gāo de fānténg dòngzuò.",
      "sentence_fr": "Elle a réalisé des mouvements de saut périlleux avec un coefficient de difficulté extrêmement élevé lors de la compétition de plongeon.",
      "sentence_en": "She completed somersault movements with an extremely high difficulty coefficient in the diving competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "diving",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个双创示范基地为大学生创业提供了政策和资源支持。",
      "sentence_pinyin": "Zhège shuāngchuàng shìfàn jīdì wèi dàxuésheng chuàngyè tígōngle zhèngcè hé zīyuán zhīchí.",
      "sentence_fr": "Cette base de démonstration d'innovation et d'entrepreneuriat fournit un soutien politique et en ressources pour l'entrepreneuriat des étudiants universitaires.",
      "sentence_en": "This innovation and entrepreneurship demonstration base provides policy and resource support for college student entrepreneurship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entrepreneurship_bases",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在景泰蓝制作中掌握了掐丝、点蓝和烧制等全套工艺。",
      "sentence_pinyin": "Tā zài jǐngtàilán zhìzuò zhōng zhǎngwòle qiāsī, diǎnlán hé shāozhì děng quán tào gōngyì.",
      "sentence_fr": "Dans la fabrication de cloisonné, il a maîtrisé l'ensemble des techniques comme le filigrane, l'émaillage et la cuisson.",
      "sentence_en": "In cloisonné making, he mastered the complete set of techniques including wire bending, enameling, and firing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloisonne",
      "created_at": "2025-11-20T19:45:00.000Z",
      "updated_at": "2025-11-20T19:45:00.000Z"
    }
  ]
}
