{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个虚拟现实游戏让玩家体验到身临其境的冒险感觉。",
      "sentence_pinyin": "Zhège xūnǐ xiànshí yóuxì ràng wánjiā tǐyàn dào shēnlínqíjìng de màoxiǎn gǎnjué.",
      "sentence_fr": "Ce jeu de réalité virtuelle permet aux joueurs de vivre une sensation d'aventure immersive.",
      "sentence_en": "This virtual reality game allows players to experience an immersive adventure sensation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "virtual_reality",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在家庭教育中注重培养孩子的独立思考和解决问题的能力。",
      "sentence_pinyin": "Tā zài jiātíng jiàoyù zhōng zhùzhòng péiyǎng háizi de dúlì sīkǎo hé jiějué wèntí de nénglì.",
      "sentence_fr": "Dans l'éducation familiale, elle met l'accent sur le développement de la pensée indépendante et des capacités de résolution de problèmes des enfants.",
      "sentence_en": "In family education, she emphasizes developing children's independent thinking and problem-solving abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "parenting",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个文创产品设计巧妙，将传统元素与现代审美完美结合。",
      "sentence_pinyin": "Zhège wénchuàng chǎnpǐn shèjì qiǎomiào, jiāng chuántǒng yuánsù yǔ xiàndài shěnměi wánměi jiéhé.",
      "sentence_fr": "Ce produit culturel et créatif est conçu de manière ingénieuse, combinant parfaitement éléments traditionnels et esthétique moderne.",
      "sentence_en": "This cultural and creative product is cleverly designed, perfectly combining traditional elements with modern aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "creative_products",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的科普文章深入浅出，让复杂的科学知识变得易于理解。",
      "sentence_pinyin": "Tā de kēpǔ wénzhāng shēnrù qiǎnchū, ràng fùzá de kēxué zhīshi biàn de yìyú lǐjiě.",
      "sentence_fr": "Ses articles de vulgarisation scientifique sont accessibles, rendant les connaissances scientifiques complexes faciles à comprendre.",
      "sentence_en": "His popular science articles are accessible, making complex scientific knowledge easy to understand.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science_communication",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个水处理系统采用先进技术，确保饮用水的安全卫生。",
      "sentence_pinyin": "Zhège shuǐ chǔlǐ xìtǒng cǎiyòng xiānjìn jìshù, quèbǎo yǐnyòng shuǐ de ānquán wèishēng.",
      "sentence_fr": "Ce système de traitement de l'eau utilise une technologie avancée pour garantir la sécurité et l'hygiène de l'eau potable.",
      "sentence_en": "This water treatment system uses advanced technology to ensure the safety and hygiene of drinking water.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "water_treatment",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的舞蹈编排创意十足，将古典与现代风格巧妙融合。",
      "sentence_pinyin": "Tā de wǔdǎo biānpái chuàngyì shízú, jiāng gǔdiǎn yǔ xiàndài fēnggé qiǎomiào rónghé.",
      "sentence_fr": "Sa chorégraphie est pleine de créativité, fusionnant habilement styles classique et moderne.",
      "sentence_en": "Her choreography is full of creativity, skillfully blending classical and modern styles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dance",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个金融科技平台利用区块链技术提高交易的安全性和透明度。",
      "sentence_pinyin": "Zhège jīnróng kējì píngtái lìyòng qūkuàiliàn jìshù tígāo jiāoyì de ānquánxìng hé tòumíngdù.",
      "sentence_fr": "Cette plateforme fintech utilise la technologie blockchain pour améliorer la sécurité et la transparence des transactions.",
      "sentence_en": "This fintech platform uses blockchain technology to improve transaction security and transparency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fintech",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在户外探险活动中学会了团队协作和应急处理技能。",
      "sentence_pinyin": "Tā zài hùwài tànxiǎn huódòng zhōng xuéhuìle tuánduì xiézuò hé yìngjí chǔlǐ jìnéng.",
      "sentence_fr": "Il a appris la collaboration d'équipe et les compétences de gestion d'urgence lors d'activités d'exploration en plein air.",
      "sentence_en": "He learned team collaboration and emergency handling skills during outdoor exploration activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "outdoor_education",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个美术馆收藏了大量现代艺术家的经典作品。",
      "sentence_pinyin": "Zhège měishùguǎn shōucángle dàliàng xiàndài yìshùjiā de jīngdiǎn zuòpǐn.",
      "sentence_fr": "Ce musée d'art abrite une vaste collection d'œuvres classiques d'artistes modernes.",
      "sentence_en": "This art museum houses a large collection of classic works by modern artists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art_museums",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过制定详细的学习计划，成功通过了职业资格考试。",
      "sentence_pinyin": "Tā tōngguò zhìdìng xiángxì de xuéxí jìhuà, chénggōng tōngguòle zhíyè zīgé kǎoshì.",
      "sentence_fr": "En élaborant un plan d'étude détaillé, elle a réussi son examen de qualification professionnelle.",
      "sentence_en": "By developing a detailed study plan, she successfully passed the professional qualification exam.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "professional_certification",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区图书馆定期举办读书分享会和文化讲座活动。",
      "sentence_pinyin": "Zhège shèqū túshūguǎn dìngqī jǔbàn dúshū fēnxiǎnghuì hé wénhuà jiǎngzuò huódòng.",
      "sentence_fr": "Cette bibliothèque communautaire organise régulièrement des séances de partage de lecture et des conférences culturelles.",
      "sentence_en": "This community library regularly holds book sharing sessions and cultural lectures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_libraries",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的建筑作品注重节能环保，获得了绿色建筑认证。",
      "sentence_pinyin": "Tā de jiànzhù zuòpǐn zhùzhòng jiénéng huánbǎo, huòdéle lǜsè jiànzhù rènzhèng.",
      "sentence_fr": "Ses œuvres architecturales mettent l'accent sur l'économie d'énergie et la protection de l'environnement, obtenant une certification de construction verte.",
      "sentence_en": "His architectural works emphasize energy conservation and environmental protection, obtaining green building certification.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_architecture",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个心理咨询中心为青少年提供专业的心理健康服务。",
      "sentence_pinyin": "Zhège xīnlǐ zīxún zhōngxīn wèi qīngshàonián tígōng zhuānyè de xīnlǐ jiànkāng fúwù.",
      "sentence_fr": "Ce centre de conseil psychologique fournit des services de santé mentale professionnels aux adolescents.",
      "sentence_en": "This psychological counseling center provides professional mental health services to adolescents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mental_health",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的视频制作技术专业，内容创意独特，深受粉丝喜爱。",
      "sentence_pinyin": "Tā de shìpín zhìzuò jìshù zhuānyè, nèiróng chuàngyì dútè, shēn shòu fěnsī xǐ'ài.",
      "sentence_fr": "Sa technique de production vidéo est professionnelle, son contenu créatif et unique, très apprécié des fans.",
      "sentence_en": "Her video production technique is professional, content creative and unique, much loved by fans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "video_production",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个交响乐团在国际音乐节上演奏了多首经典曲目。",
      "sentence_pinyin": "Zhège jiāoxiǎng yuètuán zài guójì yīnyuèjié shàng yǎnzòule duō shǒu jīngdiǎn qǔmù.",
      "sentence_fr": "Cet orchestre symphonique a interprété plusieurs morceaux classiques lors du festival de musique international.",
      "sentence_en": "This symphony orchestra performed multiple classical pieces at the international music festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "classical_music",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在创业过程中积累了丰富的市场营销和客户管理经验。",
      "sentence_pinyin": "Tā zài chuàngyè guòchéng zhōng jīlěile fēngfù de shìchǎng yíngxiāo hé kèhù guǎnlǐ jīngyàn.",
      "sentence_fr": "Au cours de son parcours entrepreneurial, il a accumulé une riche expérience en marketing et en gestion de la clientèle.",
      "sentence_en": "During his entrepreneurial journey, he accumulated rich experience in marketing and customer management.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entrepreneurship",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生态农场采用循环农业模式，实现了零废弃物生产。",
      "sentence_pinyin": "Zhège shēngtài nóngchǎng cǎiyòng xúnhuán nóngyè móshì, shíxiànle líng fèiqìwù shēngchǎn.",
      "sentence_fr": "Cette ferme écologique adopte un modèle d'agriculture circulaire, réalisant une production zéro déchet.",
      "sentence_en": "This ecological farm adopts a circular agriculture model, achieving zero-waste production.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sustainable_agriculture",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在职场中善于沟通协调，有效化解了团队之间的矛盾。",
      "sentence_pinyin": "Tā zài zhíchǎng zhōng shànyú gōutōng xiétiáo, yǒuxiào huàjiěle tuánduì zhījiān de máodùn.",
      "sentence_fr": "Au travail, elle est douée pour la communication et la coordination, résolvant efficacement les conflits entre équipes.",
      "sentence_en": "At work, she is good at communication and coordination, effectively resolving conflicts between teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "workplace_skills",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个天文台配备了高性能望远镜，用于观测深空天体。",
      "sentence_pinyin": "Zhège tiānwéntái pèibèile gāo xìngnéng wàngyuǎnjìng, yòngyú guāncè shēnkōng tiāntǐ.",
      "sentence_fr": "Cet observatoire est équipé de télescopes haute performance pour observer les objets célestes en espace profond.",
      "sentence_en": "This observatory is equipped with high-performance telescopes for observing deep space celestial objects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "astronomy",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的纪实摄影作品记录了社会变迁和人民生活的真实面貌。",
      "sentence_pinyin": "Tā de jìshí shèyǐng zuòpǐn jìlùle shèhuì biànqiān hé rénmín shēnghuó de zhēnshí miànmào.",
      "sentence_fr": "Ses œuvres de photographie documentaire capturent l'évolution sociale et la vraie nature de la vie des gens.",
      "sentence_en": "His documentary photography works capture social changes and the true face of people's lives.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "documentary_photography",
      "created_at": "2025-11-20T17:45:00.000Z",
      "updated_at": "2025-11-20T17:45:00.000Z"
    }
  ]
}
