{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "变形材料研究开发能够根据环境刺激改变形状和性能的智能材料。",
      "sentence_pinyin": "Biànxíng cáiliào yánjiū kāifā nénggòu gēnjù huánjìng cìjī gǎibiàn xíngzhuàng hé xìngnéng de zhìnéng cáiliào.",
      "sentence_fr": "La recherche sur les matériaux morphiques développe des matériaux intelligents capables de changer de forme et de propriétés en réponse aux stimuli environnementaux.",
      "sentence_en": "Morphing materials research develops smart materials that can change shape and properties in response to environmental stimuli.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "morphing_materials",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "健康传播学研究如何有效传达健康信息以促进健康行为改变。",
      "sentence_pinyin": "Jiànkāng chuánbō xué yánjiū rúhé yǒuxiào chuándá jiànkāng xìnxī yǐ cùjìn jiànkāng xíngwéi gǎibiàn.",
      "sentence_fr": "La communication de santé étudie comment transmettre efficacement les informations sanitaires pour promouvoir les changements de comportement en matière de santé.",
      "sentence_en": "Health communication studies how to effectively convey health information to promote health behavior change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "health_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "边缘人工智能将机器学习模型部署在本地设备上以减少延迟和保护隐私。",
      "sentence_pinyin": "Biānyuán réngōng zhìnéng jiāng jīqì xuéxí móxíng bùshǔ zài běndì shèbèi shàng yǐ jiǎnshǎo yánchí hé bǎohù yǐnsī.",
      "sentence_fr": "L'intelligence artificielle en périphérie déploie des modèles d'apprentissage automatique sur des appareils locaux pour réduire la latence et protéger la vie privée.",
      "sentence_en": "Edge AI deploys machine learning models on local devices to reduce latency and protect privacy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "edge_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会凝聚力研究探索维系社会团结和社区归属感的因素。",
      "sentence_pinyin": "Shèhuì níngjù lì yánjiū tànsuǒ wéixì shèhuì tuánjié hé shèqū guīshǔ gǎn de yīnsù.",
      "sentence_fr": "La recherche sur la cohésion sociale explore les facteurs qui maintiennent la solidarité sociale et le sentiment d'appartenance communautaire.",
      "sentence_en": "Social cohesion research explores factors that maintain social solidarity and community belonging.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_cohesion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新陈代谢组学通过分析小分子代谢物来揭示生物体的生理和病理状态。",
      "sentence_pinyin": "Xīnchén dàixiè zǔ xué tōngguò fēnxī xiǎo fēnzǐ dàixiè wù lái jiēshì shēngwùtǐ de shēnglǐ hé bìnglǐ zhuàngtài.",
      "sentence_fr": "La métabolomique révèle les états physiologiques et pathologiques des organismes en analysant les petites molécules métaboliques.",
      "sentence_en": "Metabolomics reveals physiological and pathological states of organisms by analyzing small molecule metabolites.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metabolomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海上风电场选址需要综合考虑风力资源、海洋生态和航运安全等多重因素。",
      "sentence_pinyin": "Hǎishàng fēngdiàn chǎng xuǎnzhǐ xūyào zōnghé kǎolǜ fēnglì zīyuán, hǎiyáng shēngtài hé hángyùn ānquán děng duō chóng yīnsù.",
      "sentence_fr": "Le choix d'un site pour un parc éolien offshore doit tenir compte de multiples facteurs tels que les ressources éoliennes, l'écologie marine et la sécurité de la navigation.",
      "sentence_en": "Offshore wind farm siting must comprehensively consider multiple factors such as wind resources, marine ecology, and shipping safety.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "offshore_wind_siting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "话语分析方法揭示语言使用如何反映和构建社会权力关系。",
      "sentence_pinyin": "Huàyǔ fēnxī fāngfǎ jiēshì yǔyán shǐyòng rúhé fǎnyìng hé jiàngòu shèhuì quánlì guānxì.",
      "sentence_fr": "Les méthodes d'analyse du discours révèlent comment l'utilisation du langage reflète et construit les relations de pouvoir sociales.",
      "sentence_en": "Discourse analysis methods reveal how language use reflects and constructs social power relations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "discourse_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络物理系统将计算与物理过程深度融合以实现智能自动化控制。",
      "sentence_pinyin": "Wǎngluò wùlǐ xìtǒng jiāng jìsuàn yǔ wùlǐ guòchéng shēndù rónghé yǐ shíxiàn zhìnéng zìdòng huà kòngzhì.",
      "sentence_fr": "Les systèmes cyber-physiques intègrent en profondeur le calcul et les processus physiques pour réaliser un contrôle automatisé intelligent.",
      "sentence_en": "Cyber-physical systems deeply integrate computation and physical processes to achieve intelligent automated control.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cyber_physical_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "药物警戒系统监测已上市药品的安全性以发现新的不良反应。",
      "sentence_pinyin": "Yàowù jǐngjì xìtǒng jiāncè yǐ shàngshì yàopǐn de ānquán xìng yǐ fāxiàn xīn de bùliáng fǎnyìng.",
      "sentence_fr": "Les systèmes de pharmacovigilance surveillent la sécurité des médicaments commercialisés pour détecter de nouvelles réactions indésirables.",
      "sentence_en": "Pharmacovigilance systems monitor the safety of marketed drugs to detect new adverse reactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pharmacovigilance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极化现象研究分析社会如何在政治和文化议题上日益分裂。",
      "sentence_pinyin": "Jíhuà xiànxiàng yánjiū fēnxī shèhuì rúhé zài zhèngzhì hé wénhuà yìtí shàng rìyì fēnliè.",
      "sentence_fr": "La recherche sur la polarisation analyse comment les sociétés se divisent de plus en plus sur les questions politiques et culturelles.",
      "sentence_en": "Polarization research analyzes how societies are becoming increasingly divided on political and cultural issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "polarization_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物声学研究利用声音记录来监测野生动物种群和生态系统健康。",
      "sentence_pinyin": "Shēngwù shēngxué yánjiū lìyòng shēngyīn jìlù lái jiāncè yěshēng dòngwù zhǒngqún hé shēngtài xìtǒng jiànkāng.",
      "sentence_fr": "La recherche bioacoustique utilise des enregistrements sonores pour surveiller les populations d'animaux sauvages et la santé des écosystèmes.",
      "sentence_en": "Bioacoustics research uses sound recordings to monitor wildlife populations and ecosystem health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bioacoustics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协同消费平台促进了商品和服务在用户之间的共享和交换。",
      "sentence_pinyin": "Xiétóng xiāofèi píngtái cùjìn le shāngpǐn hé fúwù zài yònghù zhījiān de gòngxiǎng hé jiāohuàn.",
      "sentence_fr": "Les plateformes de consommation collaborative facilitent le partage et l'échange de biens et de services entre utilisateurs.",
      "sentence_en": "Collaborative consumption platforms facilitate sharing and exchange of goods and services among users.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "collaborative_consumption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光伏电池效率的不断提升正在加速太阳能发电的成本下降。",
      "sentence_pinyin": "Guāngfú diànchí xiàolǜ de bùduàn tíshēng zhèngzài jiāsù tàiyáng néng fādiàn de chéngběn xiàjiàng.",
      "sentence_fr": "L'amélioration continue de l'efficacité des cellules photovoltaïques accélère la baisse des coûts de la production d'énergie solaire.",
      "sentence_en": "Continuous improvements in photovoltaic cell efficiency are accelerating the cost reduction of solar power generation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "photovoltaic_efficiency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "创业生态系统研究分析初创企业成功所需的支持网络和资源。",
      "sentence_pinyin": "Chuàngyè shēngtài xìtǒng yánjiū fēnxī chūchuàng qǐyè chénggōng suǒ xū de zhīchí wǎngluò hé zīyuán.",
      "sentence_fr": "La recherche sur les écosystèmes entrepreneuriaux analyse les réseaux de soutien et les ressources nécessaires au succès des startups.",
      "sentence_en": "Entrepreneurial ecosystem research analyzes the support networks and resources needed for startup success.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "entrepreneurial_ecosystems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "冷冻电镜技术革命性地提高了观察生物分子结构的分辨率。",
      "sentence_pinyin": "Lěngdòng diànjìng jìshù gémìng xìng de tígāo le guānchá shēngwù fēnzǐ jiégòu de fēnbiànlǜ.",
      "sentence_fr": "La technologie de cryomicroscopie électronique a révolutionné la résolution d'observation des structures biomoléculaires.",
      "sentence_en": "Cryo-electron microscopy technology has revolutionarily improved the resolution of observing biomolecular structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cryo_electron_microscopy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言政策研究分析政府如何通过法规影响语言使用和语言地位。",
      "sentence_pinyin": "Yǔyán zhèngcè yánjiū fēnxī zhèngfǔ rúhé tōngguò fǎguī yǐngxiǎng yǔyán shǐyòng hé yǔyán dìwèi.",
      "sentence_fr": "La recherche sur les politiques linguistiques analyse comment les gouvernements influencent l'usage et le statut des langues par la réglementation.",
      "sentence_en": "Language policy research analyzes how governments influence language use and status through regulations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协作过滤算法通过分析用户行为模式来生成个性化推荐。",
      "sentence_pinyin": "Xiézuò guòlǜ suànfǎ tōngguò fēnxī yònghù xíngwéi móshì lái shēngchéng gèxìng huà tuījiàn.",
      "sentence_fr": "Les algorithmes de filtrage collaboratif génèrent des recommandations personnalisées en analysant les schémas de comportement des utilisateurs.",
      "sentence_en": "Collaborative filtering algorithms generate personalized recommendations by analyzing user behavior patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "collaborative_filtering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "童年逆境经历对大脑发育和终身健康具有深远的影响。",
      "sentence_pinyin": "Tóngnián nìjìng jīnglì duì dànǎo fāyù hé zhōngshēn jiànkāng jùyǒu shēnyuǎn de yǐngxiǎng.",
      "sentence_fr": "Les expériences adverses de l'enfance ont un impact profond sur le développement cérébral et la santé tout au long de la vie.",
      "sentence_en": "Adverse childhood experiences have profound impacts on brain development and lifelong health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "adverse_childhood_experiences",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绿色债券为环境友好型项目提供了创新性的融资渠道。",
      "sentence_pinyin": "Lǜsè zhàiquàn wèi huánjìng yǒuhǎo xíng xiàngmù tígōng le chuàngxīn xìng de róngzī qúdào.",
      "sentence_fr": "Les obligations vertes offrent des canaux de financement innovants pour les projets respectueux de l'environnement.",
      "sentence_en": "Green bonds provide innovative financing channels for environmentally friendly projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_bonds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "感觉统合训练帮助有发育障碍的儿童更好地处理感觉信息。",
      "sentence_pinyin": "Gǎnjué tǒnghé xùnliàn bāngzhù yǒu fāyù zhàng'ài de értóng gèng hǎo de chǔlǐ gǎnjué xìnxī.",
      "sentence_fr": "L'entraînement à l'intégration sensorielle aide les enfants ayant des troubles du développement à mieux traiter les informations sensorielles.",
      "sentence_en": "Sensory integration training helps children with developmental disorders better process sensory information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sensory_integration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
