{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能手环可以监测心率、睡眠质量和运动数据,帮助用户管理健康。",
      "sentence_pinyin": "Zhège zhìnéng shǒuhuán kěyǐ jiāncè xīnlǜ, shuìmián zhìliàng hé yùndòng shùjù, bāngzhù yònghù guǎnlǐ jiànkāng.",
      "sentence_fr": "Ce bracelet intelligent peut surveiller la fréquence cardiaque, la qualité du sommeil et les données d'activité, aidant les utilisateurs à gérer leur santé.",
      "sentence_en": "This smart bracelet can monitor heart rate, sleep quality, and exercise data, helping users manage their health.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_wearables",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "豫剧是河南的地方戏曲,唱腔慷慨激昂,深受中原地区观众的喜爱。",
      "sentence_pinyin": "Yùjù shì Hénán de dìfāng xìqǔ, chàngqiāng kāngkǎi jī'áng, shēn shòu Zhōngyuán dìqū guānzhòng de xǐ'ài.",
      "sentence_fr": "L'opéra Yu est un opéra régional du Henan, avec un chant généreux et passionné, très apprécié du public de la région du Zhongyuan.",
      "sentence_en": "Yu opera is a regional opera of Henan, with generous and passionate singing, deeply loved by audiences in the Central Plains region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新型环保公交车采用电力驱动,零排放,减少了城市空气污染。",
      "sentence_pinyin": "Xīnxíng huánbǎo gōngjiāochē cǎiyòng diànlì qūdòng, líng páifàng, jiǎnshǎo le chéngshì kōngqì wūrǎn.",
      "sentence_fr": "Les nouveaux bus écologiques fonctionnent à l'électricité, sans émissions, réduisant la pollution atmosphérique urbaine.",
      "sentence_en": "New eco-friendly buses use electric power, producing zero emissions, reducing urban air pollution.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "electric_buses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能衣柜可以根据天气和场合推荐穿搭,还能自动整理衣物。",
      "sentence_pinyin": "Zhìnéng yīguì kěyǐ gēnjù tiānqì hé chǎnghé tuījiàn chuāndā, hái néng zìdòng zhěnglǐ yīwù.",
      "sentence_fr": "L'armoire intelligente peut recommander des tenues selon la météo et l'occasion, et peut aussi ranger automatiquement les vêtements.",
      "sentence_en": "The smart wardrobe can recommend outfits based on weather and occasion, and can automatically organize clothes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_wardrobes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的草编工艺利用天然草料编织各种实用器具和装饰品。",
      "sentence_pinyin": "Zhōngguó chuántǒng de cǎobiān gōngyì lìyòng tiānrán cǎoliào biānzhī gèzhǒng shíyòng qìjù hé zhuāngshìpǐn.",
      "sentence_fr": "L'artisanat traditionnel chinois de tressage d'herbe utilise des matériaux naturels pour créer divers ustensiles pratiques et décorations.",
      "sentence_en": "Traditional Chinese grass weaving craftsmanship uses natural grass materials to weave various practical utensils and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grass_weaving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能烟雾报警器可以连接手机,在检测到烟雾时立即发送警报。",
      "sentence_pinyin": "Zhìnéng yānwù bàojǐngqì kěyǐ liánjiē shǒujī, zài jiǎncè dào yānwù shí lìjí fāsòng jǐngbào.",
      "sentence_fr": "Le détecteur de fumée intelligent peut se connecter au téléphone et envoyer immédiatement une alerte lorsqu'il détecte de la fumée.",
      "sentence_en": "The smart smoke detector can connect to a phone and immediately send an alert when smoke is detected.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fire_alarms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "秦腔是陕西的地方戏曲,以其粗犷豪放的唱腔风格闻名全国。",
      "sentence_pinyin": "Qínqiāng shì Shǎnxī de dìfāng xìqǔ, yǐ qí cūguǎng háofàng de chàngqiāng fēnggé wénmíng quánguó.",
      "sentence_fr": "L'opéra Qin est un opéra régional du Shaanxi, célèbre dans tout le pays pour son style de chant rugueux et audacieux.",
      "sentence_en": "Qin opera is a regional opera of Shaanxi, famous nationwide for its rough and bold singing style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qin_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市立体绿化工程在建筑外墙种植绿色植物,美化城市环境。",
      "sentence_pinyin": "Chéngshì lìtǐ lǜhuà gōngchéng zài jiànzhù wàiqiáng zhòngzhí lǜsè zhíwù, měihuà chéngshì huánjìng.",
      "sentence_fr": "Les projets de verdissement vertical urbain plantent des végétaux sur les murs extérieurs des bâtiments, embellissant l'environnement urbain.",
      "sentence_en": "Urban vertical greening projects plant green vegetation on building exterior walls, beautifying the urban environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vertical_greening",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能跑步机可以根据用户的心率自动调节速度和坡度。",
      "sentence_pinyin": "Zhìnéng pǎobùjī kěyǐ gēnjù yònghù de xīnlǜ zìdòng tiáojié sùdù hé pōdù.",
      "sentence_fr": "Le tapis de course intelligent peut ajuster automatiquement la vitesse et l'inclinaison en fonction de la fréquence cardiaque de l'utilisateur.",
      "sentence_en": "The smart treadmill can automatically adjust speed and incline based on the user's heart rate.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_treadmills",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的葫芦雕刻艺术将普通的葫芦变成精美的艺术品。",
      "sentence_pinyin": "Zhōngguó chuántǒng de húlu diāokè yìshù jiāng pǔtōng de húlu biànchéng jīngměi de yìshùpǐn.",
      "sentence_fr": "L'art traditionnel chinois de la sculpture sur calebasse transforme des calebasses ordinaires en œuvres d'art exquises.",
      "sentence_en": "Traditional Chinese gourd carving art transforms ordinary gourds into exquisite works of art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gourd_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能门锁可以记录每次开门的时间和方式,提高家庭安全性。",
      "sentence_pinyin": "Zhìnéng ménsuǒ kěyǐ jìlù měi cì kāimén de shíjiān hé fāngshì, tígāo jiātíng ānquánxìng.",
      "sentence_fr": "La serrure intelligente peut enregistrer l'heure et la méthode de chaque ouverture de porte, améliorant la sécurité domestique.",
      "sentence_en": "The smart lock can record the time and method of each door opening, improving home security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_locks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "晋剧是山西的地方戏曲,唱腔激越奔放,具有浓郁的地方特色。",
      "sentence_pinyin": "Jìnjù shì Shānxī de dìfāng xìqǔ, chàngqiāng jīyuè bēnfàng, jùyǒu nóngyù de dìfāng tèsè.",
      "sentence_fr": "L'opéra Jin est un opéra régional du Shanxi, avec un chant passionné et libre, très caractéristique de la région.",
      "sentence_en": "Jin opera is a regional opera of Shanxi, with passionate and free-flowing singing, featuring strong regional characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jin_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区为残疾人设置了无障碍通道,方便他们的日常出行。",
      "sentence_pinyin": "Zhège shèqū wèi cánjírén shèzhì le wúzhàng'ài tōngdào, fāngbiàn tāmen de rìcháng chūxíng.",
      "sentence_fr": "Cette communauté a installé des passages sans obstacles pour les personnes handicapées, facilitant leurs déplacements quotidiens.",
      "sentence_en": "This community has set up barrier-free passages for disabled people, facilitating their daily travel.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "accessibility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子秤可以记录称重历史,并通过应用分析食材营养成分。",
      "sentence_pinyin": "Zhìnéng diànzǐ chèng kěyǐ jìlù chēngzhòng lìshǐ, bìng tōngguò yìngyòng fēnxī shícái yíngyǎng chéngfèn.",
      "sentence_fr": "La balance électronique intelligente peut enregistrer l'historique des pesées et analyser les nutriments des ingrédients via une application.",
      "sentence_en": "The smart electronic scale can record weighing history and analyze ingredient nutrients through an app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_kitchen_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的瓷板画将绘画艺术与瓷器工艺完美结合在一起。",
      "sentence_pinyin": "Zhōngguó chuántǒng de cíbǎn huà jiāng huìhuà yìshù yǔ cíqì gōngyì wánměi jiéhé zài yīqǐ.",
      "sentence_fr": "La peinture traditionnelle chinoise sur plaques de porcelaine combine parfaitement l'art de la peinture et l'artisanat de la céramique.",
      "sentence_en": "Traditional Chinese porcelain panel painting perfectly combines painting art with ceramic craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "porcelain_painting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能眼镜可以拍照录像,还能显示导航信息和接收通知。",
      "sentence_pinyin": "Zhìnéng yǎnjìng kěyǐ pāizhào lùxiàng, hái néng xiǎnshì dǎoháng xìnxī hé jiēshōu tōngzhī.",
      "sentence_fr": "Les lunettes intelligentes peuvent prendre des photos et enregistrer des vidéos, afficher des informations de navigation et recevoir des notifications.",
      "sentence_en": "Smart glasses can take photos and videos, display navigation information, and receive notifications.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_glasses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "吕剧是山东的地方戏曲,语言朴实,曲调优美动听。",
      "sentence_pinyin": "Lǚjù shì Shāndōng de dìfāng xìqǔ, yǔyán pǔshí, qǔdiào yōuměi dòngtīng.",
      "sentence_fr": "L'opéra Lü est un opéra régional du Shandong, avec un langage simple et des mélodies agréables.",
      "sentence_en": "Lü opera is a regional opera of Shandong, with simple language and beautiful, pleasant melodies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳能路灯白天储能晚上发光,不需要额外的电力供应。",
      "sentence_pinyin": "Tàiyángnéng lùdēng báitiān chǔnéng wǎnshàng fāguāng, bù xūyào éwài de diànlì gōngyìng.",
      "sentence_fr": "Les lampadaires solaires stockent l'énergie le jour et éclairent la nuit, sans besoin d'alimentation électrique supplémentaire.",
      "sentence_en": "Solar street lights store energy during the day and illuminate at night, requiring no additional power supply.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "solar_lighting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能健身镜可以在镜面上显示健身课程,指导用户进行锻炼。",
      "sentence_pinyin": "Zhìnéng jiànshēn jìng kěyǐ zài jìngmiàn shàng xiǎnshì jiànshēn kèchéng, zhǐdǎo yònghù jìnxíng duànliàn.",
      "sentence_fr": "Le miroir de fitness intelligent peut afficher des cours d'exercice sur sa surface, guidant les utilisateurs dans leur entraînement.",
      "sentence_en": "The smart fitness mirror can display workout classes on its surface, guiding users through exercises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fitness_mirrors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的核雕艺术在小小的果核上雕刻出精细的人物和风景。",
      "sentence_pinyin": "Zhōngguó chuántǒng de hédiāo yìshù zài xiǎoxiǎo de guǒhé shàng diāokè chū jīngxì de rénwù hé fēngjǐng.",
      "sentence_fr": "L'art traditionnel chinois de la sculpture sur noyau de fruit grave des personnages et des paysages délicats sur de petits noyaux.",
      "sentence_en": "Traditional Chinese pit carving art carves delicate figures and landscapes on tiny fruit pits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pit_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
