{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个农村电商培训项目帮助村民掌握了网上销售农产品的技能。",
      "sentence_pinyin": "Zhège nóngcūn diànshāng péixùn xiàngmù bāngzhù cūnmín zhǎngwòle wǎngshàng xiāoshòu nóngchǎnpǐn de jìnéng.",
      "sentence_fr": "Ce programme de formation au commerce électronique rural aide les villageois à maîtriser les compétences de vente de produits agricoles en ligne.",
      "sentence_en": "This rural e-commerce training program helps villagers master the skills of selling agricultural products online.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_ecommerce",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在二胡演奏中表达了丰富的情感和深刻的艺术内涵。",
      "sentence_pinyin": "Tā zài èrhú yǎnzòu zhōng biǎodále fēngfù de qínggǎn hé shēnkè de yìshù nèihán.",
      "sentence_fr": "Elle a exprimé des émotions riches et une profonde signification artistique dans son jeu d'erhu.",
      "sentence_en": "She expressed rich emotions and profound artistic connotation in her erhu performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_music",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能穿戴设备可以监测用户的心率、血压和运动数据。",
      "sentence_pinyin": "Zhège zhìnéng chuāndài shèbèi kěyǐ jiāncè yònghù de xīnlǜ, xuèyā hé yùndòng shùjù.",
      "sentence_fr": "Cet appareil portable intelligent peut surveiller la fréquence cardiaque, la pression artérielle et les données d'activité de l'utilisateur.",
      "sentence_en": "This smart wearable device can monitor the user's heart rate, blood pressure, and activity data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wearable_tech",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在诗歌创作中追求语言的凝练和意境的深远。",
      "sentence_pinyin": "Tā zài shīgē chuàngzuò zhōng zhuīqiú yǔyán de níngliàn hé yìjìng de shēnyuǎn.",
      "sentence_fr": "Dans la création poétique, il recherche la concision du langage et la profondeur de la signification artistique.",
      "sentence_en": "In poetry creation, he pursues language conciseness and profound artistic conception.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poetry_writing",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区食堂为独居老人提供营养均衡的三餐配送服务。",
      "sentence_pinyin": "Zhège shèqū shítáng wèi dújū lǎorén tígōng yíngyǎng jūnhéng de sān cān pèisòng fúwù.",
      "sentence_fr": "Cette cantine communautaire fournit un service de livraison de trois repas équilibrés sur le plan nutritionnel aux personnes âgées vivant seules.",
      "sentence_en": "This community canteen provides nutritionally balanced three-meal delivery service for elderly people living alone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "meal_delivery",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的纺织品设计将传统织造工艺与现代审美完美结合。",
      "sentence_pinyin": "Tā de fǎngzhīpǐn shèjì jiāng chuántǒng zhīzào gōngyì yǔ xiàndài shěnměi wánměi jiéhé.",
      "sentence_fr": "Sa conception textile combine parfaitement l'artisanat de tissage traditionnel avec l'esthétique moderne.",
      "sentence_en": "Her textile design perfectly combines traditional weaving craftsmanship with modern aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "textile_design",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生物识别系统通过指纹和面部识别提供安全验证。",
      "sentence_pinyin": "Zhège shēngwù shíbié xìtǒng tōngguò zhǐwén hé miànbù shíbié tígōng ānquán yànzhèng.",
      "sentence_fr": "Ce système d'identification biométrique fournit une vérification sécurisée par reconnaissance d'empreintes digitales et faciale.",
      "sentence_en": "This biometric identification system provides secure verification through fingerprint and facial recognition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biometric_security",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在冰球比赛中展现了出色的滑冰技术和团队配合能力。",
      "sentence_pinyin": "Tā zài bīngqiú bǐsài zhōng zhǎnxiànle chūsè de huábīng jìshù hé tuánduì pèihé nénglì.",
      "sentence_fr": "Il a démontré d'excellentes compétences en patinage et en travail d'équipe lors du match de hockey sur glace.",
      "sentence_en": "He demonstrated excellent skating skills and teamwork ability in the ice hockey match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ice_hockey",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字图书馆收藏了海量的电子书籍和学术资源。",
      "sentence_pinyin": "Zhège shùzì túshūguǎn shōucángle hǎiliàng de diànzǐ shūjí hé xuéshù zīyuán.",
      "sentence_fr": "Cette bibliothèque numérique contient une vaste collection de livres électroniques et de ressources académiques.",
      "sentence_en": "This digital library houses a vast collection of e-books and academic resources.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_libraries",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在皮影戏表演中传承了这门古老的民间艺术形式。",
      "sentence_pinyin": "Tā zài píyǐngxì biǎoyǎn zhōng chuánchéngle zhè mén gǔlǎo de mínjiān yìshù xíngshì.",
      "sentence_fr": "Dans sa performance de théâtre d'ombres, elle a perpétué cette forme d'art populaire ancienne.",
      "sentence_en": "In her shadow puppet theater performance, she perpetuated this ancient folk art form.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shadow_puppetry",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个云计算平台为企业提供了灵活可扩展的数据存储方案。",
      "sentence_pinyin": "Zhège yún jìsuàn píngtái wèi qǐyè tígōngle línghuó kě kuòzhǎn de shùjù cúnchǔ fāng'àn.",
      "sentence_fr": "Cette plateforme de cloud computing fournit aux entreprises des solutions de stockage de données flexibles et évolutives.",
      "sentence_en": "This cloud computing platform provides enterprises with flexible and scalable data storage solutions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_computing",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在手工制皂工艺中使用天然植物精油和有机原料。",
      "sentence_pinyin": "Tā zài shǒugōng zhìzào gōngyì zhōng shǐyòng tiānrán zhíwù jīngyóu hé yǒujī yuánliào.",
      "sentence_fr": "Dans l'artisanat de fabrication de savon, il utilise des huiles essentielles végétales naturelles et des ingrédients biologiques.",
      "sentence_en": "In handmade soap crafting, he uses natural plant essential oils and organic ingredients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "soap_making",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环境监测系统实时追踪水质、土壤和空气的污染状况。",
      "sentence_pinyin": "Zhège huánjìng jiāncè xìtǒng shíshí zhuīzōng shuǐzhì, tǔrǎng hé kōngqì de wūrǎn zhuàngkuàng.",
      "sentence_fr": "Ce système de surveillance environnementale suit en temps réel l'état de pollution de l'eau, du sol et de l'air.",
      "sentence_en": "This environmental monitoring system tracks water, soil, and air pollution status in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_monitoring",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的现代舞作品通过肢体语言探讨了人与自然的关系。",
      "sentence_pinyin": "Tā de xiàndàiwǔ zuòpǐn tōngguò zhītǐ yǔyán tàntǎole rén yǔ zìrán de guānxi.",
      "sentence_fr": "Ses œuvres de danse moderne explorent la relation entre l'homme et la nature à travers le langage corporel.",
      "sentence_en": "Her modern dance works explore the relationship between humans and nature through body language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "modern_dance",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创客空间为发明爱好者提供了工具设备和技术支持。",
      "sentence_pinyin": "Zhège chuàngkè kōngjiān wèi fāmíng àihàozhě tígōngle gōngjù shèbèi hé jìshù zhīchí.",
      "sentence_fr": "Cet espace de makers fournit des outils, des équipements et un support technique aux passionnés d'invention.",
      "sentence_en": "This maker space provides tools, equipment, and technical support for invention enthusiasts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maker_spaces",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在橄榄球比赛中发挥了出色的突破和传球能力。",
      "sentence_pinyin": "Tā zài gǎnlǎnqiú bǐsài zhōng fāhuīle chūsè de túpò hé chuánqiú nénglì.",
      "sentence_fr": "Il a démontré d'excellentes capacités de percée et de passe lors du match de rugby.",
      "sentence_en": "He demonstrated excellent breakthrough and passing abilities in the rugby match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rugby",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个心理健康热线全天候为有需要的人提供情绪疏导。",
      "sentence_pinyin": "Zhège xīnlǐ jiànkāng rèxiàn quántiānhòu wèi yǒu xūyào de rén tígōng qíngxù shūdǎo.",
      "sentence_fr": "Cette ligne d'assistance en santé mentale fournit un soutien émotionnel 24h/24 aux personnes dans le besoin.",
      "sentence_en": "This mental health hotline provides emotional support 24/7 for people in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mental_health_hotlines",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的金属雕塑作品展现了工业文明与自然之美的对话。",
      "sentence_pinyin": "Tā de jīnshǔ diāosù zuòpǐn zhǎnxiànle gōngyè wénmíng yǔ zìrán zhī měi de duìhuà.",
      "sentence_fr": "Ses sculptures métalliques présentent un dialogue entre la civilisation industrielle et la beauté naturelle.",
      "sentence_en": "Her metal sculptures present a dialogue between industrial civilization and natural beauty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "metal_sculpture",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个节能改造项目大幅降低了建筑物的能源消耗和运营成本。",
      "sentence_pinyin": "Zhège jiénéng gǎizào xiàngmù dàfú jiàngdīle jiànzhùwù de néngyuán xiāohào hé yùnyíng chéngběn.",
      "sentence_fr": "Ce projet de rénovation énergétique a considérablement réduit la consommation d'énergie et les coûts d'exploitation des bâtiments.",
      "sentence_en": "This energy-saving renovation project significantly reduced the building's energy consumption and operating costs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "energy_efficiency",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在戏曲表演中展现了扎实的基本功和深厚的艺术修养。",
      "sentence_pinyin": "Tā zài xìqǔ biǎoyǎn zhōng zhǎnxiànle zhāshi de jīběngōng hé shēnhòu de yìshù xiūyǎng.",
      "sentence_fr": "Dans sa performance d'opéra traditionnel, il a démontré des bases solides et une profonde culture artistique.",
      "sentence_en": "In his traditional opera performance, he demonstrated solid fundamentals and profound artistic cultivation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "traditional_opera",
      "created_at": "2025-11-20T19:05:00.000Z",
      "updated_at": "2025-11-20T19:05:00.000Z"
    }
  ]
}
