{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "生成对抗网络在图像合成和风格迁移领域取得了令人瞩目的成果。",
      "sentence_pinyin": "Shēngchéng duìkàng wǎngluò zài túxiàng héchéng hé fēnggé qiānyí lǐngyù qǔdé le lìng rén zhǔmù de chéngguǒ.",
      "sentence_fr": "Les réseaux antagonistes génératifs ont obtenu des résultats remarquables dans la synthèse d'images et le transfert de style.",
      "sentence_en": "Generative adversarial networks have achieved remarkable results in image synthesis and style transfer.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "generative_adversarial_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学传播工作者致力于将复杂的科学知识以通俗易懂的方式介绍给公众。",
      "sentence_pinyin": "Kēxué chuánbò gōngzuòzhě zhìlì yú jiāng fùzá de kēxué zhīshi yǐ tōngsú yìdǒng de fāngshì jièshào gěi gōngzhòng.",
      "sentence_fr": "Les communicateurs scientifiques s'efforcent de présenter des connaissances scientifiques complexes au public de manière accessible.",
      "sentence_en": "Science communicators are dedicated to presenting complex scientific knowledge to the public in an accessible way.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "science_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位雕塑家运用回收材料创作的作品引发了对消费主义的深刻反思。",
      "sentence_pinyin": "Zhè wèi diāosùjiā yùnyòng huíshōu cáiliào chuàngzuò de zuòpǐn yǐnfā le duì xiāofèizhǔyì de shēnkè fǎnsī.",
      "sentence_fr": "Les œuvres de ce sculpteur créées à partir de matériaux recyclés suscitent une réflexion profonde sur le consumérisme.",
      "sentence_en": "This sculptor's works created using recycled materials have sparked deep reflection on consumerism.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "recycled_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "肠脑轴研究揭示了消化系统与心理健康之间的双向信号通讯机制。",
      "sentence_pinyin": "Chángnǎozhóu yánjiū jiēshì le xiāohuà xìtǒng yǔ xīnlǐ jiànkāng zhījiān de shuāngxiàng xìnhào tōngxùn jīzhì.",
      "sentence_fr": "La recherche sur l'axe intestin-cerveau révèle les mécanismes de communication bidirectionnelle entre le système digestif et la santé mentale.",
      "sentence_en": "Gut-brain axis research reveals the bidirectional signaling communication mechanisms between the digestive system and mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gut_brain_axis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市应急响应系统整合了多部门资源以提高灾害处置的协调效率。",
      "sentence_pinyin": "Chéngshì yìngjí xiǎngyìng xìtǒng zhěnghé le duō bùmén zīyuán yǐ tígāo zāihài chǔzhì de xiétiáo xiàolǜ.",
      "sentence_fr": "Les systèmes de réponse d'urgence urbaine intègrent les ressources de plusieurs départements pour améliorer l'efficacité de la coordination dans la gestion des catastrophes.",
      "sentence_en": "Urban emergency response systems integrate multi-department resources to improve coordination efficiency in disaster management.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emergency_response_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算机视觉技术在自动化质量检测和缺陷识别方面展现了广阔的应用前景。",
      "sentence_pinyin": "Jìsuànjī shìjué jìshù zài zìdònghuà zhìliàng jiǎncè hé quēxiàn shìbié fāngmiàn zhǎnxiàn le guǎngkuò de yìngyòng qiánjǐng.",
      "sentence_fr": "La technologie de vision par ordinateur présente de vastes perspectives d'application dans le contrôle qualité automatisé et la détection des défauts.",
      "sentence_en": "Computer vision technology shows broad application prospects in automated quality inspection and defect detection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computer_vision",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共历史学强调让普通民众参与历史记忆的建构和传播过程。",
      "sentence_pinyin": "Gōnggòng lìshǐxué qiángdiào ràng pǔtōng mínzhòng cānyù lìshǐ jìyì de jiàngòu hé chuánbò guòchéng.",
      "sentence_fr": "L'histoire publique met l'accent sur la participation des citoyens ordinaires à la construction et à la diffusion de la mémoire historique.",
      "sentence_en": "Public history emphasizes involving ordinary citizens in the construction and dissemination of historical memory.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_history",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部独立电影以低成本制作却凭借其深刻的人文关怀获得了广泛好评。",
      "sentence_pinyin": "Zhè bù dúlì diànyǐng yǐ dī chéngběn zhìzuò què píngjie qí shēnkè de rénwén guānhuái huòdé le guǎngfàn hǎopíng.",
      "sentence_fr": "Ce film indépendant, malgré son budget limité, a été largement salué pour sa profonde préoccupation humaniste.",
      "sentence_en": "This independent film, despite its low-budget production, has received widespread acclaim for its profound humanistic concern.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "independent_cinema",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "抗衰老研究正在探索延长健康寿命和减缓细胞衰老的生物学机制。",
      "sentence_pinyin": "Kàng shuāilǎo yánjiū zhèngzài tànsuǒ yáncháng jiànkāng shòumìng hé jiǎnhuǎn xìbāo shuāilǎo de shēngwùxué jīzhì.",
      "sentence_fr": "La recherche anti-âge explore les mécanismes biologiques pour prolonger l'espérance de vie en bonne santé et ralentir le vieillissement cellulaire.",
      "sentence_en": "Anti-aging research is exploring biological mechanisms to extend healthy lifespan and slow cellular aging.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "aging_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密码学的发展使电子商务和数字金融交易的安全性得到了根本保障。",
      "sentence_pinyin": "Mìmǎxué de fāzhǎn shǐ diànzǐ shāngwù hé shùzì jīnróng jiāoyì de ānquánxìng dédào le gēnběn bǎozhàng.",
      "sentence_fr": "Le développement de la cryptographie a fondamentalement garanti la sécurité du commerce électronique et des transactions financières numériques.",
      "sentence_en": "The development of cryptography has fundamentally ensured the security of e-commerce and digital financial transactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨境电商平台消除了地理障碍,使小型企业能够进入全球市场。",
      "sentence_pinyin": "Kuàjìng diànshāng píngtái xiāochú le dìlǐ zhàng'ài, shǐ xiǎoxíng qǐyè nénggòu jìnrù quánqiú shìchǎng.",
      "sentence_fr": "Les plateformes de commerce électronique transfrontalier éliminent les barrières géographiques, permettant aux petites entreprises d'accéder aux marchés mondiaux.",
      "sentence_en": "Cross-border e-commerce platforms eliminate geographical barriers, enabling small businesses to access global markets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cross_border_ecommerce",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态廊道的建设帮助连接破碎化的栖息地,保障野生动物的基因交流。",
      "sentence_pinyin": "Shēngtài lángdào de jiànshè bāngzhù liánjiē pòsuìhuà de qīxīdì, bǎozhàng yěshēng dòngwù de jīyīn jiāoliú.",
      "sentence_fr": "La construction de corridors écologiques aide à relier les habitats fragmentés et à garantir les échanges génétiques de la faune sauvage.",
      "sentence_en": "The construction of ecological corridors helps connect fragmented habitats and ensures genetic exchange among wildlife.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wildlife_corridors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声学生态学研究分析自然声景对生态系统健康和物种多样性的指示作用。",
      "sentence_pinyin": "Shēngxué shēngtàixué yánjiū fēnxī zìrán shēngjǐng duì shēngtài xìtǒng jiànkāng hé wùzhǒng duōyàngxìng de zhǐshì zuòyòng.",
      "sentence_fr": "L'écologie acoustique analyse le rôle indicateur des paysages sonores naturels sur la santé des écosystèmes et la biodiversité.",
      "sentence_en": "Acoustic ecology research analyzes the indicative role of natural soundscapes on ecosystem health and species diversity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "acoustic_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "敏捷项目管理方法通过短周期迭代来快速响应变化的客户需求。",
      "sentence_pinyin": "Mǐnjié xiàngmù guǎnlǐ fāngfǎ tōngguò duǎn zhōuqī diédài lái kuàisù xiǎngyìng biànhuà de kèhù xūqiú.",
      "sentence_fr": "Les méthodes de gestion de projet agile répondent rapidement aux besoins changeants des clients grâce à des itérations à cycles courts.",
      "sentence_en": "Agile project management methods respond quickly to changing customer needs through short-cycle iterations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agile_project_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位民族音乐学家记录了濒临失传的传统音乐形式及其文化语境。",
      "sentence_pinyin": "Zhè wèi mínzú yīnyuèxuéjiā jìlù le bīnlín shīchuán de chuántǒng yīnyuè xíngshì jí qí wénhuà yǔjìng.",
      "sentence_fr": "Cet ethnomusicologue a documenté des formes musicales traditionnelles en voie de disparition et leur contexte culturel.",
      "sentence_en": "This ethnomusicologist has documented traditional music forms on the verge of being lost and their cultural context.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ethnomusicology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "远程医疗技术的普及使偏远地区居民也能获得专业的医疗咨询服务。",
      "sentence_pinyin": "Yuǎnchéng yīliáo jìshù de pǔjí shǐ piānyuǎn dìqū jūmín yě néng huòdé zhuānyè de yīliáo zīxún fúwù.",
      "sentence_fr": "La popularisation de la télémédecine permet aux habitants des zones reculées d'accéder également à des services de consultation médicale professionnelle.",
      "sentence_en": "The popularization of telemedicine technology enables residents in remote areas to also access professional medical consultation services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "telemedicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多模态学习系统整合视觉、听觉和文本信息来提升人工智能的理解能力。",
      "sentence_pinyin": "Duō mótài xuéxí xìtǒng zhěnghé shìjué, tīngjué hé wénběn xìnxī lái tíshēng réngōng zhìnéng de lǐjiě nénglì.",
      "sentence_fr": "Les systèmes d'apprentissage multimodal intègrent des informations visuelles, auditives et textuelles pour améliorer les capacités de compréhension de l'IA.",
      "sentence_en": "Multimodal learning systems integrate visual, auditory, and textual information to enhance artificial intelligence understanding capabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multimodal_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际发展援助的有效性评估强调可持续性和受援国自主能力的培养。",
      "sentence_pinyin": "Guójì fāzhǎn yuánzhù de yǒuxiàoxìng pínggū qiángdiào kě chíxùxìng hé shòuyuánguó zìzhǔ nénglì de péiyǎng.",
      "sentence_fr": "L'évaluation de l'efficacité de l'aide au développement international met l'accent sur la durabilité et le renforcement des capacités autonomes des pays bénéficiaires.",
      "sentence_en": "Effectiveness evaluation of international development aid emphasizes sustainability and the cultivation of recipient countries' autonomous capabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "development_aid",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沉浸式语言学习环境通过模拟真实情境来加速二语习得过程。",
      "sentence_pinyin": "Chénjìnshì yǔyán xuéxí huánjìng tōngguò mónǐ zhēnshí qíngjìng lái jiāsù èryǔ xídé guòchéng.",
      "sentence_fr": "Les environnements d'apprentissage des langues immersifs accélèrent le processus d'acquisition d'une langue seconde en simulant des situations réelles.",
      "sentence_en": "Immersive language learning environments accelerate second language acquisition by simulating real-life situations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immersive_language_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
