{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "思维和推理心理学研究人类如何解决问题和做出逻辑判断。",
      "sentence_pinyin": "Sīwéi hé tuīlǐ xīnlǐxué yánjiū rénlèi rúhé jiějué wèntí hé zuòchū luójí pànduàn.",
      "sentence_fr": "La psychologie de la pensée et du raisonnement étudie comment les humains résolvent les problèmes et font des jugements logiques.",
      "sentence_en": "Thinking and reasoning psychology studies how humans solve problems and make logical judgments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "thinking_reasoning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "统计力学用概率方法解释宏观热力学性质的微观基础。",
      "sentence_pinyin": "Tǒngjì lìxué yòng gàilǜ fāngfǎ jiěshì hóngguān rèlìxué xìngzhì de wēiguān jīchǔ.",
      "sentence_fr": "La mécanique statistique utilise des méthodes probabilistes pour expliquer les bases microscopiques des propriétés thermodynamiques macroscopiques.",
      "sentence_en": "Statistical mechanics uses probabilistic methods to explain the microscopic basis of macroscopic thermodynamic properties.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "statistical_mechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "创业管理研究新企业的创建、发展和成长策略。",
      "sentence_pinyin": "Chuàngyè guǎnlǐ yánjiū xīn qǐyè de chuàngjiàn, fāzhǎn hé chéngzhǎng cèlüè.",
      "sentence_fr": "Le management entrepreneurial étudie les stratégies de création, de développement et de croissance de nouvelles entreprises.",
      "sentence_en": "Entrepreneurship management studies the creation, development, and growth strategies of new ventures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "entrepreneurship_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "访问控制策略定义谁可以访问哪些资源以及以什么方式访问。",
      "sentence_pinyin": "Fǎngwèn kòngzhì cèlüè dìngyì shéi kěyǐ fǎngwèn nǎxiē zīyuán yǐjí yǐ shénme fāngshì fǎngwèn.",
      "sentence_fr": "Les politiques de contrôle d'accès définissent qui peut accéder à quelles ressources et de quelle manière.",
      "sentence_en": "Access control policies define who can access which resources and in what manner.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "access_control",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言发展心理学研究儿童如何习得母语的认知过程。",
      "sentence_pinyin": "Yǔyán fāzhǎn xīnlǐxué yánjiū értóng rúhé xídé mǔyǔ de rènzhī guòchéng.",
      "sentence_fr": "La psychologie du développement du langage étudie les processus cognitifs par lesquels les enfants acquièrent leur langue maternelle.",
      "sentence_en": "Language development psychology studies the cognitive processes by which children acquire their native language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电磁学研究电荷、电场、磁场及其相互作用的物理规律。",
      "sentence_pinyin": "Diàncíxué yánjiū diànhè, diànchǎng, cíchǎng jí qí xiānghù zuòyòng de wùlǐ guīlǜ.",
      "sentence_fr": "L'électromagnétisme étudie les lois physiques des charges électriques, des champs électriques, des champs magnétiques et leurs interactions.",
      "sentence_en": "Electromagnetism studies the physical laws of electric charges, electric fields, magnetic fields, and their interactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "electromagnetism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际商务研究跨国企业运营和全球市场进入战略。",
      "sentence_pinyin": "Guójì shāngwù yánjiū kuàguó qǐyè yùnyíng hé quánqiú shìchǎng jìnrù zhànlüè.",
      "sentence_fr": "Le commerce international étudie les opérations des entreprises multinationales et les stratégies d'entrée sur les marchés mondiaux.",
      "sentence_en": "International business studies multinational enterprise operations and global market entry strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_business",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "软件安全审计评估应用程序的漏洞和合规性风险。",
      "sentence_pinyin": "Ruǎnjiàn ānquán shěnjì pínggū yìngyòng chéngxù de lòudòng hé héguīxìng fēngxiǎn.",
      "sentence_fr": "L'audit de sécurité logicielle évalue les vulnérabilités des applications et les risques de conformité.",
      "sentence_en": "Software security audits evaluate application vulnerabilities and compliance risks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_audit",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化心理学研究文化如何塑造人类的思维方式和行为模式。",
      "sentence_pinyin": "Wénhuà xīnlǐxué yánjiū wénhuà rúhé sùzào rénlèi de sīwéi fāngshì hé xíngwéi móshì.",
      "sentence_fr": "La psychologie culturelle étudie comment la culture façonne les modes de pensée et les modèles de comportement humains.",
      "sentence_en": "Cultural psychology studies how culture shapes human thinking patterns and behavioral patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流体力学研究液体和气体的运动以及作用于它们的力。",
      "sentence_pinyin": "Liútǐ lìxué yánjiū yètǐ hé qìtǐ de yùndòng yǐjí zuòyòng yú tāmen de lì.",
      "sentence_fr": "La mécanique des fluides étudie le mouvement des liquides et des gaz ainsi que les forces qui s'exercent sur eux.",
      "sentence_en": "Fluid mechanics studies the motion of liquids and gases and the forces acting on them.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fluid_mechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "投资组合理论指导如何分散投资以平衡风险和回报。",
      "sentence_pinyin": "Tóuzī zǔhé lǐlùn zhǐdǎo rúhé fēnsàn tóuzī yǐ pínghéng fēngxiǎn hé huíbào.",
      "sentence_fr": "La théorie du portefeuille guide la diversification des investissements pour équilibrer le risque et le rendement.",
      "sentence_en": "Portfolio theory guides how to diversify investments to balance risk and return.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "portfolio_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "渗透测试模拟攻击者行为以发现系统的安全弱点。",
      "sentence_pinyin": "Shèntòu cèshì mónǐ gōngjī zhě xíngwéi yǐ fāxiàn xìtǒng de ānquán ruòdiǎn.",
      "sentence_fr": "Les tests de pénétration simulent le comportement des attaquants pour découvrir les faiblesses de sécurité des systèmes.",
      "sentence_en": "Penetration testing simulates attacker behavior to discover system security weaknesses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "penetration_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "动机心理学研究驱动人类行为的内在和外在因素。",
      "sentence_pinyin": "Dòngjī xīnlǐxué yánjiū qūdòng rénlèi xíngwéi de nèizài hé wàizài yīnsù.",
      "sentence_fr": "La psychologie de la motivation étudie les facteurs internes et externes qui motivent le comportement humain.",
      "sentence_en": "Motivation psychology studies the internal and external factors that drive human behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "motivation_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "经典力学描述宏观物体在力的作用下的运动规律。",
      "sentence_pinyin": "Jīngdiǎn lìxué miáoshù hóngguān wùtǐ zài lì de zuòyòng xià de yùndòng guīlǜ.",
      "sentence_fr": "La mécanique classique décrit les lois du mouvement des objets macroscopiques sous l'action des forces.",
      "sentence_en": "Classical mechanics describes the laws of motion of macroscopic objects under the action of forces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "classical_mechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "衍生品定价模型用于估算期权和期货等金融工具的价值。",
      "sentence_pinyin": "Yǎnshēngpǐn dìngjià móxíng yòng yú gūsuàn qīquán hé qīhuò děng jīnróng gōngjù de jiàzhí.",
      "sentence_fr": "Les modèles d'évaluation des dérivés sont utilisés pour estimer la valeur des instruments financiers tels que les options et les contrats à terme.",
      "sentence_en": "Derivative pricing models are used to estimate the value of financial instruments such as options and futures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "derivative_pricing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "灾难恢复计划确保业务能够在系统故障后迅速恢复运营。",
      "sentence_pinyin": "Zāinàn huīfù jìhuà quèbǎo yèwù nénggòu zài xìtǒng gùzhàng hòu xùnsù huīfù yùnyíng.",
      "sentence_fr": "Les plans de reprise après sinistre garantissent que les entreprises peuvent reprendre rapidement leurs opérations après une défaillance du système.",
      "sentence_en": "Disaster recovery plans ensure businesses can quickly resume operations after system failures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "disaster_recovery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智力研究探讨人类认知能力的本质、结构和测量方法。",
      "sentence_pinyin": "Zhìlì yánjiū tàntǎo rénlèi rènzhī nénglì de běnzhì, jiégòu hé cèliáng fāngfǎ.",
      "sentence_fr": "La recherche sur l'intelligence explore la nature, la structure et les méthodes de mesure des capacités cognitives humaines.",
      "sentence_en": "Intelligence research explores the nature, structure, and measurement methods of human cognitive abilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intelligence_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "相对论改变了我们对时间、空间和引力的基本理解。",
      "sentence_pinyin": "Xiāngduìlùn gǎibiànle wǒmen duì shíjiān, kōngjiān hé yǐnlì de jīběn lǐjiě.",
      "sentence_fr": "La relativité a changé notre compréhension fondamentale du temps, de l'espace et de la gravité.",
      "sentence_en": "Relativity changed our fundamental understanding of time, space, and gravity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "relativity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公司治理框架确保企业管理层对股东负责并透明运营。",
      "sentence_pinyin": "Gōngsī zhìlǐ kuàngjià quèbǎo qǐyè guǎnlǐ céng duì gǔdōng fùzé bìng tòumíng yùnyíng.",
      "sentence_fr": "Les cadres de gouvernance d'entreprise garantissent que la direction est responsable envers les actionnaires et opère de manière transparente.",
      "sentence_en": "Corporate governance frameworks ensure company management is accountable to shareholders and operates transparently.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_governance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "业务连续性管理为各种紧急情况制定预防和应对措施。",
      "sentence_pinyin": "Yèwù liánxùxìng guǎnlǐ wèi gè zhǒng jǐnjí qíngkuàng zhìdìng yùfáng hé yìngduì cuòshī.",
      "sentence_fr": "La gestion de la continuité des activités développe des mesures de prévention et de réponse pour diverses situations d'urgence.",
      "sentence_en": "Business continuity management develops prevention and response measures for various emergency situations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "business_continuity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
