{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠错码通过冗余编码保护量子信息免受退相干影响。",
      "sentence_pinyin": "Liàngzǐ jiūcuò mǎ tōngguò róngyú biānmǎ bǎohù liàngzǐ xìnxī miǎnshòu tuì xiānggān yǐngxiǎng.",
      "sentence_fr": "Les codes correcteurs d'erreurs quantiques protègent l'information quantique de la décohérence par encodage redondant.",
      "sentence_en": "Quantum error-correcting codes protect quantum information from decoherence through redundant encoding.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_error_correction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识简洁论证允许在不揭示计算细节的情况下验证正确性。",
      "sentence_pinyin": "Líng zhīshì jiǎnjié lùnzhèng yǔnxǔ zài bù jiēshì jìsuàn xìjié de qíngkuàng xià yànzhèng zhèngquèxìng.",
      "sentence_fr": "Les arguments succincts à connaissance nulle permettent de vérifier l'exactitude sans révéler les détails du calcul.",
      "sentence_en": "Zero-knowledge succinct arguments allow verification of correctness without revealing computational details.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "zk_snarks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "依赖类型系统将类型和值统一到单一的表达层次中。",
      "sentence_pinyin": "Yīlài lèixíng xìtǒng jiāng lèixíng hé zhí tǒngyī dào dānyī de biǎodá céngcì zhōng.",
      "sentence_fr": "Les systèmes de types dépendants unifient les types et les valeurs dans une seule hiérarchie d'expressions.",
      "sentence_en": "Dependent type systems unify types and values into a single hierarchy of expressions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "dependent_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "霍奇猜想关联代数几何与微分几何的深层结构。",
      "sentence_pinyin": "Huòqí cāixiǎng guānlián dàishù jǐhé yǔ wēifēn jǐhé de shēncéng jiégòu.",
      "sentence_fr": "La conjecture de Hodge relie les structures profondes de la géométrie algébrique et de la géométrie différentielle.",
      "sentence_en": "The Hodge conjecture relates the deep structures of algebraic geometry and differential geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hodge_conjecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑量子计算利用非阿贝尔任意子实现容错量子门。",
      "sentence_pinyin": "Tuòpū liàngzǐ jìsuàn lìyòng fēi Ābèi'ěr rènyìzǐ shíxiàn róngcuò liàngzǐ mén.",
      "sentence_fr": "L'informatique quantique topologique utilise des anyons non-abéliens pour réaliser des portes quantiques tolérantes aux fautes.",
      "sentence_en": "Topological quantum computing uses non-Abelian anyons to implement fault-tolerant quantum gates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可验证随机函数在不可预测性和可验证性之间取得平衡。",
      "sentence_pinyin": "Kě yànzhèng suíjī hánshù zài bùkě yùcèxìng hé kě yànzhèngxìng zhījiān qǔdé pínghéng.",
      "sentence_fr": "Les fonctions aléatoires vérifiables établissent un équilibre entre l'imprévisibilité et la vérifiabilité.",
      "sentence_en": "Verifiable random functions achieve a balance between unpredictability and verifiability.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "verifiable_random_functions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "线性类型确保资源被精确使用一次而不被复制或丢弃。",
      "sentence_pinyin": "Xiànxìng lèixíng quèbǎo zīyuán bèi jīngquè shǐyòng yīcì ér bù bèi fùzhì huò diūqì.",
      "sentence_fr": "Les types linéaires garantissent que les ressources sont utilisées exactement une fois sans être copiées ou abandonnées.",
      "sentence_en": "Linear types ensure resources are used exactly once without being copied or discarded.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "linear_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模空间参数化具有特定性质的几何对象的等价类。",
      "sentence_pinyin": "Mó kōngjiān cānshùhuà jùyǒu tèdìng xìngzhì de jǐhé duìxiàng de děngjià lèi.",
      "sentence_fr": "Les espaces de modules paramètrent les classes d'équivalence d'objets géométriques avec des propriétés spécifiques.",
      "sentence_en": "Moduli spaces parametrize equivalence classes of geometric objects with specific properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "moduli_spaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子退火通过模拟量子隧穿效应解决组合优化问题。",
      "sentence_pinyin": "Liàngzǐ tuìhuǒ tōngguò mónǐ liàngzǐ suìchuān xiàoyìng jiějué zǔhé yōuhuà wèntí.",
      "sentence_fr": "Le recuit quantique résout les problèmes d'optimisation combinatoire en simulant l'effet tunnel quantique.",
      "sentence_en": "Quantum annealing solves combinatorial optimization problems by simulating quantum tunneling effects.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_annealing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同态加密允许在加密数据上直接执行计算操作。",
      "sentence_pinyin": "Tóngtài jiāmì yǔnxǔ zài jiāmì shùjù shàng zhíjiē zhíxíng jìsuàn cāozuò.",
      "sentence_fr": "Le chiffrement homomorphe permet d'effectuer des opérations de calcul directement sur des données chiffrées.",
      "sentence_en": "Homomorphic encryption allows computational operations to be performed directly on encrypted data.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homomorphic_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高阶类型构造器将类型级函数作为参数传递。",
      "sentence_pinyin": "Gāo jiē lèixíng gòuzào qì jiāng lèixíng jí hánshù zuòwéi cānshù chuándì.",
      "sentence_fr": "Les constructeurs de types d'ordre supérieur passent des fonctions au niveau des types comme paramètres.",
      "sentence_en": "Higher-kinded type constructors pass type-level functions as parameters.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "higher_kinded_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "概形理论统一了代数几何中局部和整体的观点。",
      "sentence_pinyin": "Gàixíng lǐlùn tǒngyī le dàishù jǐhé zhōng júbù hé zhěngtǐ de guāndiǎn.",
      "sentence_fr": "La théorie des schémas unifie les perspectives locales et globales en géométrie algébrique.",
      "sentence_en": "Scheme theory unifies local and global perspectives in algebraic geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "scheme_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超导量子比特利用约瑟夫森结实现量子态的相干操控。",
      "sentence_pinyin": "Chāodǎo liàngzǐ bǐtè lìyòng Yuēsèfūsēn jié shíxiàn liàngzǐ tài de xiānggān cāokòng.",
      "sentence_fr": "Les qubits supraconducteurs utilisent des jonctions Josephson pour la manipulation cohérente des états quantiques.",
      "sentence_en": "Superconducting qubits use Josephson junctions to achieve coherent manipulation of quantum states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "superconducting_qubits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格密码学基于格中最短向量问题的计算困难性。",
      "sentence_pinyin": "Gé mìmǎxué jīyú gé zhōng zuì duǎn xiàngliàng wèntí de jìsuàn kùnnánxìng.",
      "sentence_fr": "La cryptographie sur réseaux repose sur la difficulté computationnelle du problème du vecteur le plus court.",
      "sentence_en": "Lattice cryptography is based on the computational hardness of the shortest vector problem in lattices.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lattice_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "效应系统在类型层面追踪计算可能产生的副作用。",
      "sentence_pinyin": "Xiàoyìng xìtǒng zài lèixíng céngmiàn zhuīzōng jìsuàn kěnéng chǎnshēng de fùzuòyòng.",
      "sentence_fr": "Les systèmes d'effets suivent au niveau des types les effets secondaires potentiels des calculs.",
      "sentence_en": "Effect systems track potential side effects of computations at the type level.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "effect_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "导出范畴将同调代数推广到更一般的设定中。",
      "sentence_pinyin": "Dǎochū fànchóu jiāng tóngdiào dàishù tuīguǎng dào gèng yībān de shèdìng zhōng.",
      "sentence_fr": "Les catégories dérivées généralisent l'algèbre homologique à des contextes plus généraux.",
      "sentence_en": "Derived categories generalize homological algebra to more general settings.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "derived_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "变分量子本征求解器结合经典和量子计算求解基态能量。",
      "sentence_pinyin": "Biànfēn liàngzǐ běnzhēng qiújiě qì jiéhé jīngdiǎn hé liàngzǐ jìsuàn qiújiě jītài néngliàng.",
      "sentence_fr": "Les solveurs variationnels quantiques combinent calcul classique et quantique pour trouver l'énergie de l'état fondamental.",
      "sentence_en": "Variational quantum eigensolvers combine classical and quantum computing to solve ground state energy.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "variational_quantum_eigensolver",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多方安全计算使各方能够联合计算而不泄露各自输入。",
      "sentence_pinyin": "Duō fāng ānquán jìsuàn shǐ gè fāng nénggòu liánhé jìsuàn ér bù xièlòu gèzì shūrù.",
      "sentence_fr": "Le calcul multipartite sécurisé permet aux parties de calculer conjointement sans révéler leurs entrées respectives.",
      "sentence_en": "Secure multi-party computation enables parties to jointly compute without revealing their respective inputs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "secure_multiparty_computation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "存在类型隐藏实现细节同时暴露抽象接口。",
      "sentence_pinyin": "Cúnzài lèixíng yǐncáng shíxiàn xìjié tóngshí bàolù chōuxiàng jiēkǒu.",
      "sentence_fr": "Les types existentiels masquent les détails d'implémentation tout en exposant une interface abstraite.",
      "sentence_en": "Existential types hide implementation details while exposing an abstract interface.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "existential_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "稳定同伦理论研究同伦范畴在悬挂操作下的稳定性质。",
      "sentence_pinyin": "Wěndìng tónglún lǐlùn yánjiū tónglún fànchóu zài xuánguà cāozuò xià de wěndìng xìngzhì.",
      "sentence_fr": "La théorie de l'homotopie stable étudie les propriétés stables des catégories homotopiques sous suspension.",
      "sentence_en": "Stable homotopy theory studies stable properties of homotopy categories under suspension operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stable_homotopy_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
