{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "瞬子是非阿贝尔规范场论中重要的非微扰解。",
      "sentence_pinyin": "Shùnzǐ shì fēi Ābèi'ěr guīfàn chǎnglùn zhōng zhòngyào de fēi wēirǎo jiě.",
      "sentence_fr": "Les instantons sont des solutions non perturbatives importantes dans les théories de jauge non abéliennes.",
      "sentence_en": "Instantons are important non-perturbative solutions in non-Abelian gauge field theories.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "instantons",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "简洁透明知识论证提供无需可信设置的零知识证明。",
      "sentence_pinyin": "Jiǎnjié tòumíng zhīshì lùnzhèng tígōng wúxū kěxìn shèzhì de líng zhīshì zhèngmíng.",
      "sentence_fr": "Les arguments de connaissance transparents succincts fournissent des preuves à connaissance nulle sans configuration de confiance.",
      "sentence_en": "Succinct transparent arguments of knowledge provide zero-knowledge proofs without trusted setup.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stark_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "区域类型使用静态分析在编译时确定对象生命周期。",
      "sentence_pinyin": "Qūyù lèixíng shǐyòng jìngtài fēnxī zài biānyì shí quèdìng duìxiàng shēngmìng zhōuqī.",
      "sentence_fr": "Les types de région utilisent l'analyse statique pour déterminer la durée de vie des objets à la compilation.",
      "sentence_en": "Region types use static analysis to determine object lifetimes at compile time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "region_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阿贝尔范畴是一类具有良好同调性质的加法范畴。",
      "sentence_pinyin": "Ābèi'ěr fànchóu shì yī lèi jùyǒu liánghǎo tóngyú xìngzhì de jiāfǎ fànchóu.",
      "sentence_fr": "Les catégories abéliennes sont une classe de catégories additives avec de bonnes propriétés homologiques.",
      "sentence_en": "Abelian categories are a class of additive categories with good homological properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "abelian_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "变分量子本征求解器是近期量子计算机的混合量子经典算法。",
      "sentence_pinyin": "Biànfēn liàngzǐ běnzhēng qiújiěqì shì jìnqī liàngzǐ jìsuànjī de hùnhé liàngzǐ jīngdiǎn suànfǎ.",
      "sentence_fr": "Le solveur d'eigenvalues quantique variationnel est un algorithme quantique-classique hybride pour les ordinateurs quantiques à court terme.",
      "sentence_en": "Variational quantum eigensolver is a hybrid quantum-classical algorithm for near-term quantum computers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "variational_quantum_eigensolver",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "递归证明组合允许证明的高效聚合和验证。",
      "sentence_pinyin": "Dìguī zhèngmíng zǔhé yǔnxǔ zhèngmíng de gāoxiào jùhé hé yànzhèng.",
      "sentence_fr": "La composition de preuves récursives permet l'agrégation et la vérification efficaces des preuves.",
      "sentence_en": "Recursive proof composition allows efficient aggregation and verification of proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "recursive_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唯一性类型确保引用在任何时刻最多有一个别名。",
      "sentence_pinyin": "Wéiyīxìng lèixíng quèbǎo yǐnyòng zài rènhé shíkè zuìduō yǒu yī gè biémíng.",
      "sentence_fr": "Les types d'unicité garantissent qu'une référence a au plus un alias à tout moment.",
      "sentence_en": "Uniqueness types ensure references have at most one alias at any point in time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "uniqueness_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "三角范畴推广了导出范畴的同调代数结构。",
      "sentence_pinyin": "Sānjiǎo fànchóu tuīguǎng le dǎochū fànchóu de tóngyú dàishù jiégòu.",
      "sentence_fr": "Les catégories triangulées généralisent les structures d'algèbre homologique des catégories dérivées.",
      "sentence_en": "Triangulated categories generalize homological algebra structures of derived categories.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "triangulated_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子近似优化算法解决组合优化问题的变分方法。",
      "sentence_pinyin": "Liàngzǐ jìnsì yōuhuà suànfǎ jiějué zǔhé yōuhuà wèntí de biànfēn fāngfǎ.",
      "sentence_fr": "L'algorithme d'optimisation approximative quantique est une méthode variationnelle pour résoudre les problèmes d'optimisation combinatoire.",
      "sentence_en": "Quantum approximate optimization algorithm is a variational method for solving combinatorial optimization problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "qaoa",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可更新零知识证明允许在不重新生成证明的情况下更新声明。",
      "sentence_pinyin": "Kě gēngxīn líng zhīshì zhèngmíng yǔnxǔ zài bù chóngxīn shēngchéng zhèngmíng de qíngkuàng xià gēngxīn shēngmíng.",
      "sentence_fr": "Les preuves à connaissance nulle actualisables permettent de mettre à jour les déclarations sans régénérer la preuve.",
      "sentence_en": "Updatable zero-knowledge proofs allow updating statements without regenerating proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "updatable_zkp",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "能力类型将访问权限编码到类型系统中限制对象操作。",
      "sentence_pinyin": "Nénglì lèixíng jiāng fǎngwèn quánxiàn biānmǎ dào lèixíng xìtǒng zhōng xiànzhì duìxiàng cāozuò.",
      "sentence_fr": "Les types de capacité encodent les droits d'accès dans le système de types pour restreindre les opérations sur les objets.",
      "sentence_en": "Capability types encode access rights into the type system to restrict object operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "capability_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "∞-拓扑斯将拓扑斯理论推广到高阶范畴论语境。",
      "sentence_pinyin": "Wúqióng-tuòpūsī jiāng tuòpūsī lǐlùn tuīguǎng dào gāojiē fànchóulùn yǔjìng.",
      "sentence_fr": "Les ∞-topos généralisent la théorie des topos au contexte de la théorie des catégories supérieures.",
      "sentence_en": "∞-topoi generalize topos theory to higher category theory contexts.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "infinity_topoi",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子机器学习探索量子计算在模式识别中的应用。",
      "sentence_pinyin": "Liàngzǐ jīqì xuéxí tànsuǒ liàngzǐ jìsuàn zài móshì shìbié zhōng de yìngyòng.",
      "sentence_fr": "L'apprentissage automatique quantique explore les applications du calcul quantique dans la reconnaissance de motifs.",
      "sentence_en": "Quantum machine learning explores applications of quantum computing in pattern recognition.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_machine_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "通用可组合安全定义了密码协议在任意组合下的安全性。",
      "sentence_pinyin": "Tōngyòng kě zǔhé ānquán dìngyì le mìmǎ xiéyì zài rènyì zǔhé xià de ānquánxìng.",
      "sentence_fr": "La sécurité universellement composable définit la sécurité des protocoles cryptographiques sous composition arbitraire.",
      "sentence_en": "Universal composability security defines cryptographic protocol security under arbitrary composition.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_composability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "子类型多态允许子类型对象在需要超类型的地方使用。",
      "sentence_pinyin": "Zǐ lèixíng duōtài yǔnxǔ zǐ lèixíng duìxiàng zài xūyào chāo lèixíng de dìfāng shǐyòng.",
      "sentence_fr": "Le polymorphisme de sous-typage permet aux objets de sous-types d'être utilisés là où un supertype est attendu.",
      "sentence_en": "Subtype polymorphism allows subtype objects to be used where supertypes are expected.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "subtype_polymorphism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数K理论研究环和代数结构的高阶不变量。",
      "sentence_pinyin": "Dàishù K lǐlùn yánjiū huán hé dàishù jiégòu de gāojiē bù biànliàng.",
      "sentence_fr": "La K-théorie algébrique étudie les invariants d'ordre supérieur des anneaux et des structures algébriques.",
      "sentence_en": "Algebraic K-theory studies higher-order invariants of rings and algebraic structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_k_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子化学模拟是量子计算最有前景的近期应用之一。",
      "sentence_pinyin": "Liàngzǐ huàxué mónǐ shì liàngzǐ jìsuàn zuì yǒu qiánjǐng de jìnqī yìngyòng zhī yī.",
      "sentence_fr": "La simulation de chimie quantique est l'une des applications à court terme les plus prometteuses du calcul quantique.",
      "sentence_en": "Quantum chemistry simulation is one of the most promising near-term applications of quantum computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_chemistry_simulation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增量式零知识证明支持对数据变更的高效证明更新。",
      "sentence_pinyin": "Zēngliàngshì líng zhīshì zhèngmíng zhīchí duì shùjù biàngēng de gāoxiào zhèngmíng gēngxīn.",
      "sentence_fr": "Les preuves à connaissance nulle incrémentales prennent en charge les mises à jour efficaces des preuves pour les modifications de données.",
      "sentence_en": "Incremental zero-knowledge proofs support efficient proof updates for data changes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "incremental_zkp",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协变和逆变类型参数控制子类型关系的方向性。",
      "sentence_pinyin": "Xiébiàn hé nìbiàn lèixíng cānshù kòngzhì zǐ lèixíng guānxì de fāngxiàngxìng.",
      "sentence_fr": "Les paramètres de type covariants et contravariants contrôlent la directionnalité des relations de sous-typage.",
      "sentence_en": "Covariant and contravariant type parameters control directionality of subtyping relationships.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "variance_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "动机上同调将代数几何与数论通过范畴论语言统一。",
      "sentence_pinyin": "Dòngjī shàngtóngyú jiāng dàishù jǐhé yǔ shùlùn tōngguò fànchóulùn yǔyán tǒngyī.",
      "sentence_fr": "La cohomologie motivique unifie la géométrie algébrique et la théorie des nombres à travers le langage de la théorie des catégories.",
      "sentence_en": "Motivic cohomology unifies algebraic geometry and number theory through categorical language.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "motivic_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
