{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个数字博物馆通过高清扫描技术让观众可以在线欣赏珍贵文物的细节。",
      "sentence_pinyin": "Zhège shùzì bówùguǎn tōngguò gāoqīng sǎomiáo jìshù ràng guānzhòng kěyǐ zàixiàn xīnshǎng zhēnguì wénwù de xìjié.",
      "sentence_fr": "Ce musée numérique permet au public d'apprécier en ligne les détails des objets précieux grâce à la technologie de numérisation haute définition.",
      "sentence_en": "This digital museum allows audiences to appreciate the details of precious artifacts online through high-definition scanning technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_museums",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "埙的制作需要选用优质的陶土,经过成型、打孔和烧制等工序。",
      "sentence_pinyin": "Xūn de zhìzuò xūyào xuǎnyòng yōuzhì de táotǔ, jīngguò chéngxíng, dǎkǒng hé shāozhì děng gōngxù.",
      "sentence_fr": "La fabrication du xun nécessite de l'argile de qualité supérieure et passe par plusieurs étapes telles que le façonnage, le perçage et la cuisson.",
      "sentence_en": "Making the xun requires selecting high-quality clay and going through processes such as shaping, drilling holes, and firing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xun_making",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个碳中和示范区采用了多种清洁能源技术,实现了零碳排放。",
      "sentence_pinyin": "Zhège tàn zhōnghé shìfànqū cǎiyòngle duō zhǒng qīngjié néngyuán jìshù, shíxiànle líng tàn páifàng.",
      "sentence_fr": "Cette zone de démonstration de neutralité carbone adopte plusieurs technologies d'énergie propre pour atteindre zéro émission de carbone.",
      "sentence_en": "This carbon-neutral demonstration zone adopts multiple clean energy technologies to achieve zero carbon emissions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "carbon_neutrality",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "瓷板画在瓷板上绘制图案后高温烧制,色彩永不褪色。",
      "sentence_pinyin": "Cíbǎn huà zài cíbǎn shàng huìzhì tú'àn hòu gāowēn shāozhì, sècǎi yǒng bù tuìsè.",
      "sentence_fr": "La peinture sur plaque de porcelaine peint des motifs sur une plaque de porcelaine puis est cuite à haute température, les couleurs ne s'estompent jamais.",
      "sentence_en": "Porcelain plate painting paints patterns on porcelain plates and then fires at high temperature, with colors that never fade.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "porcelain_plate_painting",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能床垫可以监测睡眠姿势并自动调节软硬度。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuángdiàn kěyǐ jiāncè shuìmián zīshì bìng zìdòng tiáojié ruǎnyìngdù.",
      "sentence_fr": "Ce matelas intelligent peut surveiller la posture de sommeil et ajuster automatiquement la fermeté.",
      "sentence_en": "This smart mattress can monitor sleep posture and automatically adjust firmness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mattresses",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区养老驿站为周边老人提供了日间照料和文化娱乐服务。",
      "sentence_pinyin": "Zhège shèqū yǎnglǎo yìzhàn wèi zhōubiān lǎorén tígōngle rìjiān zhàoliào hé wénhuà yúlè fúwù.",
      "sentence_fr": "Cette station de soins aux personnes âgées de la communauté offre des services de soins de jour et de divertissement culturel aux personnes âgées du quartier.",
      "sentence_en": "This community elderly care station provides day care and cultural entertainment services for elderly people in the area.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_care_stations",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝的面板由优质桐木制成,对音色有很大影响。",
      "sentence_pinyin": "Gǔzhēng de miànbǎn yóu yōuzhì tóngmù zhìchéng, duì yīnsè yǒu hěn dà yǐngxiǎng.",
      "sentence_fr": "Le dessus du guzheng est fait de bois de paulownia de qualité, ce qui a une grande influence sur le timbre.",
      "sentence_en": "The guzheng's soundboard is made of high-quality paulownia wood, which greatly affects the tone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_construction",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线知识付费平台让专业人士可以分享知识并获得收入。",
      "sentence_pinyin": "Zhège zàixiàn zhīshi fùfèi píngtái ràng zhuānyè rénshì kěyǐ fēnxiǎng zhīshi bìng huòdé shōurù.",
      "sentence_fr": "Cette plateforme de connaissances payantes en ligne permet aux professionnels de partager leurs connaissances et de gagner un revenu.",
      "sentence_en": "This online paid knowledge platform allows professionals to share knowledge and earn income.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "knowledge_payment_platforms",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "刻瓷艺术用金刚石刀在瓷器表面刻画出精细的图案。",
      "sentence_pinyin": "Kècí yìshù yòng jīngāngshí dāo zài cíqì biǎomiàn kèhuà chū jīngxì de tú'àn.",
      "sentence_fr": "L'art de la gravure sur porcelaine utilise un couteau en diamant pour graver des motifs fins sur la surface de la porcelaine.",
      "sentence_en": "Porcelain engraving art uses a diamond knife to carve fine patterns on the porcelain surface.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "porcelain_engraving",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能饮水机可以精确控制水温,满足不同饮品的冲泡需求。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yǐnshuǐjī kěyǐ jīngquè kòngzhì shuǐwēn, mǎnzú bùtóng yǐnpǐn de chōngpào xūqiú.",
      "sentence_fr": "Ce distributeur d'eau intelligent peut contrôler précisément la température de l'eau pour répondre aux besoins d'infusion de différentes boissons.",
      "sentence_en": "This smart water dispenser can precisely control water temperature to meet the brewing needs of different beverages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_dispensers",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个光伏扶贫项目为贫困村庄安装了太阳能发电设备,增加了村民收入。",
      "sentence_pinyin": "Zhège guāngfú fúpín xiàngmù wèi pínkùn cūnzhuāng ānzhuāngle tàiyángnéng fādiàn shèbèi, zēngjiāle cūnmín shōurù.",
      "sentence_fr": "Ce projet d'aide aux pauvres par le photovoltaïque a installé des équipements de production d'énergie solaire dans les villages pauvres, augmentant les revenus des villageois.",
      "sentence_en": "This photovoltaic poverty alleviation project installed solar power generation equipment in poor villages, increasing villagers' income.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "solar_poverty_alleviation",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡的琴筒由蟒蛇皮蒙制,是影响音质的关键部件。",
      "sentence_pinyin": "Èrhú de qíntǒng yóu mǎngshépí méngzhì, shì yǐngxiǎng yīnzhì de guānjiàn bùjiàn.",
      "sentence_fr": "Le corps de résonance de l'erhu est recouvert de peau de python, c'est un élément clé affectant la qualité du son.",
      "sentence_en": "The erhu's sound box is covered with python skin, which is a key component affecting sound quality.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_construction",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个共享厨房让创业者可以按时段租用专业厨房设备生产食品。",
      "sentence_pinyin": "Zhège gòngxiǎng chúfáng ràng chuàngyèzhě kěyǐ àn shíduàn zūyòng zhuānyè chúfáng shèbèi shēngchǎn shípǐn.",
      "sentence_fr": "Cette cuisine partagée permet aux entrepreneurs de louer des équipements de cuisine professionnels par créneau horaire pour produire des aliments.",
      "sentence_en": "This shared kitchen allows entrepreneurs to rent professional kitchen equipment by time slots to produce food.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shared_kitchens",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绒绣用彩色绒线在特制的网格布上绣出立体感很强的图案。",
      "sentence_pinyin": "Róngxiù yòng cǎisè róngxiàn zài tèzhì de wǎnggébù shàng xiù chū lìtǐgǎn hěn qiáng de tú'àn.",
      "sentence_fr": "La broderie de velours utilise des fils de velours colorés pour broder des motifs avec un fort effet tridimensionnel sur un tissu à mailles spécial.",
      "sentence_en": "Velvet embroidery uses colored velvet threads to embroider patterns with strong three-dimensional effect on special grid fabric.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "velvet_embroidery",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能香薰机可以定时释放香气并通过手机远程控制。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xiāngxūnjī kěyǐ dìngshí shìfàng xiāngqì bìng tōngguò shǒujī yuǎnchéng kòngzhì.",
      "sentence_fr": "Ce diffuseur d'arômes intelligent peut libérer des parfums à des heures programmées et être contrôlé à distance via téléphone.",
      "sentence_en": "This smart aromatherapy diffuser can release fragrance on a timer and be remotely controlled via smartphone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_diffusers",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾分类宣传项目通过进校园活动,培养青少年的环保意识。",
      "sentence_pinyin": "Zhège lājī fēnlèi xuānchuán xiàngmù tōngguò jìn xiàoyuán huódòng, péiyǎng qīngshàonián de huánbǎo yìshi.",
      "sentence_fr": "Ce projet de sensibilisation au tri des déchets cultive la conscience environnementale des jeunes à travers des activités dans les écoles.",
      "sentence_en": "This waste sorting awareness project cultivates environmental awareness among young people through campus activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_education",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶曲《十面埋伏》生动地描绘了古代战争的激烈场面。",
      "sentence_pinyin": "Pípá qǔ 'Shímiàn máifú' shēngdòng de miáohuìle gǔdài zhànzhēng de jīliè chǎngmiàn.",
      "sentence_fr": "La pièce de pipa 'Embuscade de dix côtés' dépeint vivement les scènes intenses de guerre ancienne.",
      "sentence_en": "The pipa piece 'Ambush from Ten Sides' vividly depicts the intense scenes of ancient warfare.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_repertoire",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线教育直播平台让名师的课程可以惠及更多学生。",
      "sentence_pinyin": "Zhège zàixiàn jiàoyù zhíbō píngtái ràng míngshī de kèchéng kěyǐ huìjí gèng duō xuéshēng.",
      "sentence_fr": "Cette plateforme de diffusion en direct éducative permet aux cours des enseignants réputés de bénéficier à plus d'étudiants.",
      "sentence_en": "This online education live streaming platform allows famous teachers' courses to benefit more students.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "live_streaming_education",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "通草画用通草切成的薄片作画,是广东特有的传统工艺。",
      "sentence_pinyin": "Tōngcǎo huà yòng tōngcǎo qiēchéng de báopiàn zuòhuà, shì Guǎngdōng tèyǒu de chuántǒng gōngyì.",
      "sentence_fr": "La peinture sur papier de moelle utilise de fines tranches de moelle de papier pour peindre, c'est un artisanat traditionnel unique du Guangdong.",
      "sentence_en": "Pith paper painting uses thin slices of pith paper to paint, a traditional craft unique to Guangdong.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pith_paper_painting",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能花盆可以监测土壤湿度并自动浇水,适合经常出差的人使用。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng huāpén kěyǐ jiāncè tǔrǎng shīdù bìng zìdòng jiāoshuǐ, shìhé jīngcháng chūchāi de rén shǐyòng.",
      "sentence_fr": "Ce pot de fleurs intelligent peut surveiller l'humidité du sol et arroser automatiquement, idéal pour les personnes qui voyagent souvent.",
      "sentence_en": "This smart flower pot can monitor soil moisture and water automatically, suitable for people who travel frequently.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_planters",
      "created_at": "2025-11-20T21:45:00.000Z",
      "updated_at": "2025-11-20T21:45:00.000Z"
    }
  ]
}
