{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子态叠加原理是量子计算并行性的根本来源。",
      "sentence_pinyin": "Liàngzǐ tài diéjiā yuánlǐ shì liàngzǐ jìsuàn bìngxíngxìng de gēnběn láiyuán.",
      "sentence_fr": "Le principe de superposition des états quantiques est la source fondamentale du parallélisme en calcul quantique.",
      "sentence_en": "The quantum state superposition principle is the fundamental source of quantum computing parallelism.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "superposition_principle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "离散对数假设是许多公钥密码系统的安全根基。",
      "sentence_pinyin": "Lísàn duìshù jiǎshè shì xǔduō gōngyào mìmǎ xìtǒng de ānquán gēnjī.",
      "sentence_fr": "L'hypothèse du logarithme discret est le fondement de sécurité de nombreux systèmes cryptographiques à clé publique.",
      "sentence_en": "The discrete logarithm assumption is the security foundation of many public-key cryptographic systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "discrete_log_assumption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型系统健全性保证类型系统不会接受错误程序。",
      "sentence_pinyin": "Lèixíng xìtǒng jiànquánxìng bǎozhèng lèixíng xìtǒng bù huì jiēshòu cuòwù chéngxù.",
      "sentence_fr": "La solidité du système de types garantit que le système de types n'acceptera pas de programmes erronés.",
      "sentence_en": "Type system soundness guarantees the type system will not accept erroneous programs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_soundness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基本群捕捉拓扑空间中路径同伦类的群结构。",
      "sentence_pinyin": "Jīběn qún bǔzhuō tuòpū kōngjiān zhōng lùjìng tónglún lèi de qún jiégòu.",
      "sentence_fr": "Le groupe fondamental capture la structure de groupe des classes d'homotopie de chemins dans les espaces topologiques.",
      "sentence_en": "The fundamental group captures the group structure of path homotopy classes in topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "fundamental_group",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子干涉是量子计算利用相位关系进行计算的机制。",
      "sentence_pinyin": "Liàngzǐ gānshè shì liàngzǐ jìsuàn lìyòng xiàngwèi guānxì jìnxíng jìsuàn de jīzhì.",
      "sentence_fr": "L'interférence quantique est le mécanisme par lequel le calcul quantique utilise les relations de phase pour effectuer des calculs.",
      "sentence_en": "Quantum interference is the mechanism by which quantum computing uses phase relationships for computation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_interference",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "素性测试算法确定大整数是否为素数。",
      "sentence_pinyin": "Sùxìng cèshì suànfǎ quèdìng dà zhěngshù shìfǒu wéi sùshù.",
      "sentence_fr": "Les algorithmes de test de primalité déterminent si de grands entiers sont des nombres premiers.",
      "sentence_en": "Primality testing algorithms determine whether large integers are prime numbers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "primality_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型系统完备性保证所有正确程序都能通过类型检查。",
      "sentence_pinyin": "Lèixíng xìtǒng wánbèixìng bǎozhèng suǒyǒu zhèngquè chéngxù dōu néng tōngguò lèixíng jiǎnchá.",
      "sentence_fr": "La complétude du système de types garantit que tous les programmes corrects passent la vérification de type.",
      "sentence_en": "Type system completeness guarantees all correct programs pass type checking.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_completeness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "单纯复形是组合拓扑中的基本构建块。",
      "sentence_pinyin": "Dānchún fùxíng shì zǔhé tuòpū zhōng de jīběn gòujiàn kuài.",
      "sentence_fr": "Les complexes simpliciaux sont les éléments de base de la topologie combinatoire.",
      "sentence_en": "Simplicial complexes are fundamental building blocks in combinatorial topology.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "simplicial_complexes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子克拉玛-周不等式量化多体系统中的量子关联。",
      "sentence_pinyin": "Liàngzǐ Kèlāmǎ-Zhōu bù děngshì liànghuà duōtǐ xìtǒng zhōng de liàngzǐ guānlián.",
      "sentence_fr": "L'inégalité quantique de Cramér-Rao quantifie les corrélations quantiques dans les systèmes à plusieurs corps.",
      "sentence_en": "Quantum Cramér-Rao inequality quantifies quantum correlations in many-body systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_cramer_rao",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "大整数分解问题是RSA密码系统安全性的基础。",
      "sentence_pinyin": "Dà zhěngshù fēnjiě wèntí shì RSA mìmǎ xìtǒng ānquánxìng de jīchǔ.",
      "sentence_fr": "Le problème de factorisation des grands entiers est le fondement de la sécurité du système cryptographique RSA.",
      "sentence_en": "Large integer factorization problem is the foundation of RSA cryptographic system security.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "integer_factorization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型上下文追踪作用域中变量的类型绑定。",
      "sentence_pinyin": "Lèixíng shàngxiàwén zhuīzōng zuòyòng yù zhōng biànliàng de lèixíng bǎngdìng.",
      "sentence_fr": "Le contexte de type suit les liaisons de type des variables dans la portée.",
      "sentence_en": "Type context tracks type bindings of variables in scope.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_context",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "CW复形提供了更灵活的拓扑空间构造方法。",
      "sentence_pinyin": "CW fùxíng tígōng le gèng línghuó de tuòpū kōngjiān gòuzào fāngfǎ.",
      "sentence_fr": "Les complexes CW fournissent des méthodes de construction d'espaces topologiques plus flexibles.",
      "sentence_en": "CW complexes provide more flexible methods for constructing topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cw_complexes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子费歇尔信息量度量子态对参数变化的敏感度。",
      "sentence_pinyin": "Liàngzǐ Fèixiē'ěr xìnxī liàng dùliàng liàngzǐ tài duì cānshù biànhuà de mǐngǎndù.",
      "sentence_fr": "L'information de Fisher quantique mesure la sensibilité des états quantiques aux changements de paramètres.",
      "sentence_en": "Quantum Fisher information measures quantum state sensitivity to parameter changes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_fisher_information",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈希函数抗碰撞性要求找到不同输入产生相同输出是困难的。",
      "sentence_pinyin": "Hāxī hánshù kàng pèngzhuàngxìng yāoqiú zhǎodào bùtóng shūrù chǎnshēng xiāngtóng shūchū shì kùnnán de.",
      "sentence_fr": "La résistance aux collisions des fonctions de hachage exige qu'il soit difficile de trouver des entrées différentes produisant la même sortie.",
      "sentence_en": "Hash function collision resistance requires finding different inputs producing same output to be difficult.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "collision_resistance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型推导算法W是参数多态类型推断的经典算法。",
      "sentence_pinyin": "Lèixíng tuīdǎo suànfǎ W shì cānshù duōtài lèixíng tuīduàn de jīngdiǎn suànfǎ.",
      "sentence_fr": "L'algorithme W d'inférence de type est l'algorithme classique pour l'inférence de type polymorphe paramétrique.",
      "sentence_en": "Type inference algorithm W is the classic algorithm for parametric polymorphic type inference.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algorithm_w",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "欧拉示性数是拓扑不变量用于区分不同拓扑类型。",
      "sentence_pinyin": "Ōulā shìxìng shù shì tuòpū bùbiànliàng yòngyú qūfēn bùtóng tuòpū lèixíng.",
      "sentence_fr": "La caractéristique d'Euler est un invariant topologique utilisé pour distinguer différents types topologiques.",
      "sentence_en": "Euler characteristic is a topological invariant used to distinguish different topological types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "euler_characteristic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子韦格纳函数在相空间中准概率表示量子态。",
      "sentence_pinyin": "Liàngzǐ Wéigénà hánshù zài xiàng kōngjiān zhōng zhǔn gàilǜ biǎoshì liàngzǐ tài.",
      "sentence_fr": "La fonction de Wigner quantique représente les états quantiques comme des quasi-probabilités dans l'espace des phases.",
      "sentence_en": "Quantum Wigner function represents quantum states as quasi-probabilities in phase space.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "wigner_function",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "预像抗性要求从输出推导可能的输入是困难的。",
      "sentence_pinyin": "Yùxiàng kàngxìng yāoqiú cóng shūchū tuīdǎo kěnéng de shūrù shì kùnnán de.",
      "sentence_fr": "La résistance aux préimages exige qu'il soit difficile de déduire des entrées possibles à partir de la sortie.",
      "sentence_en": "Preimage resistance requires deducing possible inputs from output to be difficult.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "preimage_resistance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "Hindley-Milner类型系统是许多函数式语言的类型基础。",
      "sentence_pinyin": "Hindley-Milner lèixíng xìtǒng shì xǔduō hánshùshì yǔyán de lèixíng jīchǔ.",
      "sentence_fr": "Le système de types Hindley-Milner est la base de typage de nombreux langages fonctionnels.",
      "sentence_en": "Hindley-Milner type system is the typing foundation of many functional languages.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hindley_milner",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "贝蒂数是描述拓扑空间各维度洞数的不变量。",
      "sentence_pinyin": "Bèidì shù shì miáoshù tuòpū kōngjiān gè wéidù dòng shù de bùbiànliàng.",
      "sentence_fr": "Les nombres de Betti sont des invariants décrivant le nombre de trous de chaque dimension dans les espaces topologiques.",
      "sentence_en": "Betti numbers are invariants describing the number of holes of each dimension in topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "betti_numbers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
