{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个城市的地下管廊系统集成了电力、通信、供水等多种管线。",
      "sentence_pinyin": "Zhège chéngshì de dìxià guǎnláng xìtǒng jíchéngle diànlì, tōngxìn, gōngshuǐ děng duō zhǒng guǎnxiàn.",
      "sentence_fr": "Le système de galeries souterraines de cette ville intègre plusieurs types de conduits tels que électricité, communications et approvisionnement en eau.",
      "sentence_en": "This city's underground utility tunnel system integrates multiple types of pipelines such as electricity, communications, and water supply.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "underground_utilities",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "京胡是京剧的主要伴奏乐器,音色高亢明亮,穿透力强。",
      "sentence_pinyin": "Jīnghú shì jīngjù de zhǔyào bànzòu yuèqì, yīnsè gāokàng míngliàng, chuāntòulì qiáng.",
      "sentence_fr": "Le jinghu est le principal instrument d'accompagnement de l'opéra de Pékin, avec un son aigu et brillant, et une forte pénétration.",
      "sentence_en": "The jinghu is the main accompanying instrument of Peking Opera, with a high-pitched and bright tone and strong penetrating power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jinghu_music",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个精准医疗项目根据患者的基因信息制定个性化治疗方案。",
      "sentence_pinyin": "Zhège jīngzhǔn yīliào xiàngmù gēnjù huànzhě de jīyīn xìnxī zhìdìng gèxìnghuà zhìliáo fāng'àn.",
      "sentence_fr": "Ce projet de médecine de précision élabore des plans de traitement personnalisés basés sur les informations génétiques des patients.",
      "sentence_en": "This precision medicine project develops personalized treatment plans based on patients' genetic information.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "precision_medicine",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "麻编工艺利用麻绳编织出耐用的地毯、坐垫和装饰品。",
      "sentence_pinyin": "Mábiān gōngyì lìyòng máshéng biānzhī chū nàiyòng de dìtǎn, zuòdiàn hé zhuāngshìpǐn.",
      "sentence_fr": "L'artisanat du tressage de jute utilise des cordes de jute pour tisser des tapis, coussins et décorations durables.",
      "sentence_en": "Hemp weaving craftsmanship uses hemp rope to weave durable carpets, cushions, and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hemp_weaving",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能扫地机器人能够自动规划清扫路线并避开障碍物。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng sǎodì jīqìrén nénggòu zìdòng guīhuà qīngsǎo lùxiàn bìng bìkāi zhàng'àiwù.",
      "sentence_fr": "Ce robot aspirateur intelligent peut planifier automatiquement les itinéraires de nettoyage et éviter les obstacles.",
      "sentence_en": "This smart vacuum robot can automatically plan cleaning routes and avoid obstacles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "robotic_vacuums",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区互助网络为需要帮助的居民提供了邻里支援服务。",
      "sentence_pinyin": "Zhège shèqū hùzhù wǎngluò wèi xūyào bāngzhù de jūmín tígōngle línlǐ zhīyuán fúwù.",
      "sentence_fr": "Ce réseau d'entraide communautaire offre des services de soutien de voisinage aux résidents qui ont besoin d'aide.",
      "sentence_en": "This community mutual aid network provides neighborhood support services for residents in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_mutual_aid",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "板胡的音色明亮尖锐,是北方梆子戏的主要伴奏乐器。",
      "sentence_pinyin": "Bǎnhú de yīnsè míngliàng jiānruì, shì běifāng bāngzi xì de zhǔyào bànzòu yuèqì.",
      "sentence_fr": "Le banhu a un son brillant et perçant, c'est le principal instrument d'accompagnement du théâtre bangzi du nord.",
      "sentence_en": "The banhu has a bright and piercing tone, and is the main accompanying instrument for northern Bangzi opera.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "banhu_music",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个云端办公系统让员工可以在任何地方访问公司的文件和应用。",
      "sentence_pinyin": "Zhège yúnduān bàngōng xìtǒng ràng yuángōng kěyǐ zài rènhé dìfāng fǎngwèn gōngsī de wénjiàn hé yìngyòng.",
      "sentence_fr": "Ce système de bureau dans le cloud permet aux employés d'accéder aux fichiers et applications de l'entreprise depuis n'importe où.",
      "sentence_en": "This cloud office system allows employees to access company files and applications from anywhere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloud_office",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "铜丝画利用细铜丝在画板上塑造出立体的人物和景物形象。",
      "sentence_pinyin": "Tóngsī huà lìyòng xì tóngsī zài huàbǎn shàng sùzào chū lìtǐ de rénwù hé jǐngwù xíngxiàng.",
      "sentence_fr": "La peinture en fil de cuivre utilise du fil de cuivre fin pour sculpter des images tridimensionnelles de personnages et de paysages sur un panneau.",
      "sentence_en": "Copper wire painting uses fine copper wire to sculpt three-dimensional images of characters and scenery on a board.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "copper_wire_art",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能垃圾桶能够自动压缩垃圾,减少了清理频率。",
      "sentence_pinyin": "Zhège zhìnéng lājītǒng nénggòu zìdòng yāsuō lājī, jiǎnshǎole qīnglǐ pínlǜ.",
      "sentence_fr": "Cette poubelle intelligente peut compresser automatiquement les déchets, réduisant la fréquence de vidage.",
      "sentence_en": "This smart trash bin can automatically compress garbage, reducing the cleaning frequency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_trash_bins",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个森林康养基地结合了中医养生理念,为游客提供疗养服务。",
      "sentence_pinyin": "Zhège sēnlín kāngyǎng jīdì jiéhéle zhōngyī yǎngshēng lǐniàn, wèi yóukè tígōng liáoyǎng fúwù.",
      "sentence_fr": "Cette base de santé forestière combine des concepts de bien-être de la médecine traditionnelle chinoise pour offrir des services de convalescence aux visiteurs.",
      "sentence_en": "This forest health base combines traditional Chinese medicine wellness concepts to provide convalescence services for visitors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "forest_therapy",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "坠胡是河南地方戏曲的主要伴奏乐器,音色委婉动听。",
      "sentence_pinyin": "Zhuìhú shì Hénán dìfāng xìqǔ de zhǔyào bànzòu yuèqì, yīnsè wěiwǎn dòngtīng.",
      "sentence_fr": "Le zhuihu est le principal instrument d'accompagnement de l'opéra local du Henan, avec un son doux et agréable.",
      "sentence_en": "The zhuihu is the main accompanying instrument for Henan local opera, with a soft and pleasant tone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhuihu_music",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线心理咨询平台采用视频或文字交流方式,保护用户隐私。",
      "sentence_pinyin": "Zhège zàixiàn xīnlǐ zīxún píngtái cǎiyòng shìpín huò wénzì jiāoliú fāngshì, bǎohù yònghù yǐnsī.",
      "sentence_fr": "Cette plateforme de consultation psychologique en ligne utilise la communication vidéo ou texte pour protéger la vie privée des utilisateurs.",
      "sentence_en": "This online psychological counseling platform uses video or text communication to protect user privacy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_counseling",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "麦草画将麦秸秆熨烫成不同色泽,拼贴成山水人物等图案。",
      "sentence_pinyin": "Màicǎo huà jiāng màijiēgǎn yùntàng chéng bùtóng sèzé, pīntiē chéng shānshuǐ rénwù děng tú'àn.",
      "sentence_fr": "La peinture sur paille de blé repasse les tiges de blé en différentes nuances et les assemble en paysages, personnages et autres motifs.",
      "sentence_en": "Wheat straw painting irons wheat straws into different shades and assembles them into landscapes, figures, and other patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wheat_straw_painting",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能水杯可以记录饮水量并提醒用户按时喝水。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng shuǐbēi kěyǐ jìlù yǐnshuǐliàng bìng tíxǐng yònghù ànshí hēshuǐ.",
      "sentence_fr": "Cette bouteille d'eau intelligente peut enregistrer la consommation d'eau et rappeler aux utilisateurs de boire de l'eau à temps.",
      "sentence_en": "This smart water bottle can record water intake and remind users to drink water on time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_bottles",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生态补偿机制通过经济手段激励企业和个人保护环境。",
      "sentence_pinyin": "Zhège shēngtài bǔcháng jīzhì tōngguò jīngjì shǒuduàn jīlì qǐyè hé gèrén bǎohù huánjìng.",
      "sentence_fr": "Ce mécanisme de compensation écologique incite les entreprises et les individus à protéger l'environnement par des moyens économiques.",
      "sentence_en": "This ecological compensation mechanism incentivizes companies and individuals to protect the environment through economic means.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecological_compensation",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "革胡是低音拉弦乐器,在民族管弦乐队中担任低音声部。",
      "sentence_pinyin": "Géhú shì dīyīn lāxián yuèqì, zài mínzú guǎnxián yuèduì zhōng dānrèn dīyīn shēngbù.",
      "sentence_fr": "Le gehu est un instrument à cordes frottées de basse, jouant la partie de basse dans les orchestres traditionnels.",
      "sentence_en": "The gehu is a bass bowed string instrument, playing the bass part in traditional orchestras.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gehu_music",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字货币钱包采用多重签名和冷存储技术保障资产安全。",
      "sentence_pinyin": "Zhège shùzì huòbì qiánbāo cǎiyòng duōchóng qiānmíng hé lěng cúnchǔ jìshù bǎozhàng zīchǎn ānquán.",
      "sentence_fr": "Ce portefeuille de cryptomonnaie adopte la technologie de signature multiple et de stockage à froid pour garantir la sécurité des actifs.",
      "sentence_en": "This cryptocurrency wallet adopts multi-signature and cold storage technology to ensure asset security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crypto_wallets",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "骨雕艺术利用动物骨骼雕刻出精美的饰品和摆件。",
      "sentence_pinyin": "Gǔdiāo yìshù lìyòng dòngwù gǔgé diāokè chū jīngměi de shìpǐn hé bǎijiàn.",
      "sentence_fr": "L'art de la sculpture sur os utilise des os d'animaux pour sculpter de beaux bijoux et ornements.",
      "sentence_en": "Bone carving art uses animal bones to carve beautiful jewelry and ornaments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bone_carving",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能监控系统能够识别异常行为并自动报警。",
      "sentence_pinyin": "Zhège zhìnéng jiānkòng xìtǒng nénggòu shíbié yìcháng xíngwéi bìng zìdòng bàojǐng.",
      "sentence_fr": "Ce système de surveillance intelligent peut identifier les comportements anormaux et déclencher automatiquement des alertes.",
      "sentence_en": "This intelligent surveillance system can identify abnormal behaviors and automatically trigger alarms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_surveillance",
      "created_at": "2025-11-20T21:15:00.000Z",
      "updated_at": "2025-11-20T21:15:00.000Z"
    }
  ]
}
