{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "宇宙弦是宇宙早期相变可能遗留的一维拓扑缺陷。",
      "sentence_pinyin": "Yǔzhòu xián shì yǔzhòu zǎoqī xiāngbiàn kěnéng yíliú de yī wéi tuòpū quēxiàn.",
      "sentence_fr": "Les cordes cosmiques sont des défauts topologiques unidimensionnels possiblement laissés par les transitions de phase de l'univers primitif.",
      "sentence_en": "Cosmic strings are one-dimensional topological defects possibly left by early universe phase transitions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cosmic_strings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "见证加密根据满足的谓词条件选择性解密数据。",
      "sentence_pinyin": "Jiànzhèng jiāmì gēnjù mǎnzú de wèicí tiáojiàn xuǎnzéxìng jiěmì shùjù.",
      "sentence_fr": "Le chiffrement par témoignage déchiffre sélectivement les données en fonction des conditions de prédicat satisfaites.",
      "sentence_en": "Witness encryption selectively decrypts data based on satisfied predicate conditions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "witness_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "线性类型确保资源恰好被使用一次防止泄漏和重复使用。",
      "sentence_pinyin": "Xiànxìng lèixíng quèbǎo zīyuán qiàhǎo bèi shǐyòng yī cì fángzhǐ xièlòu hé chóngfù shǐyòng.",
      "sentence_fr": "Les types linéaires garantissent que les ressources sont utilisées exactement une fois, empêchant les fuites et la réutilisation.",
      "sentence_en": "Linear types ensure resources are used exactly once, preventing leaks and reuse.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "linear_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "德拉姆上同调将微分形式与代数拓扑联系起来。",
      "sentence_pinyin": "Délāmǔ shàngtóngyú jiāng wēifēn xíngshì yǔ dàishù tuòpū liánxì qǐlái.",
      "sentence_fr": "La cohomologie de de Rham relie les formes différentielles à la topologie algébrique.",
      "sentence_en": "De Rham cohomology connects differential forms to algebraic topology.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "de_rham_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子退火利用量子隧穿效应探索组合优化问题的解空间。",
      "sentence_pinyin": "Liàngzǐ tuìhuǒ lìyòng liàngzǐ suìchuān xiàoyìng tànsuǒ zǔhé yōuhuà wèntí de jiě kōngjiān.",
      "sentence_fr": "Le recuit quantique utilise l'effet tunnel quantique pour explorer l'espace des solutions des problèmes d'optimisation combinatoire.",
      "sentence_en": "Quantum annealing uses quantum tunneling effects to explore solution spaces of combinatorial optimization problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_annealing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间锁定谜题强制在指定时间后才能计算出结果。",
      "sentence_pinyin": "Shíjiān suǒdìng mítí qiángzhì zài zhǐdìng shíjiān hòu cáinéng jìsuàn chū jiéguǒ.",
      "sentence_fr": "Les puzzles verrouillés dans le temps forcent le calcul du résultat uniquement après un temps spécifié.",
      "sentence_en": "Time-locked puzzles force computation of results only after a specified time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "time_locked_puzzles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿射类型是线性类型的扩展允许资源最多使用一次。",
      "sentence_pinyin": "Fǎngshè lèixíng shì xiànxìng lèixíng de kuòzhǎn yǔnxǔ zīyuán zuìduō shǐyòng yī cì.",
      "sentence_fr": "Les types affines sont une extension des types linéaires permettant aux ressources d'être utilisées au plus une fois.",
      "sentence_en": "Affine types are an extension of linear types allowing resources to be used at most once.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "affine_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "切赫上同调通过覆盖层计算层的上同调群。",
      "sentence_pinyin": "Qièhè shàngtóngyú tōngguò fùgàicéng jìsuàn céng de shàngtóngyúqún.",
      "sentence_fr": "La cohomologie de Čech calcule les groupes de cohomologie des faisceaux via les recouvrements.",
      "sentence_en": "Čech cohomology computes cohomology groups of sheaves via coverings.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cech_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子行走是经典随机游走的量子类比具有独特的传播特性。",
      "sentence_pinyin": "Liàngzǐ xíngzǒu shì jīngdiǎn suíjī yóuzǒu de liàngzǐ lèibǐ jùyǒu dútè de chuánbò tèxìng.",
      "sentence_fr": "La marche quantique est l'analogue quantique de la marche aléatoire classique avec des propriétés de propagation uniques.",
      "sentence_en": "Quantum walks are quantum analogues of classical random walks with unique propagation properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_walks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可提取承诺允许在特定条件下提取承诺值。",
      "sentence_pinyin": "Kě tíqǔ chéngnuò yǔnxǔ zài tèdìng tiáojiàn xià tíqǔ chéngnuò zhí.",
      "sentence_fr": "Les engagements extractibles permettent d'extraire la valeur engagée sous certaines conditions.",
      "sentence_en": "Extractable commitments allow extracting the committed value under specific conditions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "extractable_commitments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "所有权类型在编译时跟踪对象所有权防止数据竞争。",
      "sentence_pinyin": "Suǒyǒuquán lèixíng zài biānyì shí gēnzōng duìxiàng suǒyǒuquán fángzhǐ shùjù jìngzhēng.",
      "sentence_fr": "Les types de propriété suivent la propriété des objets à la compilation pour prévenir les courses aux données.",
      "sentence_en": "Ownership types track object ownership at compile time to prevent data races.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ownership_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "层论为代数几何和复分析提供了统一的范畴论框架。",
      "sentence_pinyin": "Cénglùn wèi dàishù jǐhé hé fù fēnxī tígōng le tǒngyī de fànchóulùn kuàngjià.",
      "sentence_fr": "La théorie des faisceaux fournit un cadre catégorique unifié pour la géométrie algébrique et l'analyse complexe.",
      "sentence_en": "Sheaf theory provides a unified categorical framework for algebraic geometry and complex analysis.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "sheaf_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子复杂性理论研究量子算法的计算资源需求。",
      "sentence_pinyin": "Liàngzǐ fùzáxìng lǐlùn yánjiū liàngzǐ suànfǎ de jìsuàn zīyuán xūqiú.",
      "sentence_fr": "La théorie de la complexité quantique étudie les besoins en ressources de calcul des algorithmes quantiques.",
      "sentence_en": "Quantum complexity theory studies computational resource requirements of quantum algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_complexity_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非交互式零知识证明允许证明者一次性发送证明。",
      "sentence_pinyin": "Fēi jiāohùshì líng zhīshì zhèngmíng yǔnxǔ zhèngmíngzhě yī cìxìng fāsòng zhèngmíng.",
      "sentence_fr": "Les preuves à connaissance nulle non interactives permettent au prouveur d'envoyer la preuve en une seule fois.",
      "sentence_en": "Non-interactive zero-knowledge proofs allow provers to send proofs in a single message.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "nizk_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量词类型将程序逻辑中的量词嵌入类型系统。",
      "sentence_pinyin": "Liàngcí lèixíng jiāng chéngxù luójí zhōng de liàngcí qiànrù lèixíng xìtǒng.",
      "sentence_fr": "Les types quantifiés intègrent les quantificateurs de la logique des programmes dans les systèmes de types.",
      "sentence_en": "Quantified types embed quantifiers from program logic into type systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantified_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "范畴代数研究范畴中对象和态射的代数结构。",
      "sentence_pinyin": "Fànchóu dàishù yánjiū fànchóu zhōng duìxiàng hé tàishè de dàishù jiégòu.",
      "sentence_fr": "L'algèbre catégorique étudie les structures algébriques des objets et des morphismes dans les catégories.",
      "sentence_en": "Categorical algebra studies algebraic structures of objects and morphisms in categories.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "categorical_algebra",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玻色采样是证明量子计算优势的典型问题之一。",
      "sentence_pinyin": "Bōsè cǎiyàng shì zhèngmíng liàngzǐ jìsuàn yōushì de diǎnxíng wèntí zhī yī.",
      "sentence_fr": "L'échantillonnage de bosons est l'un des problèmes typiques pour démontrer l'avantage du calcul quantique.",
      "sentence_en": "Boson sampling is one of the typical problems for demonstrating quantum computing advantage.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "boson_sampling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "简洁非交互知识论证提供常数大小的通用证明系统。",
      "sentence_pinyin": "Jiǎnjié fēi jiāohù zhīshì lùnzhèng tígōng chángshù dàxiǎo de tōngyòng zhèngmíng xìtǒng.",
      "sentence_fr": "Les arguments de connaissance non interactifs succincts fournissent des systèmes de preuve universels de taille constante.",
      "sentence_en": "Succinct non-interactive arguments of knowledge provide constant-size universal proof systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "snark_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "借用检查器在编译时验证引用的有效性和生命周期。",
      "sentence_pinyin": "Jièyòng jiǎncháqì zài biānyì shí yànzhèng yǐnyòng de yǒuxiàoxìng hé shēngmìng zhōuqī.",
      "sentence_fr": "Le vérificateur d'emprunt vérifie la validité et la durée de vie des références à la compilation.",
      "sentence_en": "Borrow checkers verify reference validity and lifetimes at compile time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "borrow_checking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "K理论连接代数与拓扑为分类向量丛提供工具。",
      "sentence_pinyin": "K lǐlùn liánjiē dàishù yǔ tuòpū wèi fēnlèi xiàngliàng cù tígōng gōngjù.",
      "sentence_fr": "La K-théorie relie l'algèbre et la topologie, fournissant des outils pour classifier les fibrés vectoriels.",
      "sentence_en": "K-theory connects algebra and topology, providing tools for classifying vector bundles.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "k_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
