{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧园区利用物联网技术实现了能源管理、安防监控和停车引导的智能化。",
      "sentence_pinyin": "Zhège zhìhuì yuánqū lìyòng wùliánwǎng jìshù shíxiànle néngyuán guǎnlǐ, ānfáng jiānkòng hé tíngchē yǐndǎo de zhìnénghuà.",
      "sentence_fr": "Ce parc intelligent utilise la technologie IoT pour réaliser l'intelligentisation de la gestion énergétique, la surveillance de sécurité et le guidage du stationnement.",
      "sentence_en": "This smart park uses IoT technology to achieve intelligentization of energy management, security monitoring, and parking guidance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parks",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐的演奏需要很强的气息控制能力,初学者往往需要长时间练习。",
      "sentence_pinyin": "Suǒnà de yǎnzòu xūyào hěn qiáng de qìxī kòngzhì nénglì, chūxuézhě wǎngwǎng xūyào cháng shíjiān liànxí.",
      "sentence_fr": "Jouer du suona nécessite un fort contrôle de la respiration, les débutants ont souvent besoin de longues pratiques.",
      "sentence_en": "Playing the suona requires strong breath control, and beginners often need long practice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_training",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农村电商培训项目帮助农民掌握了网络销售技能,拓宽了销售渠道。",
      "sentence_pinyin": "Zhège nóngcūn diànshāng péixùn xiàngmù bāngzhù nóngmín zhǎngwòle wǎngluò xiāoshòu jìnéng, tuòkuānle xiāoshòu qúdào.",
      "sentence_fr": "Ce projet de formation au commerce électronique rural aide les agriculteurs à maîtriser les compétences de vente en ligne et à élargir leurs canaux de vente.",
      "sentence_en": "This rural e-commerce training project helps farmers master online sales skills and expand sales channels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecommerce_training",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "象牙果雕刻利用植物象牙果的质地,制作出仿象牙工艺品。",
      "sentence_pinyin": "Xiàngyáguǒ diāokè lìyòng zhíwù xiàngyáguǒ de zhìdì, zhìzuò chū fǎng xiàngyá gōngyìpǐn.",
      "sentence_fr": "La sculpture sur noix d'ivoire végétal utilise la texture de la noix d'ivoire pour créer des objets artisanaux imitant l'ivoire.",
      "sentence_en": "Tagua nut carving uses the texture of vegetable ivory to create ivory-like handicrafts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tagua_nut_carving",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电饭煲能够根据米的种类自动调节火候和时间。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànfànbāo nénggòu gēnjù mǐ de zhǒnglèi zìdòng tiáojié huǒhòu hé shíjiān.",
      "sentence_fr": "Cette cuiseur à riz intelligent peut ajuster automatiquement la température et le temps selon le type de riz.",
      "sentence_en": "This smart rice cooker can automatically adjust heat and time according to the type of rice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_rice_cookers",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个绿色出行平台整合了公交、地铁、共享单车等多种交通方式。",
      "sentence_pinyin": "Zhège lǜsè chūxíng píngtái zhěnghéle gōngjiāo, dìtiě, gòngxiǎng dānchē děng duō zhǒng jiāotōng fāngshì.",
      "sentence_fr": "Cette plateforme de transport vert intègre plusieurs modes de transport tels que bus, métro et vélos partagés.",
      "sentence_en": "This green transportation platform integrates multiple modes of transport such as buses, subways, and shared bicycles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "multimodal_transportation",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝曲《渔舟唱晚》通过优美的旋律描绘了渔民晚归的喜悦心情。",
      "sentence_pinyin": "Gǔzhēng qǔ 'Yúzhōu chàng wǎn' tōngguò yōuměi de xuánlǜ miáohuìle yúmín wǎn guī de xǐyuè xīnqíng.",
      "sentence_fr": "La pièce de guzheng 'Chant du soir des bateaux de pêcheurs' dépeint la joie des pêcheurs rentrant le soir à travers une belle mélodie.",
      "sentence_en": "The guzheng piece 'Evening Song of the Fishing Boats' depicts the joyful mood of fishermen returning in the evening through a beautiful melody.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_repertoire",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个远程医疗会诊平台连接了城乡医疗资源,缓解了看病难的问题。",
      "sentence_pinyin": "Zhège yuǎnchéng yīliào huìzhěn píngtái liánjiēle chéngxiāng yīliào zīyuán, huǎnjiěle kànbìng nán de wèntí.",
      "sentence_fr": "Cette plateforme de consultation médicale à distance relie les ressources médicales urbaines et rurales, allégeant le problème de l'accès aux soins.",
      "sentence_en": "This telemedicine consultation platform connects urban and rural medical resources, alleviating the difficulty of accessing healthcare.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "telemedicine_platforms",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "糖画艺人用融化的糖浆在石板上快速绘制出各种生动的图案。",
      "sentence_pinyin": "Tánghuà yìrén yòng rónghuà de tángjiāng zài shíbǎn shàng kuàisù huìzhì chū gèzhǒng shēngdòng de tú'àn.",
      "sentence_fr": "Les artistes de la peinture au sucre dessinent rapidement divers motifs vivants avec du sirop de sucre fondu sur une dalle de pierre.",
      "sentence_en": "Sugar painting artists quickly draw various vivid patterns with melted syrup on a stone slab.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sugar_painting",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能门铃具有可视对讲和人脸识别功能,增强了家庭安全。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng ménlíng jùyǒu kěshì duìjiǎng hé rénliǎn shíbié gōngnéng, zēngqiángle jiātíng ānquán.",
      "sentence_fr": "Cette sonnette intelligente possède des fonctions d'interphone vidéo et de reconnaissance faciale, renforçant la sécurité domestique.",
      "sentence_en": "This smart doorbell has video intercom and facial recognition functions, enhancing home security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_doorbells",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区花园项目让居民能够种植蔬菜,体验农耕乐趣。",
      "sentence_pinyin": "Zhège shèqū huāyuán xiàngmù ràng jūmín nénggòu zhòngzhí shūcài, tǐyàn nónggēng lèqù.",
      "sentence_fr": "Ce projet de jardin communautaire permet aux résidents de cultiver des légumes et de vivre le plaisir de l'agriculture.",
      "sentence_en": "This community garden project allows residents to grow vegetables and experience the joy of farming.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_gardens",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "管子的演奏技巧包括循环换气,可以吹出连绵不断的长音。",
      "sentence_pinyin": "Guǎnzi de yǎnzòu jìqiǎo bāokuò xúnhuán huànqì, kěyǐ chuī chū liánmián bùduàn de chángyīn.",
      "sentence_fr": "Les techniques de jeu du guanzi incluent la respiration circulaire, permettant de produire des notes longues continues.",
      "sentence_en": "Guanzi playing techniques include circular breathing, allowing continuous long notes to be produced.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guanzi_techniques",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线课堂使用虚拟现实技术,让学生能够身临其境地学习历史和地理。",
      "sentence_pinyin": "Zhège zàixiàn kètáng shǐyòng xūnǐ xiànshí jìshù, ràng xuéshēng nénggòu shēnlínqíjìng de xuéxí lìshǐ hé dìlǐ.",
      "sentence_fr": "Cette classe en ligne utilise la réalité virtuelle pour permettre aux étudiants d'apprendre l'histoire et la géographie de manière immersive.",
      "sentence_en": "This online classroom uses virtual reality technology to allow students to learn history and geography immersively.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vr_education",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "核桃雕刻在小小的核桃壳上刻出精细复杂的花纹和图案。",
      "sentence_pinyin": "Hétao diāokè zài xiǎoxiǎo de hétao ké shàng kè chū jīngxì fùzá de huāwén hé tú'àn.",
      "sentence_fr": "La sculpture sur noix grave des motifs et dessins fins et complexes sur de petites coquilles de noix.",
      "sentence_en": "Walnut carving engraves fine and complex patterns and designs on small walnut shells.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "walnut_carving",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能家居系统能够学习用户习惯,自动调节室内环境。",
      "sentence_pinyin": "Zhège zhìnéng jiājū xìtǒng nénggòu xuéxí yònghù xíguàn, zìdòng tiáojié shìnèi huánjìng.",
      "sentence_fr": "Ce système domotique intelligent peut apprendre les habitudes des utilisateurs et ajuster automatiquement l'environnement intérieur.",
      "sentence_en": "This smart home system can learn user habits and automatically adjust the indoor environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "adaptive_smart_homes",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个碳交易平台为企业提供了减排量的买卖和交易服务。",
      "sentence_pinyin": "Zhège tàn jiāoyì píngtái wèi qǐyè tígōngle jiǎnpáiliàng de mǎimài hé jiāoyì fúwù.",
      "sentence_fr": "Cette plateforme d'échange de carbone offre aux entreprises des services d'achat, de vente et d'échange de réductions d'émissions.",
      "sentence_en": "This carbon trading platform provides companies with services for buying, selling, and trading emission reductions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "carbon_trading",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "月琴的形状像满月,音色清脆响亮,常用于京剧和说唱伴奏。",
      "sentence_pinyin": "Yuèqín de xíngzhuàng xiàng mǎnyuè, yīnsè qīngcuì xiǎngliàng, cháng yòng yú jīngjù hé shuōchàng bànzòu.",
      "sentence_fr": "Le yueqin a la forme d'une pleine lune, avec un son clair et sonore, souvent utilisé pour accompagner l'opéra de Pékin et les récits chantés.",
      "sentence_en": "The yueqin is shaped like a full moon, with a clear and loud tone, often used to accompany Peking Opera and storytelling performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yueqin_music",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个知识分享平台鼓励专业人士分享经验,促进了知识的传播。",
      "sentence_pinyin": "Zhège zhīshi fēnxiǎng píngtái gǔlì zhuānyè rénshì fēnxiǎng jīngyàn, cùjìnle zhīshi de chuánbō.",
      "sentence_fr": "Cette plateforme de partage de connaissances encourage les professionnels à partager leur expérience, favorisant la diffusion des connaissances.",
      "sentence_en": "This knowledge sharing platform encourages professionals to share their experience, promoting the dissemination of knowledge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "knowledge_sharing_platforms",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "煤精雕刻利用煤精石的乌黑光泽,制作出精美的首饰和工艺品。",
      "sentence_pinyin": "Méijīng diāokè lìyòng méijīng shí de wūhēi guāngzé, zhìzuò chū jīngměi de shǒushì hé gōngyìpǐn.",
      "sentence_fr": "La sculpture sur jais utilise le lustre noir du jais pour créer de beaux bijoux et objets artisanaux.",
      "sentence_en": "Jet carving uses the black luster of jet stone to create beautiful jewelry and crafts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jet_carving",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能插座可以远程控制电器开关,并监测用电量。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chāzuò kěyǐ yuǎnchéng kòngzhì diànqì kāiguān, bìng jiāncè yòngdiànliàng.",
      "sentence_fr": "Cette prise intelligente peut contrôler à distance les interrupteurs des appareils et surveiller la consommation d'électricité.",
      "sentence_en": "This smart socket can remotely control appliance switches and monitor power consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_plugs",
      "created_at": "2025-11-20T21:20:00.000Z",
      "updated_at": "2025-11-20T21:20:00.000Z"
    }
  ]
}
