{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能停车系统可以引导车主找到最近的空闲车位,节省寻找时间。",
      "sentence_pinyin": "Zhège zhìnéng tíngchē xìtǒng kěyǐ yǐndǎo chēzhǔ zhǎodào zuìjìn de kòngxián chēwèi, jiéshěng xúnzhǎo shíjiān.",
      "sentence_fr": "Ce système de stationnement intelligent peut guider les conducteurs vers la place libre la plus proche, économisant du temps de recherche.",
      "sentence_en": "This smart parking system can guide drivers to the nearest available parking space, saving search time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的面塑艺术家用面团捏出各种生动的人物和动物形象。",
      "sentence_pinyin": "Zhōngguó chuántǒng de miànsù yìshùjiā yòng miàntuán niēchū gèzhǒng shēngdòng de rénwù hé dòngwù xíngxiàng.",
      "sentence_fr": "Les artistes traditionnels chinois de modelage de pâte créent diverses figures vivantes de personnages et d'animaux avec de la pâte.",
      "sentence_en": "Traditional Chinese dough modeling artists create various vivid figures of characters and animals with dough.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dough_sculpture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的医疗惠民政策减轻了农村居民的看病负担。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de yīliáo huìmín zhèngcè jiǎnqīng le nóngcūn jūmín de kànbìng fùdān.",
      "sentence_fr": "Les politiques médicales favorables lancées par le gouvernement ont allégé le fardeau des soins de santé pour les résidents ruraux.",
      "sentence_en": "The government's favorable medical policies have reduced the healthcare burden for rural residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "healthcare_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能床垫可以监测睡眠质量,并根据睡姿自动调节软硬度。",
      "sentence_pinyin": "Zhìnéng chuángdiàn kěyǐ jiāncè shuìmián zhìliàng, bìng gēnjù shuìzī zìdòng tiáojié ruǎnyìngdù.",
      "sentence_fr": "Le matelas intelligent peut surveiller la qualité du sommeil et ajuster automatiquement la fermeté selon la position de sommeil.",
      "sentence_en": "The smart mattress can monitor sleep quality and automatically adjust firmness based on sleeping position.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mattresses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "箫是中国传统的竖吹乐器,音色幽雅,适合演奏古典曲目。",
      "sentence_pinyin": "Xiāo shì Zhōngguó chuántǒng de shùchuī yuèqì, yīnsè yōuyǎ, shìhé yǎnzòu gǔdiǎn qǔmù.",
      "sentence_fr": "Le xiao est un instrument à vent vertical traditionnel chinois, au timbre élégant, adapté à l'interprétation de morceaux classiques.",
      "sentence_en": "The xiao is a traditional Chinese vertical wind instrument, with an elegant tone, suitable for playing classical pieces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiao_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绿色建筑采用节能材料和设计,减少了建筑对环境的影响。",
      "sentence_pinyin": "Lǜsè jiànzhù cǎiyòng jiénéng cáiliào hé shèjì, jiǎnshǎo le jiànzhù duì huánjìng de yǐngxiǎng.",
      "sentence_fr": "Les bâtiments verts utilisent des matériaux et des conceptions économes en énergie, réduisant l'impact environnemental des constructions.",
      "sentence_en": "Green buildings use energy-efficient materials and designs, reducing the environmental impact of construction.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_buildings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物喂食器可以定时定量投放食物,还能远程查看宠物状态。",
      "sentence_pinyin": "Zhìnéng chǒngwù wèishíqì kěyǐ dìngshí dìngliàng tóufàng shíwù, hái néng yuǎnchéng chákàn chǒngwù zhuàngtài.",
      "sentence_fr": "Le distributeur de nourriture intelligent pour animaux peut distribuer la nourriture à heures fixes et en quantités précises, et permet de surveiller l'animal à distance.",
      "sentence_en": "The smart pet feeder can dispense food at set times and amounts, and allows remote viewing of pet status.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_feeders",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这件青花瓷瓶是景德镇的传统工艺品,造型优美,图案典雅。",
      "sentence_pinyin": "Zhè jiàn qīnghuā cí píng shì Jǐngdézhèn de chuántǒng gōngyìpǐn, zàoxíng yōuměi, tú'àn diǎnyǎ.",
      "sentence_fr": "Ce vase en porcelaine bleu et blanc est un artisanat traditionnel de Jingdezhen, avec une forme gracieuse et des motifs élégants.",
      "sentence_en": "This blue and white porcelain vase is a traditional craft from Jingdezhen, with a graceful shape and elegant patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "blue_white_porcelain",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能体重秤不仅能测量体重,还能分析体脂率和肌肉量。",
      "sentence_pinyin": "Zhìnéng tǐzhòng chèng bùjǐn néng cèliáng tǐzhòng, hái néng fēnxī tǐzhīlǜ hé jīròu liàng.",
      "sentence_fr": "La balance intelligente peut non seulement mesurer le poids, mais aussi analyser le taux de graisse corporelle et la masse musculaire.",
      "sentence_en": "The smart body scale can not only measure weight but also analyze body fat percentage and muscle mass.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝是中国传统的弹拨乐器,音色悠扬,深受音乐爱好者的喜爱。",
      "sentence_pinyin": "Gǔzhēng shì Zhōngguó chuántǒng de tánbō yuèqì, yīnsè yōuyáng, shēn shòu yīnyuè àihàozhě de xǐ'ài.",
      "sentence_fr": "Le guzheng est un instrument traditionnel chinois à cordes pincées, au son mélodieux, très apprécié des amateurs de musique.",
      "sentence_en": "The guzheng is a traditional Chinese plucked string instrument, with a melodious tone, deeply loved by music enthusiasts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市绿道系统连接了各个公园和社区,方便市民骑行和步行。",
      "sentence_pinyin": "Chéngshì lǜdào xìtǒng liánjiē le gègè gōngyuán hé shèqū, fāngbiàn shìmín qíxíng hé bùxíng.",
      "sentence_fr": "Le système de voies vertes urbaines relie les différents parcs et quartiers, facilitant le vélo et la marche pour les citadins.",
      "sentence_en": "The urban greenway system connects various parks and communities, making cycling and walking convenient for residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_greenways",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能音响可以通过语音控制播放音乐,还能控制其他智能家居设备。",
      "sentence_pinyin": "Zhìnéng yīnxiǎng kěyǐ tōngguò yǔyīn kòngzhì bōfàng yīnyuè, hái néng kòngzhì qítā zhìnéng jiājū shèbèi.",
      "sentence_fr": "L'enceinte intelligente peut jouer de la musique par commande vocale et contrôler d'autres appareils domestiques intelligents.",
      "sentence_en": "The smart speaker can play music through voice control and can control other smart home devices.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_speakers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的风筝制作工艺包括扎架、糊纸、绑线和彩绘四道工序。",
      "sentence_pinyin": "Zhōngguó chuántǒng de fēngzheng zhìzuò gōngyì bāokuò zhā jià, hú zhǐ, bǎng xiàn hé cǎihuì sì dào gōngxù.",
      "sentence_fr": "L'artisanat traditionnel chinois de fabrication de cerfs-volants comprend quatre étapes : assemblage de l'armature, collage du papier, fixation du fil et peinture.",
      "sentence_en": "Traditional Chinese kite-making craftsmanship includes four processes: frame assembly, paper pasting, string tying, and painting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kite_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能烤箱可以根据食材自动设置温度和时间,确保烹饪效果。",
      "sentence_pinyin": "Zhìnéng kǎoxiāng kěyǐ gēnjù shícái zìdòng shèzhì wēndù hé shíjiān, quèbǎo pēngrèn xiàoguǒ.",
      "sentence_fr": "Le four intelligent peut régler automatiquement la température et le temps selon les ingrédients, garantissant de bons résultats de cuisson.",
      "sentence_en": "The smart oven can automatically set temperature and time based on ingredients, ensuring cooking results.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_ovens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座城市的地铁网络四通八达,极大地方便了市民的日常出行。",
      "sentence_pinyin": "Zhè zuò chéngshì de dìtiě wǎngluò sìtōng bādá, jídà de fāngbiàn le shìmín de rìcháng chūxíng.",
      "sentence_fr": "Le réseau de métro de cette ville s'étend dans toutes les directions, facilitant grandement les déplacements quotidiens des habitants.",
      "sentence_en": "This city's subway network extends in all directions, greatly facilitating residents' daily travel.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_transit",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "龙舟竞渡是端午节的传统活动,各地都会举办盛大的比赛。",
      "sentence_pinyin": "Lóngzhōu jìngdù shì Duānwǔjié de chuántǒng huódòng, gèdì dōu huì jǔbàn shèngdà de bǐsài.",
      "sentence_fr": "La course de bateaux-dragons est une activité traditionnelle de la Fête des Bateaux-Dragons, avec de grandes compétitions organisées partout.",
      "sentence_en": "Dragon boat racing is a traditional activity of the Dragon Boat Festival, with grand competitions held everywhere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dragon_boat",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能咖啡机可以记住你的口味偏好,一键制作你喜欢的咖啡。",
      "sentence_pinyin": "Zhìnéng kāfēijī kěyǐ jìzhù nǐ de kǒuwèi piānhào, yī jiàn zhìzuò nǐ xǐhuan de kāfēi.",
      "sentence_fr": "La machine à café intelligente peut mémoriser vos préférences gustatives et préparer votre café préféré en une touche.",
      "sentence_en": "The smart coffee maker can remember your taste preferences and make your favorite coffee with one touch.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_coffee_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统戏曲脸谱的颜色和图案代表着不同的人物性格和身份。",
      "sentence_pinyin": "Zhōngguó chuántǒng xìqǔ liǎnpǔ de yánsè hé tú'àn dàibiǎo zhe bùtóng de rénwù xìnggé hé shēnfèn.",
      "sentence_fr": "Les couleurs et motifs des masques de l'opéra traditionnel chinois représentent différents caractères et identités des personnages.",
      "sentence_en": "The colors and patterns of traditional Chinese opera facial makeup represent different character personalities and identities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "opera_masks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区志愿者定期组织活动关爱空巢老人,送去温暖和陪伴。",
      "sentence_pinyin": "Shèqū zhìyuànzhě dìngqī zǔzhī huódòng guān'ài kōngcháo lǎorén, sòng qù wēnnuǎn hé péibàn.",
      "sentence_fr": "Les bénévoles communautaires organisent régulièrement des activités pour prendre soin des personnes âgées vivant seules, leur apportant chaleur et compagnie.",
      "sentence_en": "Community volunteers regularly organize activities to care for elderly people living alone, bringing warmth and companionship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_volunteering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能洗碗机可以根据餐具数量和脏污程度自动选择清洗模式。",
      "sentence_pinyin": "Zhìnéng xǐwǎnjī kěyǐ gēnjù cānjù shùliàng hé zāngwū chéngdù zìdòng xuǎnzé qīngxǐ móshì.",
      "sentence_fr": "Le lave-vaisselle intelligent peut sélectionner automatiquement le mode de lavage selon la quantité de vaisselle et le niveau de saleté.",
      "sentence_en": "The smart dishwasher can automatically select the washing mode based on the amount of dishes and level of dirtiness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dishwashers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
