{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "神经网络架构搜索自动化设计最优的深度学习模型结构以提高性能。",
      "sentence_pinyin": "Shénjīng wǎngluò jiàgòu sōusuǒ zìdònghuà shèjì zuìyōu de shēndù xuéxí móxíng jiégòu yǐ tígāo xìngnéng.",
      "sentence_fr": "La recherche d'architecture de réseaux neuronaux automatise la conception de structures optimales de modèles d'apprentissage profond pour améliorer les performances.",
      "sentence_en": "Neural architecture search automates the design of optimal deep learning model structures to improve performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neural_architecture_search",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人类学家通过田野调查深入了解不同社区的文化实践和社会组织形式。",
      "sentence_pinyin": "Rénlèi xuéjiā tōngguò tiányě diàochá shēnrù liǎojiě bùtóng shèqū de wénhuà shíjiàn hé shèhuì zǔzhī xíngshì.",
      "sentence_fr": "Les anthropologues acquièrent une compréhension approfondie des pratiques culturelles et des formes d'organisation sociale des différentes communautés grâce au travail de terrain.",
      "sentence_en": "Anthropologists gain deep understanding of different communities' cultural practices and social organization forms through fieldwork.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "anthropological_fieldwork",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可解释人工智能研究如何使机器学习模型的决策过程更加透明和可理解。",
      "sentence_pinyin": "Kě jiěshì réngōng zhìnéng yánjiū rúhé shǐ jīqì xuéxí móxíng de juécè guòchéng gèngjiā tòumíng hé kě lǐjiě.",
      "sentence_fr": "L'intelligence artificielle explicable étudie comment rendre le processus de décision des modèles d'apprentissage automatique plus transparent et compréhensible.",
      "sentence_en": "Explainable artificial intelligence studies how to make the decision-making process of machine learning models more transparent and understandable.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "explainable_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循环经济模式强调资源的持续利用和废物的最小化以实现可持续发展。",
      "sentence_pinyin": "Xúnhuán jīngjì móshì qiángdiào zīyuán de chíxù lìyòng hé fèiwù de zuìxiǎohuà yǐ shíxiàn kě chíxù fāzhǎn.",
      "sentence_fr": "Le modèle d'économie circulaire met l'accent sur l'utilisation continue des ressources et la minimisation des déchets pour atteindre un développement durable.",
      "sentence_en": "The circular economy model emphasizes continuous resource utilization and waste minimization to achieve sustainable development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circular_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会心理学研究个人如何被他人的存在和行为所影响和改变。",
      "sentence_pinyin": "Shèhuì xīnlǐxué yánjiū gèrén rúhé bèi tārén de cúnzài hé xíngwéi suǒ yǐngxiǎng hé gǎibiàn.",
      "sentence_fr": "La psychologie sociale étudie comment les individus sont influencés et modifiés par la présence et le comportement des autres.",
      "sentence_en": "Social psychology studies how individuals are influenced and changed by the presence and behavior of others.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "区块链智能合约可以自动执行预定条件触发的协议而无需中间人。",
      "sentence_pinyin": "Qūkuàiliàn zhìnéng héyuē kěyǐ zìdòng zhíxíng yùdìng tiáojiàn chùfā de xiéyì ér wúxū zhōngjiānrén.",
      "sentence_fr": "Les contrats intelligents blockchain peuvent exécuter automatiquement des accords déclenchés par des conditions prédéfinies sans intermédiaire.",
      "sentence_en": "Blockchain smart contracts can automatically execute agreements triggered by predetermined conditions without intermediaries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_contracts",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态系统服务评估量化自然环境为人类社会提供的经济和非经济价值。",
      "sentence_pinyin": "Shēngtài xìtǒng fúwù pínggū liànghuà zìrán huánjìng wèi rénlèi shèhuì tígōng de jīngjì hé fēi jīngjì jiàzhí.",
      "sentence_fr": "L'évaluation des services écosystémiques quantifie la valeur économique et non économique que l'environnement naturel fournit à la société humaine.",
      "sentence_en": "Ecosystem services assessment quantifies the economic and non-economic value that the natural environment provides to human society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecosystem_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语义网技术旨在使互联网上的数据具有机器可理解的含义和关系。",
      "sentence_pinyin": "Yǔyì wǎng jìshù zhǐzài shǐ hùliánwǎng shàng de shùjù jùyǒu jīqì kě lǐjiě de hányì hé guānxì.",
      "sentence_fr": "La technologie du web sémantique vise à donner aux données sur Internet une signification et des relations compréhensibles par les machines.",
      "sentence_en": "Semantic web technology aims to give data on the Internet machine-understandable meaning and relationships.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semantic_web",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "积极心理学研究人类幸福感和心理繁荣的科学基础和促进方法。",
      "sentence_pinyin": "Jījí xīnlǐxué yánjiū rénlèi xìngfúgǎn hé xīnlǐ fánróng de kēxué jīchǔ hé cùjìn fāngfǎ.",
      "sentence_fr": "La psychologie positive étudie les fondements scientifiques du bien-être humain et de l'épanouissement psychologique, ainsi que les méthodes pour les promouvoir.",
      "sentence_en": "Positive psychology studies the scientific foundation of human well-being and psychological flourishing and methods to promote them.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "positive_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "氢燃料电池技术被认为是实现零排放交通运输的关键解决方案之一。",
      "sentence_pinyin": "Qīng ránliào diànchí jìshù bèi rènwéi shì shíxiàn líng páifàng jiāotōng yùnshū de guānjiàn jiějué fāng'àn zhī yī.",
      "sentence_fr": "La technologie des piles à combustible à hydrogène est considérée comme l'une des solutions clés pour atteindre un transport à zéro émission.",
      "sentence_en": "Hydrogen fuel cell technology is considered one of the key solutions for achieving zero-emission transportation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hydrogen_fuel_cells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化资本理论解释了教育成就和社会流动性与家庭文化背景之间的关系。",
      "sentence_pinyin": "Wénhuà zīběn lǐlùn jiěshìle jiàoyù chéngjiù hé shèhuì liúdòngxìng yǔ jiātíng wénhuà bèijǐng zhījiān de guānxì.",
      "sentence_fr": "La théorie du capital culturel explique la relation entre la réussite scolaire, la mobilité sociale et le contexte culturel familial.",
      "sentence_en": "Cultural capital theory explains the relationship between educational achievement, social mobility, and family cultural background.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_capital_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "迁移学习使已在大型数据集上训练的模型能够应用于相关的新任务。",
      "sentence_pinyin": "Qiānyí xuéxí shǐ yǐ zài dàxíng shùjùjí shàng xùnliàn de móxíng nénggòu yìngyòng yú xiāngguān de xīn rènwù.",
      "sentence_fr": "L'apprentissage par transfert permet aux modèles déjà entraînés sur de grands ensembles de données d'être appliqués à de nouvelles tâches connexes.",
      "sentence_en": "Transfer learning enables models already trained on large datasets to be applied to related new tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transfer_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会网络分析研究人际关系的结构模式及其对信息传播的影响。",
      "sentence_pinyin": "Shèhuì wǎngluò fēnxī yánjiū rénjì guānxì de jiégòu móshì jí qí duì xìnxī chuánbō de yǐngxiǎng.",
      "sentence_fr": "L'analyse des réseaux sociaux étudie les modèles structurels des relations interpersonnelles et leur impact sur la diffusion de l'information.",
      "sentence_en": "Social network analysis studies the structural patterns of interpersonal relationships and their impact on information dissemination.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_network_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋可再生能源包括潮汐能、波浪能和海洋温差能等多种形式。",
      "sentence_pinyin": "Hǎiyáng kě zàishēng néngyuán bāokuò cháoxī néng, bōlàng néng hé hǎiyáng wēnchā néng děng duō zhǒng xíngshì.",
      "sentence_fr": "L'énergie renouvelable marine comprend diverses formes telles que l'énergie marémotrice, l'énergie des vagues et l'énergie thermique des océans.",
      "sentence_en": "Marine renewable energy includes various forms such as tidal energy, wave energy, and ocean thermal energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_renewable_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工业生态学将生态系统原理应用于工业系统以减少环境影响和资源消耗。",
      "sentence_pinyin": "Gōngyè shēngtàixué jiāng shēngtài xìtǒng yuánlǐ yìngyòng yú gōngyè xìtǒng yǐ jiǎnshǎo huánjìng yǐngxiǎng hé zīyuán xiāohào.",
      "sentence_fr": "L'écologie industrielle applique les principes des écosystèmes aux systèmes industriels pour réduire l'impact environnemental et la consommation de ressources.",
      "sentence_en": "Industrial ecology applies ecosystem principles to industrial systems to reduce environmental impact and resource consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "industrial_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言类型学通过跨语言比较来揭示人类语言的普遍特征和多样性。",
      "sentence_pinyin": "Yǔyán lèixíngxué tōngguò kuà yǔyán bǐjiào lái jiēshì rénlèi yǔyán de pǔbiàn tèzhēng hé duōyàngxìng.",
      "sentence_fr": "La typologie linguistique révèle les caractéristiques universelles et la diversité des langues humaines à travers des comparaisons interlinguistiques.",
      "sentence_en": "Linguistic typology reveals universal features and diversity of human languages through cross-linguistic comparison.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "linguistic_typology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "敏捷软件开发方法论强调迭代开发和对变化需求的快速响应能力。",
      "sentence_pinyin": "Mǐnjié ruǎnjiàn kāifā fāngfǎlùn qiángdiào diédài kāifā hé duì biànhuà xūqiú de kuàisù xiǎngyìng nénglì.",
      "sentence_fr": "Les méthodologies de développement logiciel agile mettent l'accent sur le développement itératif et la capacité de réponse rapide aux exigences changeantes.",
      "sentence_en": "Agile software development methodologies emphasize iterative development and rapid response capability to changing requirements.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agile_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "比较政治学分析不同国家政治制度和政策选择之间的差异与相似性。",
      "sentence_pinyin": "Bǐjiào zhèngzhìxué fēnxī bùtóng guójiā zhèngzhì zhìdù hé zhèngcè xuǎnzé zhījiān de chāyì yǔ xiāngsìxìng.",
      "sentence_fr": "La politique comparée analyse les différences et les similitudes entre les systèmes politiques et les choix politiques de différents pays.",
      "sentence_en": "Comparative politics analyzes the differences and similarities between political systems and policy choices of different countries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "comparative_politics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "再生医学研究如何利用干细胞和组织工程修复或替换受损器官。",
      "sentence_pinyin": "Zàishēng yīxué yánjiū rúhé lìyòng gànxìbāo hé zǔzhī gōngchéng xiūfù huò tìhuàn shòusǔn qìguān.",
      "sentence_fr": "La médecine régénérative étudie comment utiliser les cellules souches et l'ingénierie tissulaire pour réparer ou remplacer les organes endommagés.",
      "sentence_en": "Regenerative medicine studies how to use stem cells and tissue engineering to repair or replace damaged organs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "regenerative_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识管理系统帮助组织有效地捕获、存储和共享员工的专业知识。",
      "sentence_pinyin": "Zhīshi guǎnlǐ xìtǒng bāngzhù zǔzhī yǒuxiào de bǔhuò, cúnchǔ hé gòngxiǎng yuángōng de zhuānyè zhīshi.",
      "sentence_fr": "Les systèmes de gestion des connaissances aident les organisations à capturer, stocker et partager efficacement l'expertise des employés.",
      "sentence_en": "Knowledge management systems help organizations effectively capture, store, and share employees' professional expertise.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "knowledge_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
