{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "声源定位技术使音频设备能够精确确定声音来源的方向和距离。",
      "sentence_pinyin": "Shēngyuán dìngwèi jìshù shǐ yīnpín shèbèi nénggòu jīngquè quèdìng shēngyīn láiyuán de fāngxiàng hé jùlí.",
      "sentence_fr": "La technologie de localisation sonore permet aux appareils audio de déterminer précisément la direction et la distance de la source sonore.",
      "sentence_en": "Sound source localization technology enables audio devices to precisely determine the direction and distance of sound sources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sound_localization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会心理学研究群体动力学和社会影响对个人思想和行为的作用。",
      "sentence_pinyin": "Shèhuì xīnlǐ xué yánjiū qúntǐ dònglì xué hé shèhuì yǐngxiǎng duì gèrén sīxiǎng hé xíngwéi de zuòyòng.",
      "sentence_fr": "La psychologie sociale étudie la dynamique de groupe et l'influence sociale sur les pensées et les comportements individuels.",
      "sentence_en": "Social psychology studies group dynamics and social influence on individual thoughts and behaviors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿生假肢技术正在开发能够感知触觉并由大脑直接控制的人工肢体。",
      "sentence_pinyin": "Fǎngshēng jiǎzhī jìshù zhèngzài kāifā nénggòu gǎnzhī chùjué bìng yóu dànǎo zhíjiē kòngzhì de réngōng zhītǐ.",
      "sentence_fr": "La technologie des prothèses bioniques développe des membres artificiels capables de percevoir le toucher et contrôlés directement par le cerveau.",
      "sentence_en": "Bionic prosthetics technology is developing artificial limbs that can sense touch and are directly controlled by the brain.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bionic_prosthetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市生态系统服务包括空气净化、温度调节和雨水管理等功能。",
      "sentence_pinyin": "Chéngshì shēngtài xìtǒng fúwù bāokuò kōngqì jìnghuà, wēndù tiáojié hé yǔshuǐ guǎnlǐ děng gōngnéng.",
      "sentence_fr": "Les services écosystémiques urbains comprennent des fonctions telles que la purification de l'air, la régulation thermique et la gestion des eaux pluviales.",
      "sentence_en": "Urban ecosystem services include functions such as air purification, temperature regulation, and stormwater management.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_ecosystem_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语义网技术使计算机能够理解和处理网页内容的含义而非仅仅是文本。",
      "sentence_pinyin": "Yǔyì wǎng jìshù shǐ jìsuànjī nénggòu lǐjiě hé chǔlǐ wǎngyè nèiróng de hányì ér fēi jǐnjǐn shì wénběn.",
      "sentence_fr": "La technologie du web sémantique permet aux ordinateurs de comprendre et de traiter le sens du contenu web plutôt que simplement le texte.",
      "sentence_en": "Semantic web technology enables computers to understand and process the meaning of web content rather than just text.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semantic_web",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "再野化倡议旨在让大型食肉动物回归它们曾经生活的生态系统。",
      "sentence_pinyin": "Zài yěhuà chàngyì zhǐzài ràng dàxíng shíròu dòngwù huíguī tāmen céngjīng shēnghuó de shēngtài xìtǒng.",
      "sentence_fr": "Les initiatives de réensauvagement visent à ramener les grands carnivores dans les écosystèmes où ils vivaient autrefois.",
      "sentence_en": "Rewilding initiatives aim to bring large carnivores back to ecosystems where they once lived.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rewilding_carnivores",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人因工程学设计考虑人体能力和局限来优化产品和系统的可用性。",
      "sentence_pinyin": "Rényīn gōngchéng xué shèjì kǎolǜ réntǐ nénglì hé júxiàn lái yōuhuà chǎnpǐn hé xìtǒng de kěyòng xìng.",
      "sentence_fr": "La conception ergonomique prend en compte les capacités et les limites du corps humain pour optimiser l'utilisabilité des produits et des systèmes.",
      "sentence_en": "Human factors engineering design considers human capabilities and limitations to optimize product and system usability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "human_factors_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球供应链中断事件凸显了建立弹性和多元化供应网络的重要性。",
      "sentence_pinyin": "Quánqiú gōngyìng liàn zhōngduàn shìjiàn tūxiǎn le jiànlì tánxìng hé duōyuán huà gōngyìng wǎngluò de zhòngyào xìng.",
      "sentence_fr": "Les perturbations de la chaîne d'approvisionnement mondiale soulignent l'importance de construire des réseaux d'approvisionnement résilients et diversifiés.",
      "sentence_en": "Global supply chain disruption events highlight the importance of building resilient and diversified supply networks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supply_chain_resilience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "荧光显微镜技术使科学家能够观察活细胞内部的动态过程。",
      "sentence_pinyin": "Yíngguāng xiǎnwēijìng jìshù shǐ kēxué jiā nénggòu guānchá huó xìbāo nèibù de dòngtài guòchéng.",
      "sentence_fr": "La technologie de microscopie à fluorescence permet aux scientifiques d'observer les processus dynamiques à l'intérieur des cellules vivantes.",
      "sentence_en": "Fluorescence microscopy technology enables scientists to observe dynamic processes inside living cells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fluorescence_microscopy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知科学整合心理学、语言学和人工智能来研究心智的本质。",
      "sentence_pinyin": "Rènzhī kēxué zhěnghé xīnlǐ xué, yǔyán xué hé réngōng zhìnéng lái yánjiū xīnzhì de běnzhì.",
      "sentence_fr": "La science cognitive intègre la psychologie, la linguistique et l'intelligence artificielle pour étudier la nature de l'esprit.",
      "sentence_en": "Cognitive science integrates psychology, linguistics, and artificial intelligence to study the nature of the mind.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绿色氢能通过可再生能源电解水生产，被视为清洁能源的未来。",
      "sentence_pinyin": "Lǜsè qīng néng tōngguò kě zàishēng néngyuán diànjiě shuǐ shēngchǎn, bèi shì wéi qīngjié néngyuán de wèilái.",
      "sentence_fr": "L'hydrogène vert, produit par électrolyse de l'eau à partir d'énergies renouvelables, est considéré comme l'avenir de l'énergie propre.",
      "sentence_en": "Green hydrogen, produced through water electrolysis using renewable energy, is seen as the future of clean energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_hydrogen",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纪录片伦理要求制作者平衡叙事需求与对拍摄对象的尊重和真实呈现。",
      "sentence_pinyin": "Jìlù piàn lúnlǐ yāoqiú zhìzuò zhě pínghéng xùshì xūqiú yǔ duì pāishè duìxiàng de zūnzhòng hé zhēnshí chéngxiàn.",
      "sentence_fr": "L'éthique documentaire exige que les réalisateurs équilibrent les besoins narratifs avec le respect et la représentation authentique des sujets filmés.",
      "sentence_en": "Documentary ethics requires filmmakers to balance narrative needs with respect for and authentic representation of subjects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "documentary_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合成数据生成技术为保护隐私的机器学习训练提供了可行的解决方案。",
      "sentence_pinyin": "Héchéng shùjù shēngchéng jìshù wèi bǎohù yǐnsī de jīqì xuéxí xùnliàn tígōng le kěxíng de jiějué fāng'àn.",
      "sentence_fr": "La technologie de génération de données synthétiques offre une solution viable pour l'entraînement de l'apprentissage automatique préservant la vie privée.",
      "sentence_en": "Synthetic data generation technology provides a viable solution for privacy-preserving machine learning training.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "synthetic_data",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "食品安全法规确保从农场到餐桌的整个食品供应链符合卫生标准。",
      "sentence_pinyin": "Shípǐn ānquán fǎguī quèbǎo cóng nóngchǎng dào cānzhuō de zhěnggè shípǐn gōngyìng liàn fúhé wèishēng biāozhǔn.",
      "sentence_fr": "Les réglementations sur la sécurité alimentaire garantissent que l'ensemble de la chaîne d'approvisionnement alimentaire, de la ferme à la table, respecte les normes sanitaires.",
      "sentence_en": "Food safety regulations ensure the entire food supply chain from farm to table meets hygiene standards.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_safety_regulations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经退行性疾病研究正在探索阿尔茨海默症和帕金森病的共同病理机制。",
      "sentence_pinyin": "Shénjīng tuìxíng xìng jíbìng yánjiū zhèngzài tànsuǒ Ā'ěrcíhǎimò zhèng hé Pàjīnsēn bìng de gòngtóng bìnglǐ jīzhì.",
      "sentence_fr": "La recherche sur les maladies neurodégénératives explore les mécanismes pathologiques communs de la maladie d'Alzheimer et de Parkinson.",
      "sentence_en": "Neurodegenerative disease research is exploring common pathological mechanisms of Alzheimer's and Parkinson's diseases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neurodegenerative_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学术出版开放获取运动倡导免费向公众提供科研成果。",
      "sentence_pinyin": "Xuéshù chūbǎn kāifàng huòqǔ yùndòng chàngdǎo miǎnfèi xiàng gōngzhòng tígōng kēyán chéngguǒ.",
      "sentence_fr": "Le mouvement d'accès ouvert dans l'édition académique préconise de fournir gratuitement les résultats de la recherche au public.",
      "sentence_en": "The open access movement in academic publishing advocates providing research results freely to the public.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "open_access_publishing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳能电池板回收利用正成为光伏产业可持续发展的重要议题。",
      "sentence_pinyin": "Tàiyáng néng diànchí bǎn huíshōu lìyòng zhèng chéngwéi guāngfú chǎnyè kěchíxù fāzhǎn de zhòngyào yìtí.",
      "sentence_fr": "Le recyclage des panneaux solaires devient un enjeu important pour le développement durable de l'industrie photovoltaïque.",
      "sentence_en": "Solar panel recycling is becoming an important issue for sustainable development of the photovoltaic industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_panel_recycling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑数据分析使用数学方法来发现复杂数据集中的隐藏结构。",
      "sentence_pinyin": "Tuòpū shùjù fēnxī shǐyòng shùxué fāngfǎ lái fāxiàn fùzá shùjù jí zhōng de yǐncáng jiégòu.",
      "sentence_fr": "L'analyse topologique des données utilise des méthodes mathématiques pour découvrir les structures cachées dans les ensembles de données complexes.",
      "sentence_en": "Topological data analysis uses mathematical methods to discover hidden structures in complex datasets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "topological_data_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "教育公平研究关注社会经济背景如何影响学生的学业成就和机会。",
      "sentence_pinyin": "Jiàoyù gōngpíng yánjiū guānzhù shèhuì jīngjì bèijǐng rúhé yǐngxiǎng xuéshēng de xuéyè chéngjiù hé jīhuì.",
      "sentence_fr": "La recherche sur l'équité éducative se concentre sur la façon dont le contexte socio-économique affecte les résultats scolaires et les opportunités des étudiants.",
      "sentence_en": "Educational equity research focuses on how socioeconomic background affects student academic achievement and opportunities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "educational_equity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "RNA疗法正在开辟通过调节基因表达来治疗疾病的新途径。",
      "sentence_pinyin": "RNA liáofǎ zhèngzài kāipì tōngguò tiáojié jīyīn biǎodá lái zhìliáo jíbìng de xīn tújìng.",
      "sentence_fr": "Les thérapies à ARN ouvrent de nouvelles voies pour traiter les maladies en régulant l'expression génétique.",
      "sentence_en": "RNA therapies are opening new avenues for treating diseases by regulating gene expression.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rna_therapeutics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
