{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "群体智能算法模仿蚁群和蜂群的集体行为来解决复杂的优化问题。",
      "sentence_pinyin": "Qúntǐ zhìnéng suànfǎ mófǎng yǐqún hé fēngqún de jítǐ xíngwéi lái jiějué fùzá de yōuhuà wèntí.",
      "sentence_fr": "Les algorithmes d'intelligence en essaim imitent le comportement collectif des colonies de fourmis et d'abeilles pour résoudre des problèmes d'optimisation complexes.",
      "sentence_en": "Swarm intelligence algorithms mimic the collective behavior of ant and bee colonies to solve complex optimization problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "swarm_intelligence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学外交利用国际科研合作来促进国家间的政治关系和相互理解。",
      "sentence_pinyin": "Kēxué wàijiāo lìyòng guójì kēyán hézuò lái cùjìn guójiā jiān de zhèngzhì guānxì hé xiānghù lǐjiě.",
      "sentence_fr": "La diplomatie scientifique utilise la coopération internationale en recherche pour promouvoir les relations politiques et la compréhension mutuelle entre les nations.",
      "sentence_en": "Science diplomacy uses international research collaboration to promote political relations and mutual understanding between nations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "science_diplomacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "细胞农业技术通过培养动物细胞生产肉类，无需屠宰动物。",
      "sentence_pinyin": "Xìbāo nóngyè jìshù tōngguò péiyǎng dòngwù xìbāo shēngchǎn ròulèi, wúxū túzǎi dòngwù.",
      "sentence_fr": "La technologie de l'agriculture cellulaire produit de la viande en cultivant des cellules animales, sans avoir besoin d'abattre d'animaux.",
      "sentence_en": "Cellular agriculture technology produces meat by cultivating animal cells without the need to slaughter animals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cellular_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知负荷理论指导教学设计者创建不超出学习者工作记忆容量的教材。",
      "sentence_pinyin": "Rènzhī fùhè lǐlùn zhǐdǎo jiàoxué shèjì zhě chuàngjiàn bù chāochū xuéxí zhě gōngzuò jìyì róngliàng de jiàocái.",
      "sentence_fr": "La théorie de la charge cognitive guide les concepteurs pédagogiques pour créer des supports d'apprentissage qui ne dépassent pas la capacité de la mémoire de travail des apprenants.",
      "sentence_en": "Cognitive load theory guides instructional designers in creating materials that don't exceed learners' working memory capacity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_load_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智慧城市基础设施整合传感器网络和数据分析来优化公共服务的提供。",
      "sentence_pinyin": "Zhìhuì chéngshì jīchǔ shèshī zhěnghé chuángǎnqì wǎngluò hé shùjù fēnxī lái yōuhuà gōnggòng fúwù de tígōng.",
      "sentence_fr": "L'infrastructure des villes intelligentes intègre des réseaux de capteurs et l'analyse de données pour optimiser la fourniture de services publics.",
      "sentence_en": "Smart city infrastructure integrates sensor networks and data analysis to optimize the delivery of public services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_city_infrastructure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声景生态学研究自然声音环境对野生动物行为和生态系统健康的影响。",
      "sentence_pinyin": "Shēngjǐng shēngtài xué yánjiū zìrán shēngyīn huánjìng duì yěshēng dòngwù xíngwéi hé shēngtài xìtǒng jiànkāng de yǐngxiǎng.",
      "sentence_fr": "L'écologie du paysage sonore étudie l'impact de l'environnement sonore naturel sur le comportement de la faune et la santé des écosystèmes.",
      "sentence_en": "Soundscape ecology studies the impact of natural sound environments on wildlife behavior and ecosystem health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soundscape_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基因驱动技术引发了关于人类改造野生种群的伦理边界的激烈讨论。",
      "sentence_pinyin": "Jīyīn qūdòng jìshù yǐnfā le guānyú rénlèi gǎizào yěshēng zhǒngqún de lúnlǐ biānjiè de jīliè tǎolùn.",
      "sentence_fr": "La technologie du forçage génétique a suscité un débat intense sur les limites éthiques de la modification des populations sauvages par l'homme.",
      "sentence_en": "Gene drive technology has sparked intense discussion about the ethical boundaries of human modification of wild populations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gene_drive",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "转型正义机制帮助社会在经历大规模人权侵害后实现和解与问责。",
      "sentence_pinyin": "Zhuǎnxíng zhèngyì jīzhì bāngzhù shèhuì zài jīnglì dà guīmó rénquán qīnhài hòu shíxiàn héjiě yǔ wènzé.",
      "sentence_fr": "Les mécanismes de justice transitionnelle aident les sociétés à parvenir à la réconciliation et à la responsabilisation après des violations massives des droits de l'homme.",
      "sentence_en": "Transitional justice mechanisms help societies achieve reconciliation and accountability after large-scale human rights violations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transitional_justice",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子传感器技术的发展将大幅提升地质勘探和医学成像的精度。",
      "sentence_pinyin": "Liàngzǐ chuángǎnqì jìshù de fāzhǎn jiāng dàfú tíshēng dìzhì kāntàn hé yīxué chéngxiàng de jīngdù.",
      "sentence_fr": "Le développement de la technologie des capteurs quantiques améliorera considérablement la précision de l'exploration géologique et de l'imagerie médicale.",
      "sentence_en": "The development of quantum sensor technology will significantly improve the precision of geological exploration and medical imaging.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_sensors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公民新闻的兴起改变了传统媒体对新闻生产和传播的垄断地位。",
      "sentence_pinyin": "Gōngmín xīnwén de xīngqǐ gǎibiàn le chuántǒng méitǐ duì xīnwén shēngchǎn hé chuánbō de lǒngduàn dìwèi.",
      "sentence_fr": "L'essor du journalisme citoyen a modifié le monopole des médias traditionnels sur la production et la diffusion de l'information.",
      "sentence_en": "The rise of citizen journalism has changed traditional media's monopoly on news production and distribution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "citizen_journalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物降解塑料的研发旨在减少传统石油基塑料对环境的长期污染。",
      "sentence_pinyin": "Shēngwù jiàngjié sùliào de yánfā zhǐzài jiǎnshǎo chuántǒng shíyóu jī sùliào duì huánjìng de chángqī wūrǎn.",
      "sentence_fr": "Le développement des plastiques biodégradables vise à réduire la pollution environnementale à long terme causée par les plastiques traditionnels à base de pétrole.",
      "sentence_en": "The development of biodegradable plastics aims to reduce the long-term environmental pollution caused by traditional petroleum-based plastics.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biodegradable_plastics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "发展心理学研究人类从婴儿期到老年期各个阶段的认知和情感发展。",
      "sentence_pinyin": "Fāzhǎn xīnlǐ xué yánjiū rénlèi cóng yīng'ér qī dào lǎonián qī gège jiēduàn de rènzhī hé qínggǎn fāzhǎn.",
      "sentence_fr": "La psychologie du développement étudie le développement cognitif et émotionnel de l'être humain de la petite enfance à la vieillesse.",
      "sentence_en": "Developmental psychology studies human cognitive and emotional development from infancy through old age.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "developmental_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无服务器计算架构允许开发人员专注于代码编写而无需管理底层服务器。",
      "sentence_pinyin": "Wú fúwùqì jìsuàn jiàgòu yǔnxǔ kāifā rényuán zhuānzhù yú dàimǎ biānxiě ér wúxū guǎnlǐ dǐcéng fúwùqì.",
      "sentence_fr": "L'architecture de calcul sans serveur permet aux développeurs de se concentrer sur l'écriture de code sans avoir à gérer les serveurs sous-jacents.",
      "sentence_en": "Serverless computing architecture allows developers to focus on writing code without needing to manage underlying servers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "serverless_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "艺术治疗利用创造性表达帮助个人处理心理创伤和情感困扰。",
      "sentence_pinyin": "Yìshù zhìliáo lìyòng chuàngzàoxìng biǎodá bāngzhù gèrén chǔlǐ xīnlǐ chuāngshāng hé qínggǎn kùnrǎo.",
      "sentence_fr": "L'art-thérapie utilise l'expression créative pour aider les individus à traiter les traumatismes psychologiques et les troubles émotionnels.",
      "sentence_en": "Art therapy uses creative expression to help individuals process psychological trauma and emotional distress.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "art_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "北极航线的开通对全球航运格局和地缘政治产生深远影响。",
      "sentence_pinyin": "Běijí hángxiàn de kāitōng duì quánqiú hángyùn géjú hé dìyuán zhèngzhì chǎnshēng shēnyuǎn yǐngxiǎng.",
      "sentence_fr": "L'ouverture des routes maritimes arctiques a un impact profond sur le paysage du transport maritime mondial et la géopolitique.",
      "sentence_en": "The opening of Arctic shipping routes has profound impacts on global shipping patterns and geopolitics.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "arctic_shipping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "再生医学研究如何利用干细胞和组织工程技术修复受损的器官和组织。",
      "sentence_pinyin": "Zàishēng yīxué yánjiū rúhé lìyòng gànxìbāo hé zǔzhī gōngchéng jìshù xiūfù shòusǔn de qìguān hé zǔzhī.",
      "sentence_fr": "La médecine régénérative étudie comment utiliser les cellules souches et l'ingénierie tissulaire pour réparer les organes et tissus endommagés.",
      "sentence_en": "Regenerative medicine studies how to use stem cells and tissue engineering to repair damaged organs and tissues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "regenerative_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会创新实验室为解决复杂社会问题提供跨部门协作的创新平台。",
      "sentence_pinyin": "Shèhuì chuàngxīn shíyàn shì wèi jiějué fùzá shèhuì wèntí tígōng kuà bùmén xiézuò de chuàngxīn píngtái.",
      "sentence_fr": "Les laboratoires d'innovation sociale fournissent des plateformes innovantes de collaboration intersectorielle pour résoudre des problèmes sociaux complexes.",
      "sentence_en": "Social innovation labs provide cross-sector collaborative platforms for solving complex social problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_innovation_labs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光遗传学技术使神经科学家能够用光精确控制特定神经元的活动。",
      "sentence_pinyin": "Guāng yíchuán xué jìshù shǐ shénjīng kēxué jiā nénggòu yòng guāng jīngquè kòngzhì tèdìng shénjīng yuán de huódòng.",
      "sentence_fr": "La technologie d'optogénétique permet aux neuroscientifiques de contrôler précisément l'activité de neurones spécifiques à l'aide de la lumière.",
      "sentence_en": "Optogenetics technology enables neuroscientists to precisely control the activity of specific neurons using light.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optogenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循证政策制定将科学研究成果系统地应用于公共政策的设计和评估。",
      "sentence_pinyin": "Xúnzhèng zhèngcè zhìdìng jiāng kēxué yánjiū chéngguǒ xìtǒng de yìngyòng yú gōnggòng zhèngcè de shèjì hé pínggū.",
      "sentence_fr": "L'élaboration de politiques fondées sur des données probantes applique systématiquement les résultats de la recherche scientifique à la conception et à l'évaluation des politiques publiques.",
      "sentence_en": "Evidence-based policymaking systematically applies scientific research findings to the design and evaluation of public policies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evidence_based_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "氢燃料电池技术为重型运输行业提供了零排放的替代动力解决方案。",
      "sentence_pinyin": "Qīng ránliào diànchí jìshù wèi zhòngxíng yùnshū hángyè tígōng le líng páifàng de tìdài dònglì jiějué fāng'àn.",
      "sentence_fr": "La technologie des piles à combustible à hydrogène offre des solutions de propulsion alternatives à zéro émission pour l'industrie du transport lourd.",
      "sentence_en": "Hydrogen fuel cell technology provides zero-emission alternative power solutions for the heavy transport industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hydrogen_fuel_cells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
