{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能电网系统可以平衡供电和用电需求,提高能源利用效率。",
      "sentence_pinyin": "Zhège zhìnéng diànwǎng xìtǒng kěyǐ pínghéng gōngdiàn hé yòngdiàn xūqiú, tígāo néngyuán lìyòng xiàolǜ.",
      "sentence_fr": "Ce système de réseau électrique intelligent peut équilibrer l'offre et la demande d'électricité, améliorant l'efficacité énergétique.",
      "sentence_en": "This smart grid system can balance power supply and demand, improving energy utilization efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_grids",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "箫的外形细长优美,由竹子制成,有六个音孔。",
      "sentence_pinyin": "Xiāo de wàixíng xìcháng yōuměi, yóu zhúzi zhìchéng, yǒu liù gè yīnkǒng.",
      "sentence_fr": "Le xiao a une forme élancée et élégante, fait de bambou, avec six trous de son.",
      "sentence_en": "The xiao has a slender and elegant appearance, made of bamboo, with six sound holes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiao_construction",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的立体绿化项目在高架桥和建筑外墙上种植了大量攀援植物。",
      "sentence_pinyin": "Zhège chéngshì de lìtǐ lǜhuà xiàngmù zài gāojiàqiáo hé jiànzhù wàiqiáng shàng zhòngzhíle dàliàng pānyuán zhíwù.",
      "sentence_fr": "Le projet de végétalisation en trois dimensions de cette ville a planté de nombreuses plantes grimpantes sur les viaducs et les murs extérieurs des bâtiments.",
      "sentence_en": "This city's three-dimensional greening project has planted many climbing plants on overpasses and building exterior walls.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vertical_greening",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绞胎瓷利用不同颜色的瓷泥绞合成型,形成独特的纹理图案。",
      "sentence_pinyin": "Jiǎotāi cí lìyòng bùtóng yánsè de cíní jiǎohé chéngxíng, xíngchéng dútè de wénlǐ tú'àn.",
      "sentence_fr": "La porcelaine à pâte torsadée utilise des argiles de différentes couleurs torsadées ensemble pour former des motifs de texture uniques.",
      "sentence_en": "Marbled porcelain uses different colored clay twisted together to form unique texture patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "marbled_porcelain",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能门锁可以记录每次开锁的时间和方式,方便追踪出入情况。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng ménsuǒ kěyǐ jìlù měi cì kāisuǒ de shíjiān hé fāngshì, fāngbiàn zhuīzōng chūrù qíngkuàng.",
      "sentence_fr": "Cette serrure intelligente peut enregistrer l'heure et la méthode de chaque déverrouillage, facilitant le suivi des entrées et sorties.",
      "sentence_en": "This smart lock can record the time and method of each unlocking, facilitating tracking of entry and exit situations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_locks",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个邻里互助平台让社区居民可以互相帮助和交换服务。",
      "sentence_pinyin": "Zhège línlǐ hùzhù píngtái ràng shèqū jūmín kěyǐ hùxiāng bāngzhù hé jiāohuàn fúwù.",
      "sentence_fr": "Cette plateforme d'entraide de quartier permet aux résidents de la communauté de s'entraider et d'échanger des services.",
      "sentence_en": "This neighborhood mutual aid platform allows community residents to help each other and exchange services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "neighborhood_platforms",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笛子分为梆笛和曲笛两大类,音色和风格各有不同。",
      "sentence_pinyin": "Dízǐ fēnwéi bāngdí hé qǔdí liǎng dà lèi, yīnsè hé fēnggé gè yǒu bùtóng.",
      "sentence_fr": "Le dizi se divise en deux grandes catégories : le bangdi et le qudi, chacun avec des timbres et styles différents.",
      "sentence_en": "The dizi is divided into two main categories: bangdi and qudi, each with different tones and styles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dizi_types",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能供应链系统能够实时追踪货物位置并预测到货时间。",
      "sentence_pinyin": "Zhège zhìnéng gōngyìngliàn xìtǒng nénggòu shíshí zhuīzōng huòwù wèizhì bìng yùcè dàohuò shíjiān.",
      "sentence_fr": "Ce système de chaîne d'approvisionnement intelligent peut suivre la position des marchandises en temps réel et prédire l'heure de livraison.",
      "sentence_en": "This smart supply chain system can track cargo location in real-time and predict delivery time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_supply_chains",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "苏绣以针法细腻、绣工精美著称,是四大名绣之首。",
      "sentence_pinyin": "Sūxiù yǐ zhēnfǎ xìnì, xiùgōng jīngměi zhùchēng, shì sì dà míngxiù zhī shǒu.",
      "sentence_fr": "La broderie Su est réputée pour ses points délicats et son travail exquis, étant la première des quatre broderies célèbres.",
      "sentence_en": "Su embroidery is renowned for its delicate stitches and exquisite craftsmanship, being the foremost of the four famous embroideries.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "su_embroidery",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能窗户可以根据阳光强度自动调节透光度。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuānghù kěyǐ gēnjù yángguāng qiángdù zìdòng tiáojié tòuguāngdù.",
      "sentence_fr": "Cette fenêtre intelligente peut ajuster automatiquement la transparence selon l'intensité du soleil.",
      "sentence_en": "This smart window can automatically adjust light transmission based on sunlight intensity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_windows",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个废弃矿山修复项目将矿区改造成了生态公园和休闲景区。",
      "sentence_pinyin": "Zhège fèiqì kuàngshān xiūfù xiàngmù jiāng kuàngqū gǎizào chéngle shēngtài gōngyuán hé xiūxián jǐngqū.",
      "sentence_fr": "Ce projet de restauration de mine abandonnée a transformé la zone minière en parc écologique et zone de loisirs.",
      "sentence_en": "This abandoned mine restoration project transformed the mining area into an ecological park and leisure scenic area.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mine_restoration",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐的音域宽广,能够演奏出悲壮、欢快等多种情绪。",
      "sentence_pinyin": "Suǒnà de yīnyù kuānguǎng, nénggòu yǎnzòu chū bēizhuàng, huānkuài děng duō zhǒng qíngxù.",
      "sentence_fr": "Le suona a une large tessiture, capable de jouer diverses émotions comme le tragique et le joyeux.",
      "sentence_en": "The suona has a wide range, capable of playing various emotions such as tragic and joyful.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_expression",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线拼车平台帮助上班族找到同路线的乘客分摊油费。",
      "sentence_pinyin": "Zhège zàixiàn pīnchē píngtái bāngzhù shàngbānzú zhǎodào tóng lùxiàn de chéngkè fēntān yóufèi.",
      "sentence_fr": "Cette plateforme de covoiturage en ligne aide les travailleurs à trouver des passagers sur le même itinéraire pour partager les frais d'essence.",
      "sentence_en": "This online carpooling platform helps commuters find passengers on the same route to share fuel costs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "carpooling_platforms",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "粤绣以色彩艳丽、构图饱满为特点,是岭南地区的传统工艺。",
      "sentence_pinyin": "Yuèxiù yǐ sècǎi yànlì, gòutú bǎomǎn wéi tèdiǎn, shì Lǐngnán dìqū de chuántǒng gōngyì.",
      "sentence_fr": "La broderie cantonaise se caractérise par ses couleurs vives et ses compositions pleines, c'est un artisanat traditionnel de la région de Lingnan.",
      "sentence_en": "Cantonese embroidery is characterized by its bright colors and full compositions, being a traditional craft of the Lingnan region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cantonese_embroidery",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能风扇可以感应室内温度并自动调节风速和摆头角度。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng fēngshàn kěyǐ gǎnyìng shìnèi wēndù bìng zìdòng tiáojié fēngsù hé bǎitóu jiǎodù.",
      "sentence_fr": "Ce ventilateur intelligent peut détecter la température intérieure et ajuster automatiquement la vitesse du vent et l'angle d'oscillation.",
      "sentence_en": "This smart fan can sense indoor temperature and automatically adjust wind speed and oscillation angle.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fans",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个青年志愿者协会组织大学生参与社区服务和公益活动。",
      "sentence_pinyin": "Zhège qīngnián zhìyuànzhě xiéhuì zǔzhī dàxuéshēng cānyù shèqū fúwù hé gōngyì huódòng.",
      "sentence_fr": "Cette association de jeunes bénévoles organise la participation des étudiants universitaires aux services communautaires et aux activités caritatives.",
      "sentence_en": "This youth volunteer association organizes university students to participate in community services and charitable activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "youth_volunteering",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝曲《高山流水》表达了知音相遇的喜悦之情。",
      "sentence_pinyin": "Gǔzhēng qǔ 'Gāoshān liúshuǐ' biǎodále zhīyīn xiāngyù de xǐyuè zhī qíng.",
      "sentence_fr": "La pièce de guzheng 'Hautes montagnes et eaux courantes' exprime la joie de rencontrer un ami intime.",
      "sentence_en": "The guzheng piece 'High Mountains and Flowing Water' expresses the joy of meeting a kindred spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_repertoire",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能配电系统可以自动检测和隔离故障线路,保障供电安全。",
      "sentence_pinyin": "Zhège zhìnéng pèidiàn xìtǒng kěyǐ zìdòng jiǎncè hé gélí gùzhàng xiànlù, bǎozhàng gōngdiàn ānquán.",
      "sentence_fr": "Ce système de distribution électrique intelligent peut détecter et isoler automatiquement les lignes défectueuses, garantissant la sécurité de l'approvisionnement.",
      "sentence_en": "This smart power distribution system can automatically detect and isolate faulty lines, ensuring power supply safety.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_power_distribution",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "湘绣以写实风格著称,尤其擅长绣制动物和人物肖像。",
      "sentence_pinyin": "Xiāngxiù yǐ xiěshí fēnggé zhùchēng, yóuqí shàncháng xiùzhì dòngwù hé rénwù xiàoxiàng.",
      "sentence_fr": "La broderie Xiang est réputée pour son style réaliste, excellant particulièrement dans la broderie de portraits d'animaux et de personnes.",
      "sentence_en": "Xiang embroidery is renowned for its realistic style, especially excelling in embroidering animal and human portraits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiang_embroidery",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能婴儿监护器可以监测婴儿的呼吸和睡眠状态并及时提醒家长。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yīng'ér jiānhùqì kěyǐ jiāncè yīng'ér de hūxī hé shuìmián zhuàngtài bìng jíshí tíxǐng jiāzhǎng.",
      "sentence_fr": "Ce moniteur intelligent pour bébé peut surveiller la respiration et l'état de sommeil du bébé et alerter les parents à temps.",
      "sentence_en": "This smart baby monitor can monitor the baby's breathing and sleep status and alert parents in a timely manner.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_baby_monitors",
      "created_at": "2025-11-20T22:00:00.000Z",
      "updated_at": "2025-11-20T22:00:00.000Z"
    }
  ]
}
