{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "形态学分析是自然语言处理中识别词语内部结构的基础技术。",
      "sentence_pinyin": "Xíngtài xué fēnxī shì zìrán yǔyán chǔlǐ zhōng shìbié cíyǔ nèibù jiégòu de jīchǔ jìshù.",
      "sentence_fr": "L'analyse morphologique est une technique fondamentale du traitement du langage naturel pour identifier la structure interne des mots.",
      "sentence_en": "Morphological analysis is a foundational technique in natural language processing for identifying internal word structure.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "morphological_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳足迹计算工具帮助个人和企业量化其温室气体排放。",
      "sentence_pinyin": "Tàn zújì jìsuàn gōngjù bāngzhù gèrén hé qǐyè liànghuà qí wēnshì qìtǐ páifàng.",
      "sentence_fr": "Les outils de calcul de l'empreinte carbone aident les individus et les entreprises à quantifier leurs émissions de gaz à effet de serre.",
      "sentence_en": "Carbon footprint calculation tools help individuals and businesses quantify their greenhouse gas emissions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_footprint_tools",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知失调理论解释了人们如何应对态度与行为之间的不一致。",
      "sentence_pinyin": "Rènzhī shītiáo lǐlùn jiěshì le rénmen rúhé yìngduì tàidù yǔ xíngwéi zhījiān de bù yīzhì.",
      "sentence_fr": "La théorie de la dissonance cognitive explique comment les gens gèrent les incohérences entre leurs attitudes et leurs comportements.",
      "sentence_en": "Cognitive dissonance theory explains how people cope with inconsistencies between attitudes and behaviors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_dissonance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "有机半导体材料为柔性和可印刷电子设备开辟了新的可能性。",
      "sentence_pinyin": "Yǒujī bàndǎotǐ cáiliào wèi róuxìng hé kě yìnshuā diànzǐ shèbèi kāipì le xīn de kěnéng xìng.",
      "sentence_fr": "Les matériaux semi-conducteurs organiques ouvrent de nouvelles possibilités pour les dispositifs électroniques flexibles et imprimables.",
      "sentence_en": "Organic semiconductor materials open new possibilities for flexible and printable electronic devices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organic_semiconductors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人口老龄化趋势正在深刻改变劳动力市场结构和退休政策。",
      "sentence_pinyin": "Rénkǒu lǎolíng huà qūshì zhèngzài shēnkè gǎibiàn láodònglì shìchǎng jiégòu hé tuìxiū zhèngcè.",
      "sentence_fr": "La tendance au vieillissement de la population modifie profondément la structure du marché du travail et les politiques de retraite.",
      "sentence_en": "Population aging trends are profoundly changing labor market structure and retirement policies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "population_aging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海底光缆承载了全球绝大多数的国际互联网通信流量。",
      "sentence_pinyin": "Hǎidǐ guāng lǎn chéngzài le quánqiú jué dàduōshù de guójì hùlián wǎng tōngxìn liúliàng.",
      "sentence_fr": "Les câbles sous-marins à fibres optiques transportent la grande majorité du trafic de communication Internet international mondial.",
      "sentence_en": "Submarine fiber optic cables carry the vast majority of global international internet communication traffic.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "submarine_cables",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "实验经济学通过控制实验来测试经济理论假设和人类决策行为。",
      "sentence_pinyin": "Shíyàn jīngjì xué tōngguò kòngzhì shíyàn lái cèshì jīngjì lǐlùn jiǎshè hé rénlèi juécè xíngwéi.",
      "sentence_fr": "L'économie expérimentale teste les hypothèses des théories économiques et le comportement décisionnel humain à travers des expériences contrôlées.",
      "sentence_en": "Experimental economics tests economic theory hypotheses and human decision-making behavior through controlled experiments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "experimental_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "噬菌体疗法作为对抗抗生素耐药细菌的替代方案重新引起关注。",
      "sentence_pinyin": "Shìjūntǐ liáofǎ zuòwéi duìkàng kàngshēngsù nàiyào xìjūn de tìdài fāng'àn chóngxīn yǐnqǐ guānzhù.",
      "sentence_fr": "La thérapie par phages suscite un regain d'intérêt comme alternative pour combattre les bactéries résistantes aux antibiotiques.",
      "sentence_en": "Phage therapy is attracting renewed attention as an alternative for combating antibiotic-resistant bacteria.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "phage_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "用户体验研究通过观察和访谈来理解用户与产品交互的方式。",
      "sentence_pinyin": "Yònghù tǐyàn yánjiū tōngguò guānchá hé fǎngtán lái lǐjiě yònghù yǔ chǎnpǐn jiāohù de fāngshì.",
      "sentence_fr": "La recherche sur l'expérience utilisateur comprend les interactions des utilisateurs avec les produits par l'observation et les entretiens.",
      "sentence_en": "User experience research understands how users interact with products through observation and interviews.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ux_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "河流生态修复项目致力于恢复受损水道的自然功能和生物多样性。",
      "sentence_pinyin": "Héliú shēngtài xiūfù xiàngmù zhìlì yú huīfù shòusǔn shuǐdào de zìrán gōngnéng hé shēngwù duōyàng xìng.",
      "sentence_fr": "Les projets de restauration écologique des cours d'eau s'efforcent de restaurer les fonctions naturelles et la biodiversité des voies d'eau endommagées.",
      "sentence_en": "River ecological restoration projects strive to restore natural functions and biodiversity of damaged waterways.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "river_restoration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "本体论工程为人工智能系统创建结构化的知识表示框架。",
      "sentence_pinyin": "Běntǐ lùn gōngchéng wèi réngōng zhìnéng xìtǒng chuàngjiàn jiégòu huà de zhīshi biǎoshì kuàngjià.",
      "sentence_fr": "L'ingénierie ontologique crée des cadres de représentation des connaissances structurées pour les systèmes d'intelligence artificielle.",
      "sentence_en": "Ontology engineering creates structured knowledge representation frameworks for artificial intelligence systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ontology_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "压力管理培训帮助员工发展应对工作压力的心理策略和技能。",
      "sentence_pinyin": "Yālì guǎnlǐ péixùn bāngzhù yuángōng fāzhǎn yìngduì gōngzuò yālì de xīnlǐ cèlüè hé jìnéng.",
      "sentence_fr": "La formation en gestion du stress aide les employés à développer des stratégies et des compétences psychologiques pour faire face au stress professionnel.",
      "sentence_en": "Stress management training helps employees develop psychological strategies and skills for coping with work stress.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stress_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太赫兹成像技术在安全检查和医学诊断领域有广阔的应用前景。",
      "sentence_pinyin": "Tài hèzī chéngxiàng jìshù zài ānquán jiǎnchá hé yīxué zhěnduàn lǐngyù yǒu guǎngkuò de yìngyòng qiánjǐng.",
      "sentence_fr": "La technologie d'imagerie térahertz a de larges perspectives d'application dans les domaines du contrôle de sécurité et du diagnostic médical.",
      "sentence_en": "Terahertz imaging technology has broad application prospects in security inspection and medical diagnosis fields.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "terahertz_imaging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球化批评者认为国际贸易加剧了社会不平等和环境退化。",
      "sentence_pinyin": "Quánqiú huà pīpíng zhě rènwéi guójì màoyì jiājù le shèhuì bù píngděng hé huánjìng tuìhuà.",
      "sentence_fr": "Les critiques de la mondialisation estiment que le commerce international aggrave les inégalités sociales et la dégradation de l'environnement.",
      "sentence_en": "Globalization critics argue that international trade exacerbates social inequality and environmental degradation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "globalization_critique",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "细胞自噬机制清除受损细胞组件并在营养缺乏时提供能量。",
      "sentence_pinyin": "Xìbāo zìshì jīzhì qīngchú shòusǔn xìbāo zǔjiàn bìng zài yíngyǎng quēfá shí tígōng néngliàng.",
      "sentence_fr": "Le mécanisme d'autophagie cellulaire élimine les composants cellulaires endommagés et fournit de l'énergie en cas de carence nutritionnelle.",
      "sentence_en": "Cellular autophagy mechanisms clear damaged cell components and provide energy during nutrient deficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "autophagy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无人值守商店利用计算机视觉和传感器技术实现自动结账。",
      "sentence_pinyin": "Wú rén zhíshǒu shāngdiàn lìyòng jìsuànjī shìjué hé chuángǎnqì jìshù shíxiàn zìdòng jiézhàng.",
      "sentence_fr": "Les magasins sans personnel utilisent la vision par ordinateur et les technologies de capteurs pour réaliser un paiement automatique.",
      "sentence_en": "Unmanned stores use computer vision and sensor technology to achieve automatic checkout.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "unmanned_stores",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际私法协调不同法律体系在跨境交易和纠纷中的适用。",
      "sentence_pinyin": "Guójì sīfǎ xiétiáo bùtóng fǎlǜ tǐxì zài kuàjìng jiāoyì hé jiūfēn zhōng de shìyòng.",
      "sentence_fr": "Le droit international privé coordonne l'application de différents systèmes juridiques dans les transactions et les litiges transfrontaliers.",
      "sentence_en": "Private international law coordinates the application of different legal systems in cross-border transactions and disputes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "private_international_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增材制造技术通过逐层添加材料来创建复杂的三维物体。",
      "sentence_pinyin": "Zēng cái zhìzào jìshù tōngguò zhú céng tiānjiā cáiliào lái chuàngjiàn fùzá de sānwéi wùtǐ.",
      "sentence_fr": "La technologie de fabrication additive crée des objets tridimensionnels complexes en ajoutant des matériaux couche par couche.",
      "sentence_en": "Additive manufacturing technology creates complex three-dimensional objects by adding materials layer by layer.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "additive_manufacturing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多模态交通规划整合公交、骑行和步行以减少私家车依赖。",
      "sentence_pinyin": "Duō mótài jiāotōng guīhuà zhěnghé gōngjiāo, qíxíng hé bùxíng yǐ jiǎnshǎo sījiā chē yīlài.",
      "sentence_fr": "La planification des transports multimodaux intègre les transports en commun, le vélo et la marche pour réduire la dépendance à la voiture particulière.",
      "sentence_en": "Multimodal transportation planning integrates public transit, cycling, and walking to reduce private car dependence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multimodal_transport",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电化学能量转换研究开发更高效的燃料电池和电解槽技术。",
      "sentence_pinyin": "Diànhuà xué néngliàng zhuǎnhuàn yánjiū kāifā gèng gāoxiào de ránliào diànchí hé diànjiě cáo jìshù.",
      "sentence_fr": "La recherche sur la conversion électrochimique de l'énergie développe des technologies de piles à combustible et d'électrolyseurs plus efficaces.",
      "sentence_en": "Electrochemical energy conversion research develops more efficient fuel cell and electrolyzer technologies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "electrochemical_conversion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
