{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "声学模型在语音识别系统中将音频信号转换为语言单位的概率分布。",
      "sentence_pinyin": "Shēngxué móxíng zài yǔyīn shíbié xìtǒng zhōng jiāng yīnpín xìnhào zhuǎnhuàn wéi yǔyán dānwèi de gàilǜ fēnbù.",
      "sentence_fr": "Les modèles acoustiques dans les systèmes de reconnaissance vocale convertissent les signaux audio en distributions de probabilité des unités linguistiques.",
      "sentence_en": "Acoustic models in speech recognition systems convert audio signals into probability distributions of linguistic units.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "acoustic_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政治哲学探讨正义、权利、自由和政治权威的规范性基础。",
      "sentence_pinyin": "Zhèngzhì zhéxué tàntǎo zhèngyì, quánlì, zìyóu hé zhèngzhì quánwēi de guīfànxìng jīchǔ.",
      "sentence_fr": "La philosophie politique explore les fondements normatifs de la justice, des droits, de la liberté et de l'autorité politique.",
      "sentence_en": "Political philosophy explores the normative foundations of justice, rights, freedom, and political authority.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "political_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可再生能源整合需要电网现代化和储能技术的协调发展。",
      "sentence_pinyin": "Kě zàishēng néngyuán zhěnghé xūyào diànwǎng xiàndàihuà hé chǔnéng jìshù de xiétiáo fāzhǎn.",
      "sentence_fr": "L'intégration des énergies renouvelables nécessite le développement coordonné de la modernisation du réseau et des technologies de stockage.",
      "sentence_en": "Renewable energy integration requires coordinated development of grid modernization and energy storage technologies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "renewable_integration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "群体动力学研究团队如何形成规范、做出决策和解决冲突。",
      "sentence_pinyin": "Qúntǐ dònglìxué yánjiū tuánduì rúhé xíngchéng guīfàn, zuòchū juécè hé jiějué chōngtū.",
      "sentence_fr": "La dynamique de groupe étudie comment les équipes forment des normes, prennent des décisions et résolvent les conflits.",
      "sentence_en": "Group dynamics studies how teams form norms, make decisions, and resolve conflicts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "group_dynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "干细胞技术为组织再生和退行性疾病治疗开辟了新的医学前沿。",
      "sentence_pinyin": "Gànxìbāo jìshù wèi zǔzhī zàishēng hé tuìxíngxìng jíbìng zhìliáo kāipìle xīn de yīxué qiányán.",
      "sentence_fr": "La technologie des cellules souches ouvre de nouvelles frontières médicales pour la régénération tissulaire et le traitement des maladies dégénératives.",
      "sentence_en": "Stem cell technology opens new medical frontiers for tissue regeneration and degenerative disease treatment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stem_cell_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "句法学分析语言中词语如何组合形成短语和句子的规则系统。",
      "sentence_pinyin": "Jùfǎxué fēnxī yǔyán zhōng cíyǔ rúhé zǔhé xíngchéng duǎnyǔ hé jùzi de guīzé xìtǒng.",
      "sentence_fr": "La syntaxe analyse le système de règles selon lequel les mots se combinent pour former des phrases et des propositions dans les langues.",
      "sentence_en": "Syntax analyzes the rule system of how words combine to form phrases and sentences in languages.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "syntax",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "软件架构模式提供了解决常见设计问题的可重用解决方案模板。",
      "sentence_pinyin": "Ruǎnjiàn jiàgòu móshì tígōngle jiějué chángjiàn shèjì wèntí de kě chóngyòng jiějué fāng'àn múbǎn.",
      "sentence_fr": "Les modèles d'architecture logicielle fournissent des modèles de solutions réutilisables pour résoudre les problèmes de conception courants.",
      "sentence_en": "Software architecture patterns provide reusable solution templates for solving common design problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "software_architecture_patterns",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "濒危语言记录工作试图在这些语言消失前保存其语法和词汇。",
      "sentence_pinyin": "Bīnwēi yǔyán jìlù gōngzuò shìtú zài zhèxiē yǔyán xiāoshī qián bǎocún qí yǔfǎ hé cíhuì.",
      "sentence_fr": "Le travail de documentation des langues en danger tente de préserver leur grammaire et leur vocabulaire avant qu'elles ne disparaissent.",
      "sentence_en": "Endangered language documentation work attempts to preserve their grammar and vocabulary before they disappear.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "endangered_languages",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行星科学研究太阳系和系外行星的形成、演化和物理特性。",
      "sentence_pinyin": "Xíngxīng kēxué yánjiū tàiyáng xì hé xì wài xíngxīng de xíngchéng, yǎnhuà hé wùlǐ tèxìng.",
      "sentence_fr": "La science planétaire étudie la formation, l'évolution et les propriétés physiques des planètes du système solaire et des exoplanètes.",
      "sentence_en": "Planetary science studies the formation, evolution, and physical properties of solar system and extrasolar planets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "planetary_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "发展经济学研究低收入国家如何实现可持续的经济增长和减贫。",
      "sentence_pinyin": "Fāzhǎn jīngjìxué yánjiū dī shōurù guójiā rúhé shíxiàn kě chíxù de jīngjì zēngzhǎng hé jiǎn pín.",
      "sentence_fr": "L'économie du développement étudie comment les pays à faible revenu peuvent atteindre une croissance économique durable et la réduction de la pauvreté.",
      "sentence_en": "Development economics studies how low-income countries can achieve sustainable economic growth and poverty reduction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "development_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "异常检测算法能够识别数据中的异常模式和潜在的欺诈行为。",
      "sentence_pinyin": "Yìcháng jiǎncè suànfǎ nénggòu shíbié shùjù zhōng de yìcháng móshì hé qiánzài de qīzhà xíngwéi.",
      "sentence_fr": "Les algorithmes de détection d'anomalies peuvent identifier des modèles anormaux dans les données et des comportements potentiellement frauduleux.",
      "sentence_en": "Anomaly detection algorithms can identify abnormal patterns in data and potential fraudulent behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "anomaly_detection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精神药理学研究药物如何影响大脑化学和心理功能以治疗精神疾病。",
      "sentence_pinyin": "Jīngshén yàolǐxué yánjiū yàowù rúhé yǐngxiǎng dànǎo huàxué hé xīnlǐ gōngnéng yǐ zhìliáo jīngshén jíbìng.",
      "sentence_fr": "La psychopharmacologie étudie comment les médicaments affectent la chimie du cerveau et les fonctions psychologiques pour traiter les troubles mentaux.",
      "sentence_en": "Psychopharmacology studies how drugs affect brain chemistry and psychological functions to treat mental disorders.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychopharmacology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可持续供应链管理整合环境和社会责任标准到采购决策中。",
      "sentence_pinyin": "Kě chíxù gōngyìng liàn guǎnlǐ zhěnghé huánjìng hé shèhuì zérèn biāozhǔn dào cǎigòu juécè zhōng.",
      "sentence_fr": "La gestion durable de la chaîne d'approvisionnement intègre les normes de responsabilité environnementale et sociale dans les décisions d'achat.",
      "sentence_en": "Sustainable supply chain management integrates environmental and social responsibility standards into procurement decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sustainable_supply_chain",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "冰川学研究冰川动态和极地冰盖变化对海平面上升的影响。",
      "sentence_pinyin": "Bīngchuān xué yánjiū bīngchuān dòngtài hé jídì bīnggài biànhuà duì hǎi píngmiàn shàngshēng de yǐngxiǎng.",
      "sentence_fr": "La glaciologie étudie la dynamique des glaciers et l'impact des changements des calottes glaciaires polaires sur l'élévation du niveau de la mer.",
      "sentence_en": "Glaciology studies glacier dynamics and the impact of polar ice sheet changes on sea level rise.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "glaciology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "形态学研究语言中词的内部结构以及词缀如何改变词义。",
      "sentence_pinyin": "Xíngtàixué yánjiū yǔyán zhōng cí de nèibù jiégòu yǐjí cízhuì rúhé gǎibiàn cíyì.",
      "sentence_fr": "La morphologie étudie la structure interne des mots dans les langues et comment les affixes modifient leur sens.",
      "sentence_en": "Morphology studies the internal structure of words in languages and how affixes change their meaning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "morphology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "服务网格架构简化了微服务之间的通信、安全和可观测性管理。",
      "sentence_pinyin": "Fúwù wǎnggé jiàgòu jiǎnhuàle wēi fúwù zhījiān de tōngxìn, ānquán hé kě guāncè xìng guǎnlǐ.",
      "sentence_fr": "L'architecture de maillage de services simplifie la gestion de la communication, de la sécurité et de l'observabilité entre les microservices.",
      "sentence_en": "Service mesh architecture simplifies communication, security, and observability management between microservices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "service_mesh",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "老年学研究衰老过程以及老年人口的社会、心理和健康需求。",
      "sentence_pinyin": "Lǎonián xué yánjiū shuāilǎo guòchéng yǐjí lǎonián rénkǒu de shèhuì, xīnlǐ hé jiànkāng xūqiú.",
      "sentence_fr": "La gérontologie étudie le processus de vieillissement et les besoins sociaux, psychologiques et sanitaires de la population âgée.",
      "sentence_en": "Gerontology studies the aging process and the social, psychological, and health needs of the elderly population.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gerontology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "药物动力学研究药物在体内的吸收、分布、代谢和排泄过程。",
      "sentence_pinyin": "Yàowù dònglìxué yánjiū yàowù zài tǐnèi de xīshōu, fēnbù, dàixiè hé páixiè guòchéng.",
      "sentence_fr": "La pharmacocinétique étudie les processus d'absorption, de distribution, de métabolisme et d'excrétion des médicaments dans l'organisme.",
      "sentence_en": "Pharmacokinetics studies the absorption, distribution, metabolism, and excretion processes of drugs in the body.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pharmacokinetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络效应理论解释了用户数量增长如何指数级增加平台价值。",
      "sentence_pinyin": "Wǎngluò xiàoyìng lǐlùn jiěshìle yònghù shùliàng zēngzhǎng rúhé zhǐshù jí zēngjiā píngtái jiàzhí.",
      "sentence_fr": "La théorie des effets de réseau explique comment la croissance du nombre d'utilisateurs augmente exponentiellement la valeur de la plateforme.",
      "sentence_en": "Network effects theory explains how user growth exponentially increases platform value.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_effects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "废物管理系统包括减量、回收、堆肥和能源回收等多种策略。",
      "sentence_pinyin": "Fèiwù guǎnlǐ xìtǒng bāokuò jiǎnliàng, huíshōu, duīféi hé néngyuán huíshōu děng duō zhǒng cèlüè.",
      "sentence_fr": "Les systèmes de gestion des déchets comprennent diverses stratégies telles que la réduction, le recyclage, le compostage et la récupération d'énergie.",
      "sentence_en": "Waste management systems include various strategies such as reduction, recycling, composting, and energy recovery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "waste_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
