{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "复杂适应系统理论研究由多个相互作用主体组成的系统如何涌现出整体行为。",
      "sentence_pinyin": "Fùzá shìyìng xìtǒng lǐlùn yánjiū yóu duō gè xiānghù zuòyòng zhǔtǐ zǔchéng de xìtǒng rúhé yǒngxiàn chū zhěngtǐ xíngwéi.",
      "sentence_fr": "La théorie des systèmes adaptatifs complexes étudie comment les systèmes composés de multiples agents en interaction font émerger un comportement global.",
      "sentence_en": "Complex adaptive systems theory studies how systems composed of multiple interacting agents emerge with collective behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "complex_adaptive_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "法律社会学研究法律与社会结构、文化规范和权力动态之间的相互关系。",
      "sentence_pinyin": "Fǎlǜ shèhuìxué yánjiū fǎlǜ yǔ shèhuì jiégòu, wénhuà guīfàn hé quánlì dòngtài zhījiān de xiānghù guānxì.",
      "sentence_fr": "La sociologie du droit étudie les interrelations entre le droit et les structures sociales, les normes culturelles et les dynamiques de pouvoir.",
      "sentence_en": "Sociology of law studies the interrelationships between law and social structures, cultural norms, and power dynamics.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sociology_of_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然语言处理技术使计算机能够理解、解释和生成人类语言内容。",
      "sentence_pinyin": "Zìrán yǔyán chǔlǐ jìshù shǐ jìsuànjī nénggòu lǐjiě, jiěshì hé shēngchéng rénlèi yǔyán nèiróng.",
      "sentence_fr": "La technologie de traitement du langage naturel permet aux ordinateurs de comprendre, d'interpréter et de générer du contenu en langage humain.",
      "sentence_en": "Natural language processing technology enables computers to understand, interpret, and generate human language content.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "natural_language_processing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "气候适应策略帮助社区和基础设施应对不断变化的气候条件带来的风险。",
      "sentence_pinyin": "Qìhòu shìyìng cèlüè bāngzhù shèqū hé jīchǔ shèshī yìngduì bùduàn biànhuà de qìhòu tiáojiàn dàilái de fēngxiǎn.",
      "sentence_fr": "Les stratégies d'adaptation au climat aident les communautés et les infrastructures à faire face aux risques posés par les conditions climatiques changeantes.",
      "sentence_en": "Climate adaptation strategies help communities and infrastructure cope with risks posed by changing climate conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "climate_adaptation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现象学方法论关注通过主观经验来理解人类意识和生活世界的本质。",
      "sentence_pinyin": "Xiànxiàngxué fāngfǎlùn guānzhù tōngguò zhǔguān jīngyàn lái lǐjiě rénlèi yìshí hé shēnghuó shìjiè de běnzhì.",
      "sentence_fr": "La méthodologie phénoménologique se concentre sur la compréhension de l'essence de la conscience humaine et du monde vécu à travers l'expérience subjective.",
      "sentence_en": "Phenomenological methodology focuses on understanding the essence of human consciousness and the lifeworld through subjective experience.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "phenomenology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子通信利用量子力学原理实现理论上不可破解的加密通信。",
      "sentence_pinyin": "Liàngzǐ tōngxìn lìyòng liàngzǐ lìxué yuánlǐ shíxiàn lǐlùn shàng bùkě pòjiě de jiāmì tōngxìn.",
      "sentence_fr": "La communication quantique utilise les principes de la mécanique quantique pour réaliser une communication cryptée théoriquement inviolable.",
      "sentence_en": "Quantum communication uses quantum mechanics principles to achieve theoretically unbreakable encrypted communication.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "劳动经济学分析劳动力市场中工资决定、就业模式和人力资本投资。",
      "sentence_pinyin": "Láodòng jīngjìxué fēnxī láodònglì shìchǎng zhōng gōngzī juédìng, jiùyè móshì hé rénlì zīběn tóuzī.",
      "sentence_fr": "L'économie du travail analyse la détermination des salaires, les modèles d'emploi et l'investissement en capital humain sur le marché du travail.",
      "sentence_en": "Labor economics analyzes wage determination, employment patterns, and human capital investment in the labor market.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "labor_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经伦理学探讨神经科学研究和技术应用引发的伦理和社会问题。",
      "sentence_pinyin": "Shénjīng lúnlǐxué tàntǎo shénjīng kēxué yánjiū hé jìshù yìngyòng yǐnfā de lúnlǐ hé shèhuì wèntí.",
      "sentence_fr": "La neuroéthique explore les questions éthiques et sociales soulevées par la recherche en neurosciences et les applications technologiques.",
      "sentence_en": "Neuroethics explores ethical and social issues raised by neuroscience research and technological applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "持续集成和持续部署实践自动化软件测试和发布流程以提高开发效率。",
      "sentence_pinyin": "Chíxù jíchéng hé chíxù bùshǔ shíjiàn zìdònghuà ruǎnjiàn cèshì hé fābù liúchéng yǐ tígāo kāifā xiàolǜ.",
      "sentence_fr": "Les pratiques d'intégration continue et de déploiement continu automatisent les processus de test et de publication de logiciels pour améliorer l'efficacité du développement.",
      "sentence_en": "Continuous integration and continuous deployment practices automate software testing and release processes to improve development efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ci_cd",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "食品安全科学研究从农场到餐桌整个供应链中的食品安全风险。",
      "sentence_pinyin": "Shípǐn ānquán kēxué yánjiū cóng nóngchǎng dào cānzhuō zhěnggè gōngyìng liàn zhōng de shípǐn ānquán fēngxiǎn.",
      "sentence_fr": "La science de la sécurité alimentaire étudie les risques de sécurité alimentaire tout au long de la chaîne d'approvisionnement de la ferme à la table.",
      "sentence_en": "Food safety science studies food safety risks throughout the supply chain from farm to table.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_safety_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "话语分析方法揭示了语言如何构建社会现实和身份认同。",
      "sentence_pinyin": "Huàyǔ fēnxī fāngfǎ jiēshìle yǔyán rúhé gòujiàn shèhuì xiànshí hé shēnfèn rèntóng.",
      "sentence_fr": "Les méthodes d'analyse du discours révèlent comment le langage construit la réalité sociale et l'identité.",
      "sentence_en": "Discourse analysis methods reveal how language constructs social reality and identity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "discourse_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电化学储能系统包括锂离子电池、液流电池和超级电容器等技术。",
      "sentence_pinyin": "Diànhuàxué chǔnéng xìtǒng bāokuò lǐ lízǐ diànchí, yèliú diànchí hé chāojí diànróngqì děng jìshù.",
      "sentence_fr": "Les systèmes de stockage d'énergie électrochimique comprennent des technologies comme les batteries lithium-ion, les batteries à flux et les supercondensateurs.",
      "sentence_en": "Electrochemical energy storage systems include technologies such as lithium-ion batteries, flow batteries, and supercapacitors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "electrochemical_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化人类学通过参与观察来理解不同文化群体的信仰和实践。",
      "sentence_pinyin": "Wénhuà rénlèixué tōngguò cānyù guānchá lái lǐjiě bùtóng wénhuà qúntǐ de xìnyǎng hé shíjiàn.",
      "sentence_fr": "L'anthropologie culturelle comprend les croyances et les pratiques de différents groupes culturels à travers l'observation participante.",
      "sentence_en": "Cultural anthropology understands the beliefs and practices of different cultural groups through participant observation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_anthropology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "推荐系统利用协同过滤和内容分析为用户提供个性化的建议。",
      "sentence_pinyin": "Tuījiàn xìtǒng lìyòng xiétóng guòlǜ hé nèiróng fēnxī wèi yònghù tígōng gèxìnghuà de jiànyì.",
      "sentence_fr": "Les systèmes de recommandation utilisent le filtrage collaboratif et l'analyse de contenu pour fournir des suggestions personnalisées aux utilisateurs.",
      "sentence_en": "Recommendation systems use collaborative filtering and content analysis to provide personalized suggestions to users.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "recommendation_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人口转型理论解释了社会从高出生率和死亡率向低水平转变的过程。",
      "sentence_pinyin": "Rénkǒu zhuǎnxíng lǐlùn jiěshìle shèhuì cóng gāo chūshēnglǜ hé sǐwánglǜ xiàng dī shuǐpíng zhuǎnbiàn de guòchéng.",
      "sentence_fr": "La théorie de la transition démographique explique le processus par lequel les sociétés passent de taux de natalité et de mortalité élevés à des niveaux bas.",
      "sentence_en": "Demographic transition theory explains the process by which societies shift from high birth and death rates to low levels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "demographic_transition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水文学研究水循环以及地表水和地下水资源的分布和运动规律。",
      "sentence_pinyin": "Shuǐwénxué yánjiū shuǐ xúnhuán yǐjí dìbiǎo shuǐ hé dìxià shuǐ zīyuán de fēnbù hé yùndòng guīlǜ.",
      "sentence_fr": "L'hydrologie étudie le cycle de l'eau ainsi que la distribution et les lois de mouvement des ressources en eaux de surface et souterraines.",
      "sentence_en": "Hydrology studies the water cycle and the distribution and movement patterns of surface and groundwater resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hydrology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模式识别算法能够从大量数据中自动识别有意义的规律和结构。",
      "sentence_pinyin": "Móshì shíbié suànfǎ nénggòu cóng dàliàng shùjù zhōng zìdòng shíbié yǒu yìyì de guīlǜ hé jiégòu.",
      "sentence_fr": "Les algorithmes de reconnaissance de formes peuvent identifier automatiquement des motifs et des structures significatifs à partir de grandes quantités de données.",
      "sentence_en": "Pattern recognition algorithms can automatically identify meaningful patterns and structures from large amounts of data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pattern_recognition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学技术研究领域分析科学知识生产的社会和文化背景。",
      "sentence_pinyin": "Kēxué jìshù yánjiū lǐngyù fēnxī kēxué zhīshi shēngchǎn de shèhuì hé wénhuà bèijǐng.",
      "sentence_fr": "Le domaine des études scientifiques et technologiques analyse le contexte social et culturel de la production des connaissances scientifiques.",
      "sentence_en": "The field of science and technology studies analyzes the social and cultural context of scientific knowledge production.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "science_technology_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳中和目标要求企业和国家平衡其温室气体排放与减排措施。",
      "sentence_pinyin": "Tàn zhōnghé mùbiāo yāoqiú qǐyè hé guójiā pínghéng qí wēnshì qìtǐ páifàng yǔ jiǎnpái cuòshī.",
      "sentence_fr": "L'objectif de neutralité carbone exige que les entreprises et les pays équilibrent leurs émissions de gaz à effet de serre avec des mesures de réduction.",
      "sentence_en": "Carbon neutrality goals require businesses and nations to balance their greenhouse gas emissions with reduction measures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_neutrality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "犯罪学理论试图解释犯罪行为的原因和有效的预防干预措施。",
      "sentence_pinyin": "Fànzuìxué lǐlùn shìtú jiěshì fànzuì xíngwéi de yuányīn hé yǒuxiào de yùfáng gānyù cuòshī.",
      "sentence_fr": "Les théories criminologiques tentent d'expliquer les causes du comportement criminel et les mesures d'intervention préventive efficaces.",
      "sentence_en": "Criminological theories attempt to explain the causes of criminal behavior and effective preventive intervention measures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "criminology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
