{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能儿童手表可以定位孩子的位置,家长可以随时了解孩子在哪里。",
      "sentence_pinyin": "Zhège zhìnéng értóng shǒubiǎo kěyǐ dìngwèi háizi de wèizhì, jiāzhǎng kěyǐ suíshí liǎojiě háizi zài nǎlǐ.",
      "sentence_fr": "Cette montre intelligente pour enfants peut localiser l'enfant, permettant aux parents de savoir où il se trouve à tout moment.",
      "sentence_en": "This smart children's watch can locate the child's position, allowing parents to know where the child is at any time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_kids_watches",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沪剧是上海的地方戏曲,唱腔柔和婉转,富有江南水乡的韵味。",
      "sentence_pinyin": "Hùjù shì Shànghǎi de dìfāng xìqǔ, chàngqiāng róuhé wǎnzhuǎn, fùyǒu Jiāngnán shuǐxiāng de yùnwèi.",
      "sentence_fr": "L'opéra Hu est un opéra régional de Shanghai, avec un chant doux et mélodieux, empreint du charme des villes d'eau du Jiangnan.",
      "sentence_en": "Hu opera is a regional opera of Shanghai, with soft and melodious singing, rich in the charm of Jiangnan water towns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市雨水收集系统将雨水储存起来,用于绿化灌溉和道路清洁。",
      "sentence_pinyin": "Chéngshì yǔshuǐ shōují xìtǒng jiāng yǔshuǐ chǔcún qǐlái, yòng yú lǜhuà guàngài hé dàolù qīngjié.",
      "sentence_fr": "Le système de collecte des eaux pluviales urbaines stocke l'eau de pluie pour l'irrigation des espaces verts et le nettoyage des routes.",
      "sentence_en": "Urban rainwater collection systems store rainwater for green space irrigation and road cleaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rainwater_harvesting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能药盒可以按时提醒老人吃药,还能记录用药情况。",
      "sentence_pinyin": "Zhìnéng yàohé kěyǐ ànshí tíxǐng lǎorén chīyào, hái néng jìlù yòngyào qíngkuàng.",
      "sentence_fr": "Le pilulier intelligent peut rappeler aux personnes âgées de prendre leurs médicaments à temps et enregistrer les prises.",
      "sentence_en": "The smart pill box can remind the elderly to take medicine on time and record medication intake.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pill_boxes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的彩灯制作工艺在元宵节期间展示各种精美的花灯。",
      "sentence_pinyin": "Zhōngguó chuántǒng de cǎidēng zhìzuò gōngyì zài Yuánxiāojié qījiān zhǎnshì gèzhǒng jīngměi de huādēng.",
      "sentence_fr": "L'artisanat traditionnel chinois de fabrication de lanternes colorées présente diverses lanternes exquises pendant la Fête des Lanternes.",
      "sentence_en": "Traditional Chinese colored lantern making craftsmanship displays various exquisite lanterns during the Lantern Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lantern_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能游戏椅配有按摩功能和音响系统,提升游戏体验。",
      "sentence_pinyin": "Zhìnéng yóuxì yǐ pèiyǒu ànmó gōngnéng hé yīnxiǎng xìtǒng, tíshēng yóuxì tǐyàn.",
      "sentence_fr": "La chaise de gaming intelligente est équipée de fonctions de massage et d'un système audio, améliorant l'expérience de jeu.",
      "sentence_en": "The smart gaming chair is equipped with massage functions and a sound system, enhancing the gaming experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_gaming_chairs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "闽剧是福建的地方戏曲,融合了多种地方音乐元素,风格独特。",
      "sentence_pinyin": "Mǐnjù shì Fújiàn de dìfāng xìqǔ, rónghé le duō zhǒng dìfāng yīnyuè yuánsù, fēnggé dútè.",
      "sentence_fr": "L'opéra Min est un opéra régional du Fujian, combinant divers éléments musicaux locaux avec un style unique.",
      "sentence_en": "Min opera is a regional opera of Fujian, combining various local musical elements with a unique style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "min_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市在街头设置了充电桩,方便电动汽车车主随时充电。",
      "sentence_pinyin": "Zhège chéngshì zài jiētóu shèzhì le chōngdiànzhuāng, fāngbiàn diàndòng qìchē chēzhǔ suíshí chōngdiàn.",
      "sentence_fr": "Cette ville a installé des bornes de recharge dans les rues, permettant aux propriétaires de véhicules électriques de recharger à tout moment.",
      "sentence_en": "This city has installed charging stations on streets, allowing electric vehicle owners to charge at any time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_charging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能鱼缸可以自动换水、调节温度和投喂鱼食,简化养鱼工作。",
      "sentence_pinyin": "Zhìnéng yúgāng kěyǐ zìdòng huànshuǐ, tiáojié wēndù hé tóuwèi yúshí, jiǎnhuà yǎngyú gōngzuò.",
      "sentence_fr": "L'aquarium intelligent peut changer l'eau, réguler la température et nourrir les poissons automatiquement, simplifiant l'élevage des poissons.",
      "sentence_en": "The smart fish tank can automatically change water, regulate temperature, and feed fish, simplifying fish keeping.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_aquariums",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的琉璃工艺品晶莹剔透,色彩绚丽,具有很高的艺术价值。",
      "sentence_pinyin": "Zhōngguó chuántǒng de liúlí gōngyìpǐn jīngyíng tītòu, sècǎi xuànlì, jùyǒu hěn gāo de yìshù jiàzhí.",
      "sentence_fr": "Les objets d'art traditionnels chinois en verre coloré sont cristallins et translucides, aux couleurs brillantes, avec une grande valeur artistique.",
      "sentence_en": "Traditional Chinese colored glass crafts are crystal clear and translucent, with brilliant colors and high artistic value.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "colored_glass",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能按摩椅可以根据用户的身体状况定制按摩程序。",
      "sentence_pinyin": "Zhìnéng ànmó yǐ kěyǐ gēnjù yònghù de shēntǐ zhuàngkuàng dìngzhì ànmó chéngxù.",
      "sentence_fr": "Le fauteuil de massage intelligent peut personnaliser les programmes de massage selon l'état physique de l'utilisateur.",
      "sentence_en": "The smart massage chair can customize massage programs based on the user's physical condition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_massage_chairs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "潮剧是广东潮汕地区的地方戏曲,唱腔清丽柔美,独具特色。",
      "sentence_pinyin": "Cháojù shì Guǎngdōng Cháoshàn dìqū de dìfāng xìqǔ, chàngqiāng qīnglì róuměi, dújù tèsè.",
      "sentence_fr": "L'opéra Chaozhou est un opéra régional de la région de Chaoshan au Guangdong, avec un chant clair et doux, très caractéristique.",
      "sentence_en": "Chaozhou opera is a regional opera of the Chaoshan region in Guangdong, with clear and soft singing, uniquely distinctive.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "chaozhou_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府大力推广可再生能源,减少对化石燃料的依赖。",
      "sentence_pinyin": "Zhèngfǔ dàlì tuīguǎng kě zàishēng néngyuán, jiǎnshǎo duì huàshí ránliào de yīlài.",
      "sentence_fr": "Le gouvernement promeut vigoureusement les énergies renouvelables pour réduire la dépendance aux combustibles fossiles.",
      "sentence_en": "The government vigorously promotes renewable energy to reduce dependence on fossil fuels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "renewable_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能座垫可以监测坐姿,并在久坐时提醒用户起身活动。",
      "sentence_pinyin": "Zhìnéng zuòdiàn kěyǐ jiāncè zuòzī, bìng zài jiǔzuò shí tíxǐng yònghù qǐshēn huódòng.",
      "sentence_fr": "Le coussin de siège intelligent peut surveiller la posture assise et rappeler à l'utilisateur de se lever et bouger après une longue période assise.",
      "sentence_en": "The smart seat cushion can monitor sitting posture and remind users to get up and move after sitting for long periods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_seat_cushions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的竹编工艺可以编织各种精美的篮子、帽子和家具。",
      "sentence_pinyin": "Zhōngguó chuántǒng de zhúbiān gōngyì kěyǐ biānzhī gèzhǒng jīngměi de lánzi, màozi hé jiājù.",
      "sentence_fr": "L'artisanat traditionnel chinois de vannerie en bambou peut tisser divers paniers, chapeaux et meubles exquis.",
      "sentence_en": "Traditional Chinese bamboo weaving craftsmanship can weave various exquisite baskets, hats, and furniture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_weaving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能净化器可以实时监测室内空气质量,并自动调节净化强度。",
      "sentence_pinyin": "Zhìnéng jìnghuàqì kěyǐ shíshí jiāncè shìnèi kōngqì zhìliàng, bìng zìdòng tiáojié jìnghuà qiángdù.",
      "sentence_fr": "Le purificateur d'air intelligent peut surveiller en temps réel la qualité de l'air intérieur et ajuster automatiquement l'intensité de purification.",
      "sentence_en": "The smart air purifier can monitor indoor air quality in real-time and automatically adjust purification intensity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_purifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "桂剧是广西的地方戏曲,既保留了汉族戏曲的特点,又融合了少数民族风情。",
      "sentence_pinyin": "Guìjù shì Guǎngxī de dìfāng xìqǔ, jì bǎoliú le Hànzú xìqǔ de tèdiǎn, yòu rónghé le shǎoshù mínzú fēngqíng.",
      "sentence_fr": "L'opéra Gui est un opéra régional du Guangxi, conservant les caractéristiques de l'opéra Han tout en intégrant le charme des minorités ethniques.",
      "sentence_en": "Gui opera is a regional opera of Guangxi, preserving Han opera characteristics while integrating ethnic minority charm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gui_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市公共自行车站点覆盖主要交通枢纽和商业区,方便市民骑行。",
      "sentence_pinyin": "Chéngshì gōnggòng zìxíngchē zhàndiǎn fùgài zhǔyào jiāotōng shūniǔ hé shāngyè qū, fāngbiàn shìmín qíxíng.",
      "sentence_fr": "Les stations de vélos publics urbains couvrent les principaux nœuds de transport et zones commerciales, facilitant le vélo pour les citadins.",
      "sentence_en": "Urban public bicycle stations cover major transportation hubs and commercial areas, making cycling convenient for residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_bicycles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能婴儿摇篮可以感应宝宝的哭声,自动摇晃安抚宝宝入睡。",
      "sentence_pinyin": "Zhìnéng yīng'ér yáolán kěyǐ gǎnyìng bǎobao de kūshēng, zìdòng yáohuàng ānfǔ bǎobao rùshuì.",
      "sentence_fr": "Le berceau intelligent pour bébé peut détecter les pleurs du bébé et se balancer automatiquement pour l'apaiser et l'endormir.",
      "sentence_en": "The smart baby cradle can detect the baby's crying and automatically rock to soothe the baby to sleep.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_baby_cradles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的绳结艺术可以编织出各种吉祥图案,常用于节日装饰。",
      "sentence_pinyin": "Zhōngguó chuántǒng de shéngjié yìshù kěyǐ biānzhī chū gèzhǒng jíxiáng tú'àn, cháng yòng yú jiérì zhuāngshì.",
      "sentence_fr": "L'art traditionnel chinois du nœud peut tisser divers motifs de bon augure, souvent utilisés pour les décorations festives.",
      "sentence_en": "Traditional Chinese knot art can weave various auspicious patterns, often used for festival decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "chinese_knots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
