{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子优势指量子计算机在特定问题上超越经典计算机的能力。",
      "sentence_pinyin": "Liàngzǐ yōushì zhǐ liàngzǐ jìsuànjī zài tèdìng wèntí shàng chāoyuè jīngdiǎn jìsuànjī de nénglì.",
      "sentence_fr": "L'avantage quantique désigne la capacité des ordinateurs quantiques à surpasser les ordinateurs classiques sur des problèmes spécifiques.",
      "sentence_en": "Quantum advantage refers to quantum computers' ability to outperform classical computers on specific problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_advantage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可区分混淆将程序转换为功能等价但难以理解的形式。",
      "sentence_pinyin": "Bùkě qūfēn hùnxiáo jiāng chéngxù zhuǎnhuàn wéi gōngnéng děngjià dàn nán yǐ lǐjiě de xíngshì.",
      "sentence_fr": "L'obfuscation indistinguable transforme les programmes en formes fonctionnellement équivalentes mais difficiles à comprendre.",
      "sentence_en": "Indistinguishability obfuscation transforms programs into functionally equivalent but hard-to-understand forms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "indistinguishability_obfuscation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "子类型多态允许派生类型在基类型位置使用。",
      "sentence_pinyin": "Zǐ lèixíng duōtài yǔnxǔ pàishēng lèixíng zài jī lèixíng wèizhì shǐyòng.",
      "sentence_fr": "Le polymorphisme de sous-typage permet aux types dérivés d'être utilisés à la place des types de base.",
      "sentence_en": "Subtype polymorphism allows derived types to be used in place of base types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "subtype_polymorphism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阿蒂亚-辛格指标定理连接微分几何与拓扑不变量。",
      "sentence_pinyin": "Ātìyà-Xīngé zhǐbiāo dìnglǐ liánjiē wēifēn jǐhé yǔ tuòpū bùbiànliàng.",
      "sentence_fr": "Le théorème de l'indice d'Atiyah-Singer relie la géométrie différentielle aux invariants topologiques.",
      "sentence_en": "The Atiyah-Singer index theorem connects differential geometry with topological invariants.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "atiyah_singer_theorem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子门保真度衡量实际量子操作与理想操作的接近程度。",
      "sentence_pinyin": "Liàngzǐ mén bǎozhēndù héngliáng shíjì liàngzǐ cāozuò yǔ lǐxiǎng cāozuò de jiējìn chéngdù.",
      "sentence_fr": "La fidélité des portes quantiques mesure la proximité entre les opérations quantiques réelles et idéales.",
      "sentence_en": "Quantum gate fidelity measures how closely actual quantum operations match ideal operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_gate_fidelity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "函数加密允许对加密数据计算特定函数而不解密整体。",
      "sentence_pinyin": "Hánshù jiāmì yǔnxǔ duì jiāmì shùjù jìsuàn tèdìng hánshù ér bù jiěmì zhěngtǐ.",
      "sentence_fr": "Le chiffrement fonctionnel permet de calculer des fonctions spécifiques sur des données chiffrées sans décrypter l'ensemble.",
      "sentence_en": "Functional encryption allows computing specific functions on encrypted data without decrypting the whole.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "functional_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型族在编译时根据类型参数选择关联类型定义。",
      "sentence_pinyin": "Lèixíng zú zài biānyì shí gēnjù lèixíng cānshù xuǎnzé guānlián lèixíng dìngyì.",
      "sentence_fr": "Les familles de types sélectionnent des définitions de types associés au moment de la compilation selon les paramètres de type.",
      "sentence_en": "Type families select associated type definitions at compile time based on type parameters.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_families",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "辛几何研究保持辛形式不变的几何结构。",
      "sentence_pinyin": "Xīn jǐhé yánjiū bǎochí xīn xíngshì bù biàn de jǐhé jiégòu.",
      "sentence_fr": "La géométrie symplectique étudie les structures géométriques qui préservent les formes symplectiques.",
      "sentence_en": "Symplectic geometry studies geometric structures that preserve symplectic forms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "symplectic_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子断层扫描通过测量重建未知量子态的完整描述。",
      "sentence_pinyin": "Liàngzǐ duàncéng sǎomiáo tōngguò cèliáng chóngjiàn wèizhī liàngzǐ tài de wánzhěng miáoshù.",
      "sentence_fr": "La tomographie quantique reconstruit une description complète des états quantiques inconnus par des mesures.",
      "sentence_en": "Quantum tomography reconstructs complete descriptions of unknown quantum states through measurements.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_tomography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "属性基加密根据用户属性而非身份授权访问权限。",
      "sentence_pinyin": "Shǔxìng jī jiāmì gēnjù yònghù shǔxìng ér fēi shēnfèn shòuquán fǎngwèn quánxiàn.",
      "sentence_fr": "Le chiffrement basé sur les attributs autorise l'accès selon les attributs des utilisateurs plutôt que leur identité.",
      "sentence_en": "Attribute-based encryption authorizes access based on user attributes rather than identity.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "attribute_based_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "路径依赖类型允许类型依赖于特定对象实例的路径。",
      "sentence_pinyin": "Lùjìng yīlài lèixíng yǔnxǔ lèixíng yīlài yú tèdìng duìxiàng shílì de lùjìng.",
      "sentence_fr": "Les types dépendants du chemin permettent aux types de dépendre du chemin vers des instances d'objets spécifiques.",
      "sentence_en": "Path-dependent types allow types to depend on the path to specific object instances.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "path_dependent_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黎曼假设关于黎曼泽塔函数零点分布的猜想至今未被证明。",
      "sentence_pinyin": "Límàn jiǎshè guānyú Límàn zétǎ hánshù língdiǎn fēnbù de cāixiǎng zhìjīn wèi bèi zhèngmíng.",
      "sentence_fr": "L'hypothèse de Riemann concernant la distribution des zéros de la fonction zêta de Riemann reste non prouvée.",
      "sentence_en": "The Riemann hypothesis concerning the distribution of zeros of the Riemann zeta function remains unproven.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "riemann_hypothesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子至上性要求量子计算机完成经典计算机无法实现的任务。",
      "sentence_pinyin": "Liàngzǐ zhìshàngxìng yāoqiú liàngzǐ jìsuànjī wánchéng jīngdiǎn jìsuànjī wúfǎ shíxiàn de rènwù.",
      "sentence_fr": "La suprématie quantique exige que les ordinateurs quantiques accomplissent des tâches impossibles pour les ordinateurs classiques.",
      "sentence_en": "Quantum supremacy requires quantum computers to complete tasks impossible for classical computers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_supremacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可否认加密允许发送者合理否认加密消息的真实内容。",
      "sentence_pinyin": "Kě fǒurèn jiāmì yǔnxǔ fāsòngzhě hélǐ fǒurèn jiāmì xiāoxī de zhēnshí nèiróng.",
      "sentence_fr": "Le chiffrement deniable permet à l'expéditeur de nier de manière plausible le contenu réel du message chiffré.",
      "sentence_en": "Deniable encryption allows senders to plausibly deny the real content of encrypted messages.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "deniable_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "幻影类型不包含运行时值但在编译时提供类型安全保证。",
      "sentence_pinyin": "Huànyǐng lèixíng bù bāohán yùnxíng shí zhí dàn zài biānyì shí tígōng lèixíng ānquán bǎozhèng.",
      "sentence_fr": "Les types fantômes ne contiennent pas de valeurs à l'exécution mais fournissent des garanties de sécurité de type à la compilation.",
      "sentence_en": "Phantom types contain no runtime values but provide type safety guarantees at compile time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "phantom_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "几何朗兰兹纲领将数论中的对应推广到几何领域。",
      "sentence_pinyin": "Jǐhé Lǎnglánzī gānglǐng jiāng shùlùn zhōng de duìyìng tuīguǎng dào jǐhé lǐngyù.",
      "sentence_fr": "Le programme géométrique de Langlands généralise les correspondances de la théorie des nombres au domaine géométrique.",
      "sentence_en": "The geometric Langlands program generalizes correspondences from number theory to the geometric domain.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "geometric_langlands",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子模拟器使用可控量子系统研究难以直接观测的量子现象。",
      "sentence_pinyin": "Liàngzǐ mónǐqì shǐyòng kěkòng liàngzǐ xìtǒng yánjiū nán yǐ zhíjiē guāncè de liàngzǐ xiànxiàng.",
      "sentence_fr": "Les simulateurs quantiques utilisent des systèmes quantiques contrôlables pour étudier des phénomènes quantiques difficiles à observer directement.",
      "sentence_en": "Quantum simulators use controllable quantum systems to study quantum phenomena that are hard to observe directly.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_simulators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后量子密码学开发能抵抗量子计算机攻击的加密算法。",
      "sentence_pinyin": "Hòu liàngzǐ mìmǎxué kāifā néng dǐkàng liàngzǐ jìsuànjī gōngjī de jiāmì suànfǎ.",
      "sentence_fr": "La cryptographie post-quantique développe des algorithmes de chiffrement résistants aux attaques des ordinateurs quantiques.",
      "sentence_en": "Post-quantum cryptography develops encryption algorithms resistant to quantum computer attacks.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "post_quantum_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "递归类型允许类型定义引用自身形成无限结构。",
      "sentence_pinyin": "Dìguī lèixíng yǔnxǔ lèixíng dìngyì yǐnyòng zìshēn xíngchéng wúxiàn jiégòu.",
      "sentence_fr": "Les types récursifs permettent aux définitions de types de se référencer elles-mêmes pour former des structures infinies.",
      "sentence_en": "Recursive types allow type definitions to reference themselves to form infinite structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "recursive_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数K理论研究环和代数结构的高阶不变量。",
      "sentence_pinyin": "Dàishù K lǐlùn yánjiū huán hé dàishù jiégòu de gāo jiē bùbiànliàng.",
      "sentence_fr": "La K-théorie algébrique étudie les invariants d'ordre supérieur des anneaux et des structures algébriques.",
      "sentence_en": "Algebraic K-theory studies higher-order invariants of rings and algebraic structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_k_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
