{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个城市的公共交通系统非常便利，可以轻松到达任何地方。",
      "sentence_pinyin": "Zhège chéngshì de gōnggòng jiāotōng xìtǒng fēicháng biànlì, kěyǐ qīngsōng dàodá rènhé dìfang.",
      "sentence_fr": "Le système de transport public de cette ville est très pratique, on peut facilement se rendre n'importe où.",
      "sentence_en": "The public transportation system in this city is very convenient, you can easily reach anywhere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "transportation",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的父母都是大学教授，从小就重视他的教育培养。",
      "sentence_pinyin": "Tā de fùmǔ dōu shì dàxué jiàoshòu, cóngxiǎo jiù zhòngshì tā de jiàoyù péiyǎng.",
      "sentence_fr": "Ses parents sont tous deux professeurs d'université et ont toujours accordé de l'importance à son éducation.",
      "sentence_en": "His parents are both university professors and have valued his education since childhood.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家面包店的糕点种类丰富，而且味道特别正宗。",
      "sentence_pinyin": "Zhè jiā miànbāodiàn de gāodiǎn zhǒnglèi fēngfù, érqiě wèidào tèbié zhèngzōng.",
      "sentence_fr": "Cette boulangerie offre une grande variété de pâtisseries au goût particulièrement authentique.",
      "sentence_en": "This bakery offers a rich variety of pastries with especially authentic taste.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她用业余时间学习了摄影技术，现在已经能拍出专业水准的作品。",
      "sentence_pinyin": "Tā yòng yèyú shíjiān xuéxíle shèyǐng jìshù, xiànzài yǐjīng néng pāi chū zhuānyè shuǐzhǔn de zuòpǐn.",
      "sentence_fr": "Elle a appris la photographie pendant son temps libre et peut maintenant produire des œuvres de niveau professionnel.",
      "sentence_en": "She learned photography in her spare time and can now produce professional-level works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hobbies",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这次培训课程让我掌握了许多实用的工作技能和方法。",
      "sentence_pinyin": "Zhè cì péixùn kèchéng ràng wǒ zhǎngwòle xǔduō shíyòng de gōngzuò jìnéng hé fāngfǎ.",
      "sentence_fr": "Ce cours de formation m'a permis de maîtriser de nombreuses compétences et méthodes de travail pratiques.",
      "sentence_en": "This training course allowed me to master many practical work skills and methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医生建议他要定期检查身体，及时发现和预防疾病。",
      "sentence_pinyin": "Yīshēng jiànyì tā yào dìngqī jiǎnchá shēntǐ, jíshí fāxiàn hé yùfáng jíbìng.",
      "sentence_fr": "Le médecin lui conseille de faire des examens médicaux réguliers pour détecter et prévenir les maladies à temps.",
      "sentence_en": "The doctor advises him to have regular medical checkups to detect and prevent diseases in time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地区的房价在过去几年里上涨得非常快。",
      "sentence_pinyin": "Zhège dìqū de fángjià zài guòqù jǐ nián lǐ shàngzhǎng de fēicháng kuài.",
      "sentence_fr": "Les prix de l'immobilier dans cette région ont augmenté très rapidement ces dernières années.",
      "sentence_en": "Housing prices in this area have risen very rapidly in the past few years.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "real_estate",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在演讲中分享了自己创业成功的经验和教训。",
      "sentence_pinyin": "Tā zài yǎnjiǎng zhōng fēnxiǎngle zìjǐ chuàngyè chénggōng de jīngyàn hé jiàoxun.",
      "sentence_fr": "Dans son discours, il a partagé son expérience et les leçons tirées de son succès entrepreneurial.",
      "sentence_en": "In his speech, he shared his experience and lessons from his successful entrepreneurship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片深入探讨了海洋生态环境保护的重要性。",
      "sentence_pinyin": "Zhè bù jìlùpiàn shēnrù tàntǎole hǎiyáng shēngtài huánjìng bǎohù de zhòngyàoxìng.",
      "sentence_fr": "Ce documentaire explore en profondeur l'importance de la protection de l'écosystème marin.",
      "sentence_en": "This documentary deeply explores the importance of marine ecosystem protection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的绘画作品充满了想象力，展现出独特的艺术风格。",
      "sentence_pinyin": "Tā de huìhuà zuòpǐn chōngmǎnle xiǎngxiànglì, zhǎnxiàn chū dútè de yìshù fēnggé.",
      "sentence_fr": "Ses peintures sont pleines d'imagination et présentent un style artistique unique.",
      "sentence_en": "Her paintings are full of imagination and showcase a unique artistic style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线课程的内容丰富实用，深受学员们的欢迎。",
      "sentence_pinyin": "Zhège zàixiàn kèchéng de nèiróng fēngfù shíyòng, shēn shòu xuéyuánmen de huānyíng.",
      "sentence_fr": "Le contenu de ce cours en ligne est riche et pratique, très apprécié des étudiants.",
      "sentence_en": "The content of this online course is rich and practical, very popular among students.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们计划在退休后搬到海边小城安度晚年。",
      "sentence_pinyin": "Tāmen jìhuà zài tuìxiū hòu bān dào hǎibiān xiǎo chéng āndù wǎnnián.",
      "sentence_fr": "Ils prévoient de déménager dans une petite ville côtière après leur retraite pour y passer leurs vieux jours.",
      "sentence_en": "They plan to move to a small coastal town after retirement to spend their later years peacefully.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "life_planning",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家公司注重员工的职业发展，提供了很多培训机会。",
      "sentence_pinyin": "Zhè jiā gōngsī zhùzhòng yuángōng de zhíyè fāzhǎn, tígōngle hěn duō péixùn jīhuì.",
      "sentence_fr": "Cette entreprise accorde de l'importance au développement professionnel des employés et offre de nombreuses opportunités de formation.",
      "sentence_en": "This company values employees' career development and provides many training opportunities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "春天来了，公园里的樱花树开满了粉红色的花朵。",
      "sentence_pinyin": "Chūntiān lái le, gōngyuán lǐ de yīnghuā shù kāi mǎnle fěnhóngsè de huāduǒ.",
      "sentence_fr": "Le printemps est arrivé, les cerisiers du parc sont couverts de fleurs roses.",
      "sentence_en": "Spring has come, the cherry trees in the park are full of pink blossoms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nature",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在比赛中发挥出色，为球队赢得了宝贵的胜利。",
      "sentence_pinyin": "Tā zài bǐsài zhōng fāhuī chūsè, wèi qiúduì yíngdéle bǎoguì de shènglì.",
      "sentence_fr": "Il a excellé lors du match et a remporté une précieuse victoire pour l'équipe.",
      "sentence_en": "He performed excellently in the match and won a valuable victory for the team.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sports",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个手机应用可以帮助用户管理日常开支和制定预算。",
      "sentence_pinyin": "Zhège shǒujī yìngyòng kěyǐ bāngzhù yònghù guǎnlǐ rìcháng kāizhī hé zhìdìng yùsuàn.",
      "sentence_fr": "Cette application mobile peut aider les utilisateurs à gérer leurs dépenses quotidiennes et établir un budget.",
      "sentence_en": "This mobile app can help users manage daily expenses and set budgets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在工作之余还坚持学习外语，提升自己的竞争力。",
      "sentence_pinyin": "Tā zài gōngzuò zhī yú hái jiānchí xuéxí wàiyǔ, tíshēng zìjǐ de jìngzhēnglì.",
      "sentence_fr": "En dehors du travail, elle continue d'étudier des langues étrangères pour améliorer sa compétitivité.",
      "sentence_en": "Outside of work, she continues to study foreign languages to enhance her competitiveness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "self_improvement",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个历史遗迹见证了这座城市数百年的变迁和发展。",
      "sentence_pinyin": "Zhège lìshǐ yíjì jiànzhèngle zhè zuò chéngshì shù bǎi nián de biànqiān hé fāzhǎn.",
      "sentence_fr": "Ce site historique témoigne de plusieurs siècles de changements et de développement de cette ville.",
      "sentence_en": "This historical site witnesses hundreds of years of changes and development of this city.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "history",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们通过互联网平台成功地推广了自己的产品。",
      "sentence_pinyin": "Tāmen tōngguò hùliánwǎng píngtái chénggōng de tuīguǎngle zìjǐ de chǎnpǐn.",
      "sentence_fr": "Ils ont réussi à promouvoir leurs produits via des plateformes Internet.",
      "sentence_en": "They successfully promoted their products through internet platforms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这本小说的情节跌宕起伏，让读者欲罢不能。",
      "sentence_pinyin": "Zhè běn xiǎoshuō de qíngjié diēdàng qǐfú, ràng dúzhě yù bà bù néng.",
      "sentence_fr": "L'intrigue de ce roman est pleine de rebondissements et captive les lecteurs.",
      "sentence_en": "The plot of this novel is full of twists and turns, keeping readers captivated.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T16:30:00.000Z",
      "updated_at": "2025-11-20T16:30:00.000Z"
    }
  ]
}
