{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "表观遗传学研究揭示了环境因素如何在不改变DNA序列的情况下影响基因表达。",
      "sentence_pinyin": "Biǎoguān yíchuánxué yánjiū jiēshìle huánjìng yīnsù rúhé zài bù gǎibiàn DNA xùliè de qíngkuàng xià yǐngxiǎng jīyīn biǎodá.",
      "sentence_fr": "La recherche en épigénétique révèle comment les facteurs environnementaux influencent l'expression génétique sans modifier la séquence ADN.",
      "sentence_en": "Epigenetics research reveals how environmental factors influence gene expression without altering the DNA sequence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epigenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会企业家精神将商业策略与解决社会问题的使命结合起来创造可持续影响。",
      "sentence_pinyin": "Shèhuì qǐyèjiā jīngshén jiāng shāngyè cèlüè yǔ jiějué shèhuì wèntí de shǐmìng jiéhé qǐlái chuàngzào kě chíxù yǐngxiǎng.",
      "sentence_fr": "L'entrepreneuriat social combine les stratégies commerciales avec une mission de résolution des problèmes sociaux pour créer un impact durable.",
      "sentence_en": "Social entrepreneurship combines business strategies with a mission to solve social problems to create sustainable impact.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_entrepreneurship",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式账本技术正在金融行业之外的供应链管理和医疗记录领域得到应用。",
      "sentence_pinyin": "Fēnbùshì zhàngběn jìshù zhèngzài jīnróng hángyè zhīwài de gōngyìng liàn guǎnlǐ hé yīliáo jìlù lǐngyù dédào yìngyòng.",
      "sentence_fr": "La technologie des registres distribués trouve des applications dans la gestion de la chaîne d'approvisionnement et les dossiers médicaux au-delà du secteur financier.",
      "sentence_en": "Distributed ledger technology is finding applications in supply chain management and medical records beyond the financial industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_ledger",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市热岛效应导致大城市中心区域的温度比周围郊区高出数度。",
      "sentence_pinyin": "Chéngshì rèdǎo xiàoyìng dǎozhì dà chéngshì zhōngxīn qūyù de wēndù bǐ zhōuwéi jiāoqū gāo chū shù dù.",
      "sentence_fr": "L'effet d'îlot de chaleur urbain fait que les températures dans les centres des grandes villes sont plusieurs degrés plus élevées que dans les banlieues environnantes.",
      "sentence_en": "The urban heat island effect causes temperatures in large city centers to be several degrees higher than surrounding suburbs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_heat_island",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知负荷理论为设计有效的教学材料提供了重要的心理学框架。",
      "sentence_pinyin": "Rènzhī fùhè lǐlùn wèi shèjì yǒuxiào de jiàoxué cáiliào tígōngle zhòngyào de xīnlǐxué kuàngjià.",
      "sentence_fr": "La théorie de la charge cognitive fournit un cadre psychologique important pour concevoir des supports pédagogiques efficaces.",
      "sentence_en": "Cognitive load theory provides an important psychological framework for designing effective instructional materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_load_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光遗传学技术使研究人员能够用光信号精确控制特定神经元的活动。",
      "sentence_pinyin": "Guāng yíchuánxué jìshù shǐ yánjiū rényuán nénggòu yòng guāng xìnhào jīngquè kòngzhì tèdìng shénjīng yuán de huódòng.",
      "sentence_fr": "La technologie optogénétique permet aux chercheurs de contrôler précisément l'activité de neurones spécifiques avec des signaux lumineux.",
      "sentence_en": "Optogenetics technology allows researchers to precisely control the activity of specific neurons with light signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optogenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "叙事经济学研究大众故事和叙事如何影响经济决策和市场波动。",
      "sentence_pinyin": "Xùshì jīngjìxué yánjiū dàzhòng gùshì hé xùshì rúhé yǐngxiǎng jīngjì juécè hé shìchǎng bōdòng.",
      "sentence_fr": "L'économie narrative étudie comment les histoires populaires et les récits influencent les décisions économiques et les fluctuations du marché.",
      "sentence_en": "Narrative economics studies how popular stories and narratives influence economic decisions and market fluctuations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳捕获与封存技术被认为是减少工业温室气体排放的重要手段之一。",
      "sentence_pinyin": "Tàn bǔhuò yǔ fēngcún jìshù bèi rènwéi shì jiǎnshǎo gōngyè wēnshì qìtǐ páifàng de zhòngyào shǒuduàn zhī yī.",
      "sentence_fr": "La technologie de capture et stockage du carbone est considérée comme l'un des moyens importants de réduire les émissions industrielles de gaz à effet de serre.",
      "sentence_en": "Carbon capture and storage technology is considered one of the important means to reduce industrial greenhouse gas emissions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_capture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多模态学习分析结合文本、视频和传感器数据来全面了解学生的学习过程。",
      "sentence_pinyin": "Duō mótài xuéxí fēnxī jiéhé wénběn, shìpín hé chuángǎnqì shùjù lái quánmiàn liǎojiě xuéshēng de xuéxí guòchéng.",
      "sentence_fr": "L'analyse d'apprentissage multimodale combine des données textuelles, vidéo et de capteurs pour comprendre de manière globale le processus d'apprentissage des étudiants.",
      "sentence_en": "Multimodal learning analytics combines text, video, and sensor data to comprehensively understand students' learning processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multimodal_learning_analytics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微生物组研究正在改变我们对人体健康与肠道细菌关系的理解。",
      "sentence_pinyin": "Wēishēngwù zǔ yánjiū zhèngzài gǎibiàn wǒmen duì réntǐ jiànkāng yǔ chángdào xìjūn guānxì de lǐjiě.",
      "sentence_fr": "La recherche sur le microbiome transforme notre compréhension de la relation entre la santé humaine et les bactéries intestinales.",
      "sentence_en": "Microbiome research is changing our understanding of the relationship between human health and gut bacteria.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microbiome_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识证明允许一方向另一方证明某声明为真而无需透露任何其他信息。",
      "sentence_pinyin": "Líng zhīshi zhèngmíng yǔnxǔ yī fāng xiàng lìng yī fāng zhèngmíng mǒu shēngmíng wéi zhēn ér wúxū tòulù rènhé qítā xìnxī.",
      "sentence_fr": "Les preuves à connaissance nulle permettent à une partie de prouver à une autre qu'une déclaration est vraie sans révéler aucune autre information.",
      "sentence_en": "Zero-knowledge proofs allow one party to prove to another that a statement is true without revealing any other information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_knowledge_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经可塑性研究表明大脑终身保持适应和重组神经连接的能力。",
      "sentence_pinyin": "Shénjīng kěsùxìng yánjiū biǎomíng dànǎo zhōngshēn bǎochí shìyìng hé chóngzǔ shénjīng liánjiē de nénglì.",
      "sentence_fr": "La recherche sur la neuroplasticité montre que le cerveau conserve la capacité de s'adapter et de réorganiser ses connexions neuronales tout au long de la vie.",
      "sentence_en": "Neuroplasticity research shows that the brain retains the ability to adapt and reorganize neural connections throughout life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroplasticity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行为金融学研究心理偏见和认知错误如何导致非理性的投资决策。",
      "sentence_pinyin": "Xíngwéi jīnróngxué yánjiū xīnlǐ piānjiàn hé rènzhī cuòwù rúhé dǎozhì fēi lǐxìng de tóuzī juécè.",
      "sentence_fr": "La finance comportementale étudie comment les biais psychologiques et les erreurs cognitives conduisent à des décisions d'investissement irrationnelles.",
      "sentence_en": "Behavioral finance studies how psychological biases and cognitive errors lead to irrational investment decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "behavioral_finance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋酸化正在威胁珊瑚礁生态系统以及依赖碳酸钙外壳的海洋生物。",
      "sentence_pinyin": "Hǎiyáng suānhuà zhèngzài wēixié shānhú jiāo shēngtài xìtǒng yǐjí yīlài tànsuān gài wàiké de hǎiyáng shēngwù.",
      "sentence_fr": "L'acidification des océans menace les écosystèmes des récifs coralliens ainsi que les organismes marins qui dépendent de coquilles de carbonate de calcium.",
      "sentence_en": "Ocean acidification is threatening coral reef ecosystems and marine organisms that depend on calcium carbonate shells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ocean_acidification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量化自我运动鼓励人们通过可穿戴设备追踪和分析个人健康数据。",
      "sentence_pinyin": "Liànghuà zìwǒ yùndòng gǔlì rénmen tōngguò kě chuāndài shèbèi zhuīzōng hé fēnxī gèrén jiànkāng shùjù.",
      "sentence_fr": "Le mouvement du soi quantifié encourage les gens à suivre et analyser leurs données de santé personnelles via des appareils portables.",
      "sentence_en": "The quantified self movement encourages people to track and analyze personal health data through wearable devices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantified_self",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言人类学探索语言如何塑造文化身份和社会关系的复杂动态。",
      "sentence_pinyin": "Yǔyán rénlèixué tànsuǒ yǔyán rúhé sùzào wénhuà shēnfèn hé shèhuì guānxì de fùzá dòngtài.",
      "sentence_fr": "L'anthropologie linguistique explore les dynamiques complexes de la façon dont la langue façonne l'identité culturelle et les relations sociales.",
      "sentence_en": "Linguistic anthropology explores the complex dynamics of how language shapes cultural identity and social relationships.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "linguistic_anthropology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联邦学习使机器学习模型能够在保护数据隐私的同时进行分布式训练。",
      "sentence_pinyin": "Liánbāng xuéxí shǐ jīqì xuéxí móxíng nénggòu zài bǎohù shùjù yǐnsī de tóngshí jìnxíng fēnbùshì xùnliàn.",
      "sentence_fr": "L'apprentissage fédéré permet aux modèles d'apprentissage automatique d'être entraînés de manière distribuée tout en protégeant la confidentialité des données.",
      "sentence_en": "Federated learning enables machine learning models to be trained in a distributed manner while protecting data privacy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "federated_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市农业正在将屋顶、垂直农场和社区花园转变为本地食物生产中心。",
      "sentence_pinyin": "Chéngshì nóngyè zhèngzài jiāng wūdǐng, chuízhí nóngchǎng hé shèqū huāyuán zhuǎnbiàn wéi běndì shíwù shēngchǎn zhōngxīn.",
      "sentence_fr": "L'agriculture urbaine transforme les toits, les fermes verticales et les jardins communautaires en centres de production alimentaire locale.",
      "sentence_en": "Urban agriculture is transforming rooftops, vertical farms, and community gardens into local food production centers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "深度强化学习算法已经在围棋和电子游戏等领域超越了人类专家水平。",
      "sentence_pinyin": "Shēndù qiánghuà xuéxí suànfǎ yǐjīng zài wéiqí hé diànzǐ yóuxì děng lǐngyù chāoyuèle rénlèi zhuānjiā shuǐpíng.",
      "sentence_fr": "Les algorithmes d'apprentissage par renforcement profond ont dépassé le niveau des experts humains dans des domaines comme le Go et les jeux vidéo.",
      "sentence_en": "Deep reinforcement learning algorithms have surpassed human expert level in domains such as Go and video games.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deep_reinforcement_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会资本理论认为人际关系网络是一种可以产生经济和社会效益的资源。",
      "sentence_pinyin": "Shèhuì zīběn lǐlùn rènwéi rénjì guānxì wǎngluò shì yī zhǒng kěyǐ chǎnshēng jīngjì hé shèhuì xiàoyì de zīyuán.",
      "sentence_fr": "La théorie du capital social considère que les réseaux de relations interpersonnelles sont une ressource pouvant générer des bénéfices économiques et sociaux.",
      "sentence_en": "Social capital theory holds that interpersonal relationship networks are a resource that can generate economic and social benefits.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_capital_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
