{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能门锁支持指纹、密码和人脸识别三种开锁方式,安全性很高。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng ménsuǒ zhīchí zhǐwén, mìmǎ hé rénliǎn shìbié sān zhǒng kāisuǒ fāngshì, ānquánxìng hěn gāo.",
      "sentence_fr": "Cette serrure intelligente prend en charge trois méthodes de déverrouillage : empreinte digitale, mot de passe et reconnaissance faciale, offrant une sécurité élevée.",
      "sentence_en": "This smart lock supports three unlocking methods: fingerprint, password, and facial recognition, providing high security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_locks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古琴是中国最古老的弹拨乐器之一,音色深沉悠远,富有禅意。",
      "sentence_pinyin": "Gǔqín shì Zhōngguó zuì gǔlǎo de tánbō yuèqì zhī yī, yīnsè shēnchén yōuyuǎn, fùyǒu chányì.",
      "sentence_fr": "Le guqin est l'un des plus anciens instruments à cordes pincées de Chine, avec un timbre profond et lointain, empreint de spiritualité zen.",
      "sentence_en": "The guqin is one of China's oldest plucked string instruments, with a deep and distant tone full of Zen spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市垃圾分类政策实施以来,居民的环保意识明显提高了。",
      "sentence_pinyin": "Chéngshì lājī fēnlèi zhèngcè shíshī yǐlái, jūmín de huánbǎo yìshí míngxiǎn tígāo le.",
      "sentence_fr": "Depuis la mise en œuvre de la politique de tri des déchets urbains, la conscience environnementale des résidents s'est nettement améliorée.",
      "sentence_en": "Since the implementation of urban waste sorting policies, residents' environmental awareness has significantly improved.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这幅蜀绣作品以金鱼戏水为题材,针法细腻,栩栩如生。",
      "sentence_pinyin": "Zhè fú Shǔxiù zuòpǐn yǐ jīnyú xì shuǐ wéi tícái, zhēnfǎ xìnì, xǔxǔ rú shēng.",
      "sentence_fr": "Cette œuvre de broderie du Sichuan représente des poissons rouges jouant dans l'eau, avec des points délicats et un réalisme saisissant.",
      "sentence_en": "This Shu embroidery work depicts goldfish playing in water, with delicate stitching and lifelike realism.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shu_embroidery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能养老系统可以实时监测老人的健康状况,并在紧急情况下自动报警。",
      "sentence_pinyin": "Zhìnéng yǎnglǎo xìtǒng kěyǐ shíshí jiāncè lǎorén de jiànkāng zhuàngkuàng, bìng zài jǐnjí qíngkuàng xià zìdòng bàojǐng.",
      "sentence_fr": "Le système de soins aux personnes âgées intelligent peut surveiller en temps réel l'état de santé des seniors et déclencher automatiquement une alarme en cas d'urgence.",
      "sentence_en": "The smart elderly care system can monitor seniors' health conditions in real-time and automatically trigger an alarm in emergencies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_elderly_care",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙是中国传统的簧片乐器,能够同时演奏多个音符,形成和声效果。",
      "sentence_pinyin": "Shēng shì Zhōngguó chuántǒng de huángpiàn yuèqì, nénggòu tóngshí yǎnzòu duō gè yīnfú, xíngchéng héshēng xiàoguǒ.",
      "sentence_fr": "Le sheng est un instrument à anche traditionnel chinois, capable de jouer plusieurs notes simultanément pour créer des effets harmoniques.",
      "sentence_en": "The sheng is a traditional Chinese reed instrument, capable of playing multiple notes simultaneously to create harmonic effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区图书馆不仅提供图书借阅服务,还定期举办读书会和文化活动。",
      "sentence_pinyin": "Zhège shèqū túshūguǎn bùjǐn tígōng túshū jièyuè fúwù, hái dìngqī jǔbàn dúshūhuì hé wénhuà huódòng.",
      "sentence_fr": "Cette bibliothèque communautaire offre non seulement des services de prêt de livres, mais organise aussi régulièrement des clubs de lecture et des activités culturelles.",
      "sentence_en": "This community library not only provides book lending services but also regularly hosts reading clubs and cultural activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_libraries",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能净水器可以根据水质自动调节过滤强度,确保饮用水的安全。",
      "sentence_pinyin": "Zhìnéng jìngshuǐqì kěyǐ gēnjù shuǐzhì zìdòng tiáojié guòlǜ qiángdù, quèbǎo yǐnyòng shuǐ de ānquán.",
      "sentence_fr": "Le purificateur d'eau intelligent peut ajuster automatiquement l'intensité de filtration selon la qualité de l'eau, garantissant la sécurité de l'eau potable.",
      "sentence_en": "The smart water purifier can automatically adjust filtration intensity based on water quality, ensuring drinking water safety.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_purifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐是中国民间最常见的吹奏乐器,音色嘹亮,常用于婚丧嫁娶等仪式。",
      "sentence_pinyin": "Suǒnà shì Zhōngguó mínjiān zuì chángjiàn de chuīzòu yuèqì, yīnsè liáoliàng, cháng yòng yú hūnsāng jiàqǔ děng yíshì.",
      "sentence_fr": "La suona est l'instrument à vent le plus courant dans la musique populaire chinoise, avec un son retentissant, souvent utilisé lors de cérémonies comme les mariages et les funérailles.",
      "sentence_en": "The suona is the most common wind instrument in Chinese folk music, with a bright and piercing sound, often used in ceremonies like weddings and funerals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海绵城市建设通过增加透水铺装和雨水花园来缓解城市内涝问题。",
      "sentence_pinyin": "Hǎimián chéngshì jiànshè tōngguò zēngjiā tòushuǐ pūzhuāng hé yǔshuǐ huāyuán lái huǎnjiě chéngshì nèilào wèntí.",
      "sentence_fr": "La construction de villes-éponges atténue les problèmes d'inondation urbaine en augmentant les revêtements perméables et les jardins de pluie.",
      "sentence_en": "Sponge city construction alleviates urban waterlogging problems by increasing permeable pavements and rain gardens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sponge_cities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这件景泰蓝花瓶采用传统掐丝珐琅工艺,色彩鲜艳,图案精美。",
      "sentence_pinyin": "Zhè jiàn jǐngtàilán huāpíng cǎiyòng chuántǒng qiāsī fàláng gōngyì, sècǎi xiānyàn, tú'àn jīngměi.",
      "sentence_fr": "Ce vase en cloisonné utilise la technique traditionnelle de l'émail cloisonné, avec des couleurs vives et des motifs exquis.",
      "sentence_en": "This cloisonné vase uses traditional wire-inlaid enamel craftsmanship, with vibrant colors and exquisite patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloisonne_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能扫地机器人可以自动规划清扫路线,清洁完成后自动返回充电。",
      "sentence_pinyin": "Zhìnéng sǎodì jīqìrén kěyǐ zìdòng guīhuà qīngsǎo lùxiàn, qīngjié wánchéng hòu zìdòng fǎnhuí chōngdiàn.",
      "sentence_fr": "Le robot aspirateur intelligent peut planifier automatiquement son itinéraire de nettoyage et retourner se recharger une fois le travail terminé.",
      "sentence_en": "The smart vacuum robot can automatically plan its cleaning route and return to charge after completing the cleaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_vacuum_robots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "扬琴是中国民族乐队中常见的打击弦乐器,音域宽广,表现力丰富。",
      "sentence_pinyin": "Yángqín shì Zhōngguó mínzú yuèduì zhōng chángjiàn de dǎjī xián yuèqì, yīnyù kuānguǎng, biǎoxiànlì fēngfù.",
      "sentence_fr": "Le yangqin est un instrument à cordes frappées courant dans les orchestres folkloriques chinois, avec une large tessiture et une riche expressivité.",
      "sentence_en": "The yangqin is a struck string instrument common in Chinese folk orchestras, with a wide range and rich expressiveness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangqin_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农村电商服务站帮助当地农民在网上销售农产品,增加了他们的收入。",
      "sentence_pinyin": "Zhège nóngcūn diànshāng fúwùzhàn bāngzhù dāngdì nóngmín zài wǎngshàng xiāoshòu nóngchǎnpǐn, zēngjiā le tāmen de shōurù.",
      "sentence_fr": "Ce centre de services e-commerce rural aide les agriculteurs locaux à vendre leurs produits agricoles en ligne, augmentant leurs revenus.",
      "sentence_en": "This rural e-commerce service station helps local farmers sell agricultural products online, increasing their income.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_ecommerce",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能晾衣架可以根据天气自动升降,遇到下雨还会自动收回衣物。",
      "sentence_pinyin": "Zhìnéng liàngyījià kěyǐ gēnjù tiānqì zìdòng shēngjiàng, yùdào xiàyǔ hái huì zìdòng shōuhuí yīwù.",
      "sentence_fr": "Le séchoir à linge intelligent peut automatiquement monter et descendre selon la météo, et rentrer automatiquement les vêtements quand il pleut.",
      "sentence_en": "The smart drying rack can automatically raise and lower based on weather, and automatically retract clothes when it rains.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_drying_racks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "皮影戏是中国传统民间艺术,艺人操纵皮影在灯光下表演故事。",
      "sentence_pinyin": "Píyǐngxì shì Zhōngguó chuántǒng mínjiān yìshù, yìrén cāozòng píyǐng zài dēngguāng xià biǎoyǎn gùshì.",
      "sentence_fr": "Le théâtre d'ombres est un art populaire traditionnel chinois où les artistes manipulent des figurines en cuir pour raconter des histoires sous la lumière.",
      "sentence_en": "Shadow puppetry is a traditional Chinese folk art where artists manipulate leather puppets to perform stories under light.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shadow_puppetry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能门铃可以实时查看门外访客,还能通过手机远程与访客对话。",
      "sentence_pinyin": "Zhìnéng ménlíng kěyǐ shíshí chákàn mén wài fǎngkè, hái néng tōngguò shǒujī yuǎnchéng yǔ fǎngkè duìhuà.",
      "sentence_fr": "La sonnette intelligente permet de voir les visiteurs en temps réel et de communiquer avec eux à distance via smartphone.",
      "sentence_en": "The smart doorbell allows real-time viewing of visitors outside and remote communication with them through a smartphone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_doorbells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位二胡演奏家用精湛的技艺演绎了一首悲伤的民间曲调。",
      "sentence_pinyin": "Zhè wèi èrhú yǎnzòujiā yòng jīngzhàn de jìyì yǎnyì le yī shǒu bēishāng de mínjiān qǔdiào.",
      "sentence_fr": "Ce joueur d'erhu a interprété une mélodie folklorique mélancolique avec une technique magistrale.",
      "sentence_en": "This erhu performer interpreted a melancholic folk tune with masterful technique.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的数字人民币试点项目在多个城市取得了良好效果。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de shùzì rénmínbì shìdiǎn xiàngmù zài duō gè chéngshì qǔdé le liánghǎo xiàoguǒ.",
      "sentence_fr": "Le projet pilote de yuan numérique lancé par le gouvernement a obtenu de bons résultats dans plusieurs villes.",
      "sentence_en": "The digital yuan pilot project launched by the government has achieved good results in multiple cities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_currency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能空气炸锅可以通过手机应用远程控制,还能推荐健康食谱。",
      "sentence_pinyin": "Zhìnéng kōngqì zhàguō kěyǐ tōngguò shǒujī yìngyòng yuǎnchéng kòngzhì, hái néng tuījiàn jiànkāng shípǔ.",
      "sentence_fr": "La friteuse à air intelligent peut être contrôlée à distance via une application mobile et recommande également des recettes saines.",
      "sentence_en": "The smart air fryer can be remotely controlled through a mobile app and can also recommend healthy recipes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_fryers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
