{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能燃气表可以实时监测燃气使用量,在检测到泄漏时自动关闭阀门。",
      "sentence_pinyin": "Zhège zhìnéng ránqìbiǎo kěyǐ shíshí jiāncè ránqì shǐyòngliàng, zài jiǎncè dào xièlòu shí zìdòng guānbì fámén.",
      "sentence_fr": "Ce compteur de gaz intelligent peut surveiller la consommation en temps réel et fermer automatiquement la vanne en cas de fuite.",
      "sentence_en": "This smart gas meter can monitor gas usage in real-time and automatically shut off the valve when detecting a leak.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_gas_meters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "朝鲜族的长鼓舞是中国东北地区著名的传统舞蹈艺术。",
      "sentence_pinyin": "Cháoxiǎnzú de chánggǔwǔ shì Zhōngguó dōngběi dìqū zhùmíng de chuántǒng wǔdǎo yìshù.",
      "sentence_fr": "La danse du tambour long de l'ethnie coréenne est un art de danse traditionnel célèbre du nord-est de la Chine.",
      "sentence_en": "The Korean ethnic group's long drum dance is a famous traditional dance art in Northeast China.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "long_drum_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的口袋公园虽然面积不大,但为附近居民提供了休憩空间。",
      "sentence_pinyin": "Chéngshì de kǒudài gōngyuán suīrán miànjī bù dà, dàn wèi fùjìn jūmín tígōng le xiūqì kōngjiān.",
      "sentence_fr": "Bien que petits en superficie, les parcs de poche urbains offrent aux résidents des espaces de repos.",
      "sentence_en": "Although small in area, urban pocket parks provide rest spaces for nearby residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pocket_parks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能腰部按摩仪可以通过热敷和振动缓解腰部酸痛。",
      "sentence_pinyin": "Zhìnéng yāobù ànmóyí kěyǐ tōngguò rèfū hé zhèndòng huǎnjiě yāobù suāntòng.",
      "sentence_fr": "Le masseur lombaire intelligent peut soulager les douleurs lombaires par la chaleur et les vibrations.",
      "sentence_en": "The smart waist massager can relieve lower back soreness through heat compression and vibration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_waist_massagers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的春联书写是春节期间的重要民俗活动之一。",
      "sentence_pinyin": "Zhōngguó chuántǒng de chūnlián shūxiě shì Chūnjié qījiān de zhòngyào mínsú huódòng zhī yī.",
      "sentence_fr": "L'écriture traditionnelle chinoise des couplets de printemps est l'une des activités folkloriques importantes pendant le Nouvel An chinois.",
      "sentence_en": "Traditional Chinese spring couplet writing is one of the important folk activities during the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "spring_couplets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能煮蛋器可以根据个人口味煮出不同熟度的鸡蛋。",
      "sentence_pinyin": "Zhìnéng zhǔdànqì kěyǐ gēnjù gèrén kǒuwèi zhǔchū bùtóng shúdù de jīdàn.",
      "sentence_fr": "Le cuiseur à œufs intelligent peut cuire des œufs à différents degrés de cuisson selon les goûts personnels.",
      "sentence_en": "The smart egg cooker can cook eggs to different doneness levels based on personal taste.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_egg_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "傣族的孔雀舞以优美的舞姿展现孔雀的神态和动作。",
      "sentence_pinyin": "Dǎizú de kǒngquèwǔ yǐ yōuměi de wǔzī zhǎnxiàn kǒngquè de shéntài hé dòngzuò.",
      "sentence_fr": "La danse du paon de l'ethnie Dai présente l'allure et les mouvements du paon à travers des poses gracieuses.",
      "sentence_en": "The Dai ethnic group's peacock dance displays the peacock's demeanor and movements through graceful poses.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "peacock_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推行的医疗救助政策帮助困难群众解决了看病难的问题。",
      "sentence_pinyin": "Zhèngfǔ tuīxíng de yīliáo jiùzhù zhèngcè bāngzhù kùnnán qúnzhòng jiějué le kànbìng nán de wèntí.",
      "sentence_fr": "La politique d'aide médicale promue par le gouvernement a aidé les personnes en difficulté à résoudre leurs problèmes d'accès aux soins.",
      "sentence_en": "The government's medical assistance policy has helped people in difficulty solve the problem of accessing medical care.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_assistance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电热毯可以根据体温自动调节温度,使用更加安全。",
      "sentence_pinyin": "Zhìnéng diànrètǎn kěyǐ gēnjù tǐwēn zìdòng tiáojié wēndù, shǐyòng gèngjiā ānquán.",
      "sentence_fr": "La couverture chauffante intelligente peut ajuster automatiquement la température selon la température corporelle, pour une utilisation plus sûre.",
      "sentence_en": "The smart electric blanket can automatically adjust temperature based on body temperature, making it safer to use.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_electric_blankets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的窗花剪纸是装饰春节窗户的常见民间艺术。",
      "sentence_pinyin": "Zhōngguó chuántǒng de chuānghuā jiǎnzhǐ shì zhuāngshì Chūnjié chuānghù de chángjiàn mínjiān yìshù.",
      "sentence_fr": "Le papier découpé traditionnel chinois pour les fenêtres est un art populaire courant pour décorer les fenêtres pendant le Nouvel An.",
      "sentence_en": "Traditional Chinese window paper-cutting is a common folk art for decorating windows during the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "window_paper_cutting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能牙刷消毒器可以用紫外线杀灭牙刷上的细菌。",
      "sentence_pinyin": "Zhìnéng yáshuā xiāodúqì kěyǐ yòng zǐwàixiàn shāmiè yáshuā shàng de xìjūn.",
      "sentence_fr": "Le stérilisateur de brosse à dents intelligent peut éliminer les bactéries sur la brosse à dents par rayons UV.",
      "sentence_en": "The smart toothbrush sterilizer can kill bacteria on toothbrushes using ultraviolet light.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toothbrush_sterilizers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土家族的摆手舞是湘西地区独特的集体舞蹈形式。",
      "sentence_pinyin": "Tǔjiāzú de bǎishǒuwǔ shì Xiāngxī dìqū dútè de jítǐ wǔdǎo xíngshì.",
      "sentence_fr": "La danse de la main de l'ethnie Tujia est une forme unique de danse collective de la région de Xiangxi.",
      "sentence_en": "The Tujia ethnic group's hand-waving dance is a unique collective dance form in the Xiangxi region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hand_waving_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的空中连廊连接了多栋建筑,方便行人在雨天出行。",
      "sentence_pinyin": "Chéngshì de kōngzhōng liánláng liánjiē le duō dòng jiànzhù, fāngbiàn xíngrén zài yǔtiān chūxíng.",
      "sentence_fr": "Les passerelles aériennes de la ville relient plusieurs bâtiments, facilitant les déplacements des piétons par temps de pluie.",
      "sentence_en": "Urban sky bridges connect multiple buildings, making it convenient for pedestrians to travel on rainy days.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sky_bridges",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能除湿盒可以吸收衣柜中的湿气,保护衣物不发霉。",
      "sentence_pinyin": "Zhìnéng chúshīhé kěyǐ xīshōu yīguì zhōng de shīqì, bǎohù yīwù bù fāméi.",
      "sentence_fr": "Le déshumidificateur intelligent peut absorber l'humidité de l'armoire, protégeant les vêtements de la moisissure.",
      "sentence_en": "The smart dehumidifier box can absorb moisture in wardrobes, protecting clothes from mold.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dehumidifier_boxes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的福字倒贴寓意福到的吉祥习俗广为流传。",
      "sentence_pinyin": "Zhōngguó chuántǒng de fúzì dàotiē yùyì fú dào de jíxiáng xísú guǎngwéi liúchuán.",
      "sentence_fr": "La coutume traditionnelle chinoise de coller le caractère Fu à l'envers, symbolisant l'arrivée de la fortune, est largement répandue.",
      "sentence_en": "The traditional Chinese custom of pasting the Fu character upside down, symbolizing the arrival of good fortune, is widely practiced.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fu_character",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电动窗帘可以设定时间自动开合,模拟日出日落。",
      "sentence_pinyin": "Zhìnéng diàndòng chuānglián kěyǐ shèdìng shíjiān zìdòng kāihé, mónǐ rìchū rìluò.",
      "sentence_fr": "Les rideaux électriques intelligents peuvent être programmés pour s'ouvrir et se fermer automatiquement, simulant le lever et le coucher du soleil.",
      "sentence_en": "Smart electric curtains can be timed to automatically open and close, simulating sunrise and sunset.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_electric_curtains",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "藏族的锅庄舞是青藏高原上流传已久的集体舞蹈。",
      "sentence_pinyin": "Zàngzú de guōzhuāngwǔ shì Qīngzàng gāoyuán shàng liúchuán yǐjiǔ de jítǐ wǔdǎo.",
      "sentence_fr": "La danse Guozhuang de l'ethnie tibétaine est une danse collective transmise depuis longtemps sur le plateau Qinghai-Tibet.",
      "sentence_en": "The Tibetan ethnic group's Guozhuang dance is a collective dance that has been passed down for a long time on the Qinghai-Tibet Plateau.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guozhuang_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织的亲子活动增进了家长和孩子之间的感情。",
      "sentence_pinyin": "Shèqū zǔzhī de qīnzǐ huódòng zēngjìn le jiāzhǎng hé háizi zhījiān de gǎnqíng.",
      "sentence_fr": "Les activités parent-enfant organisées par la communauté ont renforcé les liens entre parents et enfants.",
      "sentence_en": "Parent-child activities organized by the community have strengthened the bond between parents and children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "parent_child_activities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电饼铛可以双面加热,快速制作各种饼类食品。",
      "sentence_pinyin": "Zhìnéng diànbǐngchēng kěyǐ shuāngmiàn jiārè, kuàisù zhìzuò gèzhǒng bǐnglèi shípǐn.",
      "sentence_fr": "La poêle électrique intelligente peut chauffer des deux côtés, préparant rapidement divers types de crêpes.",
      "sentence_en": "The smart electric griddle can heat on both sides, quickly making various types of flatbreads.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_griddles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的舞狮表演在节庆活动中象征着吉祥如意。",
      "sentence_pinyin": "Zhōngguó chuántǒng de wǔshī biǎoyǎn zài jiéqìng huódòng zhōng xiàngzhēng zhe jíxiáng rúyì.",
      "sentence_fr": "La danse du lion traditionnelle chinoise symbolise la bonne fortune lors des célébrations festives.",
      "sentence_en": "Traditional Chinese lion dance performances symbolize good luck and fortune during festive activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lion_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
