{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个城市的公共自行车系统配备了GPS定位和电子围栏技术,实现了规范化管理。",
      "sentence_pinyin": "Zhège chéngshì de gōnggòng zìxíngchē xìtǒng pèibèile GPS dìngwèi hé diànzǐ wéilán jìshù, shíxiànle guīfànhuà guǎnlǐ.",
      "sentence_fr": "Le système de vélos publics de cette ville est équipé de GPS et de technologie de géo-barrière électronique pour une gestion standardisée.",
      "sentence_en": "The city's public bicycle system is equipped with GPS positioning and electronic fence technology for standardized management.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_bike_systems",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柳琴音色明亮清脆,在民族乐队中主要担任高音声部的演奏。",
      "sentence_pinyin": "Liǔqín yīnsè míngliàng qīngcuì, zài mínzú yuèduì zhōng zhǔyào dānrèn gāoyīn shēngbù de yǎnzòu.",
      "sentence_fr": "Le liuqin a un son brillant et clair, jouant principalement les parties aiguës dans les orchestres traditionnels.",
      "sentence_en": "The liuqin has a bright and clear tone, mainly playing the high-pitched parts in traditional orchestras.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "liuqin_music",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精准扶贫政策通过因地制宜的帮扶措施,帮助数百万贫困人口脱贫致富。",
      "sentence_pinyin": "Jīngzhǔn fúpín zhèngcè tōngguò yīndì-zhìyí de bāngfú cuòshī, bāngzhù shù bǎi wàn pínkùn rénkǒu tuōpín zhìfù.",
      "sentence_fr": "La politique de réduction ciblée de la pauvreté a aidé des millions de personnes pauvres à sortir de la pauvreté grâce à des mesures d'assistance adaptées aux conditions locales.",
      "sentence_en": "The targeted poverty alleviation policy has helped millions of poor people escape poverty through locally adapted assistance measures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poverty_alleviation",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玉雕工艺对原料的选择和雕刻技法都有极高的要求,需要数年才能掌握。",
      "sentence_pinyin": "Yùdiāo gōngyì duì yuánliào de xuǎnzé hé diāokè jìfǎ dōu yǒu jí gāo de yāoqiú, xūyào shù nián cái néng zhǎngwò.",
      "sentence_fr": "L'art de la sculpture de jade a des exigences très élevées pour la sélection des matériaux et les techniques de sculpture, nécessitant plusieurs années de maîtrise.",
      "sentence_en": "Jade carving craftsmanship has very high requirements for material selection and carving techniques, requiring several years to master.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jade_carving",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家企业开发的语音识别系统能够准确识别多种方言和口音。",
      "sentence_pinyin": "Zhè jiā qǐyè kāifā de yǔyīn shíbié xìtǒng nénggòu zhǔnquè shíbié duō zhǒng fāngyán hé kǒuyīn.",
      "sentence_fr": "Le système de reconnaissance vocale développé par cette entreprise peut identifier avec précision plusieurs dialectes et accents.",
      "sentence_en": "The speech recognition system developed by this company can accurately identify multiple dialects and accents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "speech_recognition",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区养老中心为老年人提供了日间照料、康复训练和文娱活动。",
      "sentence_pinyin": "Zhège shèqū yǎnglǎo zhōngxīn wèi lǎoniánrén tígōngle rìjiān zhàoliào, kāngfù xùnliàn hé wényú huódòng.",
      "sentence_fr": "Ce centre de soins communautaire pour personnes âgées offre soins de jour, rééducation et activités culturelles et récréatives aux personnes âgées.",
      "sentence_en": "This community elderly care center provides day care, rehabilitation training, and cultural and recreational activities for the elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "day_care_centers",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "砚台不仅是书法绘画的实用工具,也是一件精美的艺术收藏品。",
      "sentence_pinyin": "Yàntái bùjǐn shì shūfǎ huìhuà de shíyòng gōngjù, yě shì yī jiàn jīngměi de yìshù shōucángpǐn.",
      "sentence_fr": "La pierre à encre n'est pas seulement un outil pratique pour la calligraphie et la peinture, mais aussi un bel objet d'art de collection.",
      "sentence_en": "The inkstone is not only a practical tool for calligraphy and painting but also a beautiful art collectible.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "inkstones",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个应急救援队配备了先进的搜救设备,能够快速响应各类突发事件。",
      "sentence_pinyin": "Zhège yìngjí jiùyuán duì pèibèile xiānjìn de sōujiù shèbèi, nénggòu kuàisù xiǎngyìng gè lèi tūfā shìjiàn.",
      "sentence_fr": "Cette équipe de secours d'urgence est équipée d'équipements de recherche et sauvetage avancés, capable de répondre rapidement à divers incidents soudains.",
      "sentence_en": "This emergency rescue team is equipped with advanced search and rescue equipment, able to respond quickly to various sudden incidents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "emergency_rescue",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "三弦是一种拨弦乐器,音色粗犷豪放,常用于说唱和戏曲伴奏。",
      "sentence_pinyin": "Sānxián shì yī zhǒng bōxián yuèqì, yīnsè cūguǎng háofàng, cháng yòng yú shuōchàng hé xìqǔ bànzòu.",
      "sentence_fr": "Le sanxian est un instrument à cordes pincées au son robuste et libre, souvent utilisé pour accompagner les récits chantés et les opéras.",
      "sentence_en": "The sanxian is a plucked string instrument with a robust and free-spirited tone, often used to accompany storytelling and opera performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sanxian_music",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增强现实技术在商品展示领域的应用,让消费者能够虚拟试穿试戴商品。",
      "sentence_pinyin": "Zēngqiáng xiànshí jìshù zài shāngpǐn zhǎnshì lǐngyù de yìngyòng, ràng xiāofèizhě nénggòu xūnǐ shìchuān shìdài shāngpǐn.",
      "sentence_fr": "L'application de la réalité augmentée dans la présentation de produits permet aux consommateurs d'essayer virtuellement les articles.",
      "sentence_en": "The application of augmented reality technology in product display allows consumers to virtually try on merchandise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "augmented_reality",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线医药平台为慢性病患者提供了便捷的药品配送和用药指导服务。",
      "sentence_pinyin": "Zhège zàixiàn yīyào píngtái wèi mànxìngbìng huànzhě tígōngle biànjié de yàopǐn pèisòng hé yòngyào zhǐdǎo fúwù.",
      "sentence_fr": "Cette plateforme pharmaceutique en ligne offre aux patients atteints de maladies chroniques des services pratiques de livraison de médicaments et de conseils d'utilisation.",
      "sentence_en": "This online pharmaceutical platform provides chronic disease patients with convenient medication delivery and usage guidance services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_pharmacy",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蜀绣以其精湛的技艺和独特的艺术风格,成为四大名绣之一。",
      "sentence_pinyin": "Shǔxiù yǐ qí jīngzhàn de jìyì hé dútè de yìshù fēnggé, chéngwéi sì dà míngxiù zhī yī.",
      "sentence_fr": "La broderie du Sichuan, avec ses techniques exquises et son style artistique unique, est devenue l'une des quatre grandes broderies célèbres.",
      "sentence_en": "Shu embroidery, with its exquisite craftsmanship and unique artistic style, has become one of the four famous embroideries.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shu_embroidery",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾分类智能回收站能够自动识别垃圾类型,并给予相应的积分奖励。",
      "sentence_pinyin": "Zhège lājī fēnlèi zhìnéng huíshōu zhàn nénggòu zìdòng shíbié lājī lèixíng, bìng jǐyǔ xiāngyìng de jīfēn jiǎnglì.",
      "sentence_fr": "Cette station de recyclage intelligente de tri des déchets peut identifier automatiquement les types de déchets et offrir des récompenses en points correspondantes.",
      "sentence_en": "This intelligent waste sorting recycling station can automatically identify waste types and provide corresponding point rewards.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_recycling",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中阮在民族乐队中担任中音声部,音色圆润饱满,富有表现力。",
      "sentence_pinyin": "Zhōngruǎn zài mínzú yuèduì zhōng dānrèn zhōngyīn shēngbù, yīnsè yuánrùn bǎomǎn, fùyǒu biǎoxiànlì.",
      "sentence_fr": "Le zhongruan joue la partie médium dans les orchestres traditionnels, avec un ton rond et plein, très expressif.",
      "sentence_en": "The zhongruan plays the middle voice part in traditional orchestras, with a round and full tone that is highly expressive.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhongruan_music",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创业孵化器为初创企业提供了办公场地、导师指导和资金支持。",
      "sentence_pinyin": "Zhège chuàngyè fūhuàqì wèi chūchuàng qǐyè tígōngle bàngōng chǎngdì, dǎoshī zhǐdǎo hé zījīn zhīchí.",
      "sentence_fr": "Cet incubateur d'entreprises fournit aux startups des espaces de bureau, un mentorat et un soutien financier.",
      "sentence_en": "This business incubator provides startups with office space, mentor guidance, and financial support.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business_incubators",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "紫砂壶因其透气性好、保温性强的特点,成为泡茶的最佳器具。",
      "sentence_pinyin": "Zǐshā hú yīn qí tòuqìxìng hǎo, bǎowēnxìng qiáng de tèdiǎn, chéngwéi pàochá de zuìjiā qìjù.",
      "sentence_fr": "Les théières en argile pourpre, grâce à leur bonne perméabilité à l'air et leur forte capacité d'isolation thermique, sont devenues les meilleurs ustensiles pour infuser le thé.",
      "sentence_en": "Purple clay teapots, with their good air permeability and strong heat retention, have become the best utensils for brewing tea.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "purple_clay_teapots",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧交通系统通过实时路况分析,为驾驶员推荐最优行车路线。",
      "sentence_pinyin": "Zhège zhìhuì jiāotōng xìtǒng tōngguò shíshí lùkuàng fēnxī, wèi jiàshǐyuán tuījiàn zuìyōu xíngchē lùxiàn.",
      "sentence_fr": "Ce système de transport intelligent recommande les meilleurs itinéraires de conduite aux conducteurs grâce à l'analyse en temps réel des conditions routières.",
      "sentence_en": "This intelligent transportation system recommends optimal driving routes to drivers through real-time traffic condition analysis.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "intelligent_transportation",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "石雕艺术利用石材的天然纹理和色彩,创造出具有独特美感的作品。",
      "sentence_pinyin": "Shídiāo yìshù lìyòng shícái de tiānrán wénlǐ hé sècǎi, chuàngzào chū jùyǒu dútè měigǎn de zuòpǐn.",
      "sentence_fr": "L'art de la sculpture sur pierre utilise les textures et couleurs naturelles de la pierre pour créer des œuvres d'une beauté unique.",
      "sentence_en": "Stone carving art utilizes the natural textures and colors of stone to create works with unique aesthetic beauty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stone_carving",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家社会企业通过回收废旧纺织品制作环保购物袋,既保护环境又创造就业。",
      "sentence_pinyin": "Zhè jiā shèhuì qǐyè tōngguò huíshōu fèijiù fǎngzhīpǐn zhìzuò huánbǎo gòuwùdài, jì bǎohù huánjìng yòu chuàngzào jiùyè.",
      "sentence_fr": "Cette entreprise sociale fabrique des sacs à provisions écologiques à partir de textiles usagés recyclés, protégeant l'environnement tout en créant des emplois.",
      "sentence_en": "This social enterprise makes eco-friendly shopping bags from recycled used textiles, both protecting the environment and creating employment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "textile_recycling",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高胡的音色明亮高亢,是粤剧和广东音乐中不可或缺的主奏乐器。",
      "sentence_pinyin": "Gāohú de yīnsè míngliàng gāokàng, shì Yuèjù hé Guǎngdōng yīnyuè zhōng bùkě huòquē de zhǔzòu yuèqì.",
      "sentence_fr": "Le gaohu a un son brillant et aigu, c'est un instrument principal indispensable dans l'opéra cantonais et la musique du Guangdong.",
      "sentence_en": "The gaohu has a bright and high-pitched tone, and is an indispensable lead instrument in Cantonese opera and Guangdong music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gaohu_music",
      "created_at": "2025-11-20T20:40:00.000Z",
      "updated_at": "2025-11-20T20:40:00.000Z"
    }
  ]
}
