{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠缠现象挑战了我们对物理世界局域性原理的传统认知。",
      "sentence_pinyin": "Liàngzǐ jiūchán xiànxiàng tiǎozhàn le wǒmen duì wùlǐ shìjiè júyù xìng yuánlǐ de chuántǒng rènzhī.",
      "sentence_fr": "Le phénomène d'intrication quantique remet en question notre compréhension traditionnelle du principe de localité dans le monde physique.",
      "sentence_en": "The phenomenon of quantum entanglement challenges our traditional understanding of the locality principle in the physical world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_entanglement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市农业的发展为解决食品安全问题提供了创新性的本地化解决方案。",
      "sentence_pinyin": "Chéngshì nóngyè de fāzhǎn wèi jiějué shípǐn ānquán wèntí tígōng le chuàngxīn xìng de běndì huà jiějué fāng'àn.",
      "sentence_fr": "Le développement de l'agriculture urbaine offre des solutions locales innovantes aux problèmes de sécurité alimentaire.",
      "sentence_en": "The development of urban agriculture provides innovative localized solutions to food security issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知行为疗法通过改变消极思维模式来帮助患者克服焦虑和抑郁症状。",
      "sentence_pinyin": "Rènzhī xíngwéi liáofǎ tōngguò gǎibiàn xiāojí sīwéi móshì lái bāngzhù huànzhě kèfú jiāolǜ hé yìyù zhèngzhuàng.",
      "sentence_fr": "La thérapie cognitivo-comportementale aide les patients à surmonter l'anxiété et la dépression en modifiant les schémas de pensée négatifs.",
      "sentence_en": "Cognitive behavioral therapy helps patients overcome anxiety and depression by changing negative thought patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_behavioral_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨国公司的税收筹划策略引发了国际社会对公平税制的广泛讨论。",
      "sentence_pinyin": "Kuàguó gōngsī de shuìshōu chóuhuà cèlüè yǐnfā le guójì shèhuì duì gōngpíng shuìzhì de guǎngfàn tǎolùn.",
      "sentence_fr": "Les stratégies d'optimisation fiscale des multinationales ont suscité un large débat international sur l'équité fiscale.",
      "sentence_en": "Tax planning strategies of multinational corporations have sparked widespread international discussion about fair taxation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_taxation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋酸化正在对珊瑚礁生态系统和贝类养殖业造成严重威胁。",
      "sentence_pinyin": "Hǎiyáng suānhuà zhèngzài duì shānhú jiāo shēngtài xìtǒng hé bèilèi yǎngzhí yè zàochéng yánzhòng wēixié.",
      "sentence_fr": "L'acidification des océans constitue une menace grave pour les écosystèmes coralliens et l'industrie de l'élevage de coquillages.",
      "sentence_en": "Ocean acidification is posing a serious threat to coral reef ecosystems and shellfish farming industries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ocean_acidification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字素养教育应该从小学阶段开始培养学生批判性地评估网络信息的能力。",
      "sentence_pinyin": "Shùzì sùyǎng jiàoyù yīnggāi cóng xiǎoxué jiēduàn kāishǐ péiyǎng xuéshēng pīpàn xìng de pínggū wǎngluò xìnxī de nénglì.",
      "sentence_fr": "L'éducation à la littératie numérique devrait commencer dès l'école primaire pour développer la capacité des élèves à évaluer de manière critique les informations en ligne.",
      "sentence_en": "Digital literacy education should begin in elementary school to develop students' ability to critically evaluate online information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表观遗传学研究揭示了环境因素如何在不改变DNA序列的情况下影响基因表达。",
      "sentence_pinyin": "Biǎoguān yíchuán xué yánjiū jiēshì le huánjìng yīnsù rúhé zài bù gǎibiàn DNA xùliè de qíngkuàng xià yǐngxiǎng jīyīn biǎodá.",
      "sentence_fr": "La recherche en épigénétique révèle comment les facteurs environnementaux influencent l'expression génétique sans modifier la séquence d'ADN.",
      "sentence_en": "Epigenetics research reveals how environmental factors influence gene expression without altering the DNA sequence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epigenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "虚拟现实技术在建筑设计领域的应用使客户能够在施工前沉浸式体验未来空间。",
      "sentence_pinyin": "Xūnǐ xiànshí jìshù zài jiànzhù shèjì lǐngyù de yìngyòng shǐ kèhù nénggòu zài shīgōng qián chénjìn shì tǐyàn wèilái kōngjiān.",
      "sentence_fr": "L'application de la réalité virtuelle dans la conception architecturale permet aux clients de vivre une expérience immersive des futurs espaces avant la construction.",
      "sentence_en": "The application of virtual reality technology in architectural design enables clients to immersively experience future spaces before construction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vr_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会企业家精神将商业模式创新与解决社会问题的使命有机结合起来。",
      "sentence_pinyin": "Shèhuì qǐyè jiā jīngshén jiāng shāngyè móshì chuàngxīn yǔ jiějué shèhuì wèntí de shǐmìng yǒujī jiéhé qǐlái.",
      "sentence_fr": "L'entrepreneuriat social combine de manière organique l'innovation des modèles commerciaux avec la mission de résoudre les problèmes sociaux.",
      "sentence_en": "Social entrepreneurship organically combines business model innovation with the mission of solving social problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_entrepreneurship",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古气候学家通过分析冰芯样本重建了过去数十万年的地球气候变化历史。",
      "sentence_pinyin": "Gǔ qìhòu xué jiā tōngguò fēnxī bīng xīn yàngběn chóngjiàn le guòqù shù shí wàn nián de dìqiú qìhòu biànhuà lìshǐ.",
      "sentence_fr": "Les paléoclimatologues ont reconstitué l'histoire des changements climatiques terrestres sur des centaines de milliers d'années en analysant des carottes de glace.",
      "sentence_en": "Paleoclimatologists have reconstructed Earth's climate change history over hundreds of thousands of years by analyzing ice core samples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "paleoclimatology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式账本技术在供应链管理中的应用大大提高了产品溯源的透明度。",
      "sentence_pinyin": "Fēnbù shì zhàngběn jìshù zài gōngyìng liàn guǎnlǐ zhōng de yìngyòng dàdà tígāo le chǎnpǐn sùyuán de tòumíng dù.",
      "sentence_fr": "L'application de la technologie des registres distribués dans la gestion de la chaîne d'approvisionnement a considérablement amélioré la transparence de la traçabilité des produits.",
      "sentence_en": "The application of distributed ledger technology in supply chain management has greatly improved the transparency of product traceability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "blockchain_supply_chain",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经可塑性研究表明成年人的大脑仍然具有显著的学习和适应能力。",
      "sentence_pinyin": "Shénjīng kěsù xìng yánjiū biǎomíng chéngnián rén de dànǎo réngrán jùyǒu xiǎnzhù de xuéxí hé shìyìng nénglì.",
      "sentence_fr": "La recherche sur la neuroplasticité montre que le cerveau adulte conserve des capacités d'apprentissage et d'adaptation remarquables.",
      "sentence_en": "Neuroplasticity research shows that the adult brain still possesses significant learning and adaptation capabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroplasticity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循环经济模式要求企业重新设计产品生命周期以最大限度地减少废物产生。",
      "sentence_pinyin": "Xúnhuán jīngjì móshì yāoqiú qǐyè chóngxīn shèjì chǎnpǐn shēngmìng zhōuqī yǐ zuìdà xiàndù de jiǎnshǎo fèiwù chǎnshēng.",
      "sentence_fr": "Le modèle d'économie circulaire exige que les entreprises repensent le cycle de vie des produits afin de minimiser la production de déchets.",
      "sentence_en": "The circular economy model requires businesses to redesign product life cycles to minimize waste generation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circular_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "比较文学研究通过跨文化视角揭示了不同文学传统之间的深层联系。",
      "sentence_pinyin": "Bǐjiào wénxué yánjiū tōngguò kuà wénhuà shìjiǎo jiēshì le bùtóng wénxué chuántǒng zhījiān de shēncéng liánxì.",
      "sentence_fr": "Les études de littérature comparée révèlent les liens profonds entre différentes traditions littéraires à travers une perspective interculturelle.",
      "sentence_en": "Comparative literature studies reveal deep connections between different literary traditions through a cross-cultural perspective.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "comparative_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精准农业技术利用传感器和数据分析优化灌溉、施肥和病虫害防治决策。",
      "sentence_pinyin": "Jīngzhǔn nóngyè jìshù lìyòng chuángǎnqì hé shùjù fēnxī yōuhuà guàngài, shīféi hé bìngchónghài fángzhì juécè.",
      "sentence_fr": "Les technologies d'agriculture de précision utilisent des capteurs et l'analyse de données pour optimiser les décisions d'irrigation, de fertilisation et de lutte contre les parasites.",
      "sentence_en": "Precision agriculture technology uses sensors and data analysis to optimize irrigation, fertilization, and pest control decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "precision_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "音乐治疗在帮助阿尔茨海默症患者唤起记忆和改善情绪方面展现出独特优势。",
      "sentence_pinyin": "Yīnyuè zhìliáo zài bāngzhù Ā'ěrcíhǎimò zhèng huànzhě huànqǐ jìyì hé gǎishàn qíngxù fāngmiàn zhǎnxiàn chū dútè yōushì.",
      "sentence_fr": "La musicothérapie présente des avantages uniques pour aider les patients atteints d'Alzheimer à évoquer des souvenirs et améliorer leur humeur.",
      "sentence_en": "Music therapy shows unique advantages in helping Alzheimer's patients evoke memories and improve mood.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "music_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市热岛效应使得市中心的夏季气温比周边郊区高出好几度。",
      "sentence_pinyin": "Chéngshì rèdǎo xiàoyìng shǐdé shì zhōngxīn de xiàjì qìwēn bǐ zhōubiān jiāoqū gāo chū hǎo jǐ dù.",
      "sentence_fr": "L'effet d'îlot de chaleur urbain fait que les températures estivales au centre-ville sont plusieurs degrés plus élevées que dans les banlieues environnantes.",
      "sentence_en": "The urban heat island effect causes summer temperatures in city centers to be several degrees higher than surrounding suburbs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_heat_island",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行为经济学的研究成果正在被广泛应用于公共政策设计和消费者保护领域。",
      "sentence_pinyin": "Xíngwéi jīngjì xué de yánjiū chéngguǒ zhèngzài bèi guǎngfàn yìngyòng yú gōnggòng zhèngcè shèjì hé xiāofèi zhě bǎohù lǐngyù.",
      "sentence_fr": "Les résultats de la recherche en économie comportementale sont largement appliqués à la conception des politiques publiques et à la protection des consommateurs.",
      "sentence_en": "Behavioral economics research findings are being widely applied to public policy design and consumer protection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "behavioral_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新媒体艺术家正在探索人工智能与人类创造力之间的边界与合作可能性。",
      "sentence_pinyin": "Xīn méitǐ yìshù jiā zhèngzài tànsuǒ réngōng zhìnéng yǔ rénlèi chuàngzàolì zhījiān de biānjiè yǔ hézuò kěnéng xìng.",
      "sentence_fr": "Les artistes des nouveaux médias explorent les frontières et les possibilités de collaboration entre l'intelligence artificielle et la créativité humaine.",
      "sentence_en": "New media artists are exploring the boundaries and collaborative possibilities between artificial intelligence and human creativity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ai_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语料库语言学的发展使得研究人员能够分析大规模真实语言使用数据。",
      "sentence_pinyin": "Yǔliàokù yǔyán xué de fāzhǎn shǐdé yánjiū rényuán nénggòu fēnxī dà guīmó zhēnshí yǔyán shǐyòng shùjù.",
      "sentence_fr": "Le développement de la linguistique de corpus permet aux chercheurs d'analyser des données d'utilisation linguistique réelle à grande échelle.",
      "sentence_en": "The development of corpus linguistics enables researchers to analyze large-scale authentic language use data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corpus_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
