{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个科研团队在癌症治疗领域取得了突破性的进展。",
      "sentence_pinyin": "Zhège kēyán tuánduì zài áizhèng zhìliáo lǐngyù qǔdéle tūpòxìng de jìnzhǎn.",
      "sentence_fr": "Cette équipe de recherche a réalisé des progrès décisifs dans le domaine du traitement du cancer.",
      "sentence_en": "This research team made breakthrough progress in the field of cancer treatment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_research",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的时装设计融合了东西方文化元素，独具特色。",
      "sentence_pinyin": "Tā de shízhuāng shèjì rónghéle dōngxīfāng wénhuà yuánsù, dújù tèsè.",
      "sentence_fr": "Sa création de mode combine des éléments culturels orientaux et occidentaux, avec un style unique.",
      "sentence_en": "Her fashion design combines Eastern and Western cultural elements with a unique style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fashion",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区中心为居民提供了丰富的文体活动和娱乐设施。",
      "sentence_pinyin": "Zhège shèqū zhōngxīn wèi jūmín tígōngle fēngfù de wéntǐ huódòng hé yúlè shèshī.",
      "sentence_fr": "Ce centre communautaire offre aux résidents de nombreuses activités culturelles et sportives ainsi que des installations de loisirs.",
      "sentence_en": "This community center provides residents with abundant cultural and sports activities and entertainment facilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在国际会议上发表了关于气候变化的重要演讲。",
      "sentence_pinyin": "Tā zài guójì huìyì shàng fābiǎole guānyú qìhòu biànhuà de zhòngyào yǎnjiǎng.",
      "sentence_fr": "Il a prononcé un discours important sur le changement climatique lors d'une conférence internationale.",
      "sentence_en": "He delivered an important speech on climate change at an international conference.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "climate",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线教育平台开发了互动性强的课程内容和学习工具。",
      "sentence_pinyin": "Zhège zàixiàn jiàoyù píngtái kāifāle hùdòngxìng qiáng de kèchéng nèiróng hé xuéxí gōngjù.",
      "sentence_fr": "Cette plateforme d'éducation en ligne a développé du contenu de cours très interactif et des outils d'apprentissage.",
      "sentence_en": "This online education platform developed highly interactive course content and learning tools.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_education",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她每周参加读书会，与书友们交流阅读心得和感悟。",
      "sentence_pinyin": "Tā měi zhōu cānjiā dúshūhuì, yǔ shūyǒumen jiāoliú yuèdú xīndé hé gǎnwù.",
      "sentence_fr": "Elle participe à un club de lecture chaque semaine, échangeant avec d'autres lecteurs ses impressions et réflexions.",
      "sentence_en": "She attends a book club every week, exchanging reading insights and reflections with fellow readers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "reading_clubs",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新型材料具有优异的耐用性和环保性能。",
      "sentence_pinyin": "Zhège xīnxíng cáiliào jùyǒu yōuyì de nàiyòngxìng hé huánbǎo xìngnéng.",
      "sentence_fr": "Ce nouveau matériau possède une excellente durabilité et des performances écologiques.",
      "sentence_en": "This new material has excellent durability and environmental performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "materials",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在退休前将自己的专业知识传授给年轻一代。",
      "sentence_pinyin": "Tā zài tuìxiū qián jiāng zìjǐ de zhuānyè zhīshi chuánshòu gěi niánqīng yīdài.",
      "sentence_fr": "Avant sa retraite, il transmet ses connaissances professionnelles à la jeune génération.",
      "sentence_en": "Before retirement, he passes on his professional knowledge to the younger generation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mentorship",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家影院采用了最新的音响和投影技术，观影体验极佳。",
      "sentence_pinyin": "Zhè jiā yǐngyuàn cǎiyòngle zuìxīn de yīnxiǎng hé tóuyǐng jìshù, guānyǐng tǐyàn jí jiā.",
      "sentence_fr": "Ce cinéma utilise les dernières technologies audio et de projection, offrant une excellente expérience de visionnage.",
      "sentence_en": "This cinema uses the latest audio and projection technology, offering an excellent viewing experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创意工作室专门为企业提供品牌策划和视觉设计服务。",
      "sentence_pinyin": "Zhège chuàngyì gōngzuòshì zhuānmén wèi qǐyè tígōng pǐnpái cèhuà hé shìjué shèjì fúwù.",
      "sentence_fr": "Ce studio créatif se spécialise dans la fourniture de services de planification de marque et de design visuel aux entreprises.",
      "sentence_en": "This creative studio specializes in providing brand planning and visual design services to enterprises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "creative_services",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的团队在产品开发过程中始终坚持用户至上的原则。",
      "sentence_pinyin": "Tā de tuánduì zài chǎnpǐn kāifā guòchéng zhōng shǐzhōng jiānchí yònghù zhìshàng de yuánzé.",
      "sentence_fr": "Son équipe adhère toujours au principe de l'utilisateur avant tout dans le processus de développement de produits.",
      "sentence_en": "Her team always adheres to the user-first principle in the product development process.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "product_development",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座公园的景观设计巧妙地融入了当地的历史文化特色。",
      "sentence_pinyin": "Zhè zuò gōngyuán de jǐngguān shèjì qiǎomiào de róngrùle dāngdì de lìshǐ wénhuà tèsè.",
      "sentence_fr": "La conception paysagère de ce parc intègre habilement les caractéristiques historiques et culturelles locales.",
      "sentence_en": "The landscape design of this park skillfully integrates local historical and cultural features.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "landscape_design",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他通过参加各种培训课程不断提升自己的专业能力。",
      "sentence_pinyin": "Tā tōngguò cānjiā gèzhǒng péixùn kèchéng bùduàn tíshēng zìjǐ de zhuānyè nénglì.",
      "sentence_fr": "Il améliore constamment ses compétences professionnelles en participant à divers cours de formation.",
      "sentence_en": "He constantly improves his professional abilities by attending various training courses.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "professional_development",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个健康管理应用可以追踪用户的饮食、运动和睡眠情况。",
      "sentence_pinyin": "Zhège jiànkāng guǎnlǐ yìngyòng kěyǐ zhuīzōng yònghù de yǐnshí, yùndòng hé shuìmián qíngkuàng.",
      "sentence_fr": "Cette application de gestion de la santé peut suivre l'alimentation, l'exercice et le sommeil des utilisateurs.",
      "sentence_en": "This health management app can track users' diet, exercise, and sleep patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_apps",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个文化遗产保护项目得到了政府和民间组织的大力支持。",
      "sentence_pinyin": "Zhège wénhuà yíchǎn bǎohù xiàngmù dédàole zhèngfǔ hé mínjiān zǔzhī de dàlì zhīchí.",
      "sentence_fr": "Ce projet de protection du patrimoine culturel a reçu un fort soutien du gouvernement et des organisations civiles.",
      "sentence_en": "This cultural heritage protection project received strong support from the government and civil organizations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "heritage",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在社交场合表现得落落大方，给人留下了深刻的印象。",
      "sentence_pinyin": "Tā zài shèjiāo chǎnghé biǎoxiàn de luòluò dàfāng, gěi rén liú xiàle shēnkè de yìnxiàng.",
      "sentence_fr": "Elle se comporte avec élégance et assurance dans les situations sociales, laissant une impression profonde.",
      "sentence_en": "She behaves with elegance and confidence in social situations, leaving a deep impression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_skills",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个实验室配备了世界一流的科研设备和仪器。",
      "sentence_pinyin": "Zhège shíyànshì pèibèile shìjiè yīliú de kēyán shèbèi hé yíqì.",
      "sentence_fr": "Ce laboratoire est équipé d'équipements et d'instruments de recherche de classe mondiale.",
      "sentence_en": "This laboratory is equipped with world-class research equipment and instruments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "research_facilities",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的摄影作品在国际摄影大赛中荣获金奖。",
      "sentence_pinyin": "Tā de shèyǐng zuòpǐn zài guójì shèyǐng dàsài zhōng rónghuò jīn jiǎng.",
      "sentence_fr": "Ses œuvres photographiques ont remporté la médaille d'or dans un concours international de photographie.",
      "sentence_en": "His photography works won the gold medal in an international photography competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "photography",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个物流公司利用人工智能技术优化了配送路线和效率。",
      "sentence_pinyin": "Zhège wùliú gōngsī lìyòng réngōng zhìnéng jìshù yōuhuàle pèisòng lùxiàn hé xiàolǜ.",
      "sentence_fr": "Cette entreprise de logistique utilise la technologie de l'intelligence artificielle pour optimiser les itinéraires et l'efficacité de livraison.",
      "sentence_en": "This logistics company uses artificial intelligence technology to optimize delivery routes and efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "logistics",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在音乐会上演奏的小提琴独奏令观众如痴如醉。",
      "sentence_pinyin": "Tā zài yīnyuèhuì shàng yǎnzòu de xiǎotíqín dúzòu lìng guānzhòng rúchī rúzuì.",
      "sentence_fr": "Son solo de violon lors du concert a captivé et fasciné le public.",
      "sentence_en": "Her violin solo at the concert captivated and fascinated the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "classical_music",
      "created_at": "2025-11-20T17:25:00.000Z",
      "updated_at": "2025-11-20T17:25:00.000Z"
    }
  ]
}
