{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "碳捕获与封存技术被认为是减少工业碳排放的重要补充手段。",
      "sentence_pinyin": "Tàn bǔhuò yǔ fēngcún jìshù bèi rènwéi shì jiǎnshǎo gōngyè tàn páifàng de zhòngyào bǔchōng shǒuduàn.",
      "sentence_fr": "La technologie de capture et de stockage du carbone est considérée comme un moyen complémentaire important pour réduire les émissions industrielles de carbone.",
      "sentence_en": "Carbon capture and storage technology is considered an important supplementary means of reducing industrial carbon emissions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_capture_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位摄影师的作品捕捉了全球化时代城市空间的标准化与地方特色的张力。",
      "sentence_pinyin": "Zhè wèi shèyǐngshī de zuòpǐn bǔzhuō le quánqiúhuà shídài chéngshì kōngjiān de biāozhǔnhuà yǔ dìfāng tèsè de zhānglì.",
      "sentence_fr": "Les œuvres de ce photographe capturent la tension entre la standardisation des espaces urbains et les caractéristiques locales à l'ère de la mondialisation.",
      "sentence_en": "This photographer's works capture the tension between standardization of urban spaces and local characteristics in the era of globalization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_photography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "个人化学习系统根据学生的学习进度和风格提供定制化的教学内容。",
      "sentence_pinyin": "Gèrénhuà xuéxí xìtǒng gēnjù xuéshēng de xuéxí jìndù hé fēnggé tígōng dìngzhìhuà de jiàoxué nèiróng.",
      "sentence_fr": "Les systèmes d'apprentissage personnalisé fournissent un contenu pédagogique adapté au rythme et au style d'apprentissage des étudiants.",
      "sentence_en": "Personalized learning systems provide customized teaching content based on students' learning progress and styles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "personalized_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类器官技术为研究疾病机制和测试药物提供了更接近人体的实验模型。",
      "sentence_pinyin": "Lèi qìguān jìshù wèi yánjiū jíbìng jīzhì hé cèshì yàowù tígōng le gèng jiējìn réntǐ de shíyàn móxíng.",
      "sentence_fr": "La technologie des organoïdes fournit des modèles expérimentaux plus proches du corps humain pour étudier les mécanismes des maladies et tester les médicaments.",
      "sentence_en": "Organoid technology provides experimental models closer to the human body for studying disease mechanisms and testing drugs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organoid_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市韧性研究关注城市系统应对和适应各种冲击与压力的能力。",
      "sentence_pinyin": "Chéngshì rènxìng yánjiū guānzhù chéngshì xìtǒng yìngduì hé shìyìng gèzhǒng chōngjī yǔ yālì de nénglì.",
      "sentence_fr": "La recherche sur la résilience urbaine se concentre sur la capacité des systèmes urbains à faire face et à s'adapter aux divers chocs et stress.",
      "sentence_en": "Urban resilience research focuses on the ability of urban systems to cope with and adapt to various shocks and stresses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_resilience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "食品科技公司正在开发利用微藻和昆虫蛋白的替代蛋白质来源。",
      "sentence_pinyin": "Shípǐn kējì gōngsī zhèngzài kāifā lìyòng wēizǎo hé kūnchóng dànbái de tìdài dànbáizhì láiyuán.",
      "sentence_fr": "Les entreprises de technologie alimentaire développent des sources de protéines alternatives utilisant des microalgues et des protéines d'insectes.",
      "sentence_en": "Food tech companies are developing alternative protein sources using microalgae and insect protein.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "alternative_proteins",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行为成瘾研究揭示了数字技术设计如何利用心理机制吸引用户注意力。",
      "sentence_pinyin": "Xíngwéi chéngyǐn yánjiū jiēshì le shùzì jìshù shèjì rúhé lìyòng xīnlǐ jīzhì xīyǐn yònghù zhùyìlì.",
      "sentence_fr": "La recherche sur l'addiction comportementale révèle comment la conception des technologies numériques exploite les mécanismes psychologiques pour capter l'attention des utilisateurs.",
      "sentence_en": "Behavioral addiction research reveals how digital technology design exploits psychological mechanisms to capture user attention.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_addiction_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部小说以交织的多重叙事线索探讨了记忆、创伤与和解的主题。",
      "sentence_pinyin": "Zhè bù xiǎoshuō yǐ jiāozhī de duōchóng xùshì xiànsuǒ tàntǎo le jìyì, chuāngshāng yǔ héjiě de zhǔtí.",
      "sentence_fr": "Ce roman explore les thèmes de la mémoire, du traumatisme et de la réconciliation à travers des fils narratifs multiples et entrelacés.",
      "sentence_en": "This novel explores themes of memory, trauma, and reconciliation through interwoven multiple narrative threads.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "敏捷开发方法论强调通过迭代和持续反馈来响应变化的需求。",
      "sentence_pinyin": "Mǐnjié kāifā fāngfǎlùn qiángdiào tōngguò diédài hé chíxù fǎnkuì lái xiǎngyìng biànhuà de xūqiú.",
      "sentence_fr": "La méthodologie de développement agile met l'accent sur la réponse aux besoins changeants par l'itération et le feedback continu.",
      "sentence_en": "Agile development methodology emphasizes responding to changing requirements through iteration and continuous feedback.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agile_methodology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "湿地生态系统在水质净化和洪水调蓄方面发挥着不可替代的作用。",
      "sentence_pinyin": "Shīdì shēngtài xìtǒng zài shuǐzhì jìnghuà hé hóngshuǐ tiáoxù fāngmiàn fāhuī zhe bùkě tìdài de zuòyòng.",
      "sentence_fr": "Les écosystèmes des zones humides jouent un rôle irremplaçable dans la purification de l'eau et la régulation des inondations.",
      "sentence_en": "Wetland ecosystems play an irreplaceable role in water purification and flood regulation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wetland_ecosystems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "供应链可追溯性系统帮助消费者了解产品从原材料到成品的全过程。",
      "sentence_pinyin": "Gōngyìngliàn kě zhuīsùxìng xìtǒng bāngzhù xiāofèizhě liǎojiě chǎnpǐn cóng yuáncáiliào dào chéngpǐn de quán guòchéng.",
      "sentence_fr": "Les systèmes de traçabilité de la chaîne d'approvisionnement aident les consommateurs à comprendre tout le parcours du produit des matières premières au produit fini.",
      "sentence_en": "Supply chain traceability systems help consumers understand the entire process from raw materials to finished products.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supply_chain_traceability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言治疗师帮助中风患者恢复言语和沟通能力,提高生活质量。",
      "sentence_pinyin": "Yǔyán zhìliáoshī bāngzhù zhòngfēng huànzhě huīfù yányǔ hé gōutōng nénglì, tígāo shēnghuó zhìliàng.",
      "sentence_fr": "Les orthophonistes aident les patients victimes d'AVC à récupérer leurs capacités de parole et de communication pour améliorer leur qualité de vie.",
      "sentence_en": "Speech therapists help stroke patients recover speech and communication abilities to improve quality of life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "speech_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人工光合作用研究试图模拟植物将阳光转化为化学能的过程。",
      "sentence_pinyin": "Réngōng guānghézuòyòng yánjiū shìtú mónǐ zhíwù jiāng yángguāng zhuǎnhuà wéi huàxuénéng de guòchéng.",
      "sentence_fr": "La recherche sur la photosynthèse artificielle tente de reproduire le processus par lequel les plantes convertissent la lumière du soleil en énergie chimique.",
      "sentence_en": "Artificial photosynthesis research attempts to simulate the process by which plants convert sunlight into chemical energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "artificial_photosynthesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这场展览通过沉浸式体验让观众深入理解气候变化对人类文明的影响。",
      "sentence_pinyin": "Zhè chǎng zhǎnlǎn tōngguò chénjìnshì tǐyàn ràng guānzhòng shēnrù lǐjiě qìhòu biànhuà duì rénlèi wénmíng de yǐngxiǎng.",
      "sentence_fr": "Cette exposition permet aux visiteurs de comprendre profondément l'impact du changement climatique sur la civilisation humaine grâce à une expérience immersive.",
      "sentence_en": "This exhibition allows audiences to deeply understand the impact of climate change on human civilization through immersive experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immersive_exhibitions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无人机技术在精准农业中的应用大大提高了农业生产的效率和精度。",
      "sentence_pinyin": "Wúrénjī jìshù zài jīngzhǔn nóngyè zhōng de yìngyòng dàdà tígāo le nóngyè shēngchǎn de xiàolǜ hé jīngdù.",
      "sentence_fr": "L'application de la technologie des drones dans l'agriculture de précision a considérablement amélioré l'efficacité et la précision de la production agricole.",
      "sentence_en": "The application of drone technology in precision agriculture has greatly improved the efficiency and accuracy of agricultural production.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agricultural_drones",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多元化的董事会构成被认为可以提升企业决策质量和长期绩效。",
      "sentence_pinyin": "Duōyuánhuà de dǒngshìhuì gòuchéng bèi rènwéi kěyǐ tíshēng qǐyè juécè zhìliàng hé chángqī jīxiào.",
      "sentence_fr": "La diversité de la composition du conseil d'administration est considérée comme susceptible d'améliorer la qualité des décisions et les performances à long terme de l'entreprise.",
      "sentence_en": "Diverse board composition is believed to improve corporate decision quality and long-term performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "board_diversity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "睡眠科学研究表明充足的睡眠对记忆巩固和情绪调节至关重要。",
      "sentence_pinyin": "Shuìmián kēxué yánjiū biǎomíng chōngzú de shuìmián duì jìyì gǒnggù hé qíngxù tiáojié zhìguān zhòngyào.",
      "sentence_fr": "La recherche en science du sommeil montre qu'un sommeil suffisant est crucial pour la consolidation de la mémoire et la régulation émotionnelle.",
      "sentence_en": "Sleep science research shows that adequate sleep is crucial for memory consolidation and emotional regulation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sleep_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市夜间经济的发展为消费市场注入了新的活力和增长动能。",
      "sentence_pinyin": "Chéngshì yèjiān jīngjì de fāzhǎn wèi xiāofèi shìchǎng zhùrù le xīn de huólì hé zēngzhǎng dòngnéng.",
      "sentence_fr": "Le développement de l'économie nocturne urbaine insuffle une nouvelle vitalité et une dynamique de croissance au marché de la consommation.",
      "sentence_en": "The development of urban nighttime economy has injected new vitality and growth momentum into the consumer market.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nighttime_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于证据的政策制定要求决策过程建立在可靠的研究数据和分析基础上。",
      "sentence_pinyin": "Jīyú zhèngjù de zhèngcè zhìdìng yāoqiú juécè guòchéng jiànlì zài kěkào de yánjiū shùjù hé fēnxī jīchǔ shàng.",
      "sentence_fr": "L'élaboration de politiques fondées sur des preuves exige que le processus décisionnel soit basé sur des données de recherche et des analyses fiables.",
      "sentence_en": "Evidence-based policy making requires the decision-making process to be based on reliable research data and analysis.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evidence_based_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
