{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子隐形传态不传输物质而是传输量子态信息。",
      "sentence_pinyin": "Liàngzǐ yǐnxíng chuán tài bù chuánshū wùzhì ér shì chuánshū liàngzǐ tài xìnxī.",
      "sentence_fr": "La téléportation quantique ne transmet pas de matière mais l'information d'état quantique.",
      "sentence_en": "Quantum teleportation transmits not matter but quantum state information.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_teleportation_info",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "聚合签名将多个签名压缩成单一紧凑签名。",
      "sentence_pinyin": "Jùhé qiānmíng jiāng duō gè qiānmíng yāsuō chéng dānyī jǐncòu qiānmíng.",
      "sentence_fr": "Les signatures agrégées compriment plusieurs signatures en une seule signature compacte.",
      "sentence_en": "Aggregate signatures compress multiple signatures into a single compact signature.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "aggregate_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦类型论将数学基础建立在类型论和同伦论之上。",
      "sentence_pinyin": "Tónglún lèixíng lùn jiāng shùxué jīchǔ jiànlì zài lèixíng lùn hé tónglún lùn zhī shàng.",
      "sentence_fr": "La théorie des types homotopiques fonde les mathématiques sur la théorie des types et la théorie de l'homotopie.",
      "sentence_en": "Homotopy type theory founds mathematics on type theory and homotopy theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homotopy_type_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "斯塔克猜想关联代数数论与L函数的特殊值。",
      "sentence_pinyin": "Sītǎkè cāixiǎng guānlián dàishù shùlùn yǔ L hánshù de tèshū zhí.",
      "sentence_fr": "La conjecture de Stark relie la théorie algébrique des nombres aux valeurs spéciales des fonctions L.",
      "sentence_en": "The Stark conjecture relates algebraic number theory to special values of L-functions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stark_conjecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子色动力学描述夸克和胶子之间的强相互作用。",
      "sentence_pinyin": "Liàngzǐ sè dònglìxué miáoshù kuākè hé jiāozǐ zhījiān de qiáng xiānghù zuòyòng.",
      "sentence_fr": "La chromodynamique quantique décrit l'interaction forte entre les quarks et les gluons.",
      "sentence_en": "Quantum chromodynamics describes the strong interaction between quarks and gluons.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_chromodynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可验证延迟函数需要顺序计算而无法并行加速。",
      "sentence_pinyin": "Kě yànzhèng yánchí hánshù xūyào shùnxù jìsuàn ér wúfǎ bìngxíng jiāsù.",
      "sentence_fr": "Les fonctions de délai vérifiables nécessitent un calcul séquentiel et ne peuvent pas être accélérées par parallélisation.",
      "sentence_en": "Verifiable delay functions require sequential computation and cannot be parallelized for speedup.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "verifiable_delay_functions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "等式推理系统通过等式公理和替换规则推导程序性质。",
      "sentence_pinyin": "Děngshì tuīlǐ xìtǒng tōngguò děngshì gōnglǐ hé tìhuàn guīzé tuīdǎo chéngxù xìngzhì.",
      "sentence_fr": "Les systèmes de raisonnement équationnel dérivent les propriétés des programmes par des axiomes d'égalité et des règles de substitution.",
      "sentence_en": "Equational reasoning systems derive program properties through equality axioms and substitution rules.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "equational_reasoning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数簇是多项式方程组的解集构成的几何对象。",
      "sentence_pinyin": "Dàishù cù shì duōxiàngshì fāngchéngzǔ de jiě jí gòuchéng de jǐhé duìxiàng.",
      "sentence_fr": "Les variétés algébriques sont des objets géométriques formés par les ensembles de solutions de systèmes d'équations polynomiales.",
      "sentence_en": "Algebraic varieties are geometric objects formed by solution sets of polynomial equation systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_varieties",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠作为量子信息处理的核心资源发挥关键作用。",
      "sentence_pinyin": "Liàngzǐ jiūchán zuòwéi liàngzǐ xìnxī chǔlǐ de héxīn zīyuán fāhuī guānjiàn zuòyòng.",
      "sentence_fr": "L'intrication quantique joue un rôle clé en tant que ressource centrale du traitement de l'information quantique.",
      "sentence_en": "Quantum entanglement plays a key role as a core resource in quantum information processing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_resource",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式密钥生成协议无需可信第三方生成共享密钥。",
      "sentence_pinyin": "Fēnbùshì mìyào shēngchéng xiéyì wúxū kěxìn dìsānfāng shēngchéng gòngxiǎng mìyào.",
      "sentence_fr": "Les protocoles de génération de clés distribuées créent des clés partagées sans tiers de confiance.",
      "sentence_en": "Distributed key generation protocols create shared keys without a trusted third party.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "distributed_key_generation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "余极限和极限在范畴论中提供了统一的构造方法。",
      "sentence_pinyin": "Yú jíxiàn hé jíxiàn zài fànchóu lùn zhōng tígōng le tǒngyī de gòuzào fāngfǎ.",
      "sentence_fr": "Les colimites et les limites fournissent des méthodes de construction unifiées en théorie des catégories.",
      "sentence_en": "Colimits and limits provide unified construction methods in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "colimits_and_limits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "魏伊猜想连接代数几何与有限域上的计数问题。",
      "sentence_pinyin": "Wèiyī cāixiǎng liánjiē dàishù jǐhé yǔ yǒuxiàn yù shàng de jìshù wèntí.",
      "sentence_fr": "Les conjectures de Weil relient la géométrie algébrique aux problèmes de comptage sur les corps finis.",
      "sentence_en": "The Weil conjectures connect algebraic geometry with counting problems over finite fields.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "weil_conjectures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子叠加态使量子比特同时处于多个状态的组合中。",
      "sentence_pinyin": "Liàngzǐ diéjiā tài shǐ liàngzǐ bǐtè tóngshí chǔyú duō gè zhuàngtài de zǔhé zhōng.",
      "sentence_fr": "La superposition quantique permet aux qubits d'être simultanément dans une combinaison de plusieurs états.",
      "sentence_en": "Quantum superposition allows qubits to be simultaneously in a combination of multiple states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_superposition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "椭圆曲线配对使基于身份的密码学成为可能。",
      "sentence_pinyin": "Tuǒyuán qūxiàn pèiduì shǐ jīyú shēnfèn de mìmǎxué chéngwéi kěnéng.",
      "sentence_fr": "Les appariements sur courbes elliptiques rendent possible la cryptographie basée sur l'identité.",
      "sentence_en": "Elliptic curve pairings make identity-based cryptography possible.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "elliptic_curve_pairings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "惰性求值延迟表达式的计算直到其值真正被需要。",
      "sentence_pinyin": "Duò xìng qiúzhí yánchí biǎodáshì de jìsuàn zhídào qí zhí zhēnzhèng bèi xūyào.",
      "sentence_fr": "L'évaluation paresseuse retarde le calcul des expressions jusqu'à ce que leur valeur soit vraiment nécessaire.",
      "sentence_en": "Lazy evaluation delays expression computation until the value is actually needed.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lazy_evaluation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦群衡量拓扑空间中不同维度的洞和路径结构。",
      "sentence_pinyin": "Tónglún qún héngliáng tuòpū kōngjiān zhōng bùtóng wéidù de dòng hé lùjìng jiégòu.",
      "sentence_fr": "Les groupes d'homotopie mesurent les trous et les structures de chemins de différentes dimensions dans les espaces topologiques.",
      "sentence_en": "Homotopy groups measure holes and path structures of different dimensions in topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homotopy_groups",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玻色子采样是展示量子优越性的重要实验平台。",
      "sentence_pinyin": "Bōsèzǐ cǎiyàng shì zhǎnshì liàngzǐ yōuyuèxìng de zhòngyào shíyàn píngtái.",
      "sentence_fr": "L'échantillonnage de bosons est une plateforme expérimentale importante pour démontrer la supériorité quantique.",
      "sentence_en": "Boson sampling is an important experimental platform for demonstrating quantum superiority.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "boson_sampling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "双线性映射在高级密码协议中提供独特的数学结构。",
      "sentence_pinyin": "Shuāng xiànxìng yìngshè zài gāojí mìmǎ xiéyì zhōng tígōng dútè de shùxué jiégòu.",
      "sentence_fr": "Les applications bilinéaires fournissent des structures mathématiques uniques dans les protocoles cryptographiques avancés.",
      "sentence_en": "Bilinear maps provide unique mathematical structures in advanced cryptographic protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bilinear_maps",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "连续传递风格将控制流显式化为函数参数传递。",
      "sentence_pinyin": "Liánxù chuándì fēnggé jiāng kòngzhì liú xiǎnshìhuà wéi hánshù cānshù chuándì.",
      "sentence_fr": "Le style de passage de continuation explicite le flux de contrôle comme passage de paramètres de fonction.",
      "sentence_en": "Continuation-passing style makes control flow explicit as function parameter passing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "continuation_passing_style",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "万有覆叠空间包含给定空间所有覆叠的完整信息。",
      "sentence_pinyin": "Wànyǒu fùdié kōngjiān bāohán gěidìng kōngjiān suǒyǒu fùdié de wánzhěng xìnxī.",
      "sentence_fr": "L'espace de recouvrement universel contient des informations complètes sur tous les recouvrements d'un espace donné.",
      "sentence_en": "The universal covering space contains complete information about all coverings of a given space.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_covering_space",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
