{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "认知语言学理论认为语言结构反映了人类概念化世界的方式。",
      "sentence_pinyin": "Rènzhī yǔyán xué lǐlùn rènwéi yǔyán jiégòu fǎnyìng le rénlèi gàiniàn huà shìjiè de fāngshì.",
      "sentence_fr": "La théorie de la linguistique cognitive soutient que la structure linguistique reflète la façon dont les humains conceptualisent le monde.",
      "sentence_en": "Cognitive linguistics theory holds that language structure reflects how humans conceptualize the world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电网技术实现了电力供需的实时监控和动态平衡调节。",
      "sentence_pinyin": "Zhìnéng diànwǎng jìshù shíxiàn le diànlì gōngxū de shíshí jiānkòng hé dòngtài pínghéng tiáojié.",
      "sentence_fr": "La technologie des réseaux intelligents permet la surveillance en temps réel et l'équilibrage dynamique de l'offre et de la demande d'électricité.",
      "sentence_en": "Smart grid technology enables real-time monitoring and dynamic balancing of electricity supply and demand.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_grid",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨代创伤研究探索历史创伤如何通过行为和生物学机制传递给后代。",
      "sentence_pinyin": "Kuà dài chuāngshāng yánjiū tànsuǒ lìshǐ chuāngshāng rúhé tōngguò xíngwéi hé shēngwù xué jīzhì chuándì gěi hòudài.",
      "sentence_fr": "La recherche sur les traumatismes intergénérationnels explore comment les traumatismes historiques sont transmis aux descendants par des mécanismes comportementaux et biologiques.",
      "sentence_en": "Intergenerational trauma research explores how historical trauma is transmitted to descendants through behavioral and biological mechanisms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intergenerational_trauma",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿人机器人研究致力于创造具有类人运动和表情能力的机器人。",
      "sentence_pinyin": "Fǎng rén jīqìrén yánjiū zhìlì yú chuàngzào jùyǒu lèi rén yùndòng hé biǎoqíng nénglì de jīqìrén.",
      "sentence_fr": "La recherche sur les robots humanoïdes s'efforce de créer des robots dotés de capacités de mouvement et d'expression faciale semblables à celles des humains.",
      "sentence_en": "Humanoid robotics research strives to create robots with human-like movement and expression capabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "humanoid_robotics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共艺术装置不仅美化城市空间，还能促进社区认同感和社会凝聚力。",
      "sentence_pinyin": "Gōnggòng yìshù zhuāngzhì bùjǐn měihuà chéngshì kōngjiān, hái néng cùjìn shèqū rèntóng gǎn hé shèhuì níngjù lì.",
      "sentence_fr": "Les installations d'art public embellissent non seulement l'espace urbain, mais favorisent également le sentiment d'identité communautaire et la cohésion sociale.",
      "sentence_en": "Public art installations not only beautify urban spaces but also promote community identity and social cohesion.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "结构生物学利用高分辨率成像技术揭示蛋白质和核酸的三维结构。",
      "sentence_pinyin": "Jiégòu shēngwù xué lìyòng gāo fēnbiànlǜ chéngxiàng jìshù jiēshì dànbáizhì hé hé suān de sānwéi jiégòu.",
      "sentence_fr": "La biologie structurale utilise des techniques d'imagerie haute résolution pour révéler les structures tridimensionnelles des protéines et des acides nucléiques.",
      "sentence_en": "Structural biology uses high-resolution imaging techniques to reveal the three-dimensional structures of proteins and nucleic acids.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "structural_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据中心能效优化对于减少信息技术行业的碳足迹至关重要。",
      "sentence_pinyin": "Shùjù zhōngxīn néngxiào yōuhuà duìyú jiǎnshǎo xìnxī jìshù hángyè de tàn zújì zhìguān zhòngyào.",
      "sentence_fr": "L'optimisation de l'efficacité énergétique des centres de données est cruciale pour réduire l'empreinte carbone du secteur des technologies de l'information.",
      "sentence_en": "Data center energy efficiency optimization is crucial for reducing the carbon footprint of the information technology industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_center_efficiency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "移民融合政策平衡文化多样性保护与社会凝聚力促进之间的关系。",
      "sentence_pinyin": "Yímín rónghé zhèngcè pínghéng wénhuà duōyàng xìng bǎohù yǔ shèhuì níngjù lì cùjìn zhījiān de guānxì.",
      "sentence_fr": "Les politiques d'intégration des immigrants équilibrent la préservation de la diversité culturelle et la promotion de la cohésion sociale.",
      "sentence_en": "Immigrant integration policies balance cultural diversity preservation and social cohesion promotion.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immigrant_integration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精神分析理论探索无意识心理过程如何影响人类行为和心理症状。",
      "sentence_pinyin": "Jīngshén fēnxī lǐlùn tànsuǒ wúyìshí xīnlǐ guòchéng rúhé yǐngxiǎng rénlèi xíngwéi hé xīnlǐ zhèngzhuàng.",
      "sentence_fr": "La théorie psychanalytique explore comment les processus psychologiques inconscients influencent le comportement humain et les symptômes psychologiques.",
      "sentence_en": "Psychoanalytic theory explores how unconscious psychological processes influence human behavior and psychological symptoms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychoanalytic_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水敏感城市设计将雨水管理融入城市规划以增强城市抗洪能力。",
      "sentence_pinyin": "Shuǐ mǐngǎn chéngshì shèjì jiāng yǔshuǐ guǎnlǐ róngrù chéngshì guīhuà yǐ zēngqiáng chéngshì kàng hóng nénglì.",
      "sentence_fr": "La conception urbaine sensible à l'eau intègre la gestion des eaux pluviales dans la planification urbaine pour renforcer la capacité de résistance aux inondations.",
      "sentence_en": "Water-sensitive urban design integrates stormwater management into urban planning to enhance flood resilience.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "water_sensitive_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经美学研究人脑如何感知和评价艺术作品的美学价值。",
      "sentence_pinyin": "Shénjīng měixué yánjiū rénnǎo rúhé gǎnzhī hé píngjià yìshù zuòpǐn de měixué jiàzhí.",
      "sentence_fr": "La neuroesthétique étudie comment le cerveau humain perçoit et évalue la valeur esthétique des œuvres d'art.",
      "sentence_en": "Neuroaesthetics studies how the human brain perceives and evaluates the aesthetic value of artworks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuroaesthetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "软件定义网络架构将网络控制功能与数据传输功能分离以提高灵活性。",
      "sentence_pinyin": "Ruǎnjiàn dìngyì wǎngluò jiàgòu jiāng wǎngluò kòngzhì gōngnéng yǔ shùjù chuánshū gōngnéng fēnlí yǐ tígāo línghuó xìng.",
      "sentence_fr": "L'architecture de réseau défini par logiciel sépare les fonctions de contrôle réseau des fonctions de transmission de données pour améliorer la flexibilité.",
      "sentence_en": "Software-defined networking architecture separates network control functions from data transmission functions to improve flexibility.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "software_defined_networking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能性核磁共振成像技术使神经科学家能够观察大脑活动的实时变化。",
      "sentence_pinyin": "Gōngnéng xìng hé cígòngzhèn chéngxiàng jìshù shǐ shénjīng kēxué jiā nénggòu guānchá dànǎo huódòng de shíshí biànhuà.",
      "sentence_fr": "La technologie d'imagerie par résonance magnétique fonctionnelle permet aux neuroscientifiques d'observer les changements en temps réel de l'activité cérébrale.",
      "sentence_en": "Functional magnetic resonance imaging technology enables neuroscientists to observe real-time changes in brain activity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fmri_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海平面上升威胁着全球沿海城市和小岛国家的长期生存。",
      "sentence_pinyin": "Hǎipíngmiàn shàngshēng wēixié zhe quánqiú yánhǎi chéngshì hé xiǎo dǎo guójiā de chángqī shēngcún.",
      "sentence_fr": "L'élévation du niveau de la mer menace la survie à long terme des villes côtières et des petits États insulaires dans le monde entier.",
      "sentence_en": "Sea level rise threatens the long-term survival of coastal cities and small island nations worldwide.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sea_level_rise",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合学习模式将线上和线下教学活动有机结合以优化学习效果。",
      "sentence_pinyin": "Hùnhé xuéxí móshì jiāng xiànshàng hé xiànxià jiàoxué huódòng yǒujī jiéhé yǐ yōuhuà xuéxí xiàoguǒ.",
      "sentence_fr": "Le modèle d'apprentissage hybride combine de manière organique les activités d'enseignement en ligne et hors ligne pour optimiser les résultats d'apprentissage.",
      "sentence_en": "Blended learning models organically combine online and offline teaching activities to optimize learning outcomes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "blended_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会网络分析研究个人和组织之间的关系结构及其对信息传播的影响。",
      "sentence_pinyin": "Shèhuì wǎngluò fēnxī yánjiū gèrén hé zǔzhī zhījiān de guānxì jiégòu jí qí duì xìnxī chuánbō de yǐngxiǎng.",
      "sentence_fr": "L'analyse des réseaux sociaux étudie la structure des relations entre individus et organisations et leur impact sur la diffusion de l'information.",
      "sentence_en": "Social network analysis studies relationship structures between individuals and organizations and their impact on information diffusion.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_network_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "抗衰老研究正在探索延长人类健康寿命的分子和细胞机制。",
      "sentence_pinyin": "Kàng shuāilǎo yánjiū zhèngzài tànsuǒ yáncháng rénlèi jiànkāng shòumìng de fēnzǐ hé xìbāo jīzhì.",
      "sentence_fr": "La recherche anti-vieillissement explore les mécanismes moléculaires et cellulaires pour prolonger la durée de vie en bonne santé des humains.",
      "sentence_en": "Anti-aging research is exploring molecular and cellular mechanisms to extend human healthy lifespan.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "anti_aging_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识产权制度试图在激励创新与促进知识传播之间取得平衡。",
      "sentence_pinyin": "Zhīshi chǎnquán zhìdù shìtú zài jīlì chuàngxīn yǔ cùjìn zhīshi chuánbō zhījiān qǔdé pínghéng.",
      "sentence_fr": "Le système de propriété intellectuelle cherche à équilibrer l'incitation à l'innovation et la promotion de la diffusion des connaissances.",
      "sentence_en": "Intellectual property systems attempt to balance incentivizing innovation and promoting knowledge dissemination.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intellectual_property",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极端主义在线传播的监控引发了言论自由与安全需求之间的紧张关系。",
      "sentence_pinyin": "Jíduān zhǔyì zàixiàn chuánbō de jiānkòng yǐnfā le yánlùn zìyóu yǔ ānquán xūqiú zhījiān de jǐnzhāng guānxì.",
      "sentence_fr": "La surveillance de la diffusion en ligne de l'extrémisme crée des tensions entre la liberté d'expression et les besoins de sécurité.",
      "sentence_en": "Monitoring online extremism propagation creates tensions between free speech and security needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "online_extremism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "植物病理学研究帮助农业专家开发更有效的作物病害防治策略。",
      "sentence_pinyin": "Zhíwù bìnglǐ xué yánjiū bāngzhù nóngyè zhuānjiā kāifā gèng yǒuxiào de zuòwù bìnghài fángzhì cèlüè.",
      "sentence_fr": "La recherche en phytopathologie aide les experts agricoles à développer des stratégies de contrôle des maladies des cultures plus efficaces.",
      "sentence_en": "Plant pathology research helps agricultural experts develop more effective crop disease control strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plant_pathology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
