{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "数字孪生技术通过创建物理资产的虚拟副本来优化运营和预测维护需求。",
      "sentence_pinyin": "Shùzì luánshēng jìshù tōngguò chuàngjiàn wùlǐ zīchǎn de xūnǐ fùběn lái yōuhuà yùnyíng hé yùcè wéihù xūqiú.",
      "sentence_fr": "La technologie du jumeau numérique optimise les opérations et prédit les besoins de maintenance en créant des répliques virtuelles d'actifs physiques.",
      "sentence_en": "Digital twin technology optimizes operations and predicts maintenance needs by creating virtual replicas of physical assets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_twins",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人口结构的转变正在重塑消费市场的需求结构和产品设计方向。",
      "sentence_pinyin": "Rénkǒu jiégòu de zhuǎnbiàn zhèngzài chóngsù xiāofèi shìchǎng de xūqiú jiégòu hé chǎnpǐn shèjì fāngxiàng.",
      "sentence_fr": "L'évolution de la structure démographique remodèle la structure de la demande du marché de consommation et l'orientation de la conception des produits.",
      "sentence_en": "Demographic transitions are reshaping consumer market demand structures and product design directions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "demographic_change",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位雕塑家的作品通过对公共空间的介入引发观众对城市生活的反思。",
      "sentence_pinyin": "Zhè wèi diāosùjiā de zuòpǐn tōngguò duì gōnggòng kōngjiān de jièrù yǐnfā guānzhòng duì chéngshì shēnghuó de fǎnsī.",
      "sentence_fr": "Les œuvres de ce sculpteur provoquent une réflexion des spectateurs sur la vie urbaine à travers leur intervention dans l'espace public.",
      "sentence_en": "This sculptor's works provoke audience reflection on urban life through their intervention in public spaces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_sculpture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微生物燃料电池技术将废水中的有机物转化为电能实现能源回收。",
      "sentence_pinyin": "Wēishēngwù ránliào diànchí jìshù jiāng fèishuǐ zhōng de yǒujīwù zhuǎnhuà wéi diànnéng shíxiàn néngyuán huíshōu.",
      "sentence_fr": "La technologie des piles à combustible microbiennes convertit les matières organiques des eaux usées en électricité pour la récupération d'énergie.",
      "sentence_en": "Microbial fuel cell technology converts organic matter in wastewater into electricity for energy recovery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microbial_fuel_cells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "叙事医学强调通过倾听患者故事来增进医患之间的理解和信任。",
      "sentence_pinyin": "Xùshì yīxué qiángdiào tōngguò qīngtīng huànzhě gùshì lái zēngjìn yīhuàn zhījiān de lǐjiě hé xìnrèn.",
      "sentence_fr": "La médecine narrative met l'accent sur l'écoute des histoires des patients pour renforcer la compréhension et la confiance médecin-patient.",
      "sentence_en": "Narrative medicine emphasizes listening to patient stories to enhance understanding and trust between doctors and patients.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "区域经济一体化进程促进了成员国之间的贸易自由化和要素流动。",
      "sentence_pinyin": "Qūyù jīngjì yītǐhuà jìnchéng cùjìn le chéngyuánguó zhījiān de màoyì zìyóuhuà hé yàosù liúdòng.",
      "sentence_fr": "Le processus d'intégration économique régionale favorise la libéralisation des échanges et la mobilité des facteurs entre les États membres.",
      "sentence_en": "Regional economic integration processes promote trade liberalization and factor mobility among member states.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "regional_integration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光学通信技术的进步正在推动数据传输速度达到前所未有的水平。",
      "sentence_pinyin": "Guāngxué tōngxìn jìshù de jìnbù zhèngzài tuīdòng shùjù chuánshū sùdù dádào qiánsuǒwèiyǒu de shuǐpíng.",
      "sentence_fr": "Les progrès de la technologie de communication optique portent les vitesses de transmission de données à des niveaux sans précédent.",
      "sentence_en": "Advances in optical communication technology are pushing data transmission speeds to unprecedented levels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optical_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区参与式规划方法使居民能够直接影响城市发展决策和公共空间设计。",
      "sentence_pinyin": "Shèqū cānyùshì guīhuà fāngfǎ shǐ jūmín nénggòu zhíjiē yǐngxiǎng chéngshì fāzhǎn juécè hé gōnggòng kōngjiān shèjì.",
      "sentence_fr": "Les méthodes de planification participative communautaire permettent aux résidents d'influencer directement les décisions de développement urbain et la conception des espaces publics.",
      "sentence_en": "Community participatory planning methods enable residents to directly influence urban development decisions and public space design.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "participatory_planning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片以独特的视角审视了全球粮食系统的运作方式和内在矛盾。",
      "sentence_pinyin": "Zhè bù jìlùpiàn yǐ dútè de shìjiǎo shěnshì le quánqiú liángshí xìtǒng de yùnzuò fāngshì hé nèizài máodùn.",
      "sentence_fr": "Ce documentaire examine le fonctionnement du système alimentaire mondial et ses contradictions internes sous un angle unique.",
      "sentence_en": "This documentary examines the workings and internal contradictions of the global food system from a unique perspective.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_system_documentary",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于云计算的协作工具正在重新定义团队协作和项目管理的方式。",
      "sentence_pinyin": "Jīyú yún jìsuàn de xiézuò gōngjù zhèngzài chóngxīn dìngyì tuánduì xiézuò hé xiàngmù guǎnlǐ de fāngshì.",
      "sentence_fr": "Les outils de collaboration basés sur le cloud redéfinissent les modes de travail en équipe et de gestion de projet.",
      "sentence_en": "Cloud-based collaboration tools are redefining the way teams collaborate and manage projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cloud_collaboration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋牧场通过人工增殖放流和生境修复来恢复渔业资源和生态功能。",
      "sentence_pinyin": "Hǎiyáng mùchǎng tōngguò réngōng zēngzhí fànglíu hé shēngjìng xiūfù lái huīfù yúyè zīyuán hé shēngtài gōngnéng.",
      "sentence_fr": "Les fermes marines restaurent les ressources halieutiques et les fonctions écologiques par la reproduction artificielle et la restauration des habitats.",
      "sentence_en": "Ocean ranching restores fishery resources and ecological functions through artificial breeding, release, and habitat restoration.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ocean_ranching",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会创业模式将商业手段与社会使命相结合以实现可持续的社会变革。",
      "sentence_pinyin": "Shèhuì chuàngyè móshì jiāng shāngyè shǒuduàn yǔ shèhuì shǐmìng xiāng jiéhé yǐ shíxiàn kě chíxù de shèhuì biàngé.",
      "sentence_fr": "Le modèle de l'entrepreneuriat social combine les moyens commerciaux avec une mission sociale pour réaliser un changement social durable.",
      "sentence_en": "Social entrepreneurship models combine business means with social missions to achieve sustainable social change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_entrepreneurship",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位指挥家以其对巴洛克音乐的历史知情演绎而享誉国际乐坛。",
      "sentence_pinyin": "Zhè wèi zhǐhuījiā yǐ qí duì Bāluòkè yīnyuè de lìshǐ zhīqíng yǎnyì ér xiǎngyù guójì yuètán.",
      "sentence_fr": "Ce chef d'orchestre est renommé internationalement pour son interprétation historiquement informée de la musique baroque.",
      "sentence_en": "This conductor is internationally renowned for their historically informed interpretation of Baroque music.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "baroque_music_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋白质结构预测的突破为药物研发和生物技术应用开辟了新途径。",
      "sentence_pinyin": "Dànbáizhì jiégòu yùcè de tūpò wèi yàowù yánfā hé shēngwù jìshù yìngyòng kāipì le xīn tújìng.",
      "sentence_fr": "Les percées dans la prédiction de la structure des protéines ouvrent de nouvelles voies pour le développement de médicaments et les applications biotechnologiques.",
      "sentence_en": "Breakthroughs in protein structure prediction have opened new pathways for drug development and biotechnology applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "protein_structure_prediction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络心理咨询服务打破了地理障碍,使心理健康支持更加普及可及。",
      "sentence_pinyin": "Wǎngluò xīnlǐ zīxún fúwù dǎpò le dìlǐ zhàng'ài, shǐ xīnlǐ jiànkāng zhīchí gèngjiā pǔjí kějí.",
      "sentence_fr": "Les services de consultation psychologique en ligne brisent les barrières géographiques, rendant le soutien en santé mentale plus accessible.",
      "sentence_en": "Online psychological counseling services break down geographical barriers, making mental health support more accessible.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "online_mental_health",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "风力发电场的选址需要综合考虑风能资源、环境影响和电网接入条件。",
      "sentence_pinyin": "Fēnglì fādiànchǎng de xuǎnzhǐ xūyào zōnghé kǎolǜ fēngnéng zīyuán, huánjìng yǐngxiǎng hé diànwǎng jiērù tiáojiàn.",
      "sentence_fr": "Le choix de l'emplacement des parcs éoliens doit tenir compte des ressources éoliennes, de l'impact environnemental et des conditions de raccordement au réseau.",
      "sentence_en": "Wind farm siting requires comprehensive consideration of wind resources, environmental impact, and grid connection conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wind_farm_siting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传统手工艺人面临着如何平衡传统技艺传承与市场创新的双重挑战。",
      "sentence_pinyin": "Chuántǒng shǒugōngyìrén miànlín zhe rúhé pínghéng chuántǒng jìyì chuánchéng yǔ shìchǎng chuàngxīn de shuāngchóng tiǎozhàn.",
      "sentence_fr": "Les artisans traditionnels font face au double défi d'équilibrer la transmission des techniques traditionnelles et l'innovation pour le marché.",
      "sentence_en": "Traditional craftspeople face the dual challenge of balancing traditional skill inheritance with market innovation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "traditional_crafts_innovation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算流体力学模拟在航空器设计和天气预报中发挥着关键作用。",
      "sentence_pinyin": "Jìsuàn liútǐ lìxué mónǐ zài hángkōngqì shèjì hé tiānqì yùbào zhōng fāhuī zhe guānjiàn zuòyòng.",
      "sentence_fr": "La simulation de mécanique des fluides numérique joue un rôle clé dans la conception aéronautique et la prévision météorologique.",
      "sentence_en": "Computational fluid dynamics simulation plays a key role in aircraft design and weather forecasting.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computational_fluid_dynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新闻编辑室的数字化转型改变了新闻采集、编辑和分发的整个流程。",
      "sentence_pinyin": "Xīnwén biānjíshì de shùzìhuà zhuǎnxíng gǎibiàn le xīnwén cǎijí, biānjí hé fēnfā de zhěnggè liúchéng.",
      "sentence_fr": "La transformation numérique des salles de rédaction a changé tout le processus de collecte, d'édition et de distribution des nouvelles.",
      "sentence_en": "The digital transformation of newsrooms has changed the entire process of news gathering, editing, and distribution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_journalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
