{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "复杂系统理论揭示了简单规则如何产生难以预测的涌现行为。",
      "sentence_pinyin": "Fùzá xìtǒng lǐlùn jiēshì le jiǎndān guīzé rúhé chǎnshēng nányǐ yùcè de yǒngxiàn xíngwéi.",
      "sentence_fr": "La théorie des systèmes complexes révèle comment des règles simples peuvent produire des comportements émergents difficiles à prédire.",
      "sentence_en": "Complex systems theory reveals how simple rules can produce hard-to-predict emergent behaviors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "complex_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨境数据流动的法律监管在全球化数字经济中变得越来越复杂。",
      "sentence_pinyin": "Kuàjìng shùjù liúdòng de fǎlǜ jiānguǎn zài quánqiú huà shùzì jīngjì zhōng biàn de yuèláiyuè fùzá.",
      "sentence_fr": "La réglementation juridique des flux de données transfrontaliers devient de plus en plus complexe dans l'économie numérique mondialisée.",
      "sentence_en": "Legal regulation of cross-border data flows is becoming increasingly complex in the globalized digital economy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_sovereignty",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合成化学使科学家能够创造自然界中不存在的新分子和材料。",
      "sentence_pinyin": "Héchéng huàxué shǐ kēxué jiā nénggòu chuàngzào zìrán jiè zhōng bù cúnzài de xīn fēnzǐ hé cáiliào.",
      "sentence_fr": "La chimie de synthèse permet aux scientifiques de créer de nouvelles molécules et matériaux qui n'existent pas dans la nature.",
      "sentence_en": "Synthetic chemistry enables scientists to create new molecules and materials that don't exist in nature.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "synthetic_chemistry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "游戏化学习策略通过引入竞争和奖励机制来提高学生的学习动力。",
      "sentence_pinyin": "Yóuxì huà xuéxí cèlüè tōngguò yǐnrù jìngzhēng hé jiǎnglì jīzhì lái tígāo xuéshēng de xuéxí dònglì.",
      "sentence_fr": "Les stratégies d'apprentissage gamifié augmentent la motivation des étudiants en introduisant des mécanismes de compétition et de récompense.",
      "sentence_en": "Gamified learning strategies increase student motivation by introducing competition and reward mechanisms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gamification_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精神病学诊断的客观生物标志物研究有望改变心理疾病的评估方式。",
      "sentence_pinyin": "Jīngshén bìng xué zhěnduàn de kèguān shēngwù biāozhì wù yánjiū yǒuwàng gǎibiàn xīnlǐ jíbìng de pínggū fāngshì.",
      "sentence_fr": "La recherche sur les biomarqueurs objectifs pour le diagnostic psychiatrique pourrait transformer la façon dont les maladies mentales sont évaluées.",
      "sentence_en": "Research on objective biomarkers for psychiatric diagnosis may transform how mental illnesses are assessed.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychiatric_biomarkers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式能源系统允许家庭和企业既消费又生产电力。",
      "sentence_pinyin": "Fēnbù shì néngyuán xìtǒng yǔnxǔ jiātíng hé qǐyè jì xiāofèi yòu shēngchǎn diànlì.",
      "sentence_fr": "Les systèmes d'énergie distribuée permettent aux ménages et aux entreprises de consommer et de produire de l'électricité.",
      "sentence_en": "Distributed energy systems allow households and businesses to both consume and produce electricity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "翻译研究已从纯语言学视角扩展到包含文化、权力和意识形态的跨学科领域。",
      "sentence_pinyin": "Fānyì yánjiū yǐ cóng chún yǔyán xué shìjiǎo kuòzhǎn dào bāohán wénhuà, quánlì hé yìshí xíngtài de kuà xuékē lǐngyù.",
      "sentence_fr": "Les études de traduction se sont élargies d'une perspective purement linguistique à un domaine interdisciplinaire englobant la culture, le pouvoir et l'idéologie.",
      "sentence_en": "Translation studies have expanded from a purely linguistic perspective to an interdisciplinary field encompassing culture, power, and ideology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "translation_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可解释人工智能研究旨在使机器学习模型的决策过程更加透明和可理解。",
      "sentence_pinyin": "Kě jiěshì réngōng zhìnéng yánjiū zhǐzài shǐ jīqì xuéxí móxíng de juécè guòchéng gèngjiā tòumíng hé kě lǐjiě.",
      "sentence_fr": "La recherche sur l'intelligence artificielle explicable vise à rendre le processus de décision des modèles d'apprentissage automatique plus transparent et compréhensible.",
      "sentence_en": "Explainable AI research aims to make machine learning model decision processes more transparent and understandable.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "explainable_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土著知识体系为现代可持续发展实践提供了宝贵的传统智慧。",
      "sentence_pinyin": "Tǔzhù zhīshi tǐxì wèi xiàndài kěchíxù fāzhǎn shíjiàn tígōng le bǎoguì de chuántǒng zhìhuì.",
      "sentence_fr": "Les systèmes de connaissances autochtones fournissent une sagesse traditionnelle précieuse pour les pratiques modernes de développement durable.",
      "sentence_en": "Indigenous knowledge systems provide valuable traditional wisdom for modern sustainable development practices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "indigenous_knowledge",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络安全保险市场的快速增长反映了企业对数字风险的日益关注。",
      "sentence_pinyin": "Wǎngluò ānquán bǎoxiǎn shìchǎng de kuàisù zēngzhǎng fǎnyìng le qǐyè duì shùzì fēngxiǎn de rìyì guānzhù.",
      "sentence_fr": "La croissance rapide du marché de l'assurance cybersécurité reflète la préoccupation croissante des entreprises face aux risques numériques.",
      "sentence_en": "The rapid growth of the cybersecurity insurance market reflects businesses' increasing concern about digital risks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cyber_insurance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "运动科学研究帮助运动员通过优化训练方法和恢复策略来提高竞技表现。",
      "sentence_pinyin": "Yùndòng kēxué yánjiū bāngzhù yùndòngyuán tōngguò yōuhuà xùnliàn fāngfǎ hé huīfù cèlüè lái tígāo jìngjì biǎoxiàn.",
      "sentence_fr": "La recherche en sciences du sport aide les athlètes à améliorer leurs performances en optimisant les méthodes d'entraînement et les stratégies de récupération.",
      "sentence_en": "Sports science research helps athletes improve athletic performance by optimizing training methods and recovery strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sports_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "气候移民问题预计将在未来几十年成为国际社会面临的重大挑战。",
      "sentence_pinyin": "Qìhòu yímín wèntí yùjì jiāng zài wèilái jǐ shí nián chéngwéi guójì shèhuì miànlín de zhòngdà tiǎozhàn.",
      "sentence_fr": "Le problème des migrants climatiques devrait devenir un défi majeur pour la communauté internationale dans les décennies à venir.",
      "sentence_en": "The climate migration issue is expected to become a major challenge facing the international community in the coming decades.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "climate_migration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "材料基因组计划利用高通量计算方法加速新材料的发现和开发。",
      "sentence_pinyin": "Cáiliào jīyīn zǔ jìhuà lìyòng gāo tōngliàng jìsuàn fāngfǎ jiāsù xīn cáiliào de fāxiàn hé kāifā.",
      "sentence_fr": "L'initiative du génome des matériaux utilise des méthodes de calcul à haut débit pour accélérer la découverte et le développement de nouveaux matériaux.",
      "sentence_en": "The materials genome initiative uses high-throughput computational methods to accelerate the discovery and development of new materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "materials_genome",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公民科学项目让普通公众参与真正的科学研究和数据收集工作。",
      "sentence_pinyin": "Gōngmín kēxué xiàngmù ràng pǔtōng gōngzhòng cānyù zhēnzhèng de kēxué yánjiū hé shùjù shōují gōngzuò.",
      "sentence_fr": "Les projets de science citoyenne permettent au grand public de participer à de véritables recherches scientifiques et à la collecte de données.",
      "sentence_en": "Citizen science projects allow the general public to participate in genuine scientific research and data collection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "citizen_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "睡眠医学研究揭示了睡眠质量对认知功能和整体健康的深远影响。",
      "sentence_pinyin": "Shuìmián yīxué yánjiū jiēshì le shuìmián zhìliàng duì rènzhī gōngnéng hé zhěngtǐ jiànkāng de shēnyuǎn yǐngxiǎng.",
      "sentence_fr": "La recherche en médecine du sommeil révèle l'impact profond de la qualité du sommeil sur les fonctions cognitives et la santé globale.",
      "sentence_en": "Sleep medicine research reveals the profound impact of sleep quality on cognitive function and overall health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sleep_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "图计算框架为分析社交网络和知识图谱等复杂关系数据提供了高效工具。",
      "sentence_pinyin": "Tú jìsuàn kuàngjià wèi fēnxī shèjiāo wǎngluò hé zhīshi túpǔ děng fùzá guānxì shùjù tígōng le gāoxiào gōngjù.",
      "sentence_fr": "Les frameworks de calcul de graphes fournissent des outils efficaces pour analyser des données relationnelles complexes telles que les réseaux sociaux et les graphes de connaissances.",
      "sentence_en": "Graph computing frameworks provide efficient tools for analyzing complex relational data such as social networks and knowledge graphs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "graph_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全民基本收入实验正在多个国家进行，以评估其对贫困和就业的影响。",
      "sentence_pinyin": "Quánmín jīběn shōurù shíyàn zhèngzài duō gè guójiā jìnxíng, yǐ pínggū qí duì pínkùn hé jiùyè de yǐngxiǎng.",
      "sentence_fr": "Des expériences de revenu de base universel sont en cours dans plusieurs pays pour évaluer leur impact sur la pauvreté et l'emploi.",
      "sentence_en": "Universal basic income experiments are being conducted in several countries to assess their impact on poverty and employment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "universal_basic_income",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋生物技术从海洋生物中提取具有医药价值的化合物用于新药开发。",
      "sentence_pinyin": "Hǎiyáng shēngwù jìshù cóng hǎiyáng shēngwù zhōng tíqǔ jùyǒu yīyào jiàzhí de huàhéwù yòngyú xīn yào kāifā.",
      "sentence_fr": "La biotechnologie marine extrait des composés à valeur pharmaceutique des organismes marins pour le développement de nouveaux médicaments.",
      "sentence_en": "Marine biotechnology extracts compounds with pharmaceutical value from marine organisms for new drug development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_biotechnology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "存在主义哲学强调个人自由、选择和对人生意义的主观建构。",
      "sentence_pinyin": "Cúnzài zhǔyì zhéxué qiángdiào gèrén zìyóu, xuǎnzé hé duì rénshēng yìyì de zhǔguān jiàngòu.",
      "sentence_fr": "La philosophie existentialiste met l'accent sur la liberté individuelle, les choix et la construction subjective du sens de la vie.",
      "sentence_en": "Existentialist philosophy emphasizes individual freedom, choice, and the subjective construction of life's meaning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "existentialism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "农业机器人技术正在改变传统种植业的劳动力需求和生产效率。",
      "sentence_pinyin": "Nóngyè jīqìrén jìshù zhèngzài gǎibiàn chuántǒng zhòngzhí yè de láodònglì xūqiú hé shēngchǎn xiàolǜ.",
      "sentence_fr": "La technologie des robots agricoles transforme les besoins en main-d'œuvre et l'efficacité de production de l'agriculture traditionnelle.",
      "sentence_en": "Agricultural robotics technology is changing traditional farming's labor requirements and production efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agricultural_robotics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
