{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能语音助手可以通过自然对话控制家中的各种智能设备。",
      "sentence_pinyin": "Zhège zhìnéng yǔyīn zhùshǒu kěyǐ tōngguò zìrán duìhuà kòngzhì jiā zhōng de gèzhǒng zhìnéng shèbèi.",
      "sentence_fr": "Cet assistant vocal intelligent peut contrôler divers appareils intelligents de la maison par conversation naturelle.",
      "sentence_en": "This smart voice assistant can control various smart devices at home through natural conversation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_voice_assistants",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土族的轮子秋是青海互助地区独特的传统体育活动。",
      "sentence_pinyin": "Tǔzú de lúnziqiū shì Qīnghǎi Hùzhù dìqū dútè de chuántǒng tǐyù huódòng.",
      "sentence_fr": "La balançoire rotative de l'ethnie Tu est une activité sportive traditionnelle unique de la région de Huzhu au Qinghai.",
      "sentence_en": "The Tu ethnic group's wheel swing is a unique traditional sports activity in Qinghai's Huzhu region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tu_wheel_swing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的社区公园改造项目为居民提供了更多休闲健身空间。",
      "sentence_pinyin": "Chéngshì de shèqū gōngyuán gǎizào xiàngmù wèi jūmín tígōng le gèng duō xiūxián jiànshēn kōngjiān.",
      "sentence_fr": "Les projets de rénovation des parcs communautaires urbains offrent aux résidents plus d'espaces de loisirs et de fitness.",
      "sentence_en": "Urban community park renovation projects provide residents with more leisure and fitness spaces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_park_renovation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子门铃可以存储访客的照片和视频,方便事后查看。",
      "sentence_pinyin": "Zhìnéng diànzǐ ménlíng kěyǐ cúnchǔ fǎngkè de zhàopiàn hé shìpín, fāngbiàn shìhòu chákàn.",
      "sentence_fr": "La sonnette électronique intelligente peut stocker les photos et vidéos des visiteurs pour consultation ultérieure.",
      "sentence_en": "The smart electronic doorbell can store visitors' photos and videos for later viewing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_video_doorbells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的春节庙会是人们游玩购物和品尝小吃的热闹场所。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Chūnjié miàohuì shì rénmen yóuwán gòuwù hé pǐncháng xiǎochī de rènào chǎngsuǒ.",
      "sentence_fr": "La foire du temple traditionnelle chinoise du Nouvel An est un lieu animé pour se divertir, faire du shopping et goûter des collations.",
      "sentence_en": "Traditional Chinese Spring Festival temple fairs are lively places for people to enjoy, shop, and taste snacks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "temple_fairs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子相框可以自动轮播家庭照片,随时展示美好回忆。",
      "sentence_pinyin": "Zhìnéng diànzǐ xiàngkuàng kěyǐ zìdòng lúnbō jiātíng zhàopiàn, suíshí zhǎnshì měihǎo huíyì.",
      "sentence_fr": "Le cadre photo numérique intelligent peut faire défiler automatiquement les photos de famille, affichant de beaux souvenirs à tout moment.",
      "sentence_en": "The smart digital photo frame can automatically rotate family photos, displaying beautiful memories anytime.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_photo_frames",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仡佬族的高台舞狮是贵州地区独特的传统民俗表演。",
      "sentence_pinyin": "Gēlǎozú de gāotái wǔshī shì Guìzhōu dìqū dútè de chuántǒng mínsú biǎoyǎn.",
      "sentence_fr": "La danse du lion sur plateforme élevée de l'ethnie Gelao est une performance folklorique traditionnelle unique de la région du Guizhou.",
      "sentence_en": "The Gelao ethnic group's high platform lion dance is a unique traditional folk performance in Guizhou region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gelao_lion_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的农业补贴政策提高了农民种粮的积极性。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de nóngyè bǔtiē zhèngcè tígāo le nóngmín zhòngliáng de jījíxìng.",
      "sentence_fr": "La politique de subventions agricoles lancée par le gouvernement a augmenté l'enthousiasme des agriculteurs pour la culture des céréales.",
      "sentence_en": "The government's agricultural subsidy policy has increased farmers' enthusiasm for grain cultivation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_subsidies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能胎压监测器可以实时显示轮胎气压,保障行车安全。",
      "sentence_pinyin": "Zhìnéng tāiyā jiāncèqì kěyǐ shíshí xiǎnshì lúntāi qìyā, bǎozhàng xíngchē ānquán.",
      "sentence_fr": "Le capteur de pression des pneus intelligent peut afficher en temps réel la pression des pneus, garantissant la sécurité de conduite.",
      "sentence_en": "The smart tire pressure monitor can display tire pressure in real-time, ensuring driving safety.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_tire_monitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的猜灯谜习俗是元宵节期间的趣味活动之一。",
      "sentence_pinyin": "Zhōngguó chuántǒng de cāi dēngmí xísú shì Yuánxiāojié qījiān de qùwèi huódòng zhī yī.",
      "sentence_fr": "La coutume traditionnelle chinoise de résoudre des énigmes de lanternes est l'une des activités amusantes pendant la Fête des Lanternes.",
      "sentence_en": "The traditional Chinese lantern riddle guessing custom is one of the fun activities during the Lantern Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lantern_riddles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能行车记录仪可以拍摄高清视频,记录行车过程中的一切。",
      "sentence_pinyin": "Zhìnéng xíngchē jìlùyí kěyǐ pāishè gāoqīng shìpín, jìlù xíngchē guòchéng zhōng de yīqiè.",
      "sentence_fr": "La dashcam intelligente peut enregistrer des vidéos HD, capturant tout pendant la conduite.",
      "sentence_en": "The smart dash cam can record HD video, capturing everything during driving.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dash_cams",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "毛南族的傩面具是广西环江地区独特的民间工艺品。",
      "sentence_pinyin": "Máonánzú de nuó miànjù shì Guǎngxī Huánjiāng dìqū dútè de mínjiān gōngyìpǐn.",
      "sentence_fr": "Les masques Nuo de l'ethnie Maonan sont des objets artisanaux folkloriques uniques de la région de Huanjiang au Guangxi.",
      "sentence_en": "The Maonan ethnic group's Nuo masks are unique folk crafts of Guangxi's Huanjiang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maonan_nuo_masks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的15分钟生活圈建设让居民的日常生活更加便利。",
      "sentence_pinyin": "Chéngshì de shíwǔ fēnzhōng shēnghuó quān jiànshè ràng jūmín de rìcháng shēnghuó gèngjiā biànlì.",
      "sentence_fr": "La construction du cercle de vie de 15 minutes rend la vie quotidienne des résidents plus pratique.",
      "sentence_en": "Urban 15-minute living circle construction makes residents' daily life more convenient.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "15_minute_city",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子标签可以追踪物品位置,防止贵重物品丢失。",
      "sentence_pinyin": "Zhìnéng diànzǐ biāoqiān kěyǐ zhuīzōng wùpǐn wèizhì, fángzhǐ guìzhòng wùpǐn diūshī.",
      "sentence_fr": "Les traceurs électroniques intelligents peuvent localiser des objets, évitant la perte d'objets de valeur.",
      "sentence_en": "Smart electronic tags can track item locations, preventing valuable items from being lost.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_item_trackers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的踩高跷表演是庙会和节庆活动中的精彩节目。",
      "sentence_pinyin": "Zhōngguó chuántǒng de cǎi gāoqiāo biǎoyǎn shì miàohuì hé jiéqìng huódòng zhōng de jīngcǎi jiémù.",
      "sentence_fr": "La performance traditionnelle chinoise des échasses est un spectacle passionnant lors des foires et des célébrations festives.",
      "sentence_en": "Traditional Chinese stilt walking performances are exciting shows at temple fairs and festive activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stilt_walking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能充电宝可以无线充电,同时为多台设备供电。",
      "sentence_pinyin": "Zhìnéng chōngdiànbǎo kěyǐ wúxiàn chōngdiàn, tóngshí wèi duō tái shèbèi gōngdiàn.",
      "sentence_fr": "La batterie externe intelligente peut charger sans fil et alimenter plusieurs appareils simultanément.",
      "sentence_en": "The smart power bank can charge wirelessly and power multiple devices simultaneously.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_power_banks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "京族的哈节是广西防城港地区独特的传统节日。",
      "sentence_pinyin": "Jīngzú de Hājié shì Guǎngxī Fángchénggǎng dìqū dútè de chuántǒng jiérì.",
      "sentence_fr": "La Fête Ha de l'ethnie Jing est une fête traditionnelle unique de la région de Fangchenggang au Guangxi.",
      "sentence_en": "The Jing ethnic group's Ha Festival is a unique traditional festival of Guangxi's Fangchenggang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jing_ha_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展的心理健康服务帮助居民缓解生活和工作压力。",
      "sentence_pinyin": "Shèqū kāizhǎn de xīnlǐ jiànkāng fúwù bāngzhù jūmín huǎnjiě shēnghuó hé gōngzuò yālì.",
      "sentence_fr": "Les services de santé mentale offerts par la communauté aident les résidents à soulager le stress de la vie et du travail.",
      "sentence_en": "Community mental health services help residents relieve life and work stress.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mental_health_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能汽车钥匙可以远程启动车辆并控制空调提前降温。",
      "sentence_pinyin": "Zhìnéng qìchē yàoshi kěyǐ yuǎnchéng qǐdòng chēliàng bìng kòngzhì kōngtiáo tíqián jiàngwēn.",
      "sentence_fr": "La clé de voiture intelligente peut démarrer le véhicule à distance et activer la climatisation pour refroidir à l'avance.",
      "sentence_en": "The smart car key can remotely start the vehicle and control the air conditioner to cool down in advance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_car_keys",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的扭秧歌表演是北方地区节庆活动中的热闘场面。",
      "sentence_pinyin": "Zhōngguó chuántǒng de niǔ yānggē biǎoyǎn shì běifāng dìqū jiéqìng huódòng zhōng de rènào chǎngmiàn.",
      "sentence_fr": "La performance traditionnelle chinoise de yangge est une scène animée lors des célébrations festives dans le nord de la Chine.",
      "sentence_en": "Traditional Chinese yangge dance performances are lively scenes during festive activities in northern regions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yangge_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
