{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "月球潮汐锁定导致其始终以同一面朝向地球。",
      "sentence_pinyin": "Yuèqiú cháoxī suǒdìng dǎozhì qí shǐzhōng yǐ tóng yī miàn cháoxiàng dìqiú.",
      "sentence_fr": "Le verrouillage gravitationnel de la Lune fait qu'elle présente toujours la même face vers la Terre.",
      "sentence_en": "The Moon's tidal locking causes it to always face the same side toward Earth.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tidal_locking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非同质化代币为数字资产提供独特的所有权证明。",
      "sentence_pinyin": "Fēi tóngzhìhuà dàibì wèi shùzì zīchǎn tígōng dútè de suǒyǒuquán zhèngmíng.",
      "sentence_fr": "Les jetons non fongibles fournissent une preuve de propriété unique pour les actifs numériques.",
      "sentence_en": "Non-fungible tokens provide unique proof of ownership for digital assets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "non_fungible_tokens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内容分发网络通过地理分布的服务器加速内容传递。",
      "sentence_pinyin": "Nèiróng fēnfā wǎngluò tōngguò dìlǐ fēnbù de fúwùqì jiāsù nèiróng chuándì.",
      "sentence_fr": "Les réseaux de diffusion de contenu accélèrent la livraison de contenu via des serveurs géographiquement distribués.",
      "sentence_en": "Content delivery networks accelerate content delivery through geographically distributed servers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "content_delivery_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "整体论认为系统整体具有超越其部分之和的特性。",
      "sentence_pinyin": "Zhěngtǐlùn rènwéi xìtǒng zhěngtǐ jùyǒu chāoyuè qí bùfèn zhī hé de tèxìng.",
      "sentence_fr": "L'holisme soutient qu'un système dans son ensemble possède des propriétés dépassant la somme de ses parties.",
      "sentence_en": "Holism holds that a system as a whole possesses properties beyond the sum of its parts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "holism_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "应用程序接口网关统一管理和保护后端服务的访问。",
      "sentence_pinyin": "Yìngyòng chéngxù jiēkǒu wǎngguān tǒngyī guǎnlǐ hé bǎohù hòuduān fúwù de fǎngwèn.",
      "sentence_fr": "Les passerelles API gèrent et protègent de manière centralisée l'accès aux services backend.",
      "sentence_en": "API gateways centrally manage and protect access to backend services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "api_gateways",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地球轨道倾角变化是影响冰期周期的米兰科维奇因素之一。",
      "sentence_pinyin": "Dìqiú guǐdào qīngjiǎo biànhuà shì yǐngxiǎng bīngqī zhōuqī de Mǐlánkēwéiqí yīnsù zhī yī.",
      "sentence_fr": "La variation de l'obliquité orbitale de la Terre est l'un des facteurs de Milankovitch affectant les cycles glaciaires.",
      "sentence_en": "Earth's orbital obliquity variation is one of the Milankovitch factors affecting ice age cycles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "milankovitch_cycles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "去中心化自治组织通过智能合约实现集体决策治理。",
      "sentence_pinyin": "Qù zhōngxīnhuà zìzhì zǔzhī tōngguò zhìnéng héyuē shíxiàn jítǐ juécè zhìlǐ.",
      "sentence_fr": "Les organisations autonomes décentralisées réalisent une gouvernance décisionnelle collective via des contrats intelligents.",
      "sentence_en": "Decentralized autonomous organizations achieve collective decision-making governance through smart contracts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "decentralized_organizations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密钥管理服务安全存储和轮换加密密钥以保护数据。",
      "sentence_pinyin": "Mìyào guǎnlǐ fúwù ānquán cúnchǔ hé lúnhuàn jiāmì mìyào yǐ bǎohù shùjù.",
      "sentence_fr": "Les services de gestion des clés stockent et effectuent la rotation des clés de chiffrement en toute sécurité pour protéger les données.",
      "sentence_en": "Key management services securely store and rotate encryption keys to protect data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "key_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然主义认为一切现象都可以用自然原因来解释。",
      "sentence_pinyin": "Zìrán zhǔyì rènwéi yīqiè xiànxiàng dōu kěyǐ yòng zìrán yuányīn lái jiěshì.",
      "sentence_fr": "Le naturalisme soutient que tous les phénomènes peuvent être expliqués par des causes naturelles.",
      "sentence_en": "Naturalism holds that all phenomena can be explained by natural causes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "naturalism_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "对象存储系统以扁平命名空间管理海量非结构化数据。",
      "sentence_pinyin": "Duìxiàng cúnchǔ xìtǒng yǐ biǎnpíng mìngmíng kōngjiān guǎnlǐ hǎiliàng fēi jiégòuhuà shùjù.",
      "sentence_fr": "Les systèmes de stockage d'objets gèrent d'énormes quantités de données non structurées avec un espace de noms plat.",
      "sentence_en": "Object storage systems manage massive unstructured data with a flat namespace.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "object_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行星逆行是由于地球和外行星轨道速度差异造成的视觉效果。",
      "sentence_pinyin": "Xíngxīng nìxíng shì yóuyú dìqiú hé wài xíngxīng guǐdào sùdù chāyì zàochéng de shìjué xiàoguǒ.",
      "sentence_fr": "La rétrogradation planétaire est un effet visuel causé par la différence de vitesse orbitale entre la Terre et les planètes extérieures.",
      "sentence_en": "Planetary retrograde motion is a visual effect caused by orbital speed differences between Earth and outer planets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "planetary_retrograde",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流动性挖矿激励用户向去中心化交易所提供流动性。",
      "sentence_pinyin": "Liúdòngxìng wākuàng jīlì yònghù xiàng qù zhōngxīnhuà jiāoyìsuǒ tígōng liúdòngxìng.",
      "sentence_fr": "Le yield farming incite les utilisateurs à fournir de la liquidité aux échanges décentralisés.",
      "sentence_en": "Liquidity mining incentivizes users to provide liquidity to decentralized exchanges.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "liquidity_mining",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "服务发现机制自动检测和注册分布式系统中的服务实例。",
      "sentence_pinyin": "Fúwù fāxiàn jīzhì zìdòng jiǎncè hé zhùcè fēnbùshì xìtǒng zhōng de fúwù shílì.",
      "sentence_fr": "Les mécanismes de découverte de services détectent et enregistrent automatiquement les instances de service dans les systèmes distribués.",
      "sentence_en": "Service discovery mechanisms automatically detect and register service instances in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "service_discovery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "因果关系是哲学和科学中解释事件联系的核心概念。",
      "sentence_pinyin": "Yīnguǒ guānxì shì zhéxué hé kēxué zhōng jiěshì shìjiàn liánxì de héxīn gàiniàn.",
      "sentence_fr": "La causalité est un concept central en philosophie et en science pour expliquer les liens entre les événements.",
      "sentence_en": "Causality is a central concept in philosophy and science for explaining connections between events.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "causality_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "断路器模式防止分布式系统中的级联故障传播。",
      "sentence_pinyin": "Duànlùqì móshì fángzhǐ fēnbùshì xìtǒng zhōng de jíliàn gùzhàng chuánbò.",
      "sentence_fr": "Le modèle de disjoncteur empêche la propagation des défaillances en cascade dans les systèmes distribués.",
      "sentence_en": "The circuit breaker pattern prevents cascading failure propagation in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circuit_breaker_pattern",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拉格朗日点是两天体引力平衡的特殊空间位置。",
      "sentence_pinyin": "Lāgélǎngrì diǎn shì liǎng tiāntǐ yǐnlì pínghéng de tèshū kōngjiān wèizhì.",
      "sentence_fr": "Les points de Lagrange sont des positions spatiales spéciales où les forces gravitationnelles de deux corps s'équilibrent.",
      "sentence_en": "Lagrange points are special spatial positions where the gravitational forces of two bodies balance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "lagrange_points",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "权益证明机制通过持有代币来验证区块链交易。",
      "sentence_pinyin": "Quányì zhèngmíng jīzhì tōngguò chíyǒu dàibì lái yànzhèng qūkuàiliàn jiāoyì.",
      "sentence_fr": "Le mécanisme de preuve d'enjeu valide les transactions blockchain en détenant des jetons.",
      "sentence_en": "The proof-of-stake mechanism validates blockchain transactions by holding tokens.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "proof_of_stake",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "配置中心集中管理分布式应用的动态配置参数。",
      "sentence_pinyin": "Pèizhì zhōngxīn jízhōng guǎnlǐ fēnbùshì yìngyòng de dòngtài pèizhì cānshù.",
      "sentence_fr": "Les centres de configuration gèrent de manière centralisée les paramètres de configuration dynamiques des applications distribuées.",
      "sentence_en": "Configuration centers centrally manage dynamic configuration parameters for distributed applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "configuration_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间哲学探讨时间的本质以及过去现在和未来的关系。",
      "sentence_pinyin": "Shíjiān zhéxué tàntǎo shíjiān de běnzhì yǐjí guòqù xiànzài hé wèilái de guānxì.",
      "sentence_fr": "La philosophie du temps explore la nature du temps et les relations entre passé, présent et futur.",
      "sentence_en": "Philosophy of time explores the nature of time and the relationships between past, present, and future.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_time",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "限流策略保护系统在高流量时不被过载请求压垮。",
      "sentence_pinyin": "Xiànliú cèlüè bǎohù xìtǒng zài gāo liúliàng shí bù bèi guòzài qǐngqiú yākuǎ.",
      "sentence_fr": "Les stratégies de limitation de débit protègent les systèmes contre la surcharge de requêtes en cas de fort trafic.",
      "sentence_en": "Rate limiting strategies protect systems from being overwhelmed by excessive requests during high traffic.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rate_limiting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
