{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "认知偏误研究帮助我们理解人类决策过程中的系统性思维错误。",
      "sentence_pinyin": "Rènzhī piānwù yánjiū bāngzhù wǒmen lǐjiě rénlèi juécè guòchéng zhōng de xìtǒng xìng sīwéi cuòwù.",
      "sentence_fr": "La recherche sur les biais cognitifs nous aide à comprendre les erreurs de pensée systématiques dans les processus décisionnels humains.",
      "sentence_en": "Cognitive bias research helps us understand systematic thinking errors in human decision-making processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_biases",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳能海水淡化技术为水资源短缺地区提供了可持续的淡水解决方案。",
      "sentence_pinyin": "Tàiyáng néng hǎishuǐ dànhuà jìshù wèi shuǐ zīyuán duǎnquē dìqū tígōng le kěchíxù de dànshuǐ jiějué fāng'àn.",
      "sentence_fr": "La technologie de dessalement solaire offre des solutions durables d'eau douce pour les régions en pénurie d'eau.",
      "sentence_en": "Solar desalination technology provides sustainable freshwater solutions for water-scarce regions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_desalination",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "叙事身份理论认为我们通过讲述自己的人生故事来构建自我认同。",
      "sentence_pinyin": "Xùshì shēnfèn lǐlùn rènwéi wǒmen tōngguò jiǎngshù zìjǐ de rénshēng gùshì lái jiàngòu zìwǒ rèntóng.",
      "sentence_fr": "La théorie de l'identité narrative suggère que nous construisons notre identité en racontant l'histoire de notre vie.",
      "sentence_en": "Narrative identity theory suggests that we construct our self-identity by telling our life stories.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_identity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合现实技术将虚拟元素无缝融入真实世界环境中创造沉浸式体验。",
      "sentence_pinyin": "Hùnhé xiànshí jìshù jiāng xūnǐ yuánsù wúfèng róngrù zhēnshí shìjiè huánjìng zhōng chuàngzào chénjìn shì tǐyàn.",
      "sentence_fr": "La technologie de réalité mixte intègre de manière transparente des éléments virtuels dans l'environnement du monde réel pour créer des expériences immersives.",
      "sentence_en": "Mixed reality technology seamlessly integrates virtual elements into real-world environments to create immersive experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mixed_reality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "负责任的人工智能开发需要在创新速度与安全保障之间取得平衡。",
      "sentence_pinyin": "Fùzé rèn de réngōng zhìnéng kāifā xūyào zài chuàngxīn sùdù yǔ ānquán bǎozhàng zhījiān qǔdé pínghéng.",
      "sentence_fr": "Le développement responsable de l'intelligence artificielle nécessite un équilibre entre la vitesse d'innovation et les garanties de sécurité.",
      "sentence_en": "Responsible AI development requires balancing innovation speed with safety guarantees.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "responsible_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "历史地理学研究过去的地理环境如何塑造了人类文明的发展轨迹。",
      "sentence_pinyin": "Lìshǐ dìlǐ xué yánjiū guòqù de dìlǐ huánjìng rúhé sùzào le rénlèi wénmíng de fāzhǎn guǐjì.",
      "sentence_fr": "La géographie historique étudie comment les environnements géographiques du passé ont façonné la trajectoire du développement de la civilisation humaine.",
      "sentence_en": "Historical geography studies how past geographical environments shaped the trajectory of human civilization development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "historical_geography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微流体芯片技术使科学家能够在极小尺度上进行复杂的生化实验。",
      "sentence_pinyin": "Wēi liútǐ xīnpiàn jìshù shǐ kēxué jiā nénggòu zài jí xiǎo chǐdù shàng jìnxíng fùzá de shēnghuà shíyàn.",
      "sentence_fr": "La technologie des puces microfluidiques permet aux scientifiques de mener des expériences biochimiques complexes à très petite échelle.",
      "sentence_en": "Microfluidic chip technology enables scientists to conduct complex biochemical experiments at extremely small scales.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microfluidics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无障碍设计原则确保产品和服务能够被所有能力水平的人使用。",
      "sentence_pinyin": "Wúzhàng'ài shèjì yuánzé quèbǎo chǎnpǐn hé fúwù nénggòu bèi suǒyǒu nénglì shuǐpíng de rén shǐyòng.",
      "sentence_fr": "Les principes de conception accessible garantissent que les produits et services peuvent être utilisés par des personnes de tous niveaux de capacité.",
      "sentence_en": "Accessible design principles ensure products and services can be used by people of all ability levels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "accessible_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "气象卫星网络为极端天气预警和气候监测提供了关键的实时数据。",
      "sentence_pinyin": "Qìxiàng wèixīng wǎngluò wèi jíduān tiānqì yùjǐng hé qìhòu jiāncè tígōng le guānjiàn de shíshí shùjù.",
      "sentence_fr": "Le réseau de satellites météorologiques fournit des données en temps réel essentielles pour les alertes météorologiques extrêmes et la surveillance climatique.",
      "sentence_en": "Weather satellite networks provide critical real-time data for extreme weather warnings and climate monitoring.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "weather_satellites",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "法医语言学通过分析语言特征帮助调查人员确定文本的作者身份。",
      "sentence_pinyin": "Fǎyī yǔyán xué tōngguò fēnxī yǔyán tèzhēng bāngzhù diàochá rényuán quèdìng wénběn de zuòzhě shēnfèn.",
      "sentence_fr": "La linguistique médico-légale aide les enquêteurs à déterminer l'identité de l'auteur d'un texte en analysant les caractéristiques linguistiques.",
      "sentence_en": "Forensic linguistics helps investigators determine text authorship by analyzing linguistic features.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "forensic_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电动垂直起降飞行器有望在未来城市交通中发挥重要作用。",
      "sentence_pinyin": "Diàndòng chuízhí qǐjiàng fēixíng qì yǒuwàng zài wèilái chéngshì jiāotōng zhōng fāhuī zhòngyào zuòyòng.",
      "sentence_fr": "Les véhicules électriques à décollage et atterrissage verticaux devraient jouer un rôle important dans le transport urbain futur.",
      "sentence_en": "Electric vertical takeoff and landing aircraft are expected to play an important role in future urban transportation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evtol_aircraft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "慢性炎症与多种疾病包括心血管疾病和某些癌症之间存在密切关联。",
      "sentence_pinyin": "Mànxìng yánzhèng yǔ duō zhǒng jíbìng bāokuò xīnxuèguǎn jíbìng hé mǒu xiē áizhèng zhījiān cúnzài mìqiè guānlián.",
      "sentence_fr": "L'inflammation chronique est étroitement associée à de nombreuses maladies, notamment les maladies cardiovasculaires et certains cancers.",
      "sentence_en": "Chronic inflammation is closely associated with multiple diseases including cardiovascular disease and certain cancers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "chronic_inflammation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "民主创新实践探索如何让公民更直接地参与政策决策过程。",
      "sentence_pinyin": "Mínzhǔ chuàngxīn shíjiàn tànsuǒ rúhé ràng gōngmín gèng zhíjiē de cānyù zhèngcè juécè guòchéng.",
      "sentence_fr": "Les pratiques d'innovation démocratique explorent comment permettre aux citoyens de participer plus directement aux processus décisionnels politiques.",
      "sentence_en": "Democratic innovation practices explore how to enable citizens to participate more directly in policy decision-making processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "democratic_innovation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子密钥分发系统利用量子力学原理提供理论上不可破解的加密通信。",
      "sentence_pinyin": "Liàngzǐ mìyào fēnfā xìtǒng lìyòng liàngzǐ lìxué yuánlǐ tígōng lǐlùn shàng bùkě pòjiě de jiāmì tōngxìn.",
      "sentence_fr": "Les systèmes de distribution de clés quantiques utilisent les principes de la mécanique quantique pour fournir une communication cryptée théoriquement inviolable.",
      "sentence_en": "Quantum key distribution systems use quantum mechanics principles to provide theoretically unbreakable encrypted communication.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化旅游的可持续发展需要在吸引游客与保护文化遗产之间寻找平衡。",
      "sentence_pinyin": "Wénhuà lǚyóu de kěchíxù fāzhǎn xūyào zài xīyǐn yóukè yǔ bǎohù wénhuà yíchǎn zhījiān xúnzhǎo pínghéng.",
      "sentence_fr": "Le développement durable du tourisme culturel nécessite de trouver un équilibre entre l'attraction des touristes et la protection du patrimoine culturel.",
      "sentence_en": "Sustainable development of cultural tourism requires finding a balance between attracting tourists and protecting cultural heritage.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_tourism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经反馈训练帮助个人学习调节自己的脑电波模式以改善注意力和情绪。",
      "sentence_pinyin": "Shénjīng fǎnkuì xùnliàn bāngzhù gèrén xuéxí tiáojié zìjǐ de nǎo diànbō móshì yǐ gǎishàn zhùyì lì hé qíngxù.",
      "sentence_fr": "L'entraînement par neurofeedback aide les individus à apprendre à réguler leurs ondes cérébrales pour améliorer l'attention et l'humeur.",
      "sentence_en": "Neurofeedback training helps individuals learn to regulate their brainwave patterns to improve attention and mood.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neurofeedback",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "供应链可追溯性系统使消费者能够了解产品从原材料到零售的完整历程。",
      "sentence_pinyin": "Gōngyìng liàn kězhuīsù xìng xìtǒng shǐ xiāofèi zhě nénggòu liǎojiě chǎnpǐn cóng yuáncáiliào dào língshòu de wánzhěng lìchéng.",
      "sentence_fr": "Les systèmes de traçabilité de la chaîne d'approvisionnement permettent aux consommateurs de connaître le parcours complet d'un produit, des matières premières à la vente au détail.",
      "sentence_en": "Supply chain traceability systems enable consumers to understand a product's complete journey from raw materials to retail.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supply_chain_traceability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地质年代学利用放射性同位素衰变来精确测定岩石和化石的年龄。",
      "sentence_pinyin": "Dìzhì niándài xué lìyòng fàngshè xìng tónwèisù shuāibiàn lái jīngquè cèdìng yánshí hé huàshí de niánlíng.",
      "sentence_fr": "La géochronologie utilise la désintégration des isotopes radioactifs pour déterminer précisément l'âge des roches et des fossiles.",
      "sentence_en": "Geochronology uses radioactive isotope decay to precisely determine the age of rocks and fossils.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geochronology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动化测试框架显著提高了软件开发过程中的代码质量和发布效率。",
      "sentence_pinyin": "Zìdòng huà cèshì kuàngjià xiǎnzhù tígāo le ruǎnjiàn kāifā guòchéng zhōng de dàimǎ zhìliàng hé fābù xiàolǜ.",
      "sentence_fr": "Les frameworks de tests automatisés améliorent considérablement la qualité du code et l'efficacité des versions dans le processus de développement logiciel.",
      "sentence_en": "Automated testing frameworks significantly improve code quality and release efficiency in the software development process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "automated_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心理弹性研究探索人们如何从逆境中恢复并适应压力性生活事件。",
      "sentence_pinyin": "Xīnlǐ tánxìng yánjiū tànsuǒ rénmen rúhé cóng nìjìng zhōng huīfù bìng shìyìng yālì xìng shēnghuó shìjiàn.",
      "sentence_fr": "La recherche sur la résilience psychologique explore comment les gens se remettent de l'adversité et s'adaptent aux événements de vie stressants.",
      "sentence_en": "Psychological resilience research explores how people recover from adversity and adapt to stressful life events.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychological_resilience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
