{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "材料科学研究不同材料的微观结构如何决定其宏观性能和应用潜力。",
      "sentence_pinyin": "Cáiliào kēxué yánjiū bùtóng cáiliào de wēiguān jiégòu rúhé juédìng qí hóngguān xìngnéng hé yìngyòng qiánlì.",
      "sentence_fr": "La science des matériaux étudie comment la microstructure des différents matériaux détermine leurs propriétés macroscopiques et leur potentiel d'application.",
      "sentence_en": "Materials science studies how the microstructure of different materials determines their macroscopic properties and application potential.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "materials_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二语习得研究探讨成人学习者如何以及为何学习第二语言的认知过程。",
      "sentence_pinyin": "Èr yǔ xídé yánjiū tàntǎo chéngrén xuéxí zhě rúhé yǐjí wèihé xuéxí dì'èr yǔyán de rènzhī guòchéng.",
      "sentence_fr": "La recherche sur l'acquisition d'une langue seconde explore les processus cognitifs de comment et pourquoi les apprenants adultes apprennent une deuxième langue.",
      "sentence_en": "Second language acquisition research explores the cognitive processes of how and why adult learners learn a second language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "second_language_acquisition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "事件驱动架构使系统能够实时响应业务事件并实现松耦合的组件集成。",
      "sentence_pinyin": "Shìjiàn qūdòng jiàgòu shǐ xìtǒng nénggòu shíshí xiǎngyìng yèwù shìjiàn bìng shíxiàn sōng ǒuhé de zǔjiàn jíchéng.",
      "sentence_fr": "L'architecture pilotée par les événements permet aux systèmes de répondre en temps réel aux événements métier et d'intégrer des composants faiblement couplés.",
      "sentence_en": "Event-driven architecture enables systems to respond to business events in real-time and achieve loosely coupled component integration.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "event_driven_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态旅游在保护自然环境的同时为当地社区提供经济发展机会。",
      "sentence_pinyin": "Shēngtài lǚyóu zài bǎohù zìrán huánjìng de tóngshí wèi dāngdì shèqū tígōng jīngjì fāzhǎn jīhuì.",
      "sentence_fr": "L'écotourisme offre des opportunités de développement économique aux communautés locales tout en protégeant l'environnement naturel.",
      "sentence_en": "Ecotourism provides economic development opportunities for local communities while protecting the natural environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecotourism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会认同理论解释了个人如何通过群体成员身份来构建自我概念。",
      "sentence_pinyin": "Shèhuì rèntóng lǐlùn jiěshìle gèrén rúhé tōngguò qúntǐ chéngyuán shēnfèn lái gòujiàn zìwǒ gàiniàn.",
      "sentence_fr": "La théorie de l'identité sociale explique comment les individus construisent leur concept de soi à travers leur appartenance à un groupe.",
      "sentence_en": "Social identity theory explains how individuals construct their self-concept through group membership.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_identity_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基因组编辑技术为治疗遗传性疾病提供了前所未有的精确干预可能性。",
      "sentence_pinyin": "Jīyīn zǔ biānjí jìshù wèi zhìliáo yíchuánxìng jíbìng tígōngle qiánsuǒwèiyǒu de jīngquè gānyù kěnéngxìng.",
      "sentence_fr": "La technologie d'édition du génome offre des possibilités d'intervention précise sans précédent pour le traitement des maladies génétiques.",
      "sentence_en": "Genome editing technology provides unprecedented possibilities for precise intervention in treating genetic diseases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "genome_editing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "应用伦理学将道德理论应用于商业、医学和环境等领域的实际问题。",
      "sentence_pinyin": "Yìngyòng lúnlǐxué jiāng dàodé lǐlùn yìngyòng yú shāngyè, yīxué hé huánjìng děng lǐngyù de shíjì wèntí.",
      "sentence_fr": "L'éthique appliquée applique les théories morales aux problèmes pratiques dans des domaines comme les affaires, la médecine et l'environnement.",
      "sentence_en": "Applied ethics applies moral theories to practical problems in fields such as business, medicine, and the environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "applied_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间序列分析方法用于预测股价、天气和其他随时间变化的数据。",
      "sentence_pinyin": "Shíjiān xùliè fēnxī fāngfǎ yòng yú yùcè gǔjià, tiānqì hé qítā suí shíjiān biànhuà de shùjù.",
      "sentence_fr": "Les méthodes d'analyse des séries temporelles sont utilisées pour prédire les cours boursiers, la météo et d'autres données qui varient dans le temps.",
      "sentence_en": "Time series analysis methods are used to predict stock prices, weather, and other data that changes over time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "time_series_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极端天气事件的频率增加与全球气候变化有着密切的科学联系。",
      "sentence_pinyin": "Jíduān tiānqì shìjiàn de pínlǜ zēngjiā yǔ quánqiú qìhòu biànhuà yǒuzhe mìqiè de kēxué liánxì.",
      "sentence_fr": "L'augmentation de la fréquence des événements météorologiques extrêmes est étroitement liée au changement climatique mondial sur le plan scientifique.",
      "sentence_en": "The increased frequency of extreme weather events has close scientific connections to global climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "extreme_weather",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心理测量学研究如何科学地测量心理特质和能力以确保测验的有效性。",
      "sentence_pinyin": "Xīnlǐ cèliángxué yánjiū rúhé kēxué de cèliáng xīnlǐ tèzhì hé nénglì yǐ quèbǎo cèyàn de yǒuxiàoxìng.",
      "sentence_fr": "La psychométrie étudie comment mesurer scientifiquement les traits psychologiques et les capacités pour assurer la validité des tests.",
      "sentence_en": "Psychometrics studies how to scientifically measure psychological traits and abilities to ensure test validity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychometrics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "领域驱动设计帮助开发团队构建反映复杂业务逻辑的软件架构。",
      "sentence_pinyin": "Lǐngyù qūdòng shèjì bāngzhù kāifā tuánduì gòujiàn fǎnyìng fùzá yèwù luójí de ruǎnjiàn jiàgòu.",
      "sentence_fr": "La conception pilotée par le domaine aide les équipes de développement à construire une architecture logicielle qui reflète une logique métier complexe.",
      "sentence_en": "Domain-driven design helps development teams build software architecture that reflects complex business logic.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "domain_driven_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "物种保护策略包括栖息地保护、人工繁殖和物种再引入计划。",
      "sentence_pinyin": "Wùzhǒng bǎohù cèlüè bāokuò qīxīdì bǎohù, réngōng fánzhí hé wùzhǒng zài yǐnrù jìhuà.",
      "sentence_fr": "Les stratégies de conservation des espèces comprennent la protection de l'habitat, la reproduction artificielle et les programmes de réintroduction.",
      "sentence_en": "Species conservation strategies include habitat protection, artificial breeding, and species reintroduction programs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "species_conservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "经济地理学分析产业集群、贸易模式和区域经济不平等的空间分布。",
      "sentence_pinyin": "Jīngjì dìlǐxué fēnxī chǎnyè jíqún, màoyì móshì hé qūyù jīngjì bù píngděng de kōngjiān fēnbù.",
      "sentence_fr": "La géographie économique analyse la distribution spatiale des clusters industriels, des modèles commerciaux et des inégalités économiques régionales.",
      "sentence_en": "Economic geography analyzes the spatial distribution of industrial clusters, trade patterns, and regional economic inequality.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "economic_geography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "转录组学研究细胞中基因表达的整体模式以了解生物功能调控。",
      "sentence_pinyin": "Zhuǎnlù zǔxué yánjiū xìbāo zhōng jīyīn biǎodá de zhěngtǐ móshì yǐ liǎojiě shēngwù gōngnéng tiáokòng.",
      "sentence_fr": "La transcriptomique étudie les modèles globaux d'expression génétique dans les cellules pour comprendre la régulation des fonctions biologiques.",
      "sentence_en": "Transcriptomics studies global patterns of gene expression in cells to understand biological function regulation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transcriptomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "信息检索系统使用索引和排序算法来高效地查找相关文档。",
      "sentence_pinyin": "Xìnxī jiǎnsuǒ xìtǒng shǐyòng suǒyǐn hé páixù suànfǎ lái gāoxiào de cházhǎo xiāngguān wéndàng.",
      "sentence_fr": "Les systèmes de recherche d'information utilisent des algorithmes d'indexation et de classement pour trouver efficacement des documents pertinents.",
      "sentence_en": "Information retrieval systems use indexing and ranking algorithms to efficiently find relevant documents.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "information_retrieval",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "民族志研究方法强调研究者深入参与并理解被研究群体的日常生活。",
      "sentence_pinyin": "Mínzú zhì yánjiū fāngfǎ qiángdiào yánjiū zhě shēnrù cānyù bìng lǐjiě bèi yánjiū qúntǐ de rìcháng shēnghuó.",
      "sentence_fr": "Les méthodes de recherche ethnographique soulignent l'engagement profond du chercheur et la compréhension de la vie quotidienne du groupe étudié.",
      "sentence_en": "Ethnographic research methods emphasize the researcher's deep involvement and understanding of the studied group's daily life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ethnographic_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "绿色建筑设计采用节能技术和可持续材料来减少环境影响。",
      "sentence_pinyin": "Lǜsè jiànzhù shèjì cǎiyòng jiénéng jìshù hé kě chíxù cáiliào lái jiǎnshǎo huánjìng yǐngxiǎng.",
      "sentence_fr": "La conception de bâtiments verts utilise des technologies économes en énergie et des matériaux durables pour réduire l'impact environnemental.",
      "sentence_en": "Green building design adopts energy-efficient technologies and sustainable materials to reduce environmental impact.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_building",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流行病学研究疾病在人群中的分布规律和影响因素以制定预防策略。",
      "sentence_pinyin": "Liúxíngbìngxué yánjiū jíbìng zài rénqún zhōng de fēnbù guīlǜ hé yǐngxiǎng yīnsù yǐ zhìdìng yùfáng cèlüè.",
      "sentence_fr": "L'épidémiologie étudie les modèles de distribution des maladies dans les populations et les facteurs d'influence pour développer des stratégies de prévention.",
      "sentence_en": "Epidemiology studies disease distribution patterns in populations and influencing factors to develop prevention strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epidemiology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "深度学习框架简化了神经网络的开发和训练过程。",
      "sentence_pinyin": "Shēndù xuéxí kuàngjià jiǎnhuàle shénjīng wǎngluò de kāifā hé xùnliàn guòchéng.",
      "sentence_fr": "Les frameworks d'apprentissage profond simplifient le processus de développement et d'entraînement des réseaux neuronaux.",
      "sentence_en": "Deep learning frameworks simplify the development and training process of neural networks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deep_learning_frameworks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会分层研究分析社会中权力、财富和地位的不平等分配机制。",
      "sentence_pinyin": "Shèhuì fēncéng yánjiū fēnxī shèhuì zhōng quánlì, cáifù hé dìwèi de bù píngděng fēnpèi jīzhì.",
      "sentence_fr": "Les études sur la stratification sociale analysent les mécanismes de distribution inégale du pouvoir, de la richesse et du statut dans la société.",
      "sentence_en": "Social stratification studies analyze the mechanisms of unequal distribution of power, wealth, and status in society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_stratification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
