{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "系统动力学建模帮助研究人员理解复杂系统中的反馈回路和延迟效应。",
      "sentence_pinyin": "Xìtǒng dònglìxué jiànmó bāngzhù yánjiū rényuán lǐjiě fùzá xìtǒng zhōng de fǎnkuì huílù hé yánchí xiàoyìng.",
      "sentence_fr": "La modélisation de la dynamique des systèmes aide les chercheurs à comprendre les boucles de rétroaction et les effets de retard dans les systèmes complexes.",
      "sentence_en": "System dynamics modeling helps researchers understand feedback loops and delay effects in complex systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "system_dynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态足迹计算衡量人类活动对自然资源的消耗和环境的影响程度。",
      "sentence_pinyin": "Shēngtài zújì jìsuàn héngliáng rénlèi huódòng duì zìrán zīyuán de xiāohào hé huánjìng de yǐngxiǎng chéngdù.",
      "sentence_fr": "Le calcul de l'empreinte écologique mesure l'étendue de la consommation des ressources naturelles et de l'impact environnemental des activités humaines.",
      "sentence_en": "Ecological footprint calculation measures the extent of natural resource consumption and environmental impact of human activities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecological_footprint",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经语言编程声称通过特定技术可以改变思维模式和行为习惯。",
      "sentence_pinyin": "Shénjīng yǔyán biānchéng shēngchēng tōngguò tèdìng jìshù kěyǐ gǎibiàn sīwéi móshì hé xíngwéi xíguàn.",
      "sentence_fr": "La programmation neurolinguistique prétend que des techniques spécifiques peuvent modifier les schémas de pensée et les habitudes comportementales.",
      "sentence_en": "Neuro-linguistic programming claims that specific techniques can change thinking patterns and behavioral habits.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neurolinguistic_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠现象挑战了我们对物理世界中局域性和实在性的传统理解。",
      "sentence_pinyin": "Liàngzǐ jiūchán xiànxiàng tiǎozhànle wǒmen duì wùlǐ shìjiè zhōng júyùxìng hé shízàixìng de chuántǒng lǐjiě.",
      "sentence_fr": "Le phénomène d'intrication quantique remet en question notre compréhension traditionnelle de la localité et de la réalité dans le monde physique.",
      "sentence_en": "The phenomenon of quantum entanglement challenges our traditional understanding of locality and reality in the physical world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_entanglement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "媒体素养教育培养公民批判性评估信息来源和识别虚假新闻的能力。",
      "sentence_pinyin": "Méitǐ sùyǎng jiàoyù péiyǎng gōngmín pīpànxìng pínggū xìnxī láiyuán hé shíbié xūjiǎ xīnwén de nénglì.",
      "sentence_fr": "L'éducation aux médias développe la capacité des citoyens à évaluer de manière critique les sources d'information et à identifier les fausses nouvelles.",
      "sentence_en": "Media literacy education develops citizens' ability to critically evaluate information sources and identify fake news.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "media_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微服务架构将大型应用程序分解为可独立部署和扩展的小型服务。",
      "sentence_pinyin": "Wēi fúwù jiàgòu jiāng dàxíng yìngyòng chéngxù fēnjiě wéi kě dúlì bùshǔ hé kuòzhǎn de xiǎoxíng fúwù.",
      "sentence_fr": "L'architecture de microservices décompose les grandes applications en petits services pouvant être déployés et mis à l'échelle indépendamment.",
      "sentence_en": "Microservices architecture decomposes large applications into small services that can be independently deployed and scaled.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microservices_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨文化心理学比较不同文化背景下人类认知和行为的差异与共性。",
      "sentence_pinyin": "Kuà wénhuà xīnlǐxué bǐjiào bùtóng wénhuà bèijǐng xià rénlèi rènzhī hé xíngwéi de chāyì yǔ gòngxìng.",
      "sentence_fr": "La psychologie interculturelle compare les différences et les points communs dans la cognition et le comportement humains à travers différents contextes culturels.",
      "sentence_en": "Cross-cultural psychology compares differences and commonalities in human cognition and behavior across different cultural backgrounds.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cross_cultural_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字孪生技术创建物理资产的虚拟副本以优化性能和预测维护需求。",
      "sentence_pinyin": "Shùzì luánshēng jìshù chuàngjiàn wùlǐ zīchǎn de xūnǐ fùběn yǐ yōuhuà xìngnéng hé yùcè wéihù xūqiú.",
      "sentence_fr": "La technologie du jumeau numérique crée des copies virtuelles d'actifs physiques pour optimiser les performances et prédire les besoins de maintenance.",
      "sentence_en": "Digital twin technology creates virtual copies of physical assets to optimize performance and predict maintenance needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_twin",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境正义运动关注污染和环境风险在不同社区间的不平等分布问题。",
      "sentence_pinyin": "Huánjìng zhèngyì yùndòng guānzhù wūrǎn hé huánjìng fēngxiǎn zài bùtóng shèqū jiān de bù píngděng fēnbù wèntí.",
      "sentence_fr": "Le mouvement pour la justice environnementale s'intéresse à la distribution inégale de la pollution et des risques environnementaux entre les différentes communautés.",
      "sentence_en": "The environmental justice movement addresses the unequal distribution of pollution and environmental risks among different communities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_justice_movement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语料库语言学利用大规模文本数据库来研究语言使用的实际模式。",
      "sentence_pinyin": "Yǔliàokù yǔyánxué lìyòng dà guīmó wénběn shùjùkù lái yánjiū yǔyán shǐyòng de shíjì móshì.",
      "sentence_fr": "La linguistique de corpus utilise des bases de données textuelles à grande échelle pour étudier les modèles réels d'utilisation de la langue.",
      "sentence_en": "Corpus linguistics uses large-scale text databases to study actual patterns of language use.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corpus_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情感计算系统尝试识别和响应用户的情绪状态以提供个性化体验。",
      "sentence_pinyin": "Qínggǎn jìsuàn xìtǒng chángshì shíbié hé xiǎngyìng yònghù de qíngxù zhuàngtài yǐ tígōng gèxìnghuà tǐyàn.",
      "sentence_fr": "Les systèmes de calcul affectif tentent de reconnaître et de répondre à l'état émotionnel des utilisateurs pour fournir des expériences personnalisées.",
      "sentence_en": "Affective computing systems attempt to recognize and respond to users' emotional states to provide personalized experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "affective_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "博弈论框架在国际关系和外交谈判研究中得到了广泛的应用。",
      "sentence_pinyin": "Bóyì lùn kuàngjià zài guójì guānxì hé wàijiāo tánpàn yánjiū zhōng dédàole guǎngfàn de yìngyòng.",
      "sentence_fr": "Le cadre de la théorie des jeux est largement appliqué dans l'étude des relations internationales et des négociations diplomatiques.",
      "sentence_en": "The game theory framework has been widely applied in the study of international relations and diplomatic negotiations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "game_theory_diplomacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海水淡化技术为水资源匮乏地区提供了重要的淡水供应解决方案。",
      "sentence_pinyin": "Hǎishuǐ dànhuà jìshù wèi shuǐ zīyuán kuìfá dìqū tígōngle zhòngyào de dànshuǐ gōngyìng jiějué fāng'àn.",
      "sentence_fr": "La technologie de dessalement de l'eau de mer fournit des solutions importantes d'approvisionnement en eau douce pour les régions pauvres en ressources hydriques.",
      "sentence_en": "Seawater desalination technology provides important freshwater supply solutions for water-scarce regions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "desalination",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会学习理论强调观察和模仿在人类行为习得过程中的重要作用。",
      "sentence_pinyin": "Shèhuì xuéxí lǐlùn qiángdiào guānchá hé mófǎng zài rénlèi xíngwéi xídé guòchéng zhōng de zhòngyào zuòyòng.",
      "sentence_fr": "La théorie de l'apprentissage social souligne le rôle important de l'observation et de l'imitation dans le processus d'acquisition du comportement humain.",
      "sentence_en": "Social learning theory emphasizes the important role of observation and imitation in the process of human behavior acquisition.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_learning_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "容器编排平台自动化管理大规模分布式应用程序的部署和运维。",
      "sentence_pinyin": "Róngqì biānpái píngtái zìdònghuà guǎnlǐ dà guīmó fēnbùshì yìngyòng chéngxù de bùshǔ hé yùnwéi.",
      "sentence_fr": "Les plateformes d'orchestration de conteneurs automatisent la gestion du déploiement et des opérations des applications distribuées à grande échelle.",
      "sentence_en": "Container orchestration platforms automate the management of deployment and operations for large-scale distributed applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "container_orchestration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市规划师运用交通流量模型来设计更高效的公共交通网络系统。",
      "sentence_pinyin": "Chéngshì guīhuà shī yùnyòng jiāotōng liúliàng móxíng lái shèjì gèng gāoxiào de gōnggòng jiāotōng wǎngluò xìtǒng.",
      "sentence_fr": "Les urbanistes utilisent des modèles de flux de trafic pour concevoir des systèmes de transport en commun plus efficaces.",
      "sentence_en": "Urban planners use traffic flow models to design more efficient public transportation network systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "traffic_flow_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知行为疗法帮助患者识别和改变导致心理问题的消极思维模式。",
      "sentence_pinyin": "Rènzhī xíngwéi liáofǎ bāngzhù huànzhě shíbié hé gǎibiàn dǎozhì xīnlǐ wèntí de xiāojí sīwéi móshì.",
      "sentence_fr": "La thérapie cognitivo-comportementale aide les patients à identifier et à modifier les schémas de pensée négatifs qui causent des problèmes psychologiques.",
      "sentence_en": "Cognitive behavioral therapy helps patients identify and change negative thinking patterns that cause psychological problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_behavioral_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地理信息系统整合空间数据和属性信息来支持复杂的地理分析决策。",
      "sentence_pinyin": "Dìlǐ xìnxī xìtǒng zhěnghé kōngjiān shùjù hé shǔxìng xìnxī lái zhīchí fùzá de dìlǐ fēnxī juécè.",
      "sentence_fr": "Les systèmes d'information géographique intègrent des données spatiales et des informations attributaires pour soutenir des décisions d'analyse géographique complexes.",
      "sentence_en": "Geographic information systems integrate spatial data and attribute information to support complex geographic analysis decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geographic_information_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "制度经济学研究正式和非正式制度如何影响经济行为和市场效率。",
      "sentence_pinyin": "Zhìdù jīngjìxué yánjiū zhèngshì hé fēi zhèngshì zhìdù rúhé yǐngxiǎng jīngjì xíngwéi hé shìchǎng xiàolǜ.",
      "sentence_fr": "L'économie institutionnelle étudie comment les institutions formelles et informelles influencent le comportement économique et l'efficacité du marché.",
      "sentence_en": "Institutional economics studies how formal and informal institutions influence economic behavior and market efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "institutional_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物降解塑料的研发旨在减少传统塑料对环境造成的长期污染问题。",
      "sentence_pinyin": "Shēngwù jiàngjìe sùliào de yánfā zhǐzài jiǎnshǎo chuántǒng sùliào duì huánjìng zàochéng de chángqī wūrǎn wèntí.",
      "sentence_fr": "Le développement de plastiques biodégradables vise à réduire les problèmes de pollution à long terme causés par les plastiques traditionnels sur l'environnement.",
      "sentence_en": "The development of biodegradable plastics aims to reduce long-term pollution problems caused by traditional plastics to the environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biodegradable_plastics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
