{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "可解释人工智能旨在让机器学习模型的决策过程对人类更加透明和可理解。",
      "sentence_pinyin": "Kě jiěshì réngōng zhìnéng zhǐzài ràng jīqì xuéxí móxíng de juécè guòchéng duì rénlèi gèngjiā tòumíng hé kě lǐjiě.",
      "sentence_fr": "L'IA explicable vise à rendre le processus de décision des modèles d'apprentissage automatique plus transparent et compréhensible pour les humains.",
      "sentence_en": "Explainable AI aims to make the decision-making process of machine learning models more transparent and understandable to humans.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "explainable_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土壤碳汇在减缓气候变化和维持农业生产力方面扮演着双重角色。",
      "sentence_pinyin": "Tǔrǎng tànhuì zài jiǎnhuǎn qìhòu biànhuà hé wéichí nóngyè shēngchǎnlì fāngmiàn bànyǎn zhe shuāngchóng juésè.",
      "sentence_fr": "Les puits de carbone du sol jouent un double rôle dans l'atténuation du changement climatique et le maintien de la productivité agricole.",
      "sentence_en": "Soil carbon sinks play a dual role in mitigating climate change and maintaining agricultural productivity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soil_carbon_sequestration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位诗人的作品以其对日常生活细节的敏锐观察和深邃思考而著称。",
      "sentence_pinyin": "Zhè wèi shīrén de zuòpǐn yǐ qí duì rìcháng shēnghuó xìjié de mǐnruì guānchá hé shēnsuì sīkǎo ér zhùchēng.",
      "sentence_fr": "Les œuvres de ce poète sont réputées pour leur observation fine des détails de la vie quotidienne et leur réflexion profonde.",
      "sentence_en": "This poet's works are renowned for their keen observation of everyday life details and profound contemplation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_poetry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精准扶贫政策通过因地制宜的措施帮助贫困地区实现可持续发展。",
      "sentence_pinyin": "Jīngzhǔn fúpín zhèngcè tōngguò yīndìzhìyí de cuòshī bāngzhù pínkùn dìqū shíxiàn kě chíxù fāzhǎn.",
      "sentence_fr": "Les politiques de réduction ciblée de la pauvreté aident les régions défavorisées à atteindre un développement durable grâce à des mesures adaptées aux conditions locales.",
      "sentence_en": "Targeted poverty alleviation policies help impoverished areas achieve sustainable development through locally-adapted measures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "targeted_poverty_alleviation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "固态电池技术的突破有望解决电动汽车续航里程和充电速度的瓶颈。",
      "sentence_pinyin": "Gùtài diànchí jìshù de tūpò yǒuwàng jiějué diàndòng qìchē xùháng lǐchéng hé chōngdiàn sùdù de píngjǐng.",
      "sentence_fr": "Les percées dans la technologie des batteries solides pourraient résoudre les goulots d'étranglement de l'autonomie et de la vitesse de charge des véhicules électriques.",
      "sentence_en": "Breakthroughs in solid-state battery technology are expected to solve the bottlenecks of electric vehicle range and charging speed.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solid_state_batteries",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "媒体素养教育帮助公众识别虚假信息和培养批判性思维能力。",
      "sentence_pinyin": "Méitǐ sùyǎng jiàoyù bāngzhù gōngzhòng shìbié xūjiǎ xìnxī hé péiyǎng pīpànxìng sīwéi nénglì.",
      "sentence_fr": "L'éducation aux médias aide le public à identifier les fausses informations et à développer des capacités de pensée critique.",
      "sentence_en": "Media literacy education helps the public identify false information and develop critical thinking skills.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "media_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "老年痴呆症的早期诊断对于延缓疾病进展和改善患者生活质量至关重要。",
      "sentence_pinyin": "Lǎonián chīdāizhèng de zǎoqī zhěnduàn duìyú yánhuǎn jíbìng jìnzhǎn hé gǎishàn huànzhě shēnghuó zhìliàng zhìguān zhòngyào.",
      "sentence_fr": "Le diagnostic précoce de la démence sénile est crucial pour ralentir la progression de la maladie et améliorer la qualité de vie des patients.",
      "sentence_en": "Early diagnosis of dementia is crucial for slowing disease progression and improving patients' quality of life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dementia_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "共享出行平台通过优化车辆利用率来减少城市交通拥堵和碳排放。",
      "sentence_pinyin": "Gòngxiǎng chūxíng píngtái tōngguò yōuhuà chēliàng lìyònglǜ lái jiǎnshǎo chéngshì jiāotōng yōngdǔ hé tàn páifàng.",
      "sentence_fr": "Les plateformes de mobilité partagée réduisent les embouteillages urbains et les émissions de carbone en optimisant le taux d'utilisation des véhicules.",
      "sentence_en": "Shared mobility platforms reduce urban traffic congestion and carbon emissions by optimizing vehicle utilization rates.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "shared_mobility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这场当代舞蹈作品通过抽象的肢体语言探讨了人与科技之间的复杂关系。",
      "sentence_pinyin": "Zhè chǎng dāngdài wǔdǎo zuòpǐn tōngguò chōuxiàng de zhītǐ yǔyán tàntǎo le rén yǔ kējì zhījiān de fùzá guānxì.",
      "sentence_fr": "Cette œuvre de danse contemporaine explore la relation complexe entre l'homme et la technologie à travers un langage corporel abstrait.",
      "sentence_en": "This contemporary dance work explores the complex relationship between humans and technology through abstract body language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联邦学习技术允许在保护数据隐私的前提下进行分布式机器学习模型训练。",
      "sentence_pinyin": "Liánbāng xuéxí jìshù yǔnxǔ zài bǎohù shùjù yǐnsī de qiántí xià jìnxíng fēnbùshì jīqì xuéxí móxíng xùnliàn.",
      "sentence_fr": "La technologie de l'apprentissage fédéré permet l'entraînement distribué de modèles d'apprentissage automatique tout en préservant la confidentialité des données.",
      "sentence_en": "Federated learning technology allows distributed machine learning model training while protecting data privacy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "federated_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际间的知识产权争端往往涉及复杂的法律管辖和执行问题。",
      "sentence_pinyin": "Guójì jiān de zhīshì chǎnquán zhēngduān wǎngwǎng shèjí fùzá de fǎlǜ guǎnxiá hé zhíxíng wèntí.",
      "sentence_fr": "Les litiges internationaux en matière de propriété intellectuelle impliquent souvent des questions complexes de juridiction et d'application des lois.",
      "sentence_en": "International intellectual property disputes often involve complex legal jurisdiction and enforcement issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_ip_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市热浪预警系统旨在保护老年人和儿童等脆弱群体的健康。",
      "sentence_pinyin": "Chéngshì rèlàng yùjǐng xìtǒng zhǐzài bǎohù lǎoniánrén hé értóng děng cuìruò qúntǐ de jiànkāng.",
      "sentence_fr": "Les systèmes d'alerte aux vagues de chaleur urbaines visent à protéger la santé des groupes vulnérables comme les personnes âgées et les enfants.",
      "sentence_en": "Urban heatwave warning systems aim to protect the health of vulnerable groups such as the elderly and children.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "heatwave_warning_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物降解材料的研发正在为减少一次性塑料污染提供可行的替代方案。",
      "sentence_pinyin": "Shēngwù jiàngjiě cáiliào de yánfā zhèngzài wèi jiǎnshǎo yīcìxìng sùliào wūrǎn tígōng kěxíng de tìdài fāng'àn.",
      "sentence_fr": "Le développement de matériaux biodégradables offre des alternatives viables pour réduire la pollution par les plastiques à usage unique.",
      "sentence_en": "The development of biodegradable materials is providing viable alternatives for reducing single-use plastic pollution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biodegradable_materials",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电影通过非线性叙事结构挑战了观众对时间和因果关系的常规理解。",
      "sentence_pinyin": "Zhè bù diànyǐng tōngguò fēi xiànxìng xùshì jiégòu tiǎozhàn le guānzhòng duì shíjiān hé yīnguǒ guānxì de chángguī lǐjiě.",
      "sentence_fr": "Ce film défie la compréhension conventionnelle du temps et de la causalité du spectateur à travers une structure narrative non linéaire.",
      "sentence_en": "This film challenges audiences' conventional understanding of time and causality through non-linear narrative structure.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nonlinear_cinema",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "预防医学的重点正从疾病治疗转向健康促进和风险因素管理。",
      "sentence_pinyin": "Yùfáng yīxué de zhòngdiǎn zhèng cóng jíbìng zhìliáo zhuǎnxiàng jiànkāng cùjìn hé fēngxiǎn yīnsù guǎnlǐ.",
      "sentence_fr": "L'accent de la médecine préventive passe du traitement des maladies à la promotion de la santé et la gestion des facteurs de risque.",
      "sentence_en": "The focus of preventive medicine is shifting from disease treatment to health promotion and risk factor management.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "preventive_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市农业运动鼓励居民利用屋顶和阳台空间种植有机蔬果。",
      "sentence_pinyin": "Chéngshì nóngyè yùndòng gǔlì jūmín lìyòng wūdǐng hé yángtái kōngjiān zhòngzhí yǒujī shūguǒ.",
      "sentence_fr": "Le mouvement de l'agriculture urbaine encourage les résidents à utiliser les toits et les balcons pour cultiver des fruits et légumes biologiques.",
      "sentence_en": "The urban agriculture movement encourages residents to use rooftop and balcony space to grow organic produce.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识证明技术为验证信息真实性而不泄露敏感数据提供了解决方案。",
      "sentence_pinyin": "Líng zhīshì zhèngmíng jìshù wèi yànzhèng xìnxī zhēnshíxìng ér bù xièlòu mǐngǎn shùjù tígōng le jiějué fāng'àn.",
      "sentence_fr": "La technologie de preuve à divulgation nulle de connaissance offre des solutions pour vérifier l'authenticité des informations sans révéler de données sensibles.",
      "sentence_en": "Zero-knowledge proof technology provides solutions for verifying information authenticity without revealing sensitive data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_knowledge_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工业遗产的活化利用为城市更新和文化创意产业发展提供了独特资源。",
      "sentence_pinyin": "Gōngyè yíchǎn de huóhuà lìyòng wèi chéngshì gēngxīn hé wénhuà chuàngyì chǎnyè fāzhǎn tígōng le dútè zīyuán.",
      "sentence_fr": "La réhabilitation du patrimoine industriel offre des ressources uniques pour le renouvellement urbain et le développement des industries créatives.",
      "sentence_en": "The adaptive reuse of industrial heritage provides unique resources for urban renewal and creative industry development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "industrial_heritage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知神经科学的发展正在揭示意识和决策过程的生物学基础。",
      "sentence_pinyin": "Rènzhī shénjīng kēxué de fāzhǎn zhèngzài jiēshì yìshí hé juécè guòchéng de shēngwùxué jīchǔ.",
      "sentence_fr": "Le développement des neurosciences cognitives révèle les bases biologiques de la conscience et des processus de prise de décision.",
      "sentence_en": "The development of cognitive neuroscience is revealing the biological basis of consciousness and decision-making processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_neuroscience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
