{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "社会语言学研究语言变异如何反映社会阶层、性别和地区差异。",
      "sentence_pinyin": "Shèhuì yǔyánxué yánjiū yǔyán biànyì rúhé fǎnyìng shèhuì jiēcéng, xìngbié hé dìqū chāyì.",
      "sentence_fr": "La sociolinguistique étudie comment la variation linguistique reflète les différences de classe sociale, de genre et de région.",
      "sentence_en": "Sociolinguistics studies how language variation reflects social class, gender, and regional differences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sociolinguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算机视觉技术使机器能够从图像和视频中提取有意义的信息。",
      "sentence_pinyin": "Jìsuànjī shìjué jìshù shǐ jīqì nénggòu cóng túxiàng hé shìpín zhōng tíqǔ yǒu yìyì de xìnxī.",
      "sentence_fr": "La technologie de vision par ordinateur permet aux machines d'extraire des informations significatives à partir d'images et de vidéos.",
      "sentence_en": "Computer vision technology enables machines to extract meaningful information from images and videos.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computer_vision",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "韧性城市规划旨在增强城市应对自然灾害和气候变化的能力。",
      "sentence_pinyin": "Rènxìng chéngshì guīhuà zhǐzài zēngqiáng chéngshì yìngduì zìrán zāihài hé qìhòu biànhuà de nénglì.",
      "sentence_fr": "La planification des villes résilientes vise à renforcer la capacité des villes à faire face aux catastrophes naturelles et au changement climatique.",
      "sentence_en": "Resilient city planning aims to enhance cities' ability to cope with natural disasters and climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "resilient_cities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "实验经济学通过控制实验来检验经济理论和人类决策行为。",
      "sentence_pinyin": "Shíyàn jīngjìxué tōngguò kòngzhì shíyàn lái jiǎnyàn jīngjì lǐlùn hé rénlèi juécè xíngwéi.",
      "sentence_fr": "L'économie expérimentale teste les théories économiques et les comportements décisionnels humains à travers des expériences contrôlées.",
      "sentence_en": "Experimental economics tests economic theories and human decision-making behavior through controlled experiments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "experimental_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "细胞信号传导研究细胞如何接收、处理和响应环境信号。",
      "sentence_pinyin": "Xìbāo xìnhào chuándǎo yánjiū xìbāo rúhé jiēshōu, chǔlǐ hé xiǎngyìng huánjìng xìnhào.",
      "sentence_fr": "La transduction du signal cellulaire étudie comment les cellules reçoivent, traitent et répondent aux signaux environnementaux.",
      "sentence_en": "Cell signal transduction studies how cells receive, process, and respond to environmental signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cell_signaling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语义学分析语言中词语和句子的意义以及意义如何被组合。",
      "sentence_pinyin": "Yǔyìxué fēnxī yǔyán zhōng cíyǔ hé jùzi de yìyì yǐjí yìyì rúhé bèi zǔhé.",
      "sentence_fr": "La sémantique analyse le sens des mots et des phrases dans les langues et comment le sens est combiné.",
      "sentence_en": "Semantics analyzes the meaning of words and sentences in languages and how meaning is combined.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semantics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "DevOps实践促进开发和运维团队之间的协作以加速软件交付。",
      "sentence_pinyin": "DevOps shíjiàn cùjìn kāifā hé yùnwéi tuánduì zhījiān de xiézuò yǐ jiāsù ruǎnjiàn jiāofù.",
      "sentence_fr": "Les pratiques DevOps favorisent la collaboration entre les équipes de développement et d'exploitation pour accélérer la livraison de logiciels.",
      "sentence_en": "DevOps practices promote collaboration between development and operations teams to accelerate software delivery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "devops",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "教育技术学研究如何有效地将技术工具整合到教学过程中。",
      "sentence_pinyin": "Jiàoyù jìshùxué yánjiū rúhé yǒuxiào de jiāng jìshù gōngjù zhěnghé dào jiàoxué guòchéng zhōng.",
      "sentence_fr": "La technologie éducative étudie comment intégrer efficacement les outils technologiques dans le processus d'enseignement.",
      "sentence_en": "Educational technology studies how to effectively integrate technological tools into the teaching process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "educational_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古气候学通过地质记录重建地球过去的气候条件和变化。",
      "sentence_pinyin": "Gǔ qìhòuxué tōngguò dìzhì jìlù chóngjiàn dìqiú guòqù de qìhòu tiáojiàn hé biànhuà.",
      "sentence_fr": "La paléoclimatologie reconstruit les conditions climatiques passées de la Terre et leurs changements à travers les archives géologiques.",
      "sentence_en": "Paleoclimatology reconstructs Earth's past climate conditions and changes through geological records.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "paleoclimatology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际人权法建立了保护基本人类尊严和自由的全球法律框架。",
      "sentence_pinyin": "Guójì rénquán fǎ jiànlìle bǎohù jīběn rénlèi zūnyán hé zìyóu de quánqiú fǎlǜ kuàngjià.",
      "sentence_fr": "Le droit international des droits de l'homme établit un cadre juridique mondial pour protéger la dignité humaine fondamentale et les libertés.",
      "sentence_en": "International human rights law establishes a global legal framework for protecting fundamental human dignity and freedoms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "human_rights_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "强化学习算法通过与环境交互和获得奖励反馈来优化决策策略。",
      "sentence_pinyin": "Qiánghuà xuéxí suànfǎ tōngguò yǔ huánjìng jiāohù hé huòdé jiǎnglì fǎnkuì lái yōuhuà juécè cèlüè.",
      "sentence_fr": "Les algorithmes d'apprentissage par renforcement optimisent les stratégies de décision en interagissant avec l'environnement et en recevant des retours de récompense.",
      "sentence_en": "Reinforcement learning algorithms optimize decision strategies by interacting with the environment and receiving reward feedback.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reinforcement_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "营养基因组学研究基因如何与饮食相互作用以影响健康和疾病风险。",
      "sentence_pinyin": "Yíngyǎng jīyīn zǔxué yánjiū jīyīn rúhé yǔ yǐnshí xiānghù zuòyòng yǐ yǐngxiǎng jiànkāng hé jíbìng fēngxiǎn.",
      "sentence_fr": "La nutrigénomique étudie comment les gènes interagissent avec l'alimentation pour influencer la santé et le risque de maladie.",
      "sentence_en": "Nutrigenomics studies how genes interact with diet to influence health and disease risk.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nutrigenomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "建构主义教学理论认为学习是学习者主动构建知识的过程。",
      "sentence_pinyin": "Jiàngòu zhǔyì jiàoxué lǐlùn rènwéi xuéxí shì xuéxí zhě zhǔdòng gòujiàn zhīshi de guòchéng.",
      "sentence_fr": "La théorie de l'enseignement constructiviste considère que l'apprentissage est un processus de construction active des connaissances par l'apprenant.",
      "sentence_en": "Constructivist teaching theory holds that learning is a process of active knowledge construction by learners.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "constructivist_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可观测性工程通过日志、指标和追踪来监控分布式系统的健康状况。",
      "sentence_pinyin": "Kě guāncè xìng gōngchéng tōngguò rìzhì, zhǐbiāo hé zhuīzōng lái jiānkòng fēnbùshì xìtǒng de jiànkāng zhuàngkuàng.",
      "sentence_fr": "L'ingénierie de l'observabilité surveille l'état de santé des systèmes distribués à travers les journaux, les métriques et le traçage.",
      "sentence_en": "Observability engineering monitors the health of distributed systems through logs, metrics, and tracing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "observability_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人口遗传学研究基因频率在人群中的分布和随时间的变化。",
      "sentence_pinyin": "Rénkǒu yíchuánxué yánjiū jīyīn pínlǜ zài rénqún zhōng de fēnbù hé suí shíjiān de biànhuà.",
      "sentence_fr": "La génétique des populations étudie la distribution des fréquences des gènes dans les populations et leur changement au fil du temps.",
      "sentence_en": "Population genetics studies the distribution of gene frequencies in populations and their change over time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "population_genetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "货币政策通过调节利率和货币供应量来影响经济活动和通货膨胀。",
      "sentence_pinyin": "Huòbì zhèngcè tōngguò tiáojié lìlǜ hé huòbì gōngyìng liàng lái yǐngxiǎng jīngjì huódòng hé tōnghuò péngzhàng.",
      "sentence_fr": "La politique monétaire influence l'activité économique et l'inflation en régulant les taux d'intérêt et la masse monétaire.",
      "sentence_en": "Monetary policy influences economic activity and inflation by regulating interest rates and money supply.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "monetary_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地球化学研究地球各圈层中化学元素的分布、迁移和循环。",
      "sentence_pinyin": "Dìqiú huàxué yánjiū dìqiú gè quāncéng zhōng huàxué yuánsù de fēnbù, qiānyí hé xúnhuán.",
      "sentence_fr": "La géochimie étudie la distribution, la migration et le cycle des éléments chimiques dans les différentes sphères de la Terre.",
      "sentence_en": "Geochemistry studies the distribution, migration, and cycling of chemical elements in Earth's various spheres.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geochemistry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分词算法是中文自然语言处理中的基础任务和技术挑战。",
      "sentence_pinyin": "Fēncí suànfǎ shì Zhōngwén zìrán yǔyán chǔlǐ zhōng de jīchǔ rènwù hé jìshù tiǎozhàn.",
      "sentence_fr": "Les algorithmes de segmentation de mots sont une tâche fondamentale et un défi technique dans le traitement du langage naturel chinois.",
      "sentence_en": "Word segmentation algorithms are a fundamental task and technical challenge in Chinese natural language processing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "word_segmentation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "职业心理学研究工作满意度、职业发展和工作生活平衡等问题。",
      "sentence_pinyin": "Zhíyè xīnlǐxué yánjiū gōngzuò mǎnyìdù, zhíyè fāzhǎn hé gōngzuò shēnghuó pínghéng děng wèntí.",
      "sentence_fr": "La psychologie du travail étudie des questions telles que la satisfaction au travail, le développement de carrière et l'équilibre travail-vie personnelle.",
      "sentence_en": "Occupational psychology studies issues such as job satisfaction, career development, and work-life balance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "occupational_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "溯源技术在食品安全和供应链透明度方面发挥着越来越重要的作用。",
      "sentence_pinyin": "Sùyuán jìshù zài shípǐn ānquán hé gōngyìng liàn tòumíngdù fāngmiàn fāhuīzhe yuè lái yuè zhòngyào de zuòyòng.",
      "sentence_fr": "La technologie de traçabilité joue un rôle de plus en plus important dans la sécurité alimentaire et la transparence de la chaîne d'approvisionnement.",
      "sentence_en": "Traceability technology plays an increasingly important role in food safety and supply chain transparency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "traceability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
