{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "循环经济理念倡导通过产品设计延长使用寿命并实现材料的闭环回收利用。",
      "sentence_pinyin": "Xúnhuán jīngjì lǐniàn chàngdǎo tōngguò chǎnpǐn shèjì yáncháng shǐyòng shòumìng bìng shíxiàn cáiliào de bìhuán huíshōu lìyòng.",
      "sentence_fr": "L'économie circulaire préconise d'allonger la durée de vie des produits par la conception et de réaliser un recyclage en boucle fermée des matériaux.",
      "sentence_en": "The circular economy concept advocates extending product lifespan through design and achieving closed-loop material recycling.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circular_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位哲学家的伦理学理论对功利主义和义务论之间的传统对立提出了质疑。",
      "sentence_pinyin": "Zhè wèi zhéxuéjiā de lúnlǐxué lǐlùn duì gōnglìzhǔyì hé yìwùlùn zhījiān de chuántǒng duìlì tíchū le zhìyí.",
      "sentence_fr": "La théorie éthique de ce philosophe remet en question l'opposition traditionnelle entre l'utilitarisme et la déontologie.",
      "sentence_en": "This philosopher's ethical theory questions the traditional opposition between utilitarianism and deontology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ethical_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增材制造技术正在革新航空航天领域的零部件生产方式和供应链管理。",
      "sentence_pinyin": "Zēngcái zhìzào jìshù zhèngzài géxīn hángkōng hángtiān lǐngyù de língbùjiàn shēngchǎn fāngshì hé gōngyìngliàn guǎnlǐ.",
      "sentence_fr": "La fabrication additive révolutionne la production de pièces et la gestion de la chaîne d'approvisionnement dans l'industrie aérospatiale.",
      "sentence_en": "Additive manufacturing technology is revolutionizing component production methods and supply chain management in the aerospace sector.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "aerospace_manufacturing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市公共艺术项目旨在提升社区认同感和改善城市空间的文化氛围。",
      "sentence_pinyin": "Chéngshì gōnggòng yìshù xiàngmù zhǐzài tíshēng shèqū rèntónggǎn hé gǎishàn chéngshì kōngjiān de wénhuà fēnwéi.",
      "sentence_fr": "Les projets d'art public urbain visent à renforcer le sentiment d'appartenance communautaire et à améliorer l'atmosphère culturelle des espaces urbains.",
      "sentence_en": "Urban public art projects aim to enhance community identity and improve the cultural atmosphere of urban spaces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表观遗传学研究揭示了环境因素如何在不改变DNA序列的情况下影响基因表达。",
      "sentence_pinyin": "Biǎoguān yíchuánxué yánjiū jiēshì le huánjìng yīnsù rúhé zài bù gǎibiàn DNA xùliè de qíngkuàng xià yǐngxiǎng jīyīn biǎodá.",
      "sentence_fr": "La recherche en épigénétique révèle comment les facteurs environnementaux influencent l'expression des gènes sans modifier la séquence de l'ADN.",
      "sentence_en": "Epigenetics research reveals how environmental factors affect gene expression without changing the DNA sequence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epigenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球化时代的企业需要培养具有跨文化沟通能力的国际化人才。",
      "sentence_pinyin": "Quánqiúhuà shídài de qǐyè xūyào péiyǎng jùyǒu kuà wénhuà gōutōng nénglì de guójìhuà réncái.",
      "sentence_fr": "Les entreprises de l'ère de la mondialisation doivent former des talents internationaux dotés de compétences en communication interculturelle.",
      "sentence_en": "Enterprises in the era of globalization need to cultivate international talents with cross-cultural communication skills.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "global_talent_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋酸化正在威胁珊瑚礁生态系统的健康和海洋生物多样性。",
      "sentence_pinyin": "Hǎiyáng suānhuà zhèngzài wēixié shānhújiāo shēngtài xìtǒng de jiànkāng hé hǎiyáng shēngwù duōyàngxìng.",
      "sentence_fr": "L'acidification des océans menace la santé des écosystèmes de récifs coralliens et la biodiversité marine.",
      "sentence_en": "Ocean acidification is threatening the health of coral reef ecosystems and marine biodiversity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ocean_acidification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "开源软件运动改变了软件开发的协作模式和知识产权的传统观念。",
      "sentence_pinyin": "Kāiyuán ruǎnjiàn yùndòng gǎibiàn le ruǎnjiàn kāifā de xiézuò móshì hé zhīshì chǎnquán de chuántǒng guānniàn.",
      "sentence_fr": "Le mouvement du logiciel open source a transformé les modèles de collaboration dans le développement logiciel et les conceptions traditionnelles de la propriété intellectuelle.",
      "sentence_en": "The open source software movement has changed collaborative models in software development and traditional concepts of intellectual property.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "open_source_movement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位行为经济学家的实验证明了人们在面对损失时的风险厌恶倾向。",
      "sentence_pinyin": "Zhè wèi xíngwéi jīngjìxuéjiā de shíyàn zhèngmíng le rénmen zài miànduì sǔnshī shí de fēngxiǎn yànwù qīngxiàng.",
      "sentence_fr": "Les expériences de cet économiste comportemental démontrent la tendance à l'aversion au risque des gens face aux pertes.",
      "sentence_en": "This behavioral economist's experiments demonstrate people's risk aversion tendency when facing losses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "behavioral_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市灰色基础设施正逐步被绿色基础设施取代以提供更多生态系统服务。",
      "sentence_pinyin": "Chéngshì huīsè jīchǔ shèshī zhèng zhúbù bèi lǜsè jīchǔ shèshī qǔdài yǐ tígōng gèng duō shēngtài xìtǒng fúwù.",
      "sentence_fr": "Les infrastructures grises urbaines sont progressivement remplacées par des infrastructures vertes pour fournir davantage de services écosystémiques.",
      "sentence_en": "Urban gray infrastructure is gradually being replaced by green infrastructure to provide more ecosystem services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_infrastructure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然语言处理技术的进步使机器翻译的质量达到了前所未有的水平。",
      "sentence_pinyin": "Zìrán yǔyán chǔlǐ jìshù de jìnbù shǐ jīqì fānyì de zhìliàng dádào le qiánsuǒwèiyǒu de shuǐpíng.",
      "sentence_fr": "Les progrès du traitement du langage naturel ont porté la qualité de la traduction automatique à un niveau sans précédent.",
      "sentence_en": "Advances in natural language processing technology have brought machine translation quality to an unprecedented level.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "machine_translation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部小说探讨了全球化背景下个人身份认同的流动性和多元性。",
      "sentence_pinyin": "Zhè bù xiǎoshuō tàntǎo le quánqiúhuà bèijǐng xià gèrén shēnfèn rèntóng de liúdòngxìng hé duōyuánxìng.",
      "sentence_fr": "Ce roman explore la fluidité et la pluralité de l'identité personnelle dans le contexte de la mondialisation.",
      "sentence_en": "This novel explores the fluidity and plurality of personal identity in the context of globalization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "identity_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "细胞农业技术有望在不牺牲动物的情况下生产肉类和乳制品。",
      "sentence_pinyin": "Xìbāo nóngyè jìshù yǒuwàng zài bù xīshēng dòngwù de qíngkuàng xià shēngchǎn ròulèi hé rǔzhìpǐn.",
      "sentence_fr": "La technologie de l'agriculture cellulaire pourrait permettre de produire de la viande et des produits laitiers sans sacrifier d'animaux.",
      "sentence_en": "Cellular agriculture technology promises to produce meat and dairy products without sacrificing animals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cellular_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "民主化设计工具的出现降低了普通人参与创意产业的技术门槛。",
      "sentence_pinyin": "Mínzhǔhuà shèjì gōngjù de chūxiàn jiàngdī le pǔtōngrén cānyù chuàngyì chǎnyè de jìshù ménkǎn.",
      "sentence_fr": "L'émergence d'outils de conception démocratisés a abaissé les barrières techniques pour la participation du grand public à l'industrie créative.",
      "sentence_en": "The emergence of democratized design tools has lowered the technical barriers for ordinary people to participate in creative industries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "democratized_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心理弹性研究表明童年早期的安全依恋关系对长期心理健康至关重要。",
      "sentence_pinyin": "Xīnlǐ tánxìng yánjiū biǎomíng tóngnián zǎoqī de ānquán yīliàn guānxì duì chángqī xīnlǐ jiànkāng zhìguān zhòngyào.",
      "sentence_fr": "La recherche sur la résilience psychologique montre que les relations d'attachement sécurisées dans la petite enfance sont cruciales pour la santé mentale à long terme.",
      "sentence_en": "Psychological resilience research shows that secure attachment relationships in early childhood are crucial for long-term mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "attachment_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "商业航天的发展正在开启太空旅游和小行星采矿的新时代。",
      "sentence_pinyin": "Shāngyè hángtiān de fāzhǎn zhèngzài kāiqǐ tàikōng lǚyóu hé xiǎoxíngxīng cǎikuàng de xīn shídài.",
      "sentence_fr": "Le développement de l'industrie spatiale commerciale ouvre une nouvelle ère pour le tourisme spatial et l'exploitation minière des astéroïdes.",
      "sentence_en": "The development of commercial spaceflight is ushering in a new era of space tourism and asteroid mining.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "commercial_space",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字素养教育应该成为现代公民教育的核心组成部分。",
      "sentence_pinyin": "Shùzì sùyǎng jiàoyù yīnggāi chéngwéi xiàndài gōngmín jiàoyù de héxīn zǔchéng bùfèn.",
      "sentence_fr": "L'éducation à la littératie numérique devrait devenir un élément central de l'éducation civique moderne.",
      "sentence_en": "Digital literacy education should become a core component of modern civic education.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古建筑修复工作需要在保持历史原真性和结构安全性之间寻找平衡。",
      "sentence_pinyin": "Gǔ jiànzhù xiūfù gōngzuò xūyào zài bǎochí lìshǐ yuánzhēnxìng hé jiégòu ānquánxìng zhījiān xúnzhǎo pínghéng.",
      "sentence_fr": "La restauration des bâtiments anciens doit trouver un équilibre entre le maintien de l'authenticité historique et la sécurité structurelle.",
      "sentence_en": "Ancient building restoration work needs to find a balance between maintaining historical authenticity and structural safety.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "architectural_restoration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合成生物学正在使研究人员能够设计具有新功能的人工生命系统。",
      "sentence_pinyin": "Héchéng shēngwùxué zhèngzài shǐ yánjiūrényuán nénggòu shèjì jùyǒu xīn gōngnéng de réngōng shēngmìng xìtǒng.",
      "sentence_fr": "La biologie synthétique permet aux chercheurs de concevoir des systèmes de vie artificielle dotés de nouvelles fonctions.",
      "sentence_en": "Synthetic biology is enabling researchers to design artificial life systems with new functions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "synthetic_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
