{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "他从小就梦想着成为一名优秀的篮球运动员。",
      "sentence_pinyin": "Tā cóngxiǎo jiù mèngxiǎngzhe chéngwéi yī míng yōuxiù de lánqiú yùndòngyuán.",
      "sentence_fr": "Il rêve depuis son enfance de devenir un excellent joueur de basketball.",
      "sentence_en": "He has dreamed since childhood of becoming an excellent basketball player.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dreams",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座古老的寺庙吸引了许多国内外的游客前来参观。",
      "sentence_pinyin": "Zhè zuò gǔlǎo de sìmiào xīyǐnle xǔduō guónèi wài de yóukè qiánlái cānguān.",
      "sentence_fr": "Ce temple ancien attire de nombreux touristes nationaux et étrangers.",
      "sentence_en": "This ancient temple attracts many domestic and foreign tourists to visit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tourism",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "我们需要采取有效措施来减少空气污染和环境破坏。",
      "sentence_pinyin": "Wǒmen xūyào cǎiqǔ yǒuxiào cuòshī lái jiǎnshǎo kōngqì wūrǎn hé huánjìng pòhuài.",
      "sentence_fr": "Nous devons prendre des mesures efficaces pour réduire la pollution de l'air et les dommages environnementaux.",
      "sentence_en": "We need to take effective measures to reduce air pollution and environmental damage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在公司担任市场部经理，负责制定营销策略。",
      "sentence_pinyin": "Tā zài gōngsī dānrèn shìchǎng bù jīnglǐ, fùzé zhìdìng yíngxiāo cèlüè.",
      "sentence_fr": "Elle est directrice du marketing dans l'entreprise et est responsable de l'élaboration des stratégies marketing.",
      "sentence_en": "She serves as marketing manager at the company and is responsible for developing marketing strategies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个菜谱的做法很详细，即使是新手也能轻松学会。",
      "sentence_pinyin": "Zhège càipǔ de zuòfǎ hěn xiángxì, jíshǐ shì xīnshǒu yě néng qīngsōng xuéhuì.",
      "sentence_fr": "La recette est très détaillée, même un débutant peut facilement l'apprendre.",
      "sentence_en": "This recipe is very detailed, even a beginner can easily learn it.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cooking",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "每当遇到困难的时候，我总是会想起妈妈的鼓励和支持。",
      "sentence_pinyin": "Měi dāng yùdào kùnnan de shíhou, wǒ zǒngshì huì xiǎngqǐ māma de gǔlì hé zhīchí.",
      "sentence_fr": "Chaque fois que je rencontre des difficultés, je pense toujours aux encouragements et au soutien de ma mère.",
      "sentence_en": "Whenever I encounter difficulties, I always think of my mother's encouragement and support.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个软件的功能很强大，可以满足用户的各种需求。",
      "sentence_pinyin": "Zhège ruǎnjiàn de gōngnéng hěn qiángdà, kěyǐ mǎnzú yònghù de gèzhǒng xūqiú.",
      "sentence_fr": "Ce logiciel est très puissant et peut répondre aux divers besoins des utilisateurs.",
      "sentence_en": "This software is very powerful and can meet users' various needs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他通过努力学习和不断练习，终于实现了自己的目标。",
      "sentence_pinyin": "Tā tōngguò nǔlì xuéxí hé bùduàn liànxí, zhōngyú shíxiànle zìjǐ de mùbiāo.",
      "sentence_fr": "Grâce à ses études assidues et sa pratique constante, il a finalement atteint son objectif.",
      "sentence_en": "Through hard study and constant practice, he finally achieved his goal.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "achievement",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片真实地记录了野生动物的生活习性。",
      "sentence_pinyin": "Zhè bù jìlùpiàn zhēnshí de jìlùle yěshēng dòngwù de shēnghuó xíxìng.",
      "sentence_fr": "Ce documentaire enregistre fidèlement les habitudes de vie des animaux sauvages.",
      "sentence_en": "This documentary authentically records the living habits of wild animals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医院的护士们工作非常辛苦，但她们总是保持微笑。",
      "sentence_pinyin": "Yīyuàn de hùshimen gōngzuò fēicháng xīnkǔ, dàn tāmen zǒngshì bǎochí wēixiào.",
      "sentence_fr": "Les infirmières de l'hôpital travaillent très dur, mais elles gardent toujours le sourire.",
      "sentence_en": "The nurses at the hospital work very hard, but they always keep smiling.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "healthcare",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学校组织了一次户外拓展训练，培养学生的团队合作精神。",
      "sentence_pinyin": "Xuéxiào zǔzhīle yī cì hùwài tuòzhǎn xùnliàn, péiyǎng xuésheng de tuánduì hézuò jīngshén.",
      "sentence_fr": "L'école a organisé une formation de développement en plein air pour cultiver l'esprit d'équipe des étudiants.",
      "sentence_en": "The school organized an outdoor development training to cultivate students' team spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地区的气候四季分明，春夏秋冬各有特色。",
      "sentence_pinyin": "Zhège dìqū de qìhòu sìjì fēnmíng, chūn xià qiū dōng gè yǒu tèsè.",
      "sentence_fr": "Le climat de cette région a quatre saisons distinctes, chacune avec ses propres caractéristiques.",
      "sentence_en": "The climate of this region has four distinct seasons, each with its own characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "weather",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的演讲内容丰富，语言生动，深受听众欢迎。",
      "sentence_pinyin": "Tā de yǎnjiǎng nèiróng fēngfù, yǔyán shēngdòng, shēn shòu tīngzhòng huānyíng.",
      "sentence_fr": "Son discours est riche en contenu et vivant dans le langage, très apprécié du public.",
      "sentence_en": "His speech is rich in content and vivid in language, very well received by the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "communication",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "为了节省开支，我们决定自己动手装修房子。",
      "sentence_pinyin": "Wèile jiéshěng kāizhī, wǒmen juédìng zìjǐ dòngshǒu zhuāngxiū fángzi.",
      "sentence_fr": "Pour économiser, nous avons décidé de rénover la maison nous-mêmes.",
      "sentence_en": "To save expenses, we decided to renovate the house ourselves.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "home",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家咖啡店的装修风格很独特，环境也很舒适。",
      "sentence_pinyin": "Zhè jiā kāfēidiàn de zhuāngxiū fēnggé hěn dútè, huánjìng yě hěn shūshì.",
      "sentence_fr": "Le style de décoration de ce café est très unique et l'ambiance est aussi très confortable.",
      "sentence_en": "The decoration style of this coffee shop is very unique, and the environment is also very comfortable.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "places",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "随着科技的发展，人工智能已经应用到生活的各个方面。",
      "sentence_pinyin": "Suízhe kējì de fāzhǎn, réngōng zhìnéng yǐjīng yìngyòng dào shēnghuó de gège fāngmiàn.",
      "sentence_fr": "Avec le développement de la technologie, l'intelligence artificielle est déjà appliquée à tous les aspects de la vie.",
      "sentence_en": "With the development of technology, artificial intelligence has been applied to all aspects of life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她参加了一个烹饪培训班，学习制作各种西式甜点。",
      "sentence_pinyin": "Tā cānjiāle yī ge pēngrèn péixùn bān, xuéxí zhìzuò gèzhǒng xīshì tiándiǎn.",
      "sentence_fr": "Elle a suivi un cours de cuisine pour apprendre à faire diverses pâtisseries occidentales.",
      "sentence_en": "She attended a cooking training class to learn to make various Western desserts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "learning",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这次旅行让我开阔了眼界，体验了不同的文化和风俗。",
      "sentence_pinyin": "Zhè cì lǚxíng ràng wǒ kāikuòle yǎnjiè, tǐyànle bùtóng de wénhuà hé fēngsú.",
      "sentence_fr": "Ce voyage m'a ouvert les yeux et m'a permis de découvrir différentes cultures et coutumes.",
      "sentence_en": "This trip broadened my horizons and let me experience different cultures and customs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "travel",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公司为员工提供了良好的福利待遇和职业发展机会。",
      "sentence_pinyin": "Gōngsī wèi yuángōng tígōngle liánghǎo de fúlì dàiyù hé zhíyè fāzhǎn jīhuì.",
      "sentence_fr": "L'entreprise offre à ses employés de bons avantages sociaux et des opportunités de développement professionnel.",
      "sentence_en": "The company provides employees with good benefits and career development opportunities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们正在计划明年春天去日本看樱花。",
      "sentence_pinyin": "Tāmen zhèngzài jìhuà míngnián chūntiān qù Rìběn kàn yīnghuā.",
      "sentence_fr": "Ils prévoient d'aller au Japon au printemps prochain pour voir les cerisiers en fleurs.",
      "sentence_en": "They are planning to go to Japan next spring to see the cherry blossoms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "travel",
      "created_at": "2025-11-20T16:15:00.000Z",
      "updated_at": "2025-11-20T16:15:00.000Z"
    }
  ]
}
