{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个国家公园拥有壮观的瀑布和原始森林景观。",
      "sentence_pinyin": "Zhège guójiā gōngyuán yǒngyǒu zhuàngguān de pùbù hé yuánshǐ sēnlín jǐngguān.",
      "sentence_fr": "Ce parc national possède des chutes d'eau spectaculaires et des paysages de forêts vierges.",
      "sentence_en": "This national park has spectacular waterfalls and pristine forest landscapes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nature",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在职业生涯中始终保持着谦虚和学习的态度。",
      "sentence_pinyin": "Tā zài zhíyè shēngyá zhōng shǐzhōng bǎochízhe qiānxū hé xuéxí de tàidu.",
      "sentence_fr": "Elle maintient toujours une attitude humble et d'apprentissage tout au long de sa carrière.",
      "sentence_en": "She always maintains a humble and learning attitude throughout her career.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "professional_attitude",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个电子商务平台建立了完善的信用评价体系。",
      "sentence_pinyin": "Zhège diànzǐ shāngwù píngtái jiànlìle wánshàn de xìnyòng píngjià tǐxì.",
      "sentence_fr": "Cette plateforme de commerce électronique a établi un système d'évaluation de crédit complet.",
      "sentence_en": "This e-commerce platform established a comprehensive credit evaluation system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "e_commerce",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的演讲风格幽默风趣，深受听众的喜爱和欢迎。",
      "sentence_pinyin": "Tā de yǎnjiǎng fēnggé yōumò fēngqù, shēn shòu tīngzhòng de xǐ'ài hé huānyíng.",
      "sentence_fr": "Son style de discours humoristique et spirituel est très apprécié et populaire auprès du public.",
      "sentence_en": "His humorous and witty speech style is very loved and popular among the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_speaking",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能家居系统可以通过语音控制各种家用电器。",
      "sentence_pinyin": "Zhège zhìnéng jiājū xìtǒng kěyǐ tōngguò yǔyīn kòngzhì gèzhǒng jiāyòng diànqì.",
      "sentence_fr": "Ce système de maison intelligente peut contrôler divers appareils électroménagers par commande vocale.",
      "sentence_en": "This smart home system can control various household appliances through voice commands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_home",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她利用业余时间学习了多门外语，拓宽了国际视野。",
      "sentence_pinyin": "Tā lìyòng yèyú shíjiān xuéxíle duō mén wàiyǔ, tuòkuānle guójì shìyě.",
      "sentence_fr": "Elle a appris plusieurs langues étrangères pendant son temps libre, élargissant sa perspective internationale.",
      "sentence_en": "She learned multiple foreign languages in her spare time, broadening her international perspective.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "language_learning",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个艺术画廊定期举办各类艺术展览和文化交流活动。",
      "sentence_pinyin": "Zhège yìshù huàláng dìngqī jǔbàn gè lèi yìshù zhǎnlǎn hé wénhuà jiāoliú huódòng.",
      "sentence_fr": "Cette galerie d'art organise régulièrement diverses expositions d'art et activités d'échanges culturels.",
      "sentence_en": "This art gallery regularly holds various art exhibitions and cultural exchange activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art_galleries",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在比赛中展现出顽强的拼搏精神和永不放弃的态度。",
      "sentence_pinyin": "Tā zài bǐsài zhōng zhǎnxiàn chū wánqiáng de pīnbó jīngshén hé yǒngbù fàngqì de tàidu.",
      "sentence_fr": "Il a fait preuve d'un esprit de lutte tenace et d'une attitude de ne jamais abandonner lors de la compétition.",
      "sentence_en": "He demonstrated a tenacious fighting spirit and a never-give-up attitude in the competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sports",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个慈善基金会长期资助贫困地区的教育事业发展。",
      "sentence_pinyin": "Zhège císhàn jījīnhuì chángqī zīzhù pínkùn dìqū de jiàoyù shìyè fāzhǎn.",
      "sentence_fr": "Cette fondation caritative soutient à long terme le développement de l'éducation dans les régions pauvres.",
      "sentence_en": "This charity foundation provides long-term support for educational development in poor areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家科技公司专注于开发环保节能的新产品。",
      "sentence_pinyin": "Zhè jiā kējì gōngsī zhuānzhù yú kāifā huánbǎo jiénéng de xīn chǎnpǐn.",
      "sentence_fr": "Cette entreprise technologique se concentre sur le développement de nouveaux produits écologiques et économes en énergie.",
      "sentence_en": "This technology company focuses on developing eco-friendly and energy-efficient new products.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_technology",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的烘焙作品不仅美味可口，而且造型精美独特。",
      "sentence_pinyin": "Tā de hōngbèi zuòpǐn bùjǐn měiwèi kěkǒu, érqiě zàoxíng jīngměi dútè.",
      "sentence_fr": "Ses créations de pâtisserie sont non seulement délicieuses mais aussi d'une forme exquise et unique.",
      "sentence_en": "Her baking creations are not only delicious but also exquisitely and uniquely shaped.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "baking",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创新项目获得了风险投资机构的青睐和资金支持。",
      "sentence_pinyin": "Zhège chuàngxīn xiàngmù huòdéle fēngxiǎn tóuzī jīgòu de qīnglài hé zījīn zhīchí.",
      "sentence_fr": "Ce projet innovant a obtenu la faveur et le soutien financier d'institutions de capital-risque.",
      "sentence_en": "This innovative project gained the favor and financial support of venture capital institutions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startups",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在团队管理中注重激发每个成员的潜能和创造力。",
      "sentence_pinyin": "Tā zài tuánduì guǎnlǐ zhōng zhùzhòng jīfā měi ge chéngyuán de qiánnéng hé chuàngzàolì.",
      "sentence_fr": "Dans la gestion d'équipe, il met l'accent sur le développement du potentiel et de la créativité de chaque membre.",
      "sentence_en": "In team management, he emphasizes developing the potential and creativity of each member.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "leadership",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐培训机构为学员提供一对一的专业指导。",
      "sentence_pinyin": "Zhège yīnyuè péixùn jīgòu wèi xuéyuán tígōng yī duì yī de zhuānyè zhǐdǎo.",
      "sentence_fr": "Cet institut de formation musicale offre un encadrement professionnel personnalisé aux étudiants.",
      "sentence_en": "This music training institute provides one-on-one professional guidance to students.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_education",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座历史建筑经过修缮后重新对公众开放参观。",
      "sentence_pinyin": "Zhè zuò lìshǐ jiànzhù jīngguò xiūshàn hòu chóngxīn duì gōngzhòng kāifàng cānguān.",
      "sentence_fr": "Ce bâtiment historique a été rouvert au public après restauration.",
      "sentence_en": "This historic building was reopened to the public after restoration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "historic_sites",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的研究论文为这个领域的理论发展做出了重要贡献。",
      "sentence_pinyin": "Tā de yánjiū lùnwén wèi zhège lǐngyù de lǐlùn fāzhǎn zuò chūle zhòngyào gòngxiàn.",
      "sentence_fr": "Son article de recherche a apporté une contribution importante au développement théorique de ce domaine.",
      "sentence_en": "Her research paper made an important contribution to the theoretical development of this field.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "academic_research",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个户外运动俱乐部组织会员进行登山、徒步等活动。",
      "sentence_pinyin": "Zhège hùwài yùndòng jùlèbù zǔzhī huìyuán jìnxíng dēngshān, túbù děng huódòng.",
      "sentence_fr": "Ce club de sports en plein air organise des activités d'escalade, de randonnée et autres pour ses membres.",
      "sentence_en": "This outdoor sports club organizes mountain climbing, hiking and other activities for members.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "outdoor_activities",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在工作中善于发现问题并及时提出解决方案。",
      "sentence_pinyin": "Tā zài gōngzuò zhōng shànyú fāxiàn wèntí bìng jíshí tíchū jiějué fāng'àn.",
      "sentence_fr": "Il est doué pour identifier les problèmes au travail et proposer des solutions en temps opportun.",
      "sentence_en": "He is good at identifying problems at work and proposing solutions in a timely manner.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "problem_solving",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社会企业致力于为残疾人创造就业机会和发展空间。",
      "sentence_pinyin": "Zhège shèhuì qǐyè zhìlì yú wèi cánjírén chuàngzào jiùyè jīhuì hé fāzhǎn kōngjiān.",
      "sentence_fr": "Cette entreprise sociale s'engage à créer des opportunités d'emploi et d'espace de développement pour les personnes handicapées.",
      "sentence_en": "This social enterprise is committed to creating employment opportunities and development space for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_enterprise",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个纪录片系列真实记录了不同职业人群的工作和生活状态。",
      "sentence_pinyin": "Zhège jìlùpiàn xìliè zhēnshí jìlùle bùtóng zhíyè rénqún de gōngzuò hé shēnghuó zhuàngtài.",
      "sentence_fr": "Cette série documentaire enregistre fidèlement le travail et la vie de personnes de différentes professions.",
      "sentence_en": "This documentary series authentically records the work and life of people from different professions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "documentaries",
      "created_at": "2025-11-20T17:30:00.000Z",
      "updated_at": "2025-11-20T17:30:00.000Z"
    }
  ]
}
