{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "光催化技术利用太阳能分解水分子来生产清洁的氢燃料。",
      "sentence_pinyin": "Guāng cuīhuà jìshù lìyòng tàiyáng néng fēnjiě shuǐ fēnzǐ lái shēngchǎn qīngjié de qīng ránliào.",
      "sentence_fr": "La technologie de photocatalyse utilise l'énergie solaire pour décomposer les molécules d'eau afin de produire du carburant hydrogène propre.",
      "sentence_en": "Photocatalytic technology uses solar energy to decompose water molecules to produce clean hydrogen fuel.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "photocatalysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言接触研究分析不同语言的使用者互动时语言结构和词汇的变化。",
      "sentence_pinyin": "Yǔyán jiēchù yánjiū fēnxī bùtóng yǔyán de shǐyòng zhě hùdòng shí yǔyán jiégòu hé cíhuì de biànhuà.",
      "sentence_fr": "L'étude du contact linguistique analyse les changements dans la structure et le vocabulaire des langues lorsque les locuteurs de différentes langues interagissent.",
      "sentence_en": "Language contact research analyzes changes in language structure and vocabulary when speakers of different languages interact.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_contact",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字治疗解决方案通过软件应用程序为患者提供基于证据的治疗干预。",
      "sentence_pinyin": "Shùzì zhìliáo jiějué fāng'àn tōngguò ruǎnjiàn yìngyòng chéngxù wèi huànzhě tígōng jīyú zhèngjù de zhìliáo gānyù.",
      "sentence_fr": "Les solutions thérapeutiques numériques fournissent aux patients des interventions thérapeutiques fondées sur des preuves via des applications logicielles.",
      "sentence_en": "Digital therapeutics solutions provide patients with evidence-based therapeutic interventions through software applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_therapeutics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市更新项目在改善基础设施的同时需要避免导致原有居民被迫搬迁。",
      "sentence_pinyin": "Chéngshì gēngxīn xiàngmù zài gǎishàn jīchǔ shèshī de tóngshí xūyào bìmiǎn dǎozhì yuányǒu jūmín bèi pò bānqiān.",
      "sentence_fr": "Les projets de rénovation urbaine doivent éviter de forcer les résidents existants à déménager tout en améliorant les infrastructures.",
      "sentence_en": "Urban renewal projects need to avoid forcing existing residents to relocate while improving infrastructure.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_renewal",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "元宇宙概念设想了一个持久的、共享的虚拟空间供人们工作和社交。",
      "sentence_pinyin": "Yuán yǔzhòu gàiniàn shèxiǎng le yīgè chíjiǔ de, gòngxiǎng de xūnǐ kōngjiān gōng rénmen gōngzuò hé shèjiāo.",
      "sentence_fr": "Le concept de métavers envisage un espace virtuel persistant et partagé où les gens peuvent travailler et socialiser.",
      "sentence_en": "The metaverse concept envisions a persistent, shared virtual space for people to work and socialize.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metaverse",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物节律研究揭示了内在生物钟如何影响睡眠、代谢和整体健康。",
      "sentence_pinyin": "Shēngwù jiézòu yánjiū jiēshì le nèizài shēngwù zhōng rúhé yǐngxiǎng shuìmián, dàixiè hé zhěngtǐ jiànkāng.",
      "sentence_fr": "La recherche sur les rythmes biologiques révèle comment l'horloge biologique interne affecte le sommeil, le métabolisme et la santé globale.",
      "sentence_en": "Circadian rhythm research reveals how the internal biological clock affects sleep, metabolism, and overall health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circadian_rhythms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "开放政府数据倡议促进公共部门信息的透明度和公民参与度。",
      "sentence_pinyin": "Kāifàng zhèngfǔ shùjù chàngyì cùjìn gōnggòng bùmén xìnxī de tòumíng dù hé gōngmín cānyù dù.",
      "sentence_fr": "Les initiatives d'ouverture des données gouvernementales favorisent la transparence des informations du secteur public et la participation citoyenne.",
      "sentence_en": "Open government data initiatives promote transparency of public sector information and citizen participation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "open_government_data",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工业共生模式让企业相互利用彼此的废弃物和副产品作为原材料。",
      "sentence_pinyin": "Gōngyè gòngshēng móshì ràng qǐyè xiānghù lìyòng bǐcǐ de fèiqì wù hé fù chǎnpǐn zuòwéi yuáncáiliào.",
      "sentence_fr": "Le modèle de symbiose industrielle permet aux entreprises d'utiliser mutuellement les déchets et sous-produits les uns des autres comme matières premières.",
      "sentence_en": "Industrial symbiosis models allow businesses to use each other's waste and by-products as raw materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "industrial_symbiosis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨文化心理学研究文化背景如何影响认知过程、情感表达和社会行为。",
      "sentence_pinyin": "Kuà wénhuà xīnlǐ xué yánjiū wénhuà bèijǐng rúhé yǐngxiǎng rènzhī guòchéng, qínggǎn biǎodá hé shèhuì xíngwéi.",
      "sentence_fr": "La psychologie interculturelle étudie comment le contexte culturel influence les processus cognitifs, l'expression émotionnelle et le comportement social.",
      "sentence_en": "Cross-cultural psychology studies how cultural background influences cognitive processes, emotional expression, and social behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cross_cultural_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "先进材料研究开发具有优异性能的新型复合材料和纳米材料。",
      "sentence_pinyin": "Xiānjìn cáiliào yánjiū kāifā jùyǒu yōuyì xìngnéng de xīnxíng fùhé cáiliào hé nàmǐ cáiliào.",
      "sentence_fr": "La recherche sur les matériaux avancés développe de nouveaux matériaux composites et nanomatériaux aux performances supérieures.",
      "sentence_en": "Advanced materials research develops new composite and nanomaterials with superior performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "advanced_materials",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "危机传播策略帮助组织在突发事件中有效地向公众传达关键信息。",
      "sentence_pinyin": "Wéijī chuánbō cèlüè bāngzhù zǔzhī zài tūfā shìjiàn zhōng yǒuxiào de xiàng gōngzhòng chuándá guānjiàn xìnxī.",
      "sentence_fr": "Les stratégies de communication de crise aident les organisations à transmettre efficacement des informations clés au public lors d'événements d'urgence.",
      "sentence_en": "Crisis communication strategies help organizations effectively convey key information to the public during emergencies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "crisis_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "反向遗传学技术使研究人员能够从已知基因序列出发研究基因功能。",
      "sentence_pinyin": "Fǎnxiàng yíchuán xué jìshù shǐ yánjiū rényuán nénggòu cóng yǐzhī jīyīn xùliè chūfā yánjiū jīyīn gōngnéng.",
      "sentence_fr": "Les techniques de génétique inverse permettent aux chercheurs d'étudier la fonction des gènes à partir de séquences génétiques connues.",
      "sentence_en": "Reverse genetics techniques enable researchers to study gene function starting from known gene sequences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reverse_genetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "住房可负担性危机正在影响全球多个主要城市的中低收入家庭。",
      "sentence_pinyin": "Zhùfáng kě fùdān xìng wéijī zhèngzài yǐngxiǎng quánqiú duō gè zhǔyào chéngshì de zhōng dī shōurù jiātíng.",
      "sentence_fr": "La crise de l'accessibilité au logement affecte les familles à revenus faibles et moyens dans de nombreuses grandes villes du monde.",
      "sentence_en": "The housing affordability crisis is affecting low and middle-income families in many major cities worldwide.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "housing_affordability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间序列分析方法帮助研究人员识别历史数据中的趋势和周期性模式。",
      "sentence_pinyin": "Shíjiān xùliè fēnxī fāngfǎ bāngzhù yánjiū rényuán shìbié lìshǐ shùjù zhōng de qūshì hé zhōuqī xìng móshì.",
      "sentence_fr": "Les méthodes d'analyse de séries temporelles aident les chercheurs à identifier les tendances et les schémas cycliques dans les données historiques.",
      "sentence_en": "Time series analysis methods help researchers identify trends and cyclical patterns in historical data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "time_series_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境心理学研究物理环境如何影响人类的情绪、行为和心理健康。",
      "sentence_pinyin": "Huánjìng xīnlǐ xué yánjiū wùlǐ huánjìng rúhé yǐngxiǎng rénlèi de qíngxù, xíngwéi hé xīnlǐ jiànkāng.",
      "sentence_fr": "La psychologie environnementale étudie comment l'environnement physique affecte les émotions, le comportement et la santé mentale des humains.",
      "sentence_en": "Environmental psychology studies how the physical environment affects human emotions, behavior, and mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可持续包装创新致力于减少塑料使用并开发可降解和可回收的替代材料。",
      "sentence_pinyin": "Kěchíxù bāozhuāng chuàngxīn zhìlì yú jiǎnshǎo sùliào shǐyòng bìng kāifā kě jiàngjié hé kě huíshōu de tìdài cáiliào.",
      "sentence_fr": "L'innovation en emballage durable s'efforce de réduire l'utilisation du plastique et de développer des matériaux alternatifs biodégradables et recyclables.",
      "sentence_en": "Sustainable packaging innovation strives to reduce plastic use and develop biodegradable and recyclable alternative materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sustainable_packaging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "虚拟团队管理需要克服时区差异和缺乏面对面交流带来的沟通挑战。",
      "sentence_pinyin": "Xūnǐ tuánduì guǎnlǐ xūyào kèfú shíqū chāyì hé quēfá miànduìmiàn jiāoliú dàilái de gōutōng tiǎozhàn.",
      "sentence_fr": "La gestion d'équipes virtuelles doit surmonter les défis de communication posés par les différences de fuseaux horaires et le manque d'interaction en face à face.",
      "sentence_en": "Virtual team management needs to overcome communication challenges posed by time zone differences and lack of face-to-face interaction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "virtual_team_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "昆虫蛋白作为可持续的替代蛋白来源正在引起食品行业的广泛关注。",
      "sentence_pinyin": "Kūnchóng dànbái zuòwéi kěchíxù de tìdài dànbái láiyuán zhèngzài yǐnqǐ shípǐn hángyè de guǎngfàn guānzhù.",
      "sentence_fr": "Les protéines d'insectes en tant que source alternative de protéines durables attirent une attention croissante dans l'industrie alimentaire.",
      "sentence_en": "Insect protein as a sustainable alternative protein source is attracting widespread attention in the food industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "insect_protein",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "监控资本主义描述了科技公司如何将用户数据商品化以获取利润。",
      "sentence_pinyin": "Jiānkòng zīběn zhǔyì miáoshù le kējì gōngsī rúhé jiāng yònghù shùjù shāngpǐn huà yǐ huòqǔ lìrùn.",
      "sentence_fr": "Le capitalisme de surveillance décrit comment les entreprises technologiques monétisent les données des utilisateurs à des fins lucratives.",
      "sentence_en": "Surveillance capitalism describes how tech companies commodify user data for profit.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "surveillance_capitalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "植物神经网络研究揭示了植物之间通过化学信号进行通信的复杂方式。",
      "sentence_pinyin": "Zhíwù shénjīng wǎngluò yánjiū jiēshì le zhíwù zhījiān tōngguò huàxué xìnhào jìnxíng tōngxìn de fùzá fāngshì.",
      "sentence_fr": "La recherche sur les réseaux de signalisation végétale révèle les moyens complexes par lesquels les plantes communiquent entre elles via des signaux chimiques.",
      "sentence_en": "Plant signaling network research reveals the complex ways plants communicate with each other through chemical signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plant_signaling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
