{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能温控系统可以根据室内人数自动调节空调的温度和风速。",
      "sentence_pinyin": "Zhège zhìnéng wēnkòng xìtǒng kěyǐ gēnjù shìnèi rénshù zìdòng tiáojié kōngtiáo de wēndù hé fēngsù.",
      "sentence_fr": "Ce système de contrôle de température intelligent peut ajuster automatiquement la température et la vitesse du ventilateur de la climatisation selon le nombre de personnes présentes.",
      "sentence_en": "This smart temperature control system can automatically adjust the air conditioner's temperature and fan speed based on the number of people indoors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_climate_control",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的糖画艺人可以用熔化的糖浆在石板上绘出各种图案。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tánghuà yìrén kěyǐ yòng rónghuà de tángjiāng zài shíbǎn shàng huìchū gèzhǒng tú'àn.",
      "sentence_fr": "Les artistes traditionnels chinois de peinture au sucre peuvent créer divers motifs sur une plaque de pierre avec du sirop fondu.",
      "sentence_en": "Traditional Chinese sugar painting artists can create various patterns on a stone slab with melted syrup.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sugar_painting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新能源汽车的普及有助于减少城市的空气污染和碳排放。",
      "sentence_pinyin": "Xīn néngyuán qìchē de pǔjí yǒuzhù yú jiǎnshǎo chéngshì de kōngqì wūrǎn hé tàn páifàng.",
      "sentence_fr": "La popularisation des véhicules à énergies nouvelles contribue à réduire la pollution atmosphérique et les émissions de carbone en ville.",
      "sentence_en": "The popularization of new energy vehicles helps reduce urban air pollution and carbon emissions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_energy_vehicles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能热水器可以学习你的用水习惯,在你需要时自动加热热水。",
      "sentence_pinyin": "Zhìnéng rèshuǐqì kěyǐ xuéxí nǐ de yòngshuǐ xíguàn, zài nǐ xūyào shí zìdòng jiārè rèshuǐ.",
      "sentence_fr": "Le chauffe-eau intelligent peut apprendre vos habitudes d'utilisation de l'eau et chauffer automatiquement l'eau quand vous en avez besoin.",
      "sentence_en": "The smart water heater can learn your water usage habits and automatically heat water when you need it.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_heaters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "京剧是中国的国粹,融合了唱、念、做、打四种表演艺术。",
      "sentence_pinyin": "Jīngjù shì Zhōngguó de guócuì, rónghé le chàng, niàn, zuò, dǎ sì zhǒng biǎoyǎn yìshù.",
      "sentence_fr": "L'opéra de Pékin est le trésor national de la Chine, combinant quatre arts du spectacle : le chant, le récitatif, le jeu et les acrobaties.",
      "sentence_en": "Peking Opera is China's national treasure, combining four performing arts: singing, recitation, acting, and martial arts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "peking_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区菜市场经过改造升级后,环境整洁了很多,购物体验也更好了。",
      "sentence_pinyin": "Shèqū càishìchǎng jīngguò gǎizào shēngjí hòu, huánjìng zhěngjié le hěn duō, gòuwù tǐyàn yě gèng hǎo le.",
      "sentence_fr": "Après la rénovation du marché communautaire, l'environnement est beaucoup plus propre et l'expérience d'achat s'est améliorée.",
      "sentence_en": "After the community market's renovation and upgrade, the environment is much cleaner and the shopping experience has improved.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_markets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能血压计可以自动记录每次测量结果,并生成健康趋势报告。",
      "sentence_pinyin": "Zhìnéng xuèyājì kěyǐ zìdòng jìlù měi cì cèliáng jiéguǒ, bìng shēngchéng jiànkāng qūshì bàogào.",
      "sentence_fr": "Le tensiomètre intelligent peut enregistrer automatiquement chaque mesure et générer un rapport de tendances de santé.",
      "sentence_en": "The smart blood pressure monitor can automatically record each measurement and generate a health trend report.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_health_monitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的泥塑工艺以无锡惠山泥人最为著名,造型生动可爱。",
      "sentence_pinyin": "Zhōngguó chuántǒng de nísù gōngyì yǐ Wúxī Huìshān nírén zuìwéi zhùmíng, zàoxíng shēngdòng kě'ài.",
      "sentence_fr": "L'artisanat traditionnel chinois de modelage d'argile est le plus célèbre pour les figurines de Huishan à Wuxi, aux formes vivantes et mignonnes.",
      "sentence_en": "Traditional Chinese clay sculpture craftsmanship is most famous for Huishan clay figurines from Wuxi, with vivid and adorable shapes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "clay_sculpture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能插座可以远程控制电器开关,还能统计用电量。",
      "sentence_pinyin": "Zhìnéng chāzuò kěyǐ yuǎnchéng kòngzhì diànqì kāiguān, hái néng tǒngjì yòngdiànliàng.",
      "sentence_fr": "La prise intelligente peut contrôler à distance les appareils électriques et aussi mesurer la consommation d'électricité.",
      "sentence_en": "The smart plug can remotely control electrical appliances and also track electricity usage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_plugs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "昆曲是中国最古老的戏曲剧种之一,被誉为百戏之祖。",
      "sentence_pinyin": "Kūnqǔ shì Zhōngguó zuì gǔlǎo de xìqǔ jùzhǒng zhī yī, bèi yù wéi bǎixì zhī zǔ.",
      "sentence_fr": "L'opéra kunqu est l'une des plus anciennes formes d'opéra chinois, surnommé l'ancêtre de tous les opéras.",
      "sentence_en": "Kunqu opera is one of China's oldest opera forms, known as the ancestor of all operas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kunqu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "垃圾焚烧发电厂将生活垃圾转化为电能,实现了废物利用。",
      "sentence_pinyin": "Lājī fénshāo fādiànchǎng jiāng shēnghuó lājī zhuǎnhuà wéi diànnéng, shíxiàn le fèiwù lìyòng.",
      "sentence_fr": "Les centrales d'incinération des déchets transforment les ordures ménagères en électricité, réalisant la valorisation des déchets.",
      "sentence_en": "Waste incineration power plants convert household garbage into electricity, achieving waste utilization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_to_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能加湿器可以根据室内湿度自动调节喷雾量,保持空气湿润。",
      "sentence_pinyin": "Zhìnéng jiāshīqì kěyǐ gēnjù shìnèi shīdù zìdòng tiáojié pēnwù liàng, bǎochí kōngqì shīrùn.",
      "sentence_fr": "L'humidificateur intelligent peut ajuster automatiquement la quantité de brume selon l'humidité intérieure, maintenant l'air humide.",
      "sentence_en": "The smart humidifier can automatically adjust mist output based on indoor humidity, keeping the air moist.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_humidifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的蜡染工艺用蜡在布上绘制图案,然后染色形成独特效果。",
      "sentence_pinyin": "Zhōngguó chuántǒng de làrǎn gōngyì yòng là zài bù shàng huìzhì tú'àn, ránhòu rǎnsè xíngchéng dútè xiàoguǒ.",
      "sentence_fr": "L'artisanat traditionnel chinois du batik utilise de la cire pour dessiner des motifs sur le tissu, puis la teinture crée des effets uniques.",
      "sentence_en": "Traditional Chinese batik craftsmanship uses wax to draw patterns on fabric, then dyeing creates unique effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "batik_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能除湿机可以自动检测空气湿度,在潮湿天气保持室内干爽。",
      "sentence_pinyin": "Zhìnéng chúshījī kěyǐ zìdòng jiǎncè kōngqì shīdù, zài cháoshī tiānqì bǎochí shìnèi gānshuǎng.",
      "sentence_fr": "Le déshumidificateur intelligent peut détecter automatiquement l'humidité de l'air et garder l'intérieur sec par temps humide.",
      "sentence_en": "The smart dehumidifier can automatically detect air humidity and keep indoors dry during humid weather.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dehumidifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "川剧变脸是四川戏曲的绝活,演员可以在瞬间变换多张脸谱。",
      "sentence_pinyin": "Chuānjù biànliǎn shì Sìchuān xìqǔ de juéhuó, yǎnyuán kěyǐ zài shùnjiān biànhuàn duō zhāng liǎnpǔ.",
      "sentence_fr": "Le changement de masque de l'opéra du Sichuan est une prouesse unique, où l'acteur peut changer plusieurs masques en un instant.",
      "sentence_en": "Sichuan opera face-changing is a unique skill where performers can switch multiple masks in an instant.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sichuan_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的智慧交通系统可以实时监控路况,优化红绿灯配时。",
      "sentence_pinyin": "Zhège chéngshì de zhìhuì jiāotōng xìtǒng kěyǐ shíshí jiānkòng lùkuàng, yōuhuà hónglǜdēng pèishí.",
      "sentence_fr": "Le système de transport intelligent de cette ville peut surveiller le trafic en temps réel et optimiser le timing des feux de circulation.",
      "sentence_en": "This city's smart traffic system can monitor road conditions in real-time and optimize traffic light timing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_traffic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能台灯可以根据环境光线自动调节亮度,保护用户的视力。",
      "sentence_pinyin": "Zhìnéng táidēng kěyǐ gēnjù huánjìng guāngxiàn zìdòng tiáojié liàngdù, bǎohù yònghù de shìlì.",
      "sentence_fr": "La lampe de bureau intelligente peut ajuster automatiquement la luminosité selon la lumière ambiante, protégeant la vue de l'utilisateur.",
      "sentence_en": "The smart desk lamp can automatically adjust brightness based on ambient light, protecting the user's eyesight.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_lamps",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的扎染工艺通过捆扎和染色创造出独特的图案纹理。",
      "sentence_pinyin": "Zhōngguó chuántǒng de zārǎn gōngyì tōngguò kǔnzhā hé rǎnsè chuàngzào chū dútè de tú'àn wénlǐ.",
      "sentence_fr": "L'artisanat traditionnel chinois du tie-dye crée des motifs et textures uniques par le nouage et la teinture.",
      "sentence_en": "Traditional Chinese tie-dye craftsmanship creates unique patterns and textures through binding and dyeing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tie_dye_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "农村饮水安全工程让偏远山区的村民也能喝上干净的自来水。",
      "sentence_pinyin": "Nóngcūn yǐnshuǐ ānquán gōngchéng ràng piānyuǎn shānqū de cūnmín yě néng hēshàng gānjìng de zìláishuǐ.",
      "sentence_fr": "Le projet de sécurité de l'eau potable rurale permet aux villageois des régions montagneuses reculées d'avoir accès à l'eau courante propre.",
      "sentence_en": "The rural drinking water safety project enables villagers in remote mountain areas to access clean tap water.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_water_safety",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能马桶盖具有座圈加热、自动冲洗和暖风烘干等多种功能。",
      "sentence_pinyin": "Zhìnéng mǎtǒng gài jùyǒu zuòquān jiārè, zìdòng chōngxǐ hé nuǎnfēng hōnggān děng duō zhǒng gōngnéng.",
      "sentence_fr": "Le siège de toilettes intelligent offre plusieurs fonctions comme le chauffage du siège, le lavage automatique et le séchage à air chaud.",
      "sentence_en": "The smart toilet seat has multiple functions including heated seat, automatic washing, and warm air drying.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toilets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
