{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠错阈值定理保证足够低的错误率下可实现容错计算。",
      "sentence_pinyin": "Liàngzǐ jiūcuò yùzhí dìnglǐ bǎozhèng zúgòu dī de cuòwù lǜ xià kě shíxiàn róngcuò jìsuàn.",
      "sentence_fr": "Le théorème du seuil de correction d'erreurs quantiques garantit un calcul tolérant aux fautes avec des taux d'erreur suffisamment bas.",
      "sentence_en": "Quantum error correction threshold theorem guarantees fault-tolerant computation with sufficiently low error rates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "threshold_theorem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "选择安全性保证攻击者选择的密文解密也是安全的。",
      "sentence_pinyin": "Xuǎnzé ānquánxìng bǎozhèng gōngjīzhě xuǎnzé de mìwén jiěmì yě shì ānquán de.",
      "sentence_fr": "La sécurité choisie garantit que le déchiffrement des textes chiffrés choisis par l'attaquant est également sécurisé.",
      "sentence_en": "Chosen ciphertext security guarantees decryption of attacker-chosen ciphertexts is also secure.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cca_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "主体归约保证类型系统中的β归约保持类型不变。",
      "sentence_pinyin": "Zhǔtǐ guīyuē bǎozhèng lèixíng xìtǒng zhōng de β guīyuē bǎochí lèixíng bù biàn.",
      "sentence_fr": "La réduction du sujet garantit que la β-réduction dans les systèmes de types préserve les types.",
      "sentence_en": "Subject reduction guarantees β-reduction in type systems preserves types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "subject_reduction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦纤维刻画纤维化映射的同伦论性质。",
      "sentence_pinyin": "Tónglún xiānwéi kèhuà xiānwéihuà yìngshè de tónglún lùn xìngzhì.",
      "sentence_fr": "Les fibres homotopiques caractérisent les propriétés homotopiques des applications fibrées.",
      "sentence_en": "Homotopy fibers characterize homotopy-theoretic properties of fibration maps.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homotopy_fibers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子魔方态是通用量子计算的关键资源状态。",
      "sentence_pinyin": "Liàngzǐ mófāng tài shì tōngyòng liàngzǐ jìsuàn de guānjiàn zīyuán zhuàngtài.",
      "sentence_fr": "Les états magiques quantiques sont des états de ressources clés pour le calcul quantique universel.",
      "sentence_en": "Quantum magic states are key resource states for universal quantum computation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "magic_states",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "紧归约在多项式时间内完成安全归约证明。",
      "sentence_pinyin": "Jǐn guīyuē zài duōxiàngshì shíjiān nèi wánchéng ānquán guīyuē zhèngmíng.",
      "sentence_fr": "Les réductions serrées complètent les preuves de réduction de sécurité en temps polynomial.",
      "sentence_en": "Tight reductions complete security reduction proofs in polynomial time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "tight_reductions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "进展性保证良类型的闭项要么是值要么可以继续求值。",
      "sentence_pinyin": "Jìnzhǎnxìng bǎozhèng liáng lèixíng de bì xiàng yàome shì zhí yàome kěyǐ jìxù qiúzhí.",
      "sentence_fr": "La progression garantit que les termes clos bien typés sont soit des valeurs, soit peuvent continuer à être évalués.",
      "sentence_en": "Progress guarantees well-typed closed terms are either values or can continue evaluation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "progress_property",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "斯蒂费尔流形是正交群上的齐性空间。",
      "sentence_pinyin": "Sīdìfèi'ěr liúxíng shì zhèngjiāo qún shàng de qíxìng kōngjiān.",
      "sentence_fr": "Les variétés de Stiefel sont des espaces homogènes sur les groupes orthogonaux.",
      "sentence_en": "Stiefel manifolds are homogeneous spaces over orthogonal groups.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stiefel_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子稳定子码利用泡利群的交换性质实现纠错。",
      "sentence_pinyin": "Liàngzǐ wěndìngzǐ mǎ lìyòng Pàolì qún de jiāohuàn xìngzhì shíxiàn jiūcuò.",
      "sentence_fr": "Les codes stabilisateurs quantiques utilisent les propriétés commutatives du groupe de Pauli pour la correction d'erreurs.",
      "sentence_en": "Quantum stabilizer codes use commutative properties of Pauli group for error correction.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stabilizer_codes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自适应安全性允许攻击者在协议执行中动态选择腐败方。",
      "sentence_pinyin": "Zìshìyìng ānquánxìng yǔnxǔ gōngjīzhě zài xiéyì zhíxíng zhōng dòngtài xuǎnzé fǔbài fāng.",
      "sentence_fr": "La sécurité adaptative permet à l'attaquant de choisir dynamiquement les parties corrompues pendant l'exécution du protocole.",
      "sentence_en": "Adaptive security allows attackers to dynamically choose corrupted parties during protocol execution.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "adaptive_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型保持性结合进展性构成类型系统的安全性定理。",
      "sentence_pinyin": "Lèixíng bǎochíxìng jiéhé jìnzhǎnxìng gòuchéng lèixíng xìtǒng de ānquánxìng dìnglǐ.",
      "sentence_fr": "La préservation des types combinée à la progression constitue le théorème de sûreté des systèmes de types.",
      "sentence_en": "Type preservation combined with progress constitutes type system safety theorems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_safety_theorem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格拉斯曼流形参数化向量空间中的k维子空间。",
      "sentence_pinyin": "Gélāsīmàn liúxíng cānshùhuà xiàngliàng kōngjiān zhōng de k wéi zǐ kōngjiān.",
      "sentence_fr": "Les variétés grassmanniennes paramètrent les sous-espaces de dimension k dans les espaces vectoriels.",
      "sentence_en": "Grassmannian manifolds parametrize k-dimensional subspaces in vector spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "grassmannian_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子电路深度影响算法执行所需的时间步数。",
      "sentence_pinyin": "Liàngzǐ diànlù shēndù yǐngxiǎng suànfǎ zhíxíng suǒxū de shíjiān bù shù.",
      "sentence_fr": "La profondeur du circuit quantique affecte le nombre d'étapes temporelles nécessaires à l'exécution de l'algorithme.",
      "sentence_en": "Quantum circuit depth affects the number of time steps needed for algorithm execution.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "circuit_depth",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "游戏跳转证明通过一系列游戏变换完成安全归约。",
      "sentence_pinyin": "Yóuxì tiàozhuǎn zhèngmíng tōngguò yī xìliè yóuxì biànhuàn wánchéng ānquán guīyuē.",
      "sentence_fr": "Les preuves par sauts de jeu complètent les réductions de sécurité par une série de transformations de jeu.",
      "sentence_en": "Game-hopping proofs complete security reductions through a series of game transformations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "game_hopping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "λ立方体组织了不同类型系统之间的包含关系。",
      "sentence_pinyin": "λ lìfāngtǐ zǔzhī le bùtóng lèixíng xìtǒng zhījiān de bāohán guānxì.",
      "sentence_fr": "Le λ-cube organise les relations d'inclusion entre différents systèmes de types.",
      "sentence_en": "Lambda cube organizes inclusion relations between different type systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lambda_cube",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "射影空间通过等价关系识别成比例的向量。",
      "sentence_pinyin": "Shèyǐng kōngjiān tōngguò děngjià guānxì shíbié chéng bǐlì de xiàngliàng.",
      "sentence_fr": "Les espaces projectifs identifient les vecteurs proportionnels par une relation d'équivalence.",
      "sentence_en": "Projective spaces identify proportional vectors through equivalence relations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "projective_spaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子比特连接性决定了哪些量子比特对可以直接交互。",
      "sentence_pinyin": "Liàngzǐ bǐtè liánjiēxìng juédìng le nǎxiē liàngzǐ bǐtè duì kěyǐ zhíjiē jiāohù.",
      "sentence_fr": "La connectivité des qubits détermine quelles paires de qubits peuvent interagir directement.",
      "sentence_en": "Qubit connectivity determines which qubit pairs can interact directly.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "qubit_connectivity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合模型安全性假设攻击者具有特定的计算能力限制。",
      "sentence_pinyin": "Hùnhé móxíng ānquánxìng jiǎshè gōngjīzhě jùyǒu tèdìng de jìsuàn nénglì xiànzhì.",
      "sentence_fr": "La sécurité du modèle hybride suppose que l'attaquant a des limitations de capacité de calcul spécifiques.",
      "sentence_en": "Hybrid model security assumes attackers have specific computational capability limitations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hybrid_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "逻辑框架为形式化证明系统提供元理论基础。",
      "sentence_pinyin": "Luójí kuàngjià wèi xíngshìhuà zhèngmíng xìtǒng tígōng yuán lǐlùn jīchǔ.",
      "sentence_fr": "Les cadres logiques fournissent une base méta-théorique pour les systèmes de preuve formels.",
      "sentence_en": "Logical frameworks provide metatheoretic foundations for formal proof systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "logical_frameworks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "向量丛是纤维为向量空间的光滑纤维丛。",
      "sentence_pinyin": "Xiàngliàng cù shì xiānwéi wéi xiàngliàng kōngjiān de guānghuá xiānwéi cù.",
      "sentence_fr": "Les fibrés vectoriels sont des fibrés lisses dont les fibres sont des espaces vectoriels.",
      "sentence_en": "Vector bundles are smooth fiber bundles whose fibers are vector spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "vector_bundles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
