{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧医院系统整合了预约挂号、电子病历和远程诊疗等功能。",
      "sentence_pinyin": "Zhège zhìhuì yīyuàn xìtǒng zhěnghéle yùyuē guàhào, diànzǐ bìnglì hé yuǎnchéng zhěnliáo děng gōngnéng.",
      "sentence_fr": "Ce système hospitalier intelligent intègre des fonctions telles que la prise de rendez-vous, les dossiers médicaux électroniques et la téléconsultation.",
      "sentence_en": "This smart hospital system integrates functions such as appointment registration, electronic medical records, and telemedicine.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_hospitals",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "尺八的音色苍凉悠远,在禅宗音乐中占有独特的地位。",
      "sentence_pinyin": "Chǐbā de yīnsè cāngliáng yōuyuǎn, zài chánzōng yīnyuè zhōng zhànyǒu dútè de dìwèi.",
      "sentence_fr": "Le shakuhachi a un son désolé et lointain, occupant une place unique dans la musique zen.",
      "sentence_en": "The shakuhachi has a desolate and distant tone, holding a unique place in Zen music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shakuhachi_music",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的智能路灯能够根据人流量自动调节亮度,节约能源。",
      "sentence_pinyin": "Zhège chéngshì de zhìnéng lùdēng nénggòu gēnjù rénliúliàng zìdòng tiáojié liàngdù, jiéyuē néngyuán.",
      "sentence_fr": "Les lampadaires intelligents de cette ville peuvent ajuster automatiquement la luminosité en fonction du flux de personnes, économisant l'énergie.",
      "sentence_en": "The smart street lights in this city can automatically adjust brightness based on pedestrian flow, saving energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_street_lights",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "葫芦烙画在葫芦表面烫出各种图案,既是工艺品又是艺术品。",
      "sentence_pinyin": "Húlu làohuà zài húlu biǎomiàn tàng chū gèzhǒng tú'àn, jì shì gōngyìpǐn yòu shì yìshùpǐn.",
      "sentence_fr": "La pyrographie sur calebasse brûle divers motifs sur la surface de la calebasse, à la fois artisanat et œuvre d'art.",
      "sentence_en": "Gourd pyrography burns various patterns on the gourd surface, both a craft and an art piece.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gourd_pyrography",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区建立了时间银行制度,鼓励居民通过志愿服务换取服务时间。",
      "sentence_pinyin": "Zhège shèqū jiànlìle shíjiān yínháng zhìdù, gǔlì jūmín tōngguò zhìyuàn fúwù huànqǔ fúwù shíjiān.",
      "sentence_fr": "Cette communauté a établi un système de banque de temps, encourageant les résidents à échanger du temps de service par le bénévolat.",
      "sentence_en": "This community has established a time bank system, encouraging residents to exchange service time through volunteer work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "time_banking",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能窗帘可以根据光线强度自动开合,还能通过语音控制。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng chuānglián kěyǐ gēnjù guāngxiàn qiángdù zìdòng kāihé, hái néng tōngguò yǔyīn kòngzhì.",
      "sentence_fr": "Ces rideaux intelligents peuvent s'ouvrir et se fermer automatiquement selon l'intensité lumineuse et être contrôlés par la voix.",
      "sentence_en": "These smart curtains can automatically open and close based on light intensity and can also be voice-controlled.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_curtains",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社会组织为孤寡老人提供了定期上门探访和生活照料服务。",
      "sentence_pinyin": "Zhège shèhuì zǔzhī wèi gūguǎ lǎorén tígōngle dìngqī shàngmén tànfǎng hé shēnghuó zhàoliào fúwù.",
      "sentence_fr": "Cette organisation sociale offre des visites à domicile régulières et des services de soins aux personnes âgées seules.",
      "sentence_en": "This social organization provides regular home visits and daily care services for solitary elderly people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_care_services",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琴书是一种说唱艺术形式,演员边弹边唱,讲述故事情节。",
      "sentence_pinyin": "Qínshū shì yī zhǒng shuōchàng yìshù xíngshì, yǎnyuán biān tán biān chàng, jiǎngshù gùshì qíngjié.",
      "sentence_fr": "Le qinshu est une forme d'art narratif chanté où les artistes jouent et chantent en même temps pour raconter des histoires.",
      "sentence_en": "Qinshu is a form of narrative singing art where performers play and sing simultaneously to tell stories.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qinshu_performance",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个农产品电商平台直接连接农户和消费者,减少了中间环节。",
      "sentence_pinyin": "Zhège nóngchǎnpǐn diànshāng píngtái zhíjiē liánjiē nónghù hé xiāofèizhě, jiǎnshǎole zhōngjiān huánjié.",
      "sentence_fr": "Cette plateforme de commerce électronique de produits agricoles relie directement les agriculteurs et les consommateurs, réduisant les intermédiaires.",
      "sentence_en": "This agricultural e-commerce platform directly connects farmers and consumers, reducing intermediary steps.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_ecommerce",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "鱼皮画利用鱼皮的天然纹理和色彩,创作出独特的民族艺术作品。",
      "sentence_pinyin": "Yúpí huà lìyòng yúpí de tiānrán wénlǐ hé sècǎi, chuàngzuò chū dútè de mínzú yìshù zuòpǐn.",
      "sentence_fr": "La peinture sur peau de poisson utilise les textures et couleurs naturelles de la peau de poisson pour créer des œuvres d'art ethniques uniques.",
      "sentence_en": "Fish skin paintings use the natural textures and colors of fish skin to create unique ethnic art works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fish_skin_art",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能体重秤不仅能测量体重,还能分析体脂率、肌肉量等身体成分。",
      "sentence_pinyin": "Zhège zhìnéng tǐzhòng chèng bùjǐn néng cèliáng tǐzhòng, hái néng fēnxī tǐzhīlǜ, jīròuliàng děng shēntǐ chéngfèn.",
      "sentence_fr": "Cette balance intelligente peut non seulement mesurer le poids, mais aussi analyser la composition corporelle comme le taux de graisse et la masse musculaire.",
      "sentence_en": "This smart scale can not only measure weight but also analyze body composition such as body fat percentage and muscle mass.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_scales",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个儿童福利项目为留守儿童提供了心理辅导和教育支持。",
      "sentence_pinyin": "Zhège értóng fúlì xiàngmù wèi liúshǒu értóng tígōngle xīnlǐ fǔdǎo hé jiàoyù zhīchí.",
      "sentence_fr": "Ce projet de protection de l'enfance fournit un soutien psychologique et éducatif aux enfants laissés pour compte.",
      "sentence_en": "This child welfare project provides psychological counseling and educational support for left-behind children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "child_welfare",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "编磬是一组音高不同的石制打击乐器,音色清脆悦耳。",
      "sentence_pinyin": "Biānqìng shì yī zǔ yīngāo bùtóng de shízhì dǎjí yuèqì, yīnsè qīngcuì yuè'ěr.",
      "sentence_fr": "Le carillon de pierres est un ensemble d'instruments de percussion en pierre de hauteurs différentes, avec un son clair et agréable.",
      "sentence_en": "The stone chime is a set of stone percussion instruments of different pitches, with a clear and pleasant sound.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stone_chimes",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款送药机器人能够在医院内自主导航,准确送达药品到指定病房。",
      "sentence_pinyin": "Zhè kuǎn sòngyào jīqìrén nénggòu zài yīyuàn nèi zìzhǔ dǎoháng, zhǔnquè sòngdá yàopǐn dào zhǐdìng bìngfáng.",
      "sentence_fr": "Ce robot de livraison de médicaments peut naviguer de manière autonome dans l'hôpital et livrer avec précision les médicaments aux chambres désignées.",
      "sentence_en": "This medication delivery robot can autonomously navigate within the hospital and accurately deliver medications to designated wards.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_robots",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玻璃器皿制作需要掌握吹制、拉伸和塑形等多种高温工艺技巧。",
      "sentence_pinyin": "Bōli qìmǐn zhìzuò xūyào zhǎngwò chuīzhì, lāshēn hé sùxíng děng duō zhǒng gāowēn gōngyì jìqiǎo.",
      "sentence_fr": "La fabrication de verrerie nécessite la maîtrise de diverses techniques à haute température comme le soufflage, l'étirage et le façonnage.",
      "sentence_en": "Glassware making requires mastering various high-temperature craft techniques such as blowing, stretching, and molding.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "glassblowing",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保项目通过回收废旧电池,防止了重金属污染土壤和水源。",
      "sentence_pinyin": "Zhège huánbǎo xiàngmù tōngguò huíshōu fèijiù diànchí, fángzhǐle zhòngjīnshǔ wūrǎn tǔrǎng hé shuǐyuán.",
      "sentence_fr": "Ce projet environnemental empêche la pollution des sols et des sources d'eau par les métaux lourds en recyclant les batteries usagées.",
      "sentence_en": "This environmental project prevents heavy metal pollution of soil and water sources by recycling used batteries.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "battery_recycling",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笛子的演奏技巧包括吐音、颤音、滑音等多种表现手法。",
      "sentence_pinyin": "Dízǐ de yǎnzòu jìqiǎo bāokuò tǔyīn, chànyīn, huáyīn děng duō zhǒng biǎoxiàn shǒufǎ.",
      "sentence_fr": "Les techniques de jeu de la flûte incluent diverses méthodes expressives comme le tonguing, le vibrato et le glissando.",
      "sentence_en": "Flute playing techniques include various expressive methods such as tonguing, vibrato, and glissando.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dizi_music",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线学习平台利用人工智能技术为每个学生定制个性化学习路径。",
      "sentence_pinyin": "Zhège zàixiàn xuéxí píngtái lìyòng réngōng zhìnéng jìshù wèi měi gè xuéshēng dìngzhì gèxìnghuà xuéxí lùjìng.",
      "sentence_fr": "Cette plateforme d'apprentissage en ligne utilise la technologie d'intelligence artificielle pour personnaliser le parcours d'apprentissage de chaque étudiant.",
      "sentence_en": "This online learning platform uses artificial intelligence technology to customize personalized learning paths for each student.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "adaptive_learning",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "桦树皮工艺利用桦树皮的柔韧性和防水性,制作出各种实用器具。",
      "sentence_pinyin": "Huàshùpí gōngyì lìyòng huàshùpí de róurènxìng hé fángshuǐxìng, zhìzuò chū gèzhǒng shíyòng qìjù.",
      "sentence_fr": "L'artisanat de l'écorce de bouleau utilise la flexibilité et l'imperméabilité de l'écorce pour fabriquer divers ustensiles pratiques.",
      "sentence_en": "Birch bark craftsmanship uses the flexibility and waterproof properties of birch bark to make various practical utensils.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "birch_bark_crafts",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能养鱼系统可以自动投喂、换水和监测水质参数。",
      "sentence_pinyin": "Zhège zhìnéng yǎngyú xìtǒng kěyǐ zìdòng tóuwèi, huànshuǐ hé jiāncè shuǐzhì cānshù.",
      "sentence_fr": "Ce système d'aquaculture intelligent peut automatiquement nourrir, changer l'eau et surveiller les paramètres de qualité de l'eau.",
      "sentence_en": "This smart fish farming system can automatically feed, change water, and monitor water quality parameters.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_aquaculture",
      "created_at": "2025-11-20T21:05:00.000Z",
      "updated_at": "2025-11-20T21:05:00.000Z"
    }
  ]
}
