{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子霸权实验展示了量子计算机解决特定问题的优势。",
      "sentence_pinyin": "Liàngzǐ bàquán shíyàn zhǎnshì le liàngzǐ jìsuànjī jiějué tèdìng wèntí de yōushì.",
      "sentence_fr": "Les expériences de suprématie quantique démontrent l'avantage des ordinateurs quantiques pour résoudre des problèmes spécifiques.",
      "sentence_en": "Quantum supremacy experiments demonstrate quantum computers' advantage in solving specific problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_supremacy_experiments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "承诺方案允许一方承诺一个值而稍后再揭示它。",
      "sentence_pinyin": "Chéngnuò fāng'àn yǔnxǔ yī fāng chéngnuò yī gè zhí ér shāo hòu zài jiēshì tā.",
      "sentence_fr": "Les schémas d'engagement permettent à une partie de s'engager sur une valeur puis de la révéler plus tard.",
      "sentence_en": "Commitment schemes allow a party to commit to a value and reveal it later.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "commitment_schemes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "单子变换器允许组合多个单子效果形成复合计算上下文。",
      "sentence_pinyin": "Dānzǐ biànhuàn qì yǔnxǔ zǔhé duō gè dānzǐ xiàoguǒ xíngchéng fùhé jìsuàn shàngxiàwén.",
      "sentence_fr": "Les transformateurs de monades permettent de combiner plusieurs effets monadiques pour former des contextes de calcul composés.",
      "sentence_en": "Monad transformers allow combining multiple monad effects to form composite computational contexts.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "monad_transformers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "p-进数论研究基于素数p的局部域及其代数性质。",
      "sentence_pinyin": "P-jìn shùlùn yánjiū jīyú sùshù p de júbù yù jí qí dàishù xìngzhì.",
      "sentence_fr": "La théorie des nombres p-adiques étudie les corps locaux basés sur le nombre premier p et leurs propriétés algébriques.",
      "sentence_en": "P-adic number theory studies local fields based on prime p and their algebraic properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "p_adic_numbers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子比特寿命决定了量子计算机能维持相干性的时间长度。",
      "sentence_pinyin": "Liàngzǐ bǐtè shòumìng juédìng le liàngzǐ jìsuànjī néng wéichí xiānggānxìng de shíjiān chángdù.",
      "sentence_fr": "La durée de vie des qubits détermine combien de temps un ordinateur quantique peut maintenir la cohérence.",
      "sentence_en": "Qubit lifetime determines how long a quantum computer can maintain coherence.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "qubit_coherence_time",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非交互式零知识证明无需证明者和验证者之间的多轮交互。",
      "sentence_pinyin": "Fēi jiāohù shì líng zhīshì zhèngmíng wúxū zhèngmíngzhě hé yànzhèngzhě zhījiān de duō lún jiāohù.",
      "sentence_fr": "Les preuves à connaissance nulle non interactives ne nécessitent pas de multiples tours d'interaction entre le prouveur et le vérificateur.",
      "sentence_en": "Non-interactive zero-knowledge proofs require no multiple rounds of interaction between prover and verifier.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "non_interactive_zkp",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "余单子对偶于单子提供了一种分解计算结构的方式。",
      "sentence_pinyin": "Yú dānzǐ duìǒu yú dānzǐ tígōng le yī zhǒng fēnjiě jìsuàn jiégòu de fāngshì.",
      "sentence_fr": "Les comonades, duales des monades, fournissent une façon de décomposer les structures de calcul.",
      "sentence_en": "Comonads, dual to monads, provide a way to decompose computational structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "comonads",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阿德尔环统一处理有理数的所有完备化同时考虑。",
      "sentence_pinyin": "Ādé'ěr huán tǒngyī chǔlǐ yǒulǐshù de suǒyǒu wánbèihuà tóngshí kǎolǜ.",
      "sentence_fr": "L'anneau des adèles traite uniformément toutes les complétions des nombres rationnels simultanément.",
      "sentence_en": "The adele ring uniformly handles all completions of rational numbers simultaneously.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "adele_rings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "离子阱量子计算机使用电磁场捕获离子作为量子比特。",
      "sentence_pinyin": "Lízǐ jǐng liàngzǐ jìsuànjī shǐyòng diàncí chǎng bǔhuò lízǐ zuòwéi liàngzǐ bǐtè.",
      "sentence_fr": "Les ordinateurs quantiques à ions piégés utilisent des champs électromagnétiques pour capturer des ions comme qubits.",
      "sentence_en": "Trapped ion quantum computers use electromagnetic fields to capture ions as qubits.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "trapped_ion_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可验证计算允许弱客户端验证强服务器计算的正确性。",
      "sentence_pinyin": "Kě yànzhèng jìsuàn yǔnxǔ ruò kèhùduān yànzhèng qiáng fúwùqì jìsuàn de zhèngquèxìng.",
      "sentence_fr": "Le calcul vérifiable permet aux clients faibles de vérifier l'exactitude des calculs effectués par des serveurs puissants.",
      "sentence_en": "Verifiable computation allows weak clients to verify the correctness of powerful server computations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "verifiable_computation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自由单子提供了一种从函子构造单子的通用方法。",
      "sentence_pinyin": "Zìyóu dānzǐ tígōng le yī zhǒng cóng hánzǐ gòuzào dānzǐ de tōngyòng fāngfǎ.",
      "sentence_fr": "Les monades libres fournissent une méthode universelle pour construire des monades à partir de foncteurs.",
      "sentence_en": "Free monads provide a universal method for constructing monads from functors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "free_monads",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "平展上同调推广了经典上同调理论到代数簇上。",
      "sentence_pinyin": "Píngzhǎn shàng tóngdiào tuīguǎng le jīngdiǎn shàng tóngdiào lǐlùn dào dàishù cù shàng.",
      "sentence_fr": "La cohomologie étale généralise la théorie de la cohomologie classique aux variétés algébriques.",
      "sentence_en": "Étale cohomology generalizes classical cohomology theory to algebraic varieties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "etale_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子退相干是量子系统与环境交互导致量子特性丧失的过程。",
      "sentence_pinyin": "Liàngzǐ tuì xiānggān shì liàngzǐ xìtǒng yǔ huánjìng jiāohù dǎozhì liàngzǐ tèxìng sàngshī de guòchéng.",
      "sentence_fr": "La décohérence quantique est le processus par lequel les systèmes quantiques perdent leurs propriétés quantiques en interagissant avec l'environnement.",
      "sentence_en": "Quantum decoherence is the process where quantum systems lose their quantum properties through interaction with the environment.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_decoherence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "秘密共享方案将秘密分割成多个份额分发给不同参与者。",
      "sentence_pinyin": "Mìmì gòngxiǎng fāng'àn jiāng mìmì fēngē chéng duō gè fèn'é fēnfā gěi bùtóng cānyùzhě.",
      "sentence_fr": "Les schémas de partage de secret divisent un secret en plusieurs parts distribuées à différents participants.",
      "sentence_en": "Secret sharing schemes divide a secret into multiple shares distributed to different participants.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "secret_sharing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "透镜组合子提供了嵌套数据结构的组合访问模式。",
      "sentence_pinyin": "Tòujìng zǔhézǐ tígōng le qiàntào shùjù jiégòu de zǔhé fǎngwèn móshì.",
      "sentence_fr": "Les combinateurs de lentilles fournissent des modèles d'accès composables pour les structures de données imbriquées.",
      "sentence_en": "Lens combinators provide composable access patterns for nested data structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lens_combinators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自守形式是满足特定对称性的复分析函数。",
      "sentence_pinyin": "Zìshǒu xíngshì shì mǎnzú tèdìng duìchènxìng de fù fēnxī hánshù.",
      "sentence_fr": "Les formes automorphes sont des fonctions analytiques complexes satisfaisant certaines symétries.",
      "sentence_en": "Automorphic forms are complex analytic functions satisfying certain symmetries.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "automorphic_forms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子态传输通过纠缠和经典通信传送量子信息。",
      "sentence_pinyin": "Liàngzǐ tài chuánshū tōngguò jiūchán hé jīngdiǎn tōngxìn chuánsòng liàngzǐ xìnxī.",
      "sentence_fr": "La téléportation d'état quantique transmet l'information quantique par l'intrication et la communication classique.",
      "sentence_en": "Quantum state teleportation transmits quantum information through entanglement and classical communication.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_teleportation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全多方计算协议保护各方输入的隐私同时计算共同函数。",
      "sentence_pinyin": "Ānquán duō fāng jìsuàn xiéyì bǎohù gè fāng shūrù de yǐnsī tóngshí jìsuàn gòngtóng hánshù.",
      "sentence_fr": "Les protocoles de calcul multipartite sécurisé protègent la confidentialité des entrées des parties tout en calculant une fonction commune.",
      "sentence_en": "Secure multi-party computation protocols protect the privacy of parties' inputs while computing a common function.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "secure_mpc_protocols",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数效应将计算效果从程序逻辑中分离出来以便模块化处理。",
      "sentence_pinyin": "Dàishù xiàoyìng jiāng jìsuàn xiàoguǒ cóng chéngxù luójí zhōng fēnlí chūlái yǐbiàn mókuàihuà chǔlǐ.",
      "sentence_fr": "Les effets algébriques séparent les effets de calcul de la logique du programme pour un traitement modulaire.",
      "sentence_en": "Algebraic effects separate computational effects from program logic for modular handling.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_effects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "伯奇-斯温纳顿-戴尔猜想关联椭圆曲线的秩与L函数的性质。",
      "sentence_pinyin": "Bóqí-Sīwēnnàdùn-Dài'ěr cāixiǎng guānlián tuǒyuán qūxiàn de zhì yǔ L hánshù de xìngzhì.",
      "sentence_fr": "La conjecture de Birch et Swinnerton-Dyer relie le rang des courbes elliptiques aux propriétés des fonctions L.",
      "sentence_en": "The Birch and Swinnerton-Dyer conjecture relates the rank of elliptic curves to properties of L-functions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "birch_swinnerton_dyer",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
