{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "临床心理学应用心理学原理来评估和治疗心理健康问题。",
      "sentence_pinyin": "Línchuáng xīnlǐxué yìngyòng xīnlǐxué yuánlǐ lái pínggū hé zhìliáo xīnlǐ jiànkāng wèntí.",
      "sentence_fr": "La psychologie clinique applique les principes psychologiques pour évaluer et traiter les problèmes de santé mentale.",
      "sentence_en": "Clinical psychology applies psychological principles to assess and treat mental health problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "clinical_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "实时系统必须在严格的时间约束内响应外部事件和输入。",
      "sentence_pinyin": "Shíshí xìtǒng bìxū zài yángé de shíjiān yuēshù nèi xiǎngyìng wàibù shìjiàn hé shūrù.",
      "sentence_fr": "Les systèmes temps réel doivent répondre aux événements et entrées externes dans des contraintes de temps strictes.",
      "sentence_en": "Real-time systems must respond to external events and inputs within strict time constraints.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "real_time_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古生物学通过化石记录研究地球上生命的历史和演化。",
      "sentence_pinyin": "Gǔshēngwùxué tōngguò huàshí jìlù yánjiū dìqiú shàng shēngmìng de lìshǐ hé yǎnhuà.",
      "sentence_fr": "La paléontologie étudie l'histoire et l'évolution de la vie sur Terre à travers les archives fossiles.",
      "sentence_en": "Paleontology studies the history and evolution of life on Earth through the fossil record.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "paleontology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "货币理论研究货币在经济中的作用以及货币政策的传导机制。",
      "sentence_pinyin": "Huòbì lǐlùn yánjiū huòbì zài jīngjì zhōng de zuòyòng yǐjí huòbì zhèngcè de chuándǎo jīzhì.",
      "sentence_fr": "La théorie monétaire étudie le rôle de la monnaie dans l'économie et les mécanismes de transmission de la politique monétaire.",
      "sentence_en": "Monetary theory studies the role of money in the economy and the transmission mechanisms of monetary policy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "monetary_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "发育生物学研究生物体从受精卵到成熟个体的发育过程。",
      "sentence_pinyin": "Fāyù shēngwùxué yánjiū shēngwùtǐ cóng shòujīng luǎn dào chéngshú gètǐ de fāyù guòchéng.",
      "sentence_fr": "La biologie du développement étudie le processus de développement des organismes de l'œuf fécondé à l'individu mature.",
      "sentence_en": "Developmental biology studies the developmental process of organisms from fertilized egg to mature individual.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "developmental_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "调试技术帮助开发人员识别和修复软件中的错误和缺陷。",
      "sentence_pinyin": "Tiáoshì jìshù bāngzhù kāifā rényuán shíbié hé xiūfù ruǎnjiàn zhōng de cuòwù hé quēxiàn.",
      "sentence_fr": "Les techniques de débogage aident les développeurs à identifier et à corriger les erreurs et les défauts dans les logiciels.",
      "sentence_en": "Debugging techniques help developers identify and fix errors and defects in software.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "debugging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传播学研究信息如何通过各种媒体渠道在个人和群体间流动。",
      "sentence_pinyin": "Chuánbòxué yánjiū xìnxī rúhé tōngguò gè zhǒng méitǐ qúdào zài gèrén hé qúntǐ jiān liúdòng.",
      "sentence_fr": "Les sciences de la communication étudient comment l'information circule entre les individus et les groupes à travers différents canaux médiatiques.",
      "sentence_en": "Communication studies research how information flows between individuals and groups through various media channels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "communication_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光学研究光的性质、传播以及光与物质的相互作用。",
      "sentence_pinyin": "Guāngxué yánjiū guāng de xìngzhì, chuánbō yǐjí guāng yǔ wùzhì de xiānghù zuòyòng.",
      "sentence_fr": "L'optique étudie les propriétés de la lumière, sa propagation et ses interactions avec la matière.",
      "sentence_en": "Optics studies the properties of light, its propagation, and interactions with matter.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内存管理是操作系统中分配和回收计算机内存资源的关键功能。",
      "sentence_pinyin": "Nèicún guǎnlǐ shì cāozuò xìtǒng zhōng fēnpèi hé huíshōu jìsuànjī nèicún zīyuán de guānjiàn gōngnéng.",
      "sentence_fr": "La gestion de la mémoire est une fonction clé des systèmes d'exploitation pour allouer et récupérer les ressources mémoire de l'ordinateur.",
      "sentence_en": "Memory management is a key function in operating systems for allocating and recovering computer memory resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "memory_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "军事心理学研究战斗应激、领导力和士兵心理健康问题。",
      "sentence_pinyin": "Jūnshì xīnlǐxué yánjiū zhàndòu yìngjī, lǐngdǎolì hé shìbīng xīnlǐ jiànkāng wèntí.",
      "sentence_fr": "La psychologie militaire étudie le stress de combat, le leadership et les problèmes de santé mentale des soldats.",
      "sentence_en": "Military psychology studies combat stress, leadership, and soldier mental health issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "military_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "矿物学研究矿物的化学成分、晶体结构和物理性质。",
      "sentence_pinyin": "Kuàngwùxué yánjiū kuàngwù de huàxué chéngfèn, jīngtǐ jiégòu hé wùlǐ xìngzhì.",
      "sentence_fr": "La minéralogie étudie la composition chimique, la structure cristalline et les propriétés physiques des minéraux.",
      "sentence_en": "Mineralogy studies the chemical composition, crystal structure, and physical properties of minerals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mineralogy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际关系理论分析国家之间的权力动态和外交互动模式。",
      "sentence_pinyin": "Guójì guānxì lǐlùn fēnxī guójiā zhījiān de quánlì dòngtài hé wàijiāo hùdòng móshì.",
      "sentence_fr": "Les théories des relations internationales analysent les dynamiques de pouvoir entre les États et les modèles d'interaction diplomatique.",
      "sentence_en": "International relations theory analyzes power dynamics between states and patterns of diplomatic interaction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_relations_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "编译器设计涉及词法分析、语法分析和代码生成等多个阶段。",
      "sentence_pinyin": "Biānyìqì shèjì shèjí cífǎ fēnxī, yǔfǎ fēnxī hé dàimǎ shēngchéng děng duō gè jiēduàn.",
      "sentence_fr": "La conception de compilateurs implique plusieurs phases telles que l'analyse lexicale, l'analyse syntaxique et la génération de code.",
      "sentence_en": "Compiler design involves multiple stages such as lexical analysis, syntax analysis, and code generation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "compiler_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生理心理学研究大脑和神经系统如何产生行为和心理过程。",
      "sentence_pinyin": "Shēnglǐ xīnlǐxué yánjiū dànǎo hé shénjīng xìtǒng rúhé chǎnshēng xíngwéi hé xīnlǐ guòchéng.",
      "sentence_fr": "La psychologie physiologique étudie comment le cerveau et le système nerveux produisent le comportement et les processus mentaux.",
      "sentence_en": "Physiological psychology studies how the brain and nervous system produce behavior and mental processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "physiological_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "岩石学研究岩石的成因、分类和地质历史中的演变。",
      "sentence_pinyin": "Yánshíxué yánjiū yánshí de chéngyīn, fēnlèi hé dìzhì lìshǐ zhōng de yǎnbiàn.",
      "sentence_fr": "La pétrologie étudie l'origine, la classification et l'évolution des roches dans l'histoire géologique.",
      "sentence_en": "Petrology studies the origin, classification, and evolution of rocks in geological history.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "petrology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业战略管理涉及制定长期目标和竞争优势的规划过程。",
      "sentence_pinyin": "Qǐyè zhànlüè guǎnlǐ shèjí zhìdìng chángqī mùbiāo hé jìngzhēng yōushì de guīhuà guòchéng.",
      "sentence_fr": "La gestion stratégique d'entreprise implique le processus de planification des objectifs à long terme et des avantages concurrentiels.",
      "sentence_en": "Corporate strategic management involves the planning process of setting long-term goals and competitive advantages.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "strategic_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "操作系统内核管理计算机硬件资源并为应用程序提供服务。",
      "sentence_pinyin": "Cāozuò xìtǒng nèihé guǎnlǐ jìsuànjī yìngjiàn zīyuán bìng wèi yìngyòng chéngxù tígōng fúwù.",
      "sentence_fr": "Le noyau du système d'exploitation gère les ressources matérielles de l'ordinateur et fournit des services aux applications.",
      "sentence_en": "The operating system kernel manages computer hardware resources and provides services to applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "os_kernel",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物物理学应用物理原理和方法来研究生物系统的功能。",
      "sentence_pinyin": "Shēngwù wùlǐxué yìngyòng wùlǐ yuánlǐ hé fāngfǎ lái yánjiū shēngwù xìtǒng de gōngnéng.",
      "sentence_fr": "La biophysique applique les principes et méthodes physiques pour étudier le fonctionnement des systèmes biologiques.",
      "sentence_en": "Biophysics applies physical principles and methods to study the functions of biological systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biophysics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人格心理学研究个体差异以及影响人格发展的遗传和环境因素。",
      "sentence_pinyin": "Réngé xīnlǐxué yánjiū gètǐ chāyì yǐjí yǐngxiǎng réngé fāzhǎn de yíchuán hé huánjìng yīnsù.",
      "sentence_fr": "La psychologie de la personnalité étudie les différences individuelles et les facteurs génétiques et environnementaux influençant le développement de la personnalité.",
      "sentence_en": "Personality psychology studies individual differences and genetic and environmental factors affecting personality development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "personality_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络协议定义了计算机之间通信的规则和数据格式标准。",
      "sentence_pinyin": "Wǎngluò xiéyì dìngyìle jìsuànjī zhījiān tōngxìn de guīzé hé shùjù géshì biāozhǔn.",
      "sentence_fr": "Les protocoles réseau définissent les règles de communication entre ordinateurs et les standards de format de données.",
      "sentence_en": "Network protocols define the rules for communication between computers and data format standards.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_protocols",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
