{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个数字货币交易平台采用了多重加密技术,保障用户的资产安全。",
      "sentence_pinyin": "Zhège shùzì huòbì jiāoyì píngtái cǎiyòngle duōchóng jiāmì jìshù, bǎozhàng yònghù de zīchǎn ānquán.",
      "sentence_fr": "Cette plateforme d'échange de cryptomonnaies adopte plusieurs technologies de cryptage pour garantir la sécurité des actifs des utilisateurs.",
      "sentence_en": "This cryptocurrency trading platform adopts multiple encryption technologies to ensure users' asset security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cryptocurrency_platforms",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "芦笙是苗族、侗族等少数民族的传统乐器,常用于节日庆典和集体舞蹈。",
      "sentence_pinyin": "Lúshēng shì Miáozú, Dòngzú děng shǎoshù mínzú de chuántǒng yuèqì, cháng yòng yú jiérì qìngdiǎn hé jítǐ wǔdǎo.",
      "sentence_fr": "Le lusheng est un instrument traditionnel des minorités Miao, Dong et autres, souvent utilisé lors des fêtes et des danses collectives.",
      "sentence_en": "The lusheng is a traditional instrument of the Miao, Dong, and other ethnic minorities, often used in festival celebrations and group dances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lusheng_music",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的垃圾分类回收率已经达到了百分之六十,成为全国的典范。",
      "sentence_pinyin": "Zhège chéngshì de lājī fēnlèi huíshōulǜ yǐjīng dádàole bǎi fēn zhī liùshí, chéngwéi quánguó de diǎnfàn.",
      "sentence_fr": "Le taux de recyclage des déchets triés de cette ville a déjà atteint 60%, devenant un modèle national.",
      "sentence_en": "This city's sorted waste recycling rate has already reached 60%, becoming a national model.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_recycling",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "竹编工艺利用竹子的韧性和质感,编织出各种实用美观的生活用品。",
      "sentence_pinyin": "Zhúbiān gōngyì lìyòng zhúzi de rènxìng hé zhìgǎn, biānzhī chū gèzhǒng shíyòng měiguān de shēnghuó yòngpǐn.",
      "sentence_fr": "L'artisanat du bambou tressé utilise la flexibilité et la texture du bambou pour tisser divers articles ménagers pratiques et esthétiques.",
      "sentence_en": "Bamboo weaving craftsmanship utilizes the toughness and texture of bamboo to weave various practical and aesthetically pleasing household items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_weaving",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能手表可以监测心电图、血氧饱和度等多项健康指标。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng shǒubiǎo kěyǐ jiāncè xīndiàntú, xuèyǎng bǎohédù děng duō xiàng jiànkāng zhǐbiāo.",
      "sentence_fr": "Cette montre intelligente peut surveiller plusieurs indicateurs de santé tels que l'électrocardiogramme et la saturation en oxygène du sang.",
      "sentence_en": "This smartwatch can monitor multiple health indicators such as electrocardiogram and blood oxygen saturation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smartwatches",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线教育平台为农村教师提供了免费的专业培训课程。",
      "sentence_pinyin": "Zhège zàixiàn jiàoyù píngtái wèi nóngcūn jiàoshī tígōngle miǎnfèi de zhuānyè péixùn kèchéng.",
      "sentence_fr": "Cette plateforme d'éducation en ligne offre des cours de formation professionnelle gratuits aux enseignants ruraux.",
      "sentence_en": "This online education platform provides free professional training courses for rural teachers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "teacher_training",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐班鼓的组合在民间婚丧嫁娶中营造出热烈或庄重的气氛。",
      "sentence_pinyin": "Suǒnà bāngǔ de zǔhé zài mínjiān hūnsāng jiàqǔ zhōng yíngzào chū rèliè huò zhuāngzhòng de qìfēn.",
      "sentence_fr": "La combinaison du suona et du bangu crée une atmosphère festive ou solennelle lors des cérémonies populaires de mariage et de funérailles.",
      "sentence_en": "The combination of suona and bangu creates a lively or solemn atmosphere in folk weddings and funerals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "folk_music_ensembles",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社会救助站为流浪乞讨人员提供临时住所、食物和返乡帮助。",
      "sentence_pinyin": "Zhège shèhuì jiùzhù zhàn wèi liúlàng qǐtǎo rényuán tígōng línshí zhùsuǒ, shíwù hé fǎnxiāng bāngzhù.",
      "sentence_fr": "Cette station d'assistance sociale offre hébergement temporaire, nourriture et aide au retour pour les personnes sans-abri et mendiantes.",
      "sentence_en": "This social assistance station provides temporary shelter, food, and return home assistance for homeless and begging people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "homeless_assistance",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宣纸的制作工艺复杂精细,需要经过一百多道工序才能完成。",
      "sentence_pinyin": "Xuānzhǐ de zhìzuò gōngyì fùzá jīngxì, xūyào jīngguò yī bǎi duō dào gōngxù cái néng wánchéng.",
      "sentence_fr": "Le processus de fabrication du papier Xuan est complexe et délicat, nécessitant plus de cent étapes pour être achevé.",
      "sentence_en": "The production process of Xuan paper is complex and delicate, requiring over one hundred steps to complete.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xuan_paper_making",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能灌溉系统根据土壤湿度和天气预报自动调节灌溉水量。",
      "sentence_pinyin": "Zhège zhìnéng guàngài xìtǒng gēnjù tǔrǎng shīdù hé tiānqì yùbào zìdòng tiáojié guàngài shuǐliàng.",
      "sentence_fr": "Ce système d'irrigation intelligent ajuste automatiquement la quantité d'eau d'irrigation selon l'humidité du sol et les prévisions météorologiques.",
      "sentence_en": "This intelligent irrigation system automatically adjusts the irrigation water amount based on soil moisture and weather forecasts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_irrigation",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "木鱼是佛教法器,也是一种打击乐器,节奏鲜明,音色独特。",
      "sentence_pinyin": "Mùyú shì fójiào fǎqì, yě shì yī zhǒng dǎjí yuèqì, jiézòu xiānmíng, yīnsè dútè.",
      "sentence_fr": "Le muyu est un instrument rituel bouddhiste et aussi un instrument de percussion, avec un rythme distinct et un son unique.",
      "sentence_en": "The wooden fish is a Buddhist ritual instrument and also a percussion instrument, with a distinct rhythm and unique sound.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wooden_fish",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家生物科技公司研发的基因检测技术能够早期发现癌症风险。",
      "sentence_pinyin": "Zhè jiā shēngwù kējì gōngsī yánfā de jīyīn jiǎncè jìshù nénggòu zǎoqī fāxiàn áizhèng fēngxiǎn.",
      "sentence_fr": "La technologie de test génétique développée par cette entreprise de biotechnologie peut détecter précocement les risques de cancer.",
      "sentence_en": "The genetic testing technology developed by this biotechnology company can detect cancer risks at an early stage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "genetic_testing",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市建立了完善的应急物资储备体系,确保灾害发生时能及时救援。",
      "sentence_pinyin": "Zhège chéngshì jiànlìle wánshàn de yìngjí wùzī chǔbèi tǐxì, quèbǎo zāihài fāshēng shí néng jíshí jiùyuán.",
      "sentence_fr": "Cette ville a établi un système complet de réserve de matériel d'urgence pour assurer des secours rapides en cas de catastrophe.",
      "sentence_en": "This city has established a comprehensive emergency supply reserve system to ensure timely rescue when disasters occur.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "emergency_supplies",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "汉服复兴运动让越来越多的年轻人开始了解和欣赏传统服饰文化。",
      "sentence_pinyin": "Hànfú fùxīng yùndòng ràng yuè lái yuè duō de niánqīngrén kāishǐ liǎojiě hé xīnshǎng chuántǒng fúshì wénhuà.",
      "sentence_fr": "Le mouvement de renaissance du hanfu incite de plus en plus de jeunes à comprendre et apprécier la culture vestimentaire traditionnelle.",
      "sentence_en": "The Hanfu revival movement has led more and more young people to understand and appreciate traditional clothing culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hanfu_culture",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海水淡化项目为沿海干旱地区提供了稳定的淡水资源。",
      "sentence_pinyin": "Zhège hǎishuǐ dànhuà xiàngmù wèi yánhǎi gānhàn dìqū tígōngle wěndìng de dànshuǐ zīyuán.",
      "sentence_fr": "Ce projet de dessalement d'eau de mer fournit des ressources en eau douce stables aux zones côtières arides.",
      "sentence_en": "This seawater desalination project provides stable freshwater resources for coastal arid areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "desalination",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡的演奏者需要通过左手按弦和右手运弓来控制音高和音色。",
      "sentence_pinyin": "Èrhú de yǎnzòuzhě xūyào tōngguò zuǒshǒu ànxián hé yòushǒu yùngōng lái kòngzhì yīngāo hé yīnsè.",
      "sentence_fr": "Les interprètes d'erhu doivent contrôler la hauteur et le timbre en appuyant sur les cordes avec la main gauche et en maniant l'archet avec la droite.",
      "sentence_en": "Erhu players need to control pitch and tone by pressing strings with the left hand and manipulating the bow with the right hand.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_music",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个公益组织为贫困学生提供助学金和学习用品,帮助他们完成学业。",
      "sentence_pinyin": "Zhège gōngyì zǔzhī wèi pínkùn xuéshēng tígōng zhùxuéjīn hé xuéxí yòngpǐn, bāngzhù tāmen wánchéng xuéyè.",
      "sentence_fr": "Cette organisation caritative fournit bourses et fournitures scolaires aux étudiants pauvres pour les aider à terminer leurs études.",
      "sentence_en": "This charity organization provides scholarships and school supplies to impoverished students to help them complete their studies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "educational_aid",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "漆线雕是一种独特的工艺美术,用漆线在器物表面盘绕出精美的图案。",
      "sentence_pinyin": "Qīxiàn diāo shì yī zhǒng dútè de gōngyì měishù, yòng qīxiàn zài qìwù biǎomiàn pánrào chū jīngměi de tú'àn.",
      "sentence_fr": "La sculpture en fil de laque est un artisanat unique qui enroule des fils de laque sur la surface des objets pour créer des motifs exquis.",
      "sentence_en": "Lacquer thread sculpture is a unique craft that coils lacquer threads on the surface of objects to create exquisite patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lacquer_thread_sculpture",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款导航应用不仅能规划路线,还能实时显示路况和停车场信息。",
      "sentence_pinyin": "Zhè kuǎn dǎoháng yìngyòng bùjǐn néng guīhuà lùxiàn, hái néng shíshí xiǎnshì lùkuàng hé tíngchēchǎng xìnxī.",
      "sentence_fr": "Cette application de navigation peut non seulement planifier des itinéraires, mais aussi afficher en temps réel les conditions routières et les informations sur les parkings.",
      "sentence_en": "This navigation app can not only plan routes but also display real-time traffic conditions and parking lot information.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "navigation_apps",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环境监测网络实时追踪空气质量、水质和土壤污染情况。",
      "sentence_pinyin": "Zhège huánjìng jiāncè wǎngluò shíshí zhuīzōng kōngqì zhìliàng, shuǐzhì hé tǔrǎng wūrǎn qíngkuàng.",
      "sentence_fr": "Ce réseau de surveillance environnementale suit en temps réel la qualité de l'air, de l'eau et la pollution des sols.",
      "sentence_en": "This environmental monitoring network tracks air quality, water quality, and soil pollution conditions in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_monitoring",
      "created_at": "2025-11-20T20:50:00.000Z",
      "updated_at": "2025-11-20T20:50:00.000Z"
    }
  ]
}
