{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个农产品质量安全检测中心为农民提供免费的检测服务。",
      "sentence_pinyin": "Zhège nóngchǎnpǐn zhìliàng ānquán jiǎncè zhōngxīn wèi nóngmín tígōng miǎnfèi de jiǎncè fúwù.",
      "sentence_fr": "Ce centre de test de sécurité et de qualité des produits agricoles fournit des services de test gratuits aux agriculteurs.",
      "sentence_en": "This agricultural product quality and safety testing center provides free testing services to farmers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_testing",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在越剧表演中以柔美婉转的唱腔征服了观众。",
      "sentence_pinyin": "Tā zài yuèjù biǎoyǎn zhōng yǐ róuměi wǎnzhuǎn de chàngqiāng zhēngfúle guānzhòng.",
      "sentence_fr": "Dans sa performance d'opéra Yue, elle a conquis le public avec une voix douce et mélodieuse.",
      "sentence_en": "In her Yue Opera performance, she conquered the audience with a soft and melodious voice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yue_opera",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能窗帘系统可以根据光线强度自动调节开合程度。",
      "sentence_pinyin": "Zhège zhìnéng chuānglián xìtǒng kěyǐ gēnjù guāngxiàn qiángdù zìdòng tiáojié kāihé chéngdù.",
      "sentence_fr": "Ce système de rideaux intelligents peut automatiquement ajuster le degré d'ouverture et de fermeture en fonction de l'intensité lumineuse.",
      "sentence_en": "This smart curtain system can automatically adjust the opening and closing degree based on light intensity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_curtains",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在传记文学创作中深入挖掘了人物的精神世界和人生轨迹。",
      "sentence_pinyin": "Tā zài zhuànjì wénxué chuàngzuò zhōng shēnrù wājuéle rénwù de jīngshén shìjiè hé rénshēng guǐjì.",
      "sentence_fr": "Dans la création de littérature biographique, il a profondément exploré le monde spirituel et la trajectoire de vie des personnages.",
      "sentence_en": "In biographical literature creation, he deeply explored the spiritual world and life trajectory of characters.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biographical_literature",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个特殊教育学校为残障儿童提供了个性化的康复训练课程。",
      "sentence_pinyin": "Zhège tèshū jiàoyù xuéxiào wèi cánzhàng értóng tígōngle gèxìnghuà de kāngfù xùnliàn kèchéng.",
      "sentence_fr": "Cette école d'éducation spéciale fournit des cours de formation en réadaptation personnalisés pour les enfants handicapés.",
      "sentence_en": "This special education school provides personalized rehabilitation training courses for disabled children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "special_education",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的包装设计既保护商品又传达了品牌形象和文化内涵。",
      "sentence_pinyin": "Tā de bāozhuāng shèjì jì bǎohù shāngpǐn yòu chuándále pǐnpái xíngxiàng hé wénhuà nèihán.",
      "sentence_fr": "Sa conception d'emballage protège non seulement les produits mais transmet également l'image de marque et la connotation culturelle.",
      "sentence_en": "Her packaging design not only protects products but also conveys brand image and cultural connotation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "packaging_design",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海岸带保护工程修复了红树林和滨海湿地生态系统。",
      "sentence_pinyin": "Zhège hǎi'àndài bǎohù gōngchéng xiūfùle hóngshùlín hé bīnhǎi shīdì shēngtài xìtǒng.",
      "sentence_fr": "Ce projet de protection de la zone côtière a restauré les écosystèmes de mangroves et de zones humides côtières.",
      "sentence_en": "This coastal zone protection project restored mangrove and coastal wetland ecosystems.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "coastal_protection",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在蹼泳比赛中发挥了出色的水下推进和换气技术。",
      "sentence_pinyin": "Tā zài púyǒng bǐsài zhōng fāhuīle chūsè de shuǐxià tuījìn hé huànqì jìshù.",
      "sentence_fr": "Il a démontré d'excellentes techniques de propulsion sous-marine et de respiration lors de la compétition de nage avec palmes.",
      "sentence_en": "He demonstrated excellent underwater propulsion and breathing techniques in the finswimming competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "finswimming",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区网格化管理系统提高了基层治理的精细化水平。",
      "sentence_pinyin": "Zhège shèqū wǎnggéhuà guǎnlǐ xìtǒng tígāole jīcéng zhìlǐ de jīngxìhuà shuǐpíng.",
      "sentence_fr": "Ce système de gestion communautaire en grille a amélioré le niveau de raffinement de la gouvernance de base.",
      "sentence_en": "This grid-based community management system improved the refinement level of grassroots governance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grid_management",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在麦秆画创作中用麦秆拼贴出了精美的图案和画面。",
      "sentence_pinyin": "Tā zài màigǎn huà chuàngzuò zhōng yòng màigǎn pīntiē chūle jīngměi de tú'àn hé huàmiàn.",
      "sentence_fr": "Dans la création d'art de paille de blé, elle a créé de magnifiques motifs et images en collant de la paille de blé.",
      "sentence_en": "In wheat straw art creation, she created exquisite patterns and images by collaging wheat straw.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wheat_straw_art",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能安防系统整合了监控摄像、入侵报警和门禁控制功能。",
      "sentence_pinyin": "Zhège zhìnéng ānfáng xìtǒng zhěnghéle jiānkòng shèxiàng, rùqīn bàojǐng hé ménjìn kòngzhì gōngnéng.",
      "sentence_fr": "Ce système de sécurité intelligent intègre les fonctions de surveillance vidéo, d'alarme anti-intrusion et de contrôle d'accès.",
      "sentence_en": "This smart security system integrates video surveillance, intrusion alarm, and access control functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "security_systems",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在排箫演奏中展现了清越明亮的音色和流畅的旋律线条。",
      "sentence_pinyin": "Tā zài páixiāo yǎnzòu zhōng zhǎnxiànle qīngyuè míngliàng de yīnsè hé liúchàng de xuánlǜ xiàntiáo.",
      "sentence_fr": "Il a démontré un timbre clair et lumineux et des lignes mélodiques fluides dans son jeu de flûte de Pan.",
      "sentence_en": "He demonstrated a clear and bright timbre and fluid melodic lines in his panpipe performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "panpipe_music",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个污染土壤修复项目采用植物修复和化学处理相结合的方法。",
      "sentence_pinyin": "Zhège wūrǎn tǔrǎng xiūfù xiàngmù cǎiyòng zhíwù xiūfù hé huàxué chǔlǐ xiāng jiéhé de fāngfǎ.",
      "sentence_fr": "Ce projet de restauration de sol contaminé adopte une méthode combinant phytoremédiation et traitement chimique.",
      "sentence_en": "This contaminated soil remediation project adopts a method combining phytoremediation and chemical treatment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "soil_remediation",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的声音艺术作品用声音材料构建了独特的听觉空间。",
      "sentence_pinyin": "Tā de shēngyīn yìshù zuòpǐn yòng shēngyīn cáiliào gòujiànle dútè de tīngjué kōngjiān.",
      "sentence_fr": "Ses œuvres d'art sonore construisent un espace auditif unique avec des matériaux sonores.",
      "sentence_en": "Her sound art works construct a unique auditory space with sound materials.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sound_art",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个森林防火监测系统通过红外探测及时发现火情。",
      "sentence_pinyin": "Zhège sēnlín fánghuǒ jiāncè xìtǒng tōngguò hóngwài tàncè jíshí fāxiàn huǒqíng.",
      "sentence_fr": "Ce système de surveillance de prévention des incendies de forêt détecte rapidement les incendies grâce à la détection infrarouge.",
      "sentence_en": "This forest fire prevention monitoring system detects fires promptly through infrared detection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "forest_fire_monitoring",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在影视配乐创作中运用了交响乐和民族音乐元素。",
      "sentence_pinyin": "Tā zài yǐngshì pèiyuè chuàngzuò zhōng yùnyòngle jiāoxiǎngyuè hé mínzú yīnyuè yuánsù.",
      "sentence_fr": "Dans la composition de musique de film, il a utilisé des éléments de musique symphonique et ethnique.",
      "sentence_en": "In film score composition, he used symphonic and ethnic music elements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "film_scoring",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个日间照料中心为失能老人提供专业的护理和康复服务。",
      "sentence_pinyin": "Zhège rìjiān zhàoliào zhōngxīn wèi shīnéng lǎorén tígōng zhuānyè de hùlǐ hé kāngfù fúwù.",
      "sentence_fr": "Ce centre de soins de jour fournit des services de soins professionnels et de réadaptation pour les personnes âgées dépendantes.",
      "sentence_en": "This day care center provides professional nursing and rehabilitation services for dependent elderly people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "day_care_centers",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在水上芭蕾表演中展现了优美的动作和完美的同步配合。",
      "sentence_pinyin": "Tā zài shuǐshàng bālěi biǎoyǎn zhōng zhǎnxiànle yōuměi de dòngzuò hé wánměi de tóngbù pèihé.",
      "sentence_fr": "Dans sa performance de ballet aquatique, elle a démontré des mouvements gracieux et une synchronisation parfaite.",
      "sentence_en": "In her synchronized swimming performance, she demonstrated graceful movements and perfect synchronization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "synchronized_swimming",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技园区孵化器为创新团队提供场地和资金支持。",
      "sentence_pinyin": "Zhège kējì yuánqū fūhuàqì wèi chuàngxīn tuánduì tígōng chǎngdì hé zījīn zhīchí.",
      "sentence_fr": "Cet incubateur de parc technologique fournit un espace et un soutien financier aux équipes innovantes.",
      "sentence_en": "This technology park incubator provides space and funding support for innovative teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tech_incubators",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在紫砂壶制作中追求造型优美、泥料精良和工艺考究。",
      "sentence_pinyin": "Tā zài zǐshā hú zhìzuò zhōng zhuīqiú zàoxíng yōuměi, níliào jīngliáng hé gōngyì kǎojiū.",
      "sentence_fr": "Dans la fabrication de théières Yixing, il recherche des formes élégantes, des matériaux d'argile de qualité et un artisanat raffiné.",
      "sentence_en": "In Yixing teapot making, he pursues elegant shapes, fine clay materials, and refined craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yixing_teapots",
      "created_at": "2025-11-20T19:40:00.000Z",
      "updated_at": "2025-11-20T19:40:00.000Z"
    }
  ]
}
