{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个健身教练制定了一套科学合理的训练计划。",
      "sentence_pinyin": "Zhège jiànshēn jiàoliàn zhìdìngle yī tào kēxué hélǐ de xùnliàn jìhuà.",
      "sentence_fr": "Ce coach de fitness a élaboré un programme d'entraînement scientifique et raisonnable.",
      "sentence_en": "This fitness coach developed a scientific and reasonable training plan.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在大学期间获得了多项奖学金和荣誉称号。",
      "sentence_pinyin": "Tā zài dàxué qījiān huòdéle duō xiàng jiǎngxuéjīn hé róngyù chēnghào.",
      "sentence_fr": "Elle a reçu plusieurs bourses et titres honorifiques pendant ses études universitaires.",
      "sentence_en": "She received multiple scholarships and honorary titles during her university years.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个旅游景点以其壮丽的自然风光和悠久的历史文化而闻名。",
      "sentence_pinyin": "Zhège lǚyóu jǐngdiǎn yǐ qí zhuànglì de zìrán fēngguāng hé yōujiǔ de lìshǐ wénhuà ér wénmíng.",
      "sentence_fr": "Cette attraction touristique est célèbre pour ses paysages naturels magnifiques et sa culture historique ancienne.",
      "sentence_en": "This tourist attraction is famous for its magnificent natural scenery and long historical culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tourism",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的创业故事激励了许多年轻人勇敢追求自己的梦想。",
      "sentence_pinyin": "Tā de chuàngyè gùshi jīlìle xǔduō niánqīngrén yǒnggǎn zhuīqiú zìjǐ de mèngxiǎng.",
      "sentence_fr": "Son histoire entrepreneuriale a inspiré de nombreux jeunes à poursuivre courageusement leurs rêves.",
      "sentence_en": "His entrepreneurial story inspired many young people to bravely pursue their dreams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "inspiration",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家超市的商品价格实惠，而且经常有促销活动。",
      "sentence_pinyin": "Zhè jiā chāoshì de shāngpǐn jiàgé shíhuì, érqiě jīngcháng yǒu cùxiāo huódòng.",
      "sentence_fr": "Les prix des produits de ce supermarché sont abordables et il y a souvent des promotions.",
      "sentence_en": "The prices of goods in this supermarket are affordable and there are often promotional activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shopping",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医院引进了先进的医疗设备，提高了诊断和治疗的准确性。",
      "sentence_pinyin": "Yīyuàn yǐnjìnle xiānjìn de yīliáo shèbèi, tígāole zhěnduàn hé zhìliáo de zhǔnquèxìng.",
      "sentence_fr": "L'hôpital a introduit des équipements médicaux avancés, améliorant la précision du diagnostic et du traitement.",
      "sentence_en": "The hospital introduced advanced medical equipment, improving the accuracy of diagnosis and treatment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "healthcare",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在面对压力时总是能保持冷静，理性地分析和解决问题。",
      "sentence_pinyin": "Tā zài miànduì yālì shí zǒngshì néng bǎochí lěngjìng, lǐxìng de fēnxī hé jiějué wèntí.",
      "sentence_fr": "Face à la pression, elle reste toujours calme et analyse et résout les problèmes de manière rationnelle.",
      "sentence_en": "When facing pressure, she always stays calm and analyzes and solves problems rationally.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "personality",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部话剧的表演精彩纷呈，赢得了观众的热烈掌声。",
      "sentence_pinyin": "Zhè bù huàjù de biǎoyǎn jīngcǎi fēnchéng, yíngdéle guānzhòng de rèliè zhǎngshēng.",
      "sentence_fr": "La performance de cette pièce de théâtre était brillante et a remporté des applaudissements enthousiastes du public.",
      "sentence_en": "The performance of this play was brilliant and won enthusiastic applause from the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个软件的界面设计简洁美观，操作起来非常流畅。",
      "sentence_pinyin": "Zhège ruǎnjiàn de jièmiàn shèjì jiǎnjié měiguān, cāozuò qǐlái fēicháng liúchàng.",
      "sentence_fr": "L'interface de ce logiciel est simple et élégante, et son utilisation est très fluide.",
      "sentence_en": "The interface design of this software is simple and elegant, and it operates very smoothly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们决定周末去郊外爬山，呼吸新鲜空气，放松身心。",
      "sentence_pinyin": "Tāmen juédìng zhōumò qù jiāowài páshān, hūxī xīnxiān kōngqì, fàngsōng shēnxīn.",
      "sentence_fr": "Ils ont décidé d'aller faire de la randonnée en banlieue ce week-end pour respirer l'air frais et se détendre.",
      "sentence_en": "They decided to go hiking in the suburbs this weekend to breathe fresh air and relax.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "recreation",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个慈善组织长期致力于帮助贫困地区的儿童改善生活条件。",
      "sentence_pinyin": "Zhège císhàn zǔzhī chángqī zhìlì yú bāngzhù pínkùn dìqū de értóng gǎishàn shēnghuó tiáojiàn.",
      "sentence_fr": "Cette organisation caritative s'engage à long terme à aider les enfants des régions pauvres à améliorer leurs conditions de vie.",
      "sentence_en": "This charity organization is long-term committed to helping children in poor areas improve their living conditions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这本书详细介绍了中国传统文化的起源和发展历程。",
      "sentence_pinyin": "Zhè běn shū xiángxì jièshàole Zhōngguó chuántǒng wénhuà de qǐyuán hé fāzhǎn lìchéng.",
      "sentence_fr": "Ce livre présente en détail les origines et le développement de la culture traditionnelle chinoise.",
      "sentence_en": "This book details the origins and development of traditional Chinese culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过社交媒体分享自己的旅行经历和摄影作品。",
      "sentence_pinyin": "Tā tōngguò shèjiāo méitǐ fēnxiǎng zìjǐ de lǚxíng jīnglì hé shèyǐng zuòpǐn.",
      "sentence_fr": "Elle partage ses expériences de voyage et ses œuvres photographiques sur les réseaux sociaux.",
      "sentence_en": "She shares her travel experiences and photography works through social media.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_media",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个研究团队在新能源技术领域取得了重大突破。",
      "sentence_pinyin": "Zhège yánjiū tuánduì zài xīn néngyuán jìshù lǐngyù qǔdéle zhòngdà tūpò.",
      "sentence_fr": "Cette équipe de recherche a réalisé une percée majeure dans le domaine des technologies des énergies nouvelles.",
      "sentence_en": "This research team made a major breakthrough in the field of new energy technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "父母的言传身教对孩子的成长有着深远的影响。",
      "sentence_pinyin": "Fùmǔ de yánchuán shēnjiào duì háizi de chéngzhǎng yǒuzhe shēnyuǎn de yǐngxiǎng.",
      "sentence_fr": "L'exemple et les enseignements des parents ont une influence profonde sur la croissance des enfants.",
      "sentence_en": "Parents' teachings and examples have a profound impact on children's growth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这次展览汇集了来自世界各地艺术家的优秀作品。",
      "sentence_pinyin": "Zhè cì zhǎnlǎn huìjíle láizì shìjiè gèdì yìshùjiā de yōuxiù zuòpǐn.",
      "sentence_fr": "Cette exposition rassemble d'excellentes œuvres d'artistes du monde entier.",
      "sentence_en": "This exhibition brings together excellent works from artists around the world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在公司担任技术总监，负责产品的研发和创新工作。",
      "sentence_pinyin": "Tā zài gōngsī dānrèn jìshù zǒngjiān, fùzé chǎnpǐn de yánfā hé chuàngxīn gōngzuò.",
      "sentence_fr": "Il est directeur technique dans l'entreprise, responsable du développement et de l'innovation des produits.",
      "sentence_en": "He serves as technical director in the company, responsible for product development and innovation work.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的夜市非常热闹，有各种各样的小吃和商品。",
      "sentence_pinyin": "Zhège chéngshì de yèshì fēicháng rènao, yǒu gèzhǒng gèyàng de xiǎochī hé shāngpǐn.",
      "sentence_fr": "Le marché nocturne de cette ville est très animé, avec toutes sortes de collations et de produits.",
      "sentence_en": "The night market of this city is very lively, with all kinds of snacks and goods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "local_culture",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在音乐学院学习声乐，梦想成为一名专业的歌唱家。",
      "sentence_pinyin": "Tā zài yīnyuè xuéyuàn xuéxí shēngyuè, mèngxiǎng chéngwéi yī míng zhuānyè de gēchàngjiā.",
      "sentence_fr": "Elle étudie le chant au conservatoire et rêve de devenir une chanteuse professionnelle.",
      "sentence_en": "She studies vocal music at the conservatory and dreams of becoming a professional singer.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个项目的成功实施为公司带来了可观的经济效益。",
      "sentence_pinyin": "Zhège xiàngmù de chénggōng shíshī wèi gōngsī dàiláile kěguān de jīngjì xiàoyì.",
      "sentence_fr": "La mise en œuvre réussie de ce projet a apporté des bénéfices économiques considérables à l'entreprise.",
      "sentence_en": "The successful implementation of this project brought considerable economic benefits to the company.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:40:00.000Z",
      "updated_at": "2025-11-20T16:40:00.000Z"
    }
  ]
}
