{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "情绪智力研究表明理解和管理情绪对于领导力和人际关系至关重要。",
      "sentence_pinyin": "Qíngxù zhìlì yánjiū biǎomíng lǐjiě hé guǎnlǐ qíngxù duìyú lǐngdǎo lì hé rénjì guānxì zhìguān zhòngyào.",
      "sentence_fr": "La recherche sur l'intelligence émotionnelle montre que comprendre et gérer les émotions est crucial pour le leadership et les relations interpersonnelles.",
      "sentence_en": "Emotional intelligence research shows that understanding and managing emotions is crucial for leadership and interpersonal relationships.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emotional_intelligence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柔性电子技术使可弯曲和可穿戴的电子设备成为可能。",
      "sentence_pinyin": "Róuxìng diànzǐ jìshù shǐ kě wānqū hé kě chuāndài de diànzǐ shèbèi chéngwéi kěnéng.",
      "sentence_fr": "La technologie électronique flexible rend possibles les appareils électroniques pliables et portables.",
      "sentence_en": "Flexible electronics technology makes bendable and wearable electronic devices possible.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "flexible_electronics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化适应理论描述了移民如何在保持原有文化与融入新文化之间寻求平衡。",
      "sentence_pinyin": "Wénhuà shìyìng lǐlùn miáoshù le yímín rúhé zài bǎochí yuányǒu wénhuà yǔ róngrù xīn wénhuà zhījiān xúnqiú pínghéng.",
      "sentence_fr": "La théorie de l'acculturation décrit comment les immigrants cherchent un équilibre entre le maintien de leur culture d'origine et l'intégration dans une nouvelle culture.",
      "sentence_en": "Acculturation theory describes how immigrants seek balance between maintaining their original culture and integrating into a new culture.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "acculturation_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋白质折叠预测是理解蛋白质功能和开发新药的关键挑战。",
      "sentence_pinyin": "Dànbáizhì zhédié yùcè shì lǐjiě dànbáizhì gōngnéng hé kāifā xīn yào de guānjiàn tiǎozhàn.",
      "sentence_fr": "La prédiction du repliement des protéines est un défi clé pour comprendre la fonction des protéines et développer de nouveaux médicaments.",
      "sentence_en": "Protein folding prediction is a key challenge for understanding protein function and developing new drugs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "protein_folding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "隐性知识管理研究如何捕获和传递难以明确表达的专业经验和技能。",
      "sentence_pinyin": "Yǐnxìng zhīshi guǎnlǐ yánjiū rúhé bǔhuò hé chuándì nányǐ míngquè biǎodá de zhuānyè jīngyàn hé jìnéng.",
      "sentence_fr": "La gestion des connaissances tacites étudie comment capturer et transférer l'expérience et les compétences professionnelles difficiles à exprimer explicitement.",
      "sentence_en": "Tacit knowledge management studies how to capture and transfer professional experience and skills that are difficult to express explicitly.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tacit_knowledge",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超级电容器在需要快速充放电的应用中补充或替代传统电池。",
      "sentence_pinyin": "Chāojí diànróngqì zài xūyào kuàisù chōng fàngdiàn de yìngyòng zhōng bǔchōng huò tìdài chuántǒng diànchí.",
      "sentence_fr": "Les supercondensateurs complètent ou remplacent les batteries traditionnelles dans les applications nécessitant une charge et décharge rapides.",
      "sentence_en": "Supercapacitors supplement or replace traditional batteries in applications requiring rapid charging and discharging.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supercapacitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "性别研究从多学科视角分析社会中的性别角色、权力和不平等。",
      "sentence_pinyin": "Xìngbié yánjiū cóng duō xuékē shìjiǎo fēnxī shèhuì zhōng de xìngbié juésè, quánlì hé bù píngděng.",
      "sentence_fr": "Les études de genre analysent les rôles de genre, le pouvoir et les inégalités dans la société d'un point de vue multidisciplinaire.",
      "sentence_en": "Gender studies analyze gender roles, power, and inequality in society from multidisciplinary perspectives.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gender_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市采矿从电子废弃物中回收贵重金属和稀有材料。",
      "sentence_pinyin": "Chéngshì cǎikuàng cóng diànzǐ fèiqì wù zhōng huíshōu guìzhòng jīnshǔ hé xīyǒu cáiliào.",
      "sentence_fr": "L'exploitation minière urbaine récupère les métaux précieux et les matériaux rares des déchets électroniques.",
      "sentence_en": "Urban mining recovers precious metals and rare materials from electronic waste.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_mining",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言类型学比较世界各种语言的结构特征以发现语言共性和差异。",
      "sentence_pinyin": "Yǔyán lèixíng xué bǐjiào shìjiè gè zhǒng yǔyán de jiégòu tèzhēng yǐ fāxiàn yǔyán gòngxìng hé chāyì.",
      "sentence_fr": "La typologie linguistique compare les caractéristiques structurelles des langues du monde pour découvrir les universaux et les différences linguistiques.",
      "sentence_en": "Linguistic typology compares structural features of world languages to discover linguistic universals and differences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "linguistic_typology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "敏捷组织设计使企业能够快速响应市场变化和客户需求。",
      "sentence_pinyin": "Mǐnjié zǔzhī shèjì shǐ qǐyè nénggòu kuàisù xiǎngyìng shìchǎng biànhuà hé kèhù xūqiú.",
      "sentence_fr": "La conception d'organisation agile permet aux entreprises de répondre rapidement aux changements du marché et aux besoins des clients.",
      "sentence_en": "Agile organization design enables businesses to quickly respond to market changes and customer needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agile_organization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合成孔径雷达卫星可以在任何天气条件下获取高分辨率地表图像。",
      "sentence_pinyin": "Héchéng kǒngjìng léidá wèixīng kěyǐ zài rènhé tiānqì tiáojiàn xià huòqǔ gāo fēnbiànlǜ dìbiǎo túxiàng.",
      "sentence_fr": "Les satellites radar à synthèse d'ouverture peuvent acquérir des images de surface à haute résolution dans toutes les conditions météorologiques.",
      "sentence_en": "Synthetic aperture radar satellites can acquire high-resolution surface images in any weather conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sar_satellites",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "消费者行为研究分析购买决策背后的心理和社会因素。",
      "sentence_pinyin": "Xiāofèi zhě xíngwéi yánjiū fēnxī gòumǎi juécè bèihòu de xīnlǐ hé shèhuì yīnsù.",
      "sentence_fr": "La recherche sur le comportement des consommateurs analyse les facteurs psychologiques et sociaux derrière les décisions d'achat.",
      "sentence_en": "Consumer behavior research analyzes psychological and social factors behind purchasing decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "consumer_behavior",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "益生菌研究正在探索肠道微生物如何影响免疫系统和心理健康。",
      "sentence_pinyin": "Yìshēngjùn yánjiū zhèngzài tànsuǒ chángdào wéishēngwù rúhé yǐngxiǎng miǎnyì xìtǒng hé xīnlǐ jiànkāng.",
      "sentence_fr": "La recherche sur les probiotiques explore comment les microbes intestinaux affectent le système immunitaire et la santé mentale.",
      "sentence_en": "Probiotics research is exploring how gut microbes affect the immune system and mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "probiotics_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "空间数据分析使城市规划者能够做出基于地理位置的智能决策。",
      "sentence_pinyin": "Kōngjiān shùjù fēnxī shǐ chéngshì guīhuà zhě nénggòu zuòchū jīyú dìlǐ wèizhì de zhìnéng juécè.",
      "sentence_fr": "L'analyse des données spatiales permet aux urbanistes de prendre des décisions intelligentes basées sur la localisation géographique.",
      "sentence_en": "Spatial data analysis enables urban planners to make intelligent decisions based on geographic location.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "spatial_data_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后现代主义理论质疑客观真理和宏大叙事的存在。",
      "sentence_pinyin": "Hòu xiàndài zhǔyì lǐlùn zhìyí kèguān zhēnlǐ hé hóngdà xùshì de cúnzài.",
      "sentence_fr": "La théorie postmoderniste remet en question l'existence de la vérité objective et des grands récits.",
      "sentence_en": "Postmodernist theory questions the existence of objective truth and grand narratives.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "postmodernism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物钟紊乱与代谢疾病、心血管问题和精神健康问题存在关联。",
      "sentence_pinyin": "Shēngwù zhōng wěnluàn yǔ dàixiè jíbìng, xīnxuèguǎn wèntí hé jīngshén jiànkāng wèntí cúnzài guānlián.",
      "sentence_fr": "Les perturbations de l'horloge biologique sont associées aux maladies métaboliques, aux problèmes cardiovasculaires et aux problèmes de santé mentale.",
      "sentence_en": "Circadian clock disruption is associated with metabolic diseases, cardiovascular problems, and mental health issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "circadian_disruption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "去物质化趋势使数字产品和服务逐渐取代物理商品消费。",
      "sentence_pinyin": "Qù wùzhì huà qūshì shǐ shùzì chǎnpǐn hé fúwù zhújiàn qǔdài wùlǐ shāngpǐn xiāofèi.",
      "sentence_fr": "La tendance à la dématérialisation fait que les produits et services numériques remplacent progressivement la consommation de biens physiques.",
      "sentence_en": "Dematerialization trends are gradually replacing physical goods consumption with digital products and services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dematerialization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光子集成电路将多个光学组件集成在单个芯片上以处理光信号。",
      "sentence_pinyin": "Guāngzǐ jíchéng diànlù jiāng duō gè guāngxué zǔjiàn jíchéng zài dāngè xīnpiàn shàng yǐ chǔlǐ guāng xìnhào.",
      "sentence_fr": "Les circuits intégrés photoniques intègrent plusieurs composants optiques sur une seule puce pour traiter les signaux lumineux.",
      "sentence_en": "Photonic integrated circuits integrate multiple optical components on a single chip to process light signals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "photonic_circuits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字包容倡议旨在确保所有社会群体都能平等获取信息技术。",
      "sentence_pinyin": "Shùzì bāoróng chàngyì zhǐzài quèbǎo suǒyǒu shèhuì qúntǐ dōu néng píngděng huòqǔ xìnxī jìshù.",
      "sentence_fr": "Les initiatives d'inclusion numérique visent à garantir que tous les groupes sociaux ont un accès égal aux technologies de l'information.",
      "sentence_en": "Digital inclusion initiatives aim to ensure all social groups have equal access to information technology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_inclusion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "免疫组库测序技术可以全面分析个体的免疫系统多样性和状态。",
      "sentence_pinyin": "Miǎnyì zǔkù cèxù jìshù kěyǐ quánmiàn fēnxī gètǐ de miǎnyì xìtǒng duōyàng xìng hé zhuàngtài.",
      "sentence_fr": "La technologie de séquençage du répertoire immunitaire peut analyser de manière exhaustive la diversité et l'état du système immunitaire d'un individu.",
      "sentence_en": "Immune repertoire sequencing technology can comprehensively analyze an individual's immune system diversity and status.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immune_repertoire",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
