{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能手表可以监测心率、血氧和睡眠质量,全面守护健康。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng shǒubiǎo kěyǐ jiāncè xīnlǜ, xuèyǎng hé shuìmián zhìliàng, quánmiàn shǒuhù jiànkāng.",
      "sentence_fr": "Cette montre intelligente peut surveiller le rythme cardiaque, l'oxygène sanguin et la qualité du sommeil pour une protection complète de la santé.",
      "sentence_en": "This smart watch can monitor heart rate, blood oxygen, and sleep quality for comprehensive health protection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_watches",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "白族的三道茶是待客的最高礼节,寓意一苦二甜三回味的人生哲理。",
      "sentence_pinyin": "Báizú de sāndàochá shì dàikè de zuìgāo lǐjié, yùyì yī kǔ èr tián sān huíwèi de rénshēng zhélǐ.",
      "sentence_fr": "Le thé aux trois saveurs des Bai est leur plus haute courtoisie envers les invités, symbolisant la philosophie de vie: amer, sucré puis rétrospectif.",
      "sentence_en": "The Bai people's Three-Course Tea is their highest hospitality etiquette, symbolizing life's philosophy of bitter, sweet, and reflective.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bai_three_course_tea",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区为新入住居民举办欢迎会,帮助他们快速融入社区生活。",
      "sentence_pinyin": "Shèqū wèi xīn rùzhù jūmín jǔbàn huānyínghuì, bāngzhù tāmen kuàisù róngrù shèqū shēnghuó.",
      "sentence_fr": "La communauté organise des réceptions de bienvenue pour les nouveaux résidents afin de les aider à s'intégrer rapidement.",
      "sentence_en": "The community holds welcome parties for new residents to help them quickly integrate into community life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_welcome_events",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "折纸是一种培养耐心和创造力的手工艺术,深受孩子们喜爱。",
      "sentence_pinyin": "Zhézhǐ shì yī zhǒng péiyǎng nàixīn hé chuàngzàolì de shǒugōng yìshù, shēn shòu háizimen xǐ'ài.",
      "sentence_fr": "L'origami est un art manuel qui cultive la patience et la créativité, très apprécié des enfants.",
      "sentence_en": "Origami is a handicraft art that cultivates patience and creativity, beloved by children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "origami_craft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能烟雾报警器能够检测烟雾浓度并自动发送警报到手机。",
      "sentence_pinyin": "Zhège zhìnéng yānwù bàojǐngqì nénggòu jiǎncè yānwù nóngdù bìng zìdòng fāsòng jǐngbào dào shǒujī.",
      "sentence_fr": "Ce détecteur de fumée intelligent peut détecter la concentration de fumée et envoyer automatiquement des alertes sur le téléphone.",
      "sentence_en": "This smart smoke alarm can detect smoke concentration and automatically send alerts to phones.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_smoke_alarms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "傣族的泼水节是庆祝新年的盛大节日,人们互相泼水表示祝福。",
      "sentence_pinyin": "Dǎizú de pōshuǐjié shì qìngzhù xīnnián de shèngdà jiérì, rénmen hùxiāng pōshuǐ biǎoshì zhùfú.",
      "sentence_fr": "Le festival de l'eau des Dai est une grande fête du Nouvel An où les gens s'aspergent d'eau pour se porter bonheur.",
      "sentence_en": "The Dai people's Water Splashing Festival is a grand New Year celebration where people splash water on each other as blessings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dai_water_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推行电子政务服务,市民可以在网上办理大部分行政事务。",
      "sentence_pinyin": "Zhèngfǔ tuīxíng diànzǐ zhèngwù fúwù, shìmín kěyǐ zài wǎngshàng bànlǐ dàbùfèn xíngzhèng shìwù.",
      "sentence_fr": "Le gouvernement promeut les services d'administration électronique, permettant aux citoyens de traiter la plupart des affaires administratives en ligne.",
      "sentence_en": "The government promotes e-government services, allowing citizens to handle most administrative matters online.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "e_government_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能洗碗机可以自动感应餐具脏污程度并调整清洗模式。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xǐwǎnjī kěyǐ zìdòng gǎnyìng cānjù zāngwū chéngdù bìng tiáozhěng qīngxǐ móshì.",
      "sentence_fr": "Ce lave-vaisselle intelligent détecte automatiquement le niveau de saleté de la vaisselle et ajuste le mode de lavage.",
      "sentence_en": "This smart dishwasher automatically senses dish dirtiness levels and adjusts washing modes accordingly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dishwashers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "苗族的银饰工艺精美绝伦,每件首饰都承载着深厚的文化内涵。",
      "sentence_pinyin": "Miáozú de yínshì gōngyì jīngměi juélún, měi jiàn shǒushì dōu chéngzài zhe shēnhòu de wénhuà nèihán.",
      "sentence_fr": "L'artisanat des bijoux en argent des Miao est d'une beauté exquise, chaque pièce portant une riche signification culturelle.",
      "sentence_en": "The Miao people's silver jewelry craftsmanship is exquisitely beautiful, with each piece carrying deep cultural significance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "miao_silver_jewelry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "打纸牌是中国人最喜欢的休闲娱乐方式之一,老少皆宜。",
      "sentence_pinyin": "Dǎ zhǐpái shì Zhōngguórén zuì xǐhuān de xiūxián yúlè fāngshì zhī yī, lǎoshào jiēyí.",
      "sentence_fr": "Jouer aux cartes est l'un des loisirs préférés des Chinois, adapté à tous les âges.",
      "sentence_en": "Playing cards is one of Chinese people's favorite leisure activities, suitable for all ages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "card_games",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区设置了共享工具间,居民可以免费借用各种维修工具。",
      "sentence_pinyin": "Shèqū shèzhì le gòngxiǎng gōngjùjiān, jūmín kěyǐ miǎnfèi jièyòng gèzhǒng wéixiū gōngjù.",
      "sentence_fr": "La communauté a créé une salle d'outils partagés où les résidents peuvent emprunter gratuitement divers outils de réparation.",
      "sentence_en": "The community set up a shared tool room where residents can borrow various repair tools for free.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_tool_sharing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能垃圾桶可以自动感应开盖,还能压缩垃圾增加容量。",
      "sentence_pinyin": "Zhège zhìnéng lājītǒng kěyǐ zìdòng gǎnyìng kāigài, hái néng yāsuō lājī zēngjiā róngliàng.",
      "sentence_fr": "Cette poubelle intelligente s'ouvre automatiquement par détection et peut compresser les déchets pour augmenter sa capacité.",
      "sentence_en": "This smart trash can automatically opens by sensor and can compress garbage to increase capacity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_trash_cans",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "彝族的火把节是盛大的传统节日,人们点燃火把驱除邪恶祈求幸福。",
      "sentence_pinyin": "Yízú de huǒbǎjié shì shèngdà de chuántǒng jiérì, rénmen diǎnrán huǒbǎ qūchú xié'è qíqiú xìngfú.",
      "sentence_fr": "Le festival des torches des Yi est une grande fête traditionnelle où les gens allument des torches pour chasser le mal et prier pour le bonheur.",
      "sentence_en": "The Yi people's Torch Festival is a grand traditional holiday where people light torches to drive away evil and pray for happiness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yi_torch_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市开展了老旧小区改造工程,提升居民的居住环境和生活质量。",
      "sentence_pinyin": "Chéngshì kāizhǎn le lǎojiù xiǎoqū gǎizào gōngchéng, tíshēng jūmín de jūzhù huánjìng hé shēnghuó zhìliàng.",
      "sentence_fr": "La ville a lancé des projets de rénovation des anciens quartiers pour améliorer l'environnement de vie et la qualité de vie des résidents.",
      "sentence_en": "The city launched old neighborhood renovation projects to improve residents' living environment and quality of life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "old_neighborhood_renovation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能按摩椅可以模拟多种按摩手法,有效缓解身体疲劳。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng ànmóyǐ kěyǐ mónǐ duō zhǒng ànmó shǒufǎ, yǒuxiào huǎnjiě shēntǐ píláo.",
      "sentence_fr": "Ce fauteuil de massage intelligent peut simuler diverses techniques de massage pour soulager efficacement la fatigue corporelle.",
      "sentence_en": "This smart massage chair can simulate multiple massage techniques to effectively relieve body fatigue.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_massage_chairs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "下象棋是中国最古老的智力游戏之一,讲究策略和全局观念。",
      "sentence_pinyin": "Xià xiàngqí shì Zhōngguó zuì gǔlǎo de zhìlì yóuxì zhī yī, jiǎngjiu cèlüè hé quánjú guānniàn.",
      "sentence_fr": "Les échecs chinois sont l'un des plus anciens jeux d'intelligence en Chine, mettant l'accent sur la stratégie et la vision globale.",
      "sentence_en": "Chinese chess is one of China's oldest intellectual games, emphasizing strategy and overall perspective.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "chinese_chess",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "壮族的三月三歌节是盛大的歌会活动,青年男女通过对歌寻觅知音。",
      "sentence_pinyin": "Zhuàngzú de sānyuèsān gējié shì shèngdà de gēhuì huódòng, qīngnián nánnǚ tōngguò duìgē xúnmì zhīyīn.",
      "sentence_fr": "Le festival des chants du 3 mars des Zhuang est un grand événement musical où les jeunes cherchent leur âme sœur par des chants dialogués.",
      "sentence_en": "The Zhuang people's Third Month Third Song Festival is a grand singing event where young people seek soulmates through antiphonal singing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhuang_song_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织了旧物置换活动,居民可以交换闲置物品减少浪费。",
      "sentence_pinyin": "Shèqū zǔzhī le jiùwù zhìhuàn huódòng, jūmín kěyǐ jiāohuàn xiánzhì wùpǐn jiǎnshǎo làngfèi.",
      "sentence_fr": "La communauté a organisé une activité d'échange d'objets usagés où les résidents peuvent échanger des articles inutilisés pour réduire le gaspillage.",
      "sentence_en": "The community organized a used goods exchange event where residents can swap idle items to reduce waste.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_item_exchange",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能除湿机可以根据室内湿度自动运行,保持环境干燥舒适。",
      "sentence_pinyin": "Zhège zhìnéng chúshījī kěyǐ gēnjù shìnèi shīdù zìdòng yùnxíng, bǎochí huánjìng gānzào shūshì.",
      "sentence_fr": "Ce déshumidificateur intelligent fonctionne automatiquement selon l'humidité intérieure pour maintenir un environnement sec et confortable.",
      "sentence_en": "This smart dehumidifier automatically operates based on indoor humidity to maintain a dry and comfortable environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dehumidifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "侗族的大歌是无伴奏多声部合唱,被列入人类非物质文化遗产名录。",
      "sentence_pinyin": "Dòngzú de dàgē shì wú bànzòu duōshēngbù héchàng, bèi lièrù rénlèi fēi wùzhì wénhuà yíchǎn mínglù.",
      "sentence_fr": "Le grand chant des Dong est un chœur polyphonique a cappella, inscrit au patrimoine culturel immatériel de l'humanité.",
      "sentence_en": "The Dong people's Grand Song is an a cappella polyphonic chorus, listed as UNESCO Intangible Cultural Heritage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dong_grand_song",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
