{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "气候模型预测全球变暖将导致极端天气事件的频率和强度显著增加。",
      "sentence_pinyin": "Qìhòu móxíng yùcè quánqiú biànnuǎn jiāng dǎozhì jíduān tiānqì shìjiàn de pínlǜ hé qiángdù xiǎnzhù zēngjiā.",
      "sentence_fr": "Les modèles climatiques prévoient que le réchauffement climatique entraînera une augmentation significative de la fréquence et de l'intensité des événements météorologiques extrêmes.",
      "sentence_en": "Climate models predict that global warming will lead to a significant increase in the frequency and intensity of extreme weather events.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "climate_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语音合成技术的进步使计算机生成的语音越来越接近自然人声。",
      "sentence_pinyin": "Yǔyīn héchéng jìshù de jìnbù shǐ jìsuànjī shēngchéng de yǔyīn yuèláiyuè jiējìn zìrán rénshēng.",
      "sentence_fr": "Les progrès de la technologie de synthèse vocale rendent la voix générée par ordinateur de plus en plus proche de la voix humaine naturelle.",
      "sentence_en": "Advances in speech synthesis technology make computer-generated speech increasingly close to natural human voice.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "speech_synthesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "农村电气化项目为偏远地区居民提供了获得现代能源服务的机会。",
      "sentence_pinyin": "Nóngcūn diànqì huà xiàngmù wèi piānyuǎn dìqū jūmín tígōng le huòdé xiàndài néngyuán fúwù de jīhuì.",
      "sentence_fr": "Les projets d'électrification rurale offrent aux résidents des zones éloignées la possibilité d'accéder aux services énergétiques modernes.",
      "sentence_en": "Rural electrification projects provide remote area residents with access to modern energy services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rural_electrification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计量经济学方法帮助经济学家从数据中识别因果关系而非仅仅是相关性。",
      "sentence_pinyin": "Jìliàng jīngjì xué fāngfǎ bāngzhù jīngjì xué jiā cóng shùjù zhōng shìbié yīnguǒ guānxì ér fēi jǐnjǐn shì xiāngguān xìng.",
      "sentence_fr": "Les méthodes économétriques aident les économistes à identifier les relations causales dans les données plutôt que de simples corrélations.",
      "sentence_en": "Econometric methods help economists identify causal relationships in data rather than mere correlations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "econometrics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阅读障碍研究帮助教育者开发针对性的干预措施来支持学习困难学生。",
      "sentence_pinyin": "Yuèdú zhàng'ài yánjiū bāngzhù jiàoyù zhě kāifā zhēnduì xìng de gānyù cuòshī lái zhīchí xuéxí kùnnán xuéshēng.",
      "sentence_fr": "La recherche sur la dyslexie aide les éducateurs à développer des interventions ciblées pour soutenir les étudiants ayant des difficultés d'apprentissage.",
      "sentence_en": "Dyslexia research helps educators develop targeted interventions to support students with learning difficulties.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dyslexia_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太空采矿技术的发展可能开启利用小行星资源的新时代。",
      "sentence_pinyin": "Tàikōng cǎikuàng jìshù de fāzhǎn kěnéng kāiqǐ lìyòng xiǎoxíngxīng zīyuán de xīn shídài.",
      "sentence_fr": "Le développement de la technologie d'extraction spatiale pourrait ouvrir une nouvelle ère d'exploitation des ressources des astéroïdes.",
      "sentence_en": "The development of space mining technology may open a new era of utilizing asteroid resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "space_mining",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "信息不对称理论解释了市场交易中买卖双方知识差距导致的效率损失。",
      "sentence_pinyin": "Xìnxī bù duìchèn lǐlùn jiěshì le shìchǎng jiāoyì zhōng mǎimài shuāngfāng zhīshi chājù dǎozhì de xiàolǜ sǔnshī.",
      "sentence_fr": "La théorie de l'asymétrie de l'information explique les pertes d'efficacité dues aux écarts de connaissances entre acheteurs et vendeurs dans les transactions de marché.",
      "sentence_en": "Information asymmetry theory explains efficiency losses caused by knowledge gaps between buyers and sellers in market transactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "information_asymmetry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "森林碳汇在全球碳循环和气候调节中发挥着不可或缺的作用。",
      "sentence_pinyin": "Sēnlín tàn huì zài quánqiú tàn xúnhuán hé qìhòu tiáojié zhōng fāhuī zhe bùkě huò quē de zuòyòng.",
      "sentence_fr": "Les puits de carbone forestiers jouent un rôle indispensable dans le cycle mondial du carbone et la régulation du climat.",
      "sentence_en": "Forest carbon sinks play an indispensable role in the global carbon cycle and climate regulation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "forest_carbon_sinks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医学伦理委员会确保临床研究符合伦理标准并保护参与者的权益。",
      "sentence_pinyin": "Yīxué lúnlǐ wěiyuánhuì quèbǎo línchuáng yánjiū fúhé lúnlǐ biāozhǔn bìng bǎohù cānyù zhě de quányì.",
      "sentence_fr": "Les comités d'éthique médicale veillent à ce que la recherche clinique respecte les normes éthiques et protège les droits des participants.",
      "sentence_en": "Medical ethics committees ensure clinical research meets ethical standards and protects participants' rights.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "medical_ethics_committees",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "低代码开发平台使非专业程序员也能快速构建功能性应用程序。",
      "sentence_pinyin": "Dī dàimǎ kāifā píngtái shǐ fēi zhuānyè chéngxù yuán yě néng kuàisù gòujiàn gōngnéng xìng yìngyòng chéngxù.",
      "sentence_fr": "Les plateformes de développement low-code permettent aux non-programmeurs de créer rapidement des applications fonctionnelles.",
      "sentence_en": "Low-code development platforms enable non-professional programmers to quickly build functional applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "low_code_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "民族志研究方法通过深入参与社区生活来理解特定文化群体的世界观。",
      "sentence_pinyin": "Mínzú zhì yánjiū fāngfǎ tōngguò shēnrù cānyù shèqū shēnghuó lái lǐjiě tèdìng wénhuà qúntǐ de shìjiè guān.",
      "sentence_fr": "Les méthodes de recherche ethnographique comprennent la vision du monde de groupes culturels spécifiques en participant profondément à la vie communautaire.",
      "sentence_en": "Ethnographic research methods understand specific cultural groups' worldviews through deep participation in community life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ethnographic_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "预防性医学强调通过早期筛查和生活方式干预来预防疾病发生。",
      "sentence_pinyin": "Yùfáng xìng yīxué qiángdiào tōngguò zǎoqī shāichá hé shēnghuó fāngshì gānyù lái yùfáng jíbìng fāshēng.",
      "sentence_fr": "La médecine préventive met l'accent sur la prévention des maladies par le dépistage précoce et les interventions sur le mode de vie.",
      "sentence_en": "Preventive medicine emphasizes preventing diseases through early screening and lifestyle interventions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "preventive_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社交机器人研究致力于创造能够与人类自然互动的智能机器人系统。",
      "sentence_pinyin": "Shèjiāo jīqìrén yánjiū zhìlì yú chuàngzào nénggòu yǔ rénlèi zìrán hùdòng de zhìnéng jīqìrén xìtǒng.",
      "sentence_fr": "La recherche sur les robots sociaux s'efforce de créer des systèmes robotiques intelligents capables d'interagir naturellement avec les humains.",
      "sentence_en": "Social robotics research strives to create intelligent robot systems capable of natural interaction with humans.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_robotics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然资本核算将生态系统服务的价值纳入经济决策和国民账户体系。",
      "sentence_pinyin": "Zìrán zīběn hésuan jiāng shēngtài xìtǒng fúwù de jiàzhí nàrù jīngjì juécè hé guómín zhànghù tǐxì.",
      "sentence_fr": "La comptabilité du capital naturel intègre la valeur des services écosystémiques dans les décisions économiques et les systèmes de comptes nationaux.",
      "sentence_en": "Natural capital accounting incorporates the value of ecosystem services into economic decisions and national accounting systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "natural_capital_accounting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "音乐认知科学研究大脑如何感知、处理和产生音乐体验。",
      "sentence_pinyin": "Yīnyuè rènzhī kēxué yánjiū dànǎo rúhé gǎnzhī, chǔlǐ hé chǎnshēng yīnyuè tǐyàn.",
      "sentence_fr": "Les sciences cognitives de la musique étudient comment le cerveau perçoit, traite et génère les expériences musicales.",
      "sentence_en": "Music cognition science studies how the brain perceives, processes, and generates musical experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "music_cognition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "建筑信息模型技术改善了建设项目中各方之间的协作和信息共享。",
      "sentence_pinyin": "Jiànzhù xìnxī móxíng jìshù gǎishàn le jiànshè xiàngmù zhōng gè fāng zhījiān de xiézuò hé xìnxī gòngxiǎng.",
      "sentence_fr": "La technologie de modélisation des informations du bâtiment améliore la collaboration et le partage d'informations entre les parties prenantes des projets de construction.",
      "sentence_en": "Building Information Modeling technology improves collaboration and information sharing among stakeholders in construction projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "building_information_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "疫苗犹豫现象的增加对全球公共卫生的群体免疫努力构成威胁。",
      "sentence_pinyin": "Yìmiáo yóuyù xiànxiàng de zēngjiā duì quánqiú gōnggòng wèishēng de qúntǐ miǎnyì nǔlì gòuchéng wēixié.",
      "sentence_fr": "L'augmentation de l'hésitation vaccinale menace les efforts d'immunité collective en santé publique mondiale.",
      "sentence_en": "The increase in vaccine hesitancy threatens global public health herd immunity efforts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vaccine_hesitancy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化产业经济学研究创意产品的生产、分配和消费的独特经济规律。",
      "sentence_pinyin": "Wénhuà chǎnyè jīngjì xué yánjiū chuàngyì chǎnpǐn de shēngchǎn, fēnpèi hé xiāofèi de dútè jīngjì guīlǜ.",
      "sentence_fr": "L'économie des industries culturelles étudie les lois économiques uniques de la production, de la distribution et de la consommation des produits créatifs.",
      "sentence_en": "Cultural industry economics studies the unique economic laws of creative product production, distribution, and consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_industry_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人机协作模式让机器人与人类工人在共享工作空间中安全地合作完成任务。",
      "sentence_pinyin": "Rén jī xiézuò móshì ràng jīqìrén yǔ rénlèi gōngrén zài gòngxiǎng gōngzuò kōngjiān zhōng ānquán de hézuò wánchéng rènwù.",
      "sentence_fr": "Les modèles de collaboration homme-robot permettent aux robots de travailler en toute sécurité avec les travailleurs humains dans des espaces de travail partagés.",
      "sentence_en": "Human-robot collaboration models allow robots to safely work with human workers in shared workspaces to complete tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "human_robot_collaboration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "野化重建项目通过重新引入本土物种来恢复退化生态系统的功能。",
      "sentence_pinyin": "Yěhuà chóngjiàn xiàngmù tōngguò chóngxīn yǐnrù běntǔ wùzhǒng lái huīfù tuìhuà shēngtài xìtǒng de gōngnéng.",
      "sentence_fr": "Les projets de réensauvagement restaurent les fonctions des écosystèmes dégradés en réintroduisant des espèces indigènes.",
      "sentence_en": "Rewilding projects restore degraded ecosystem functions by reintroducing native species.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rewilding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
