{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个海水淡化项目为沿海城市解决了淡水资源短缺的问题。",
      "sentence_pinyin": "Zhège hǎishuǐ dànhuà xiàngmù wèi yánhǎi chéngshì jiějuéle dànshuǐ zīyuán duǎnquē de wèntí.",
      "sentence_fr": "Ce projet de dessalement d'eau de mer a résolu le problème de pénurie de ressources en eau douce pour les villes côtières.",
      "sentence_en": "This seawater desalination project solved the freshwater resource shortage problem for coastal cities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "water_desalination",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的服装品牌以简约时尚的设计风格赢得了消费者的青睐。",
      "sentence_pinyin": "Tā de fúzhuāng pǐnpái yǐ jiǎnyuē shíshàng de shèjì fēnggé yíngdéle xiāofèizhě de qīnglài.",
      "sentence_fr": "Sa marque de vêtements a gagné la faveur des consommateurs grâce à un style de design minimaliste et à la mode.",
      "sentence_en": "Her clothing brand won consumer favor with its minimalist and fashionable design style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fashion_brands",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个森林公园为市民提供了亲近自然、休闲放松的好去处。",
      "sentence_pinyin": "Zhège sēnlín gōngyuán wèi shìmín tígōngle qīnjìn zìrán, xiūxián fàngsōng de hǎo qùchù.",
      "sentence_fr": "Ce parc forestier offre aux citoyens un excellent endroit pour se rapprocher de la nature et se détendre.",
      "sentence_en": "This forest park provides citizens with a great place to get close to nature and relax.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "forest_parks",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在机器人编程竞赛中展现了出色的逻辑思维和动手能力。",
      "sentence_pinyin": "Tā zài jīqìrén biānchéng jìngsài zhōng zhǎnxiànle chūsè de luójí sīwéi hé dòngshǒu nénglì.",
      "sentence_fr": "Il a démontré une excellente pensée logique et des compétences pratiques lors de la compétition de programmation robotique.",
      "sentence_en": "He demonstrated excellent logical thinking and hands-on skills in the robot programming competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "robotics_competitions",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐节汇集了摇滚、爵士、电子等多种音乐风格。",
      "sentence_pinyin": "Zhège yīnyuèjié huìjíle yáogǔn, juéshì, diànzǐ děng duō zhǒng yīnyuè fēnggé.",
      "sentence_fr": "Ce festival de musique rassemble de nombreux styles musicaux tels que rock, jazz et électronique.",
      "sentence_en": "This music festival brings together multiple music styles such as rock, jazz, and electronic.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_festivals",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过参加志愿支教活动为山区孩子带去了知识和希望。",
      "sentence_pinyin": "Tā tōngguò cānjiā zhìyuàn zhījiào huódòng wèi shānqū háizi dài qùle zhīshi hé xīwàng.",
      "sentence_fr": "En participant à des activités d'enseignement bénévole, elle a apporté connaissances et espoir aux enfants des régions montagneuses.",
      "sentence_en": "By participating in volunteer teaching activities, she brought knowledge and hope to children in mountainous areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volunteer_teaching",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个无障碍设施改造项目方便了残疾人的出行和生活。",
      "sentence_pinyin": "Zhège wú zhàng'ài shèshī gǎizào xiàngmù fāngbiànle cánjírén de chūxíng hé shēnghuó.",
      "sentence_fr": "Ce projet de rénovation des installations accessibles a facilité les déplacements et la vie des personnes handicapées.",
      "sentence_en": "This accessible facilities renovation project facilitated the travel and life of people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "accessibility",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的魔术表演充满创意和惊喜，让观众赞叹不已。",
      "sentence_pinyin": "Tā de móshù biǎoyǎn chōngmǎn chuàngyì hé jīngxǐ, ràng guānzhòng zàntàn bùyǐ.",
      "sentence_fr": "Son spectacle de magie est plein de créativité et de surprises, laissant le public émerveillé.",
      "sentence_en": "His magic show is full of creativity and surprises, leaving the audience amazed.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "magic_performances",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食品检测实验室为食品安全提供了专业的技术保障。",
      "sentence_pinyin": "Zhège shípǐn jiǎncè shíyànshì wèi shípǐn ānquán tígōngle zhuānyè de jìshù bǎozhàng.",
      "sentence_fr": "Ce laboratoire de contrôle alimentaire fournit une garantie technique professionnelle pour la sécurité alimentaire.",
      "sentence_en": "This food testing laboratory provides professional technical guarantee for food safety.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_testing",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在面塑艺术创作中继承了传统技艺并融入了现代元素。",
      "sentence_pinyin": "Tā zài miànsù yìshù chuàngzuò zhōng jìchéngle chuántǒng jìyì bìng róngrùle xiàndài yuánsù.",
      "sentence_fr": "Dans la création artistique de pâte à modeler, elle a hérité des techniques traditionnelles et intégré des éléments modernes.",
      "sentence_en": "In dough sculpture art creation, she inherited traditional techniques and integrated modern elements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dough_sculpture",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字货币交易平台采用了多重安全防护措施。",
      "sentence_pinyin": "Zhège shùzì huòbì jiāoyì píngtái cǎiyòngle duōchóng ānquán fánghù cuòshī.",
      "sentence_fr": "Cette plateforme d'échange de crypto-monnaies a adopté de multiples mesures de sécurité.",
      "sentence_en": "This cryptocurrency exchange platform adopted multiple security protection measures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cryptocurrency",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在羽毛球训练中提高了反应速度和击球技术。",
      "sentence_pinyin": "Tā zài yǔmáoqiú xùnliàn zhōng tígāole fǎnyìng sùdù hé jīqiú jìshù.",
      "sentence_fr": "Lors de l'entraînement au badminton, il a amélioré sa vitesse de réaction et sa technique de frappe.",
      "sentence_en": "During badminton training, he improved his reaction speed and hitting technique.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "badminton",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保教育基地通过互动展示普及生态保护知识。",
      "sentence_pinyin": "Zhège huánbǎo jiàoyù jīdì tōngguò hùdòng zhǎnshì pǔjí shēngtài bǎohù zhīshi.",
      "sentence_fr": "Cette base d'éducation environnementale vulgarise les connaissances sur la protection écologique à travers des expositions interactives.",
      "sentence_en": "This environmental education base popularizes ecological protection knowledge through interactive displays.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_education",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的香水调配作品散发着独特迷人的香气。",
      "sentence_pinyin": "Tā de xiāngshuǐ tiáopèi zuòpǐn sànfāzhe dútè mírén de xiāngqì.",
      "sentence_fr": "Ses créations de parfums dégagent un arôme unique et enchanteur.",
      "sentence_en": "Her perfume creations emit a unique and enchanting aroma.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "perfumery",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能安防系统能够实时监控并自动报警异常情况。",
      "sentence_pinyin": "Zhège zhìnéng ānfáng xìtǒng nénggòu shíshí jiānkòng bìng zìdòng bàojǐng yìcháng qíngkuàng.",
      "sentence_fr": "Ce système de sécurité intelligent peut surveiller en temps réel et alerter automatiquement en cas de situations anormales.",
      "sentence_en": "This intelligent security system can monitor in real-time and automatically alert abnormal situations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_security",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在历史研究中发现了许多被忽略的重要史实。",
      "sentence_pinyin": "Tā zài lìshǐ yánjiū zhōng fāxiànle xǔduō bèi hūlüè de zhòngyào shǐshí.",
      "sentence_fr": "Dans ses recherches historiques, il a découvert de nombreux faits historiques importants négligés.",
      "sentence_en": "In his historical research, he discovered many important historical facts that had been overlooked.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "historical_research",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个亲子活动中心设计了丰富多彩的家庭互动项目。",
      "sentence_pinyin": "Zhège qīnzǐ huódòng zhōngxīn shèjìle fēngfù duōcǎi de jiātíng hùdòng xiàngmù.",
      "sentence_fr": "Ce centre d'activités parent-enfant a conçu de riches projets d'interaction familiale.",
      "sentence_en": "This parent-child activity center designed rich family interaction projects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family_activities",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的茶艺表演优雅从容，展现了中国茶文化的深厚底蕴。",
      "sentence_pinyin": "Tā de cháyì biǎoyǎn yōuyǎ cóngróng, zhǎnxiànle Zhōngguó chá wénhuà de shēnhòu dǐyùn.",
      "sentence_fr": "Sa performance de l'art du thé est élégante et sereine, montrant le profond héritage de la culture du thé chinois.",
      "sentence_en": "Her tea ceremony performance is elegant and composed, showcasing the profound heritage of Chinese tea culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tea_ceremony",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个基因编辑技术为治疗遗传性疾病开辟了新的途径。",
      "sentence_pinyin": "Zhège jīyīn biānjí jìshù wèi zhìliáo yíchuánxìng jíbìng kāipìle xīn de tújìng.",
      "sentence_fr": "Cette technologie d'édition génétique a ouvert de nouvelles voies pour le traitement des maladies héréditaires.",
      "sentence_en": "This gene editing technology opened new pathways for treating hereditary diseases.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gene_editing",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在乒乓球比赛中以灵活的步伐和精准的控球取得胜利。",
      "sentence_pinyin": "Tā zài pīngpāngqiú bǐsài zhōng yǐ línghuó de bùfá hé jīngzhǔn de kòngqiú qǔdé shènglì.",
      "sentence_fr": "Il a remporté la victoire au tennis de table grâce à des mouvements agiles et un contrôle précis de la balle.",
      "sentence_en": "He won victory in table tennis with agile footwork and precise ball control.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "table_tennis",
      "created_at": "2025-11-20T18:40:00.000Z",
      "updated_at": "2025-11-20T18:40:00.000Z"
    }
  ]
}
