{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "暗物质构成宇宙物质总量的约四分之一但不发射电磁辐射。",
      "sentence_pinyin": "Àn wùzhì gòuchéng yǔzhòu wùzhì zǒngliàng de yuē sì fēn zhī yī dàn bù fāshè diàncí fúshè.",
      "sentence_fr": "La matière noire constitue environ un quart de la masse totale de l'univers mais n'émet pas de rayonnement électromagnétique.",
      "sentence_en": "Dark matter makes up about a quarter of the total mass of the universe but does not emit electromagnetic radiation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dark_matter",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "信用违约互换允许投资者对冲债券发行人的违约风险。",
      "sentence_pinyin": "Xìnyòng wéiyuē hùhuàn yǔnxǔ tóuzīzhě duìchōng zhàiquàn fāxíngrén de wéiyuē fēngxiǎn.",
      "sentence_fr": "Les swaps de défaut de crédit permettent aux investisseurs de se couvrir contre le risque de défaut des émetteurs d'obligations.",
      "sentence_en": "Credit default swaps allow investors to hedge against the default risk of bond issuers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "credit_derivatives",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "恶意软件分析沙箱在隔离环境中安全执行可疑代码。",
      "sentence_pinyin": "Èyì ruǎnjiàn fēnxī shāxiāng zài gélí huánjìng zhōng ānquán zhíxíng kěyí dàimǎ.",
      "sentence_fr": "Les bacs à sable d'analyse des logiciels malveillants exécutent en toute sécurité du code suspect dans un environnement isolé.",
      "sentence_en": "Malware analysis sandboxes safely execute suspicious code in an isolated environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "malware_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "康德义务论认为道德行为应基于普遍适用的理性原则。",
      "sentence_pinyin": "Kāngdé yìwùlùn rènwéi dàodé xíngwéi yīng jīyú pǔbiàn shìyòng de lǐxìng yuánzé.",
      "sentence_fr": "La déontologie kantienne soutient que le comportement moral doit être fondé sur des principes rationnels universellement applicables.",
      "sentence_en": "Kantian deontology holds that moral behavior should be based on universally applicable rational principles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "kantian_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "变分自编码器学习数据的潜在概率分布以生成新样本。",
      "sentence_pinyin": "Biànfēn zì biānmǎqì xuéxí shùjù de qiánzài gàilǜ fēnbù yǐ shēngchéng xīn yàngběn.",
      "sentence_fr": "Les auto-encodeurs variationnels apprennent la distribution de probabilité latente des données pour générer de nouveaux échantillons.",
      "sentence_en": "Variational autoencoders learn the latent probability distribution of data to generate new samples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "variational_autoencoders",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "暗能量驱动宇宙加速膨胀但其本质仍是物理学之谜。",
      "sentence_pinyin": "Àn néngliàng qūdòng yǔzhòu jiāsù péngzhàng dàn qí běnzhì réng shì wùlǐxué zhī mí.",
      "sentence_fr": "L'énergie noire propulse l'expansion accélérée de l'univers mais sa nature reste un mystère de la physique.",
      "sentence_en": "Dark energy drives the accelerating expansion of the universe but its nature remains a mystery of physics.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dark_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "算法交易系统根据预设规则自动执行高频金融交易。",
      "sentence_pinyin": "Suànfǎ jiāoyì xìtǒng gēnjù yùshè guīzé zìdòng zhíxíng gāopín jīnróng jiāoyì.",
      "sentence_fr": "Les systèmes de trading algorithmique exécutent automatiquement des transactions financières à haute fréquence selon des règles prédéfinies.",
      "sentence_en": "Algorithmic trading systems automatically execute high-frequency financial transactions based on preset rules.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "algorithmic_trading",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字取证技术收集和分析电子证据以支持法律诉讼。",
      "sentence_pinyin": "Shùzì qǔzhèng jìshù shōují hé fēnxī diànzǐ zhèngjù yǐ zhīchí fǎlǜ sùsòng.",
      "sentence_fr": "Les techniques de criminalistique numérique collectent et analysent des preuves électroniques pour soutenir les procédures judiciaires.",
      "sentence_en": "Digital forensics techniques collect and analyze electronic evidence to support legal proceedings.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_forensics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "美德伦理学强调培养品格特质而非遵循具体规则。",
      "sentence_pinyin": "Měidé lúnlǐxué qiángdiào péiyǎng pǐngé tèzhì ér fēi zūnxún jùtǐ guīzé.",
      "sentence_fr": "L'éthique des vertus met l'accent sur le développement des traits de caractère plutôt que sur le respect de règles spécifiques.",
      "sentence_en": "Virtue ethics emphasizes cultivating character traits rather than following specific rules.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "virtue_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "图神经网络专门处理具有节点和边结构的关系数据。",
      "sentence_pinyin": "Tú shénjīng wǎngluò zhuānmén chǔlǐ jùyǒu jiédiǎn hé biān jiégòu de guānxì shùjù.",
      "sentence_fr": "Les réseaux neuronaux de graphes traitent spécifiquement les données relationnelles avec des structures de nœuds et d'arêtes.",
      "sentence_en": "Graph neural networks specifically process relational data with node and edge structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "graph_neural_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黑洞事件视界是光线无法逃逸的临界边界区域。",
      "sentence_pinyin": "Hēidòng shìjiàn shìjiè shì guāngxiàn wúfǎ táoyì de línjiè biānjiè qūyù.",
      "sentence_fr": "L'horizon des événements d'un trou noir est la limite critique au-delà de laquelle la lumière ne peut s'échapper.",
      "sentence_en": "A black hole's event horizon is the critical boundary region from which light cannot escape.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "black_hole_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "货币政策通过利率调整影响通货膨胀和经济增长。",
      "sentence_pinyin": "Huòbì zhèngcè tōngguò lìlǜ tiáozhěng yǐngxiǎng tōnghuò péngzhàng hé jīngjì zēngzhǎng.",
      "sentence_fr": "La politique monétaire influence l'inflation et la croissance économique par des ajustements des taux d'intérêt.",
      "sentence_en": "Monetary policy influences inflation and economic growth through interest rate adjustments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "monetary_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "身份和访问管理系统控制用户对企业资源的访问权限。",
      "sentence_pinyin": "Shēnfèn hé fǎngwèn guǎnlǐ xìtǒng kòngzhì yònghù duì qǐyè zīyuán de fǎngwèn quánxiàn.",
      "sentence_fr": "Les systèmes de gestion des identités et des accès contrôlent les droits d'accès des utilisateurs aux ressources de l'entreprise.",
      "sentence_en": "Identity and access management systems control user access rights to enterprise resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "identity_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会契约论探讨个人与国家之间的相互权利和义务。",
      "sentence_pinyin": "Shèhuì qìyuē lùn tàntǎo gèrén yǔ guójiā zhījiān de xiānghù quánlì hé yìwù.",
      "sentence_fr": "La théorie du contrat social explore les droits et obligations mutuels entre les individus et l'État.",
      "sentence_en": "Social contract theory explores the mutual rights and obligations between individuals and the state.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_contract_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自监督学习通过设计代理任务从未标注数据中学习特征。",
      "sentence_pinyin": "Zì jiāndū xuéxí tōngguò shèjì dàilǐ rènwù cóng wèi biāozhù shùjù zhōng xuéxí tèzhēng.",
      "sentence_fr": "L'apprentissage auto-supervisé apprend des caractéristiques à partir de données non étiquetées en concevant des tâches proxy.",
      "sentence_en": "Self-supervised learning learns features from unlabeled data by designing proxy tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "self_supervised_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "引力波探测开启了观测宇宙极端事件的新窗口。",
      "sentence_pinyin": "Yǐnlì bō tàncè kāiqǐ le guāncè yǔzhòu jíduān shìjiàn de xīn chuāngkǒu.",
      "sentence_fr": "La détection des ondes gravitationnelles a ouvert une nouvelle fenêtre d'observation des événements extrêmes de l'univers.",
      "sentence_en": "Gravitational wave detection has opened a new window for observing extreme events in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gravitational_waves",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宏观审慎监管旨在防范系统性金融风险的累积。",
      "sentence_pinyin": "Hóngguān shěnshèn jiānguǎn zhǐ zài fángfàn xìtǒngxìng jīnróng fēngxiǎn de lěijī.",
      "sentence_fr": "La réglementation macroprudentielle vise à prévenir l'accumulation des risques financiers systémiques.",
      "sentence_en": "Macroprudential regulation aims to prevent the accumulation of systemic financial risks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "macroprudential_regulation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "应用程序编程接口安全测试验证数据交换的完整性。",
      "sentence_pinyin": "Yìngyòng chéngxù biānchéng jiēkǒu ānquán cèshì yànzhèng shùjù jiāohuàn de wánzhěngxìng.",
      "sentence_fr": "Les tests de sécurité des interfaces de programmation d'applications vérifient l'intégrité des échanges de données.",
      "sentence_en": "Application programming interface security testing verifies the integrity of data exchanges.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "api_security_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认识论研究知识的本质、来源和有效性的哲学问题。",
      "sentence_pinyin": "Rènshìlùn yánjiū zhīshì de běnzhì, láiyuán hé yǒuxiàoxìng de zhéxué wèntí.",
      "sentence_fr": "L'épistémologie étudie les questions philosophiques de la nature, des sources et de la validité de la connaissance.",
      "sentence_en": "Epistemology studies philosophical questions of the nature, sources, and validity of knowledge.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epistemology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联邦学习允许多方在不共享原始数据的情况下协作训练模型。",
      "sentence_pinyin": "Liánbāng xuéxí yǔnxǔ duō fāng zài bù gòngxiǎng yuánshǐ shùjù de qíngkuàng xià xiézuò xùnliàn móxíng.",
      "sentence_fr": "L'apprentissage fédéré permet à plusieurs parties de collaborer à l'entraînement de modèles sans partager les données brutes.",
      "sentence_en": "Federated learning allows multiple parties to collaboratively train models without sharing raw data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "federated_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
