{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "霍金辐射理论预测黑洞会缓慢蒸发并最终消失。",
      "sentence_pinyin": "Huòjīn fúshè lǐlùn yùcè hēidòng huì huǎnmàn zhēngfā bìng zuìzhōng xiāoshī.",
      "sentence_fr": "La théorie du rayonnement de Hawking prédit que les trous noirs s'évaporent lentement et finissent par disparaître.",
      "sentence_en": "Hawking radiation theory predicts that black holes slowly evaporate and eventually disappear.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hawking_radiation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工作量证明机制通过计算难题验证区块链网络交易。",
      "sentence_pinyin": "Gōngzuòliàng zhèngmíng jīzhì tōngguò jìsuàn nántí yànzhèng qūkuàiliàn wǎngluò jiāoyì.",
      "sentence_fr": "Le mécanisme de preuve de travail valide les transactions du réseau blockchain par des puzzles de calcul.",
      "sentence_en": "The proof-of-work mechanism validates blockchain network transactions through computational puzzles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "proof_of_work",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式追踪系统跟踪请求在微服务之间的完整路径。",
      "sentence_pinyin": "Fēnbùshì zhuīzōng xìtǒng gēnzōng qǐngqiú zài wēi fúwù zhījiān de wánzhěng lùjìng.",
      "sentence_fr": "Les systèmes de traçage distribué suivent le chemin complet des requêtes entre les microservices.",
      "sentence_en": "Distributed tracing systems track the complete path of requests between microservices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_tracing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "身份哲学探讨同一性和个体持续存在的条件问题。",
      "sentence_pinyin": "Shēnfèn zhéxué tàntǎo tóngyīxìng hé gètǐ chíxù cúnzài de tiáojiàn wèntí.",
      "sentence_fr": "La philosophie de l'identité explore les questions d'identité et les conditions de persistance des individus.",
      "sentence_en": "Philosophy of identity explores questions of sameness and conditions for individual persistence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_identity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "熔断降级策略在服务故障时提供备用响应机制。",
      "sentence_pinyin": "Róngduàn jiàngjí cèlüè zài fúwù gùzhàng shí tígōng bèiyòng xiǎngyìng jīzhì.",
      "sentence_fr": "Les stratégies de disjonction et de dégradation fournissent des mécanismes de réponse de secours en cas de défaillance de service.",
      "sentence_en": "Circuit breaking and fallback strategies provide backup response mechanisms during service failures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fallback_strategies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "费米悖论质疑为何尚未发现任何外星智慧生命迹象。",
      "sentence_pinyin": "Fèimǐ bèilùn zhìyí wèihé shàngwèi fāxiàn rènhé wàixīng zhìhuì shēngmìng jìxiàng.",
      "sentence_fr": "Le paradoxe de Fermi questionne pourquoi aucune trace de vie extraterrestre intelligente n'a encore été découverte.",
      "sentence_en": "The Fermi paradox questions why no signs of extraterrestrial intelligent life have yet been discovered.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fermi_paradox",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨链互操作协议实现不同区块链网络之间的资产转移。",
      "sentence_pinyin": "Kuà liàn hù cāozuò xiéyì shíxiàn bùtóng qūkuàiliàn wǎngluò zhījiān de zīchǎn zhuǎnyí.",
      "sentence_fr": "Les protocoles d'interopérabilité inter-chaînes permettent le transfert d'actifs entre différents réseaux blockchain.",
      "sentence_en": "Cross-chain interoperability protocols enable asset transfers between different blockchain networks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cross_chain_interoperability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "幂等性设计确保重复请求不会产生非预期的副作用。",
      "sentence_pinyin": "Mìděngxìng shèjì quèbǎo chóngfù qǐngqiú bù huì chǎnshēng fēi yùqī de fùzuòyòng.",
      "sentence_fr": "La conception idempotente garantit que les requêtes répétées ne produisent pas d'effets secondaires inattendus.",
      "sentence_en": "Idempotent design ensures that repeated requests do not produce unexpected side effects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "idempotent_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模态逻辑研究可能性和必然性等模态概念的形式系统。",
      "sentence_pinyin": "Mótài luójí yánjiū kěnéngxìng hé bìránxìng děng mótài gàiniàn de xíngshì xìtǒng.",
      "sentence_fr": "La logique modale étudie les systèmes formels des concepts modaux tels que la possibilité et la nécessité.",
      "sentence_en": "Modal logic studies formal systems of modal concepts such as possibility and necessity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "modal_logic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蓝绿部署策略通过并行环境实现零停机时间的更新。",
      "sentence_pinyin": "Lánlǜ bùshǔ cèlüè tōngguò bìngxíng huánjìng shíxiàn líng tíngjī shíjiān de gēngxīn.",
      "sentence_fr": "La stratégie de déploiement bleu-vert permet des mises à jour sans temps d'arrêt grâce à des environnements parallèles.",
      "sentence_en": "Blue-green deployment strategy enables zero-downtime updates through parallel environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "blue_green_deployment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "德雷克方程估算银河系中可能存在的外星文明数量。",
      "sentence_pinyin": "Déléikè fāngchéng gūsuàn yínhéxì zhōng kěnéng cúnzài de wàixīng wénmíng shùliàng.",
      "sentence_fr": "L'équation de Drake estime le nombre de civilisations extraterrestres potentiellement présentes dans la galaxie.",
      "sentence_en": "The Drake equation estimates the number of extraterrestrial civilizations potentially present in the galaxy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "drake_equation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "第二层扩容方案在主链之外处理交易以提高吞吐量。",
      "sentence_pinyin": "Dì èr céng kuòróng fāng'àn zài zhǔ liàn zhīwài chǔlǐ jiāoyì yǐ tígāo tūntǔliàng.",
      "sentence_fr": "Les solutions de mise à l'échelle de couche 2 traitent les transactions hors de la chaîne principale pour améliorer le débit.",
      "sentence_en": "Layer 2 scaling solutions process transactions off the main chain to improve throughput.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "layer2_scaling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "金丝雀发布逐步向小部分用户推送新版本以测试稳定性。",
      "sentence_pinyin": "Jīnsīquè fābù zhúbù xiàng xiǎo bùfèn yònghù tuīsòng xīn bǎnběn yǐ cèshì wěndìngxìng.",
      "sentence_fr": "Le déploiement canari déploie progressivement de nouvelles versions vers un petit groupe d'utilisateurs pour tester la stabilité.",
      "sentence_en": "Canary release gradually rolls out new versions to a small subset of users to test stability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "canary_deployment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "真理符合论认为真命题必须与客观事实相对应。",
      "sentence_pinyin": "Zhēnlǐ fúhélùn rènwéi zhēn mìngtí bìxū yǔ kèguān shìshí xiāng duìyìng.",
      "sentence_fr": "La théorie de la correspondance de la vérité soutient que les propositions vraies doivent correspondre aux faits objectifs.",
      "sentence_en": "The correspondence theory of truth holds that true propositions must correspond to objective facts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "correspondence_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "特征标志系统允许在运行时动态启用或禁用功能。",
      "sentence_pinyin": "Tèzhēng biāozhì xìtǒng yǔnxǔ zài yùnxíng shí dòngtài qǐyòng huò jìnyòng gōngnéng.",
      "sentence_fr": "Les systèmes de feature flags permettent d'activer ou de désactiver dynamiquement des fonctionnalités à l'exécution.",
      "sentence_en": "Feature flag systems allow dynamically enabling or disabling features at runtime.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "feature_flags",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宜居带是恒星周围液态水可能存在的轨道区域。",
      "sentence_pinyin": "Yíjū dài shì héngxīng zhōuwéi yètài shuǐ kěnéng cúnzài de guǐdào qūyù.",
      "sentence_fr": "La zone habitable est la région orbitale autour d'une étoile où l'eau liquide pourrait exister.",
      "sentence_en": "The habitable zone is the orbital region around a star where liquid water could potentially exist.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "habitable_zone",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识证明允许证明方在不透露信息的情况下验证声明。",
      "sentence_pinyin": "Líng zhīshì zhèngmíng yǔnxǔ zhèngmíng fāng zài bù tòulù xìnxī de qíngkuàng xià yànzhèng shēngmíng.",
      "sentence_fr": "Les preuves à connaissance nulle permettent à un prouveur de vérifier une affirmation sans révéler d'informations.",
      "sentence_en": "Zero-knowledge proofs allow a prover to verify a claim without revealing information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_knowledge_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "滚动更新策略逐步替换旧版本实例以保持服务可用性。",
      "sentence_pinyin": "Gǔndòng gēngxīn cèlüè zhúbù tìhuàn jiù bǎnběn shílì yǐ bǎochí fúwù kěyòngxìng.",
      "sentence_fr": "La stratégie de mise à jour continue remplace progressivement les instances de l'ancienne version pour maintenir la disponibilité du service.",
      "sentence_en": "Rolling update strategy gradually replaces old version instances to maintain service availability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rolling_updates",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "真理融贯论认为命题的真假取决于与信念体系的一致性。",
      "sentence_pinyin": "Zhēnlǐ róngguànlùn rènwéi mìngtí de zhēn jiǎ qǔjué yú yǔ xìnniàn tǐxì de yīzhìxìng.",
      "sentence_fr": "La théorie cohérentiste de la vérité soutient que la vérité d'une proposition dépend de sa cohérence avec un système de croyances.",
      "sentence_en": "The coherence theory of truth holds that a proposition's truth depends on consistency with a belief system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "coherence_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可变基础设施原则要求通过替换而非修改来更新系统。",
      "sentence_pinyin": "Bùkě biàn jīchǔ shèshī yuánzé yāoqiú tōngguò tìhuàn ér fēi xiūgǎi lái gēngxīn xìtǒng.",
      "sentence_fr": "Le principe d'infrastructure immuable exige de mettre à jour les systèmes par remplacement plutôt que par modification.",
      "sentence_en": "The immutable infrastructure principle requires updating systems through replacement rather than modification.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immutable_infrastructure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
