{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子色动力学解释了夸克之间的强相互作用机制。",
      "sentence_pinyin": "Liàngzǐ sèdònglìxué jiěshì le kuākè zhījiān de qiáng xiānghù zuòyòng jīzhì.",
      "sentence_fr": "La chromodynamique quantique explique le mécanisme d'interaction forte entre les quarks.",
      "sentence_en": "Quantum chromodynamics explains the strong interaction mechanism between quarks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "particle_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业并购整合需要深入分析战略协同效应和文化兼容性。",
      "sentence_pinyin": "Qǐyè bìnggòu zhěnghé xūyào shēnrù fēnxī zhànlüè xiétóng xiàoyìng hé wénhuà jiānróngxìng.",
      "sentence_fr": "L'intégration des fusions-acquisitions nécessite une analyse approfondie des synergies stratégiques et de la compatibilité culturelle.",
      "sentence_en": "Merger and acquisition integration requires in-depth analysis of strategic synergies and cultural compatibility.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_mergers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密码学哈希函数确保数据完整性和数字签名的有效性。",
      "sentence_pinyin": "Mìmǎxué hāxī hánshù quèbǎo shùjù wánzhěngxìng hé shùzì qiānmíng de yǒuxiàoxìng.",
      "sentence_fr": "Les fonctions de hachage cryptographique garantissent l'intégrité des données et la validité des signatures numériques.",
      "sentence_en": "Cryptographic hash functions ensure data integrity and the validity of digital signatures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cryptographic_functions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "存在主义哲学强调个人自由选择和对生命意义的主观建构。",
      "sentence_pinyin": "Cúnzài zhǔyì zhéxué qiángdiào gèrén zìyóu xuǎnzé hé duì shēngmìng yìyì de zhǔguān jiàngòu.",
      "sentence_fr": "La philosophie existentialiste met l'accent sur le libre choix individuel et la construction subjective du sens de la vie.",
      "sentence_en": "Existentialist philosophy emphasizes individual free choice and the subjective construction of life's meaning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "existentialist_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经网络深度学习模型通过反向传播算法优化权重参数。",
      "sentence_pinyin": "Shénjīng wǎngluò shēndù xuéxí móxíng tōngguò fǎnxiàng chuánbò suànfǎ yōuhuà quánzhòng cānshù.",
      "sentence_fr": "Les modèles d'apprentissage profond des réseaux neuronaux optimisent les paramètres de poids par rétropropagation.",
      "sentence_en": "Neural network deep learning models optimize weight parameters through backpropagation algorithms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deep_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电磁波谱涵盖从无线电波到伽马射线的广泛频率范围。",
      "sentence_pinyin": "Diàncí bōpǔ hángài cóng wúxiàndiàn bō dào jiāmǎ shèxiàn de guǎngfàn pínlǜ fànwéi.",
      "sentence_fr": "Le spectre électromagnétique couvre une large gamme de fréquences allant des ondes radio aux rayons gamma.",
      "sentence_en": "The electromagnetic spectrum covers a wide frequency range from radio waves to gamma rays.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "electromagnetic_spectrum",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业社会责任报告披露公司在环境和社会方面的绩效。",
      "sentence_pinyin": "Qǐyè shèhuì zérèn bàogào pīlù gōngsī zài huánjìng hé shèhuì fāngmiàn de jīxiào.",
      "sentence_fr": "Les rapports de responsabilité sociale des entreprises divulguent les performances environnementales et sociales de l'entreprise.",
      "sentence_en": "Corporate social responsibility reports disclose the company's environmental and social performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_responsibility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公钥基础设施支持数字证书的签发和身份认证服务。",
      "sentence_pinyin": "Gōngyào jīchǔ shèshī zhīchí shùzì zhèngshū de qiānfā hé shēnfèn rènzhèng fúwù.",
      "sentence_fr": "L'infrastructure à clé publique prend en charge l'émission de certificats numériques et les services d'authentification.",
      "sentence_en": "Public key infrastructure supports digital certificate issuance and identity authentication services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_key_infrastructure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现象学方法论要求研究者悬置先入为主的判断和假设。",
      "sentence_pinyin": "Xiànxiàngxué fāngfǎlùn yāoqiú yánjiūzhě xuánzhì xiānrù wéi zhǔ de pànduàn hé jiǎshè.",
      "sentence_fr": "La méthodologie phénoménologique exige que les chercheurs suspendent leurs jugements et hypothèses préconçus.",
      "sentence_en": "Phenomenological methodology requires researchers to suspend preconceived judgments and assumptions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "phenomenological_methodology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "卷积神经网络在图像识别和计算机视觉领域取得突破性进展。",
      "sentence_pinyin": "Juànjī shénjīng wǎngluò zài túxiàng shìbié hé jìsuànjī shìjué lǐngyù qǔdé tūpòxìng jìnzhǎn.",
      "sentence_fr": "Les réseaux neuronaux convolutifs ont réalisé des avancées révolutionnaires dans la reconnaissance d'images et la vision par ordinateur.",
      "sentence_en": "Convolutional neural networks have achieved breakthrough progress in image recognition and computer vision.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "convolutional_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "热力学第二定律表明孤立系统的熵总是趋向于增加。",
      "sentence_pinyin": "Rèlìxué dì èr dìnglǜ biǎomíng gūlì xìtǒng de shāng zǒng shì qūxiàng yú zēngjiā.",
      "sentence_fr": "La deuxième loi de la thermodynamique stipule que l'entropie d'un système isolé tend toujours à augmenter.",
      "sentence_en": "The second law of thermodynamics states that the entropy of an isolated system always tends to increase.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "thermodynamic_laws",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "对冲基金采用多种复杂策略来获取绝对收益和管理风险。",
      "sentence_pinyin": "Duìchōng jījīn cǎiyòng duō zhǒng fùzá cèlüè lái huòqǔ juéduì shōuyì hé guǎnlǐ fēngxiǎn.",
      "sentence_fr": "Les fonds spéculatifs emploient diverses stratégies complexes pour générer des rendements absolus et gérer les risques.",
      "sentence_en": "Hedge funds employ various complex strategies to generate absolute returns and manage risk.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hedge_fund_strategies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零信任安全架构要求对每次访问请求进行持续验证。",
      "sentence_pinyin": "Líng xìnrèn ānquán jiàgòu yāoqiú duì měi cì fǎngwèn qǐngqiú jìnxíng chíxù yànzhèng.",
      "sentence_fr": "L'architecture de sécurité zéro confiance exige une vérification continue pour chaque demande d'accès.",
      "sentence_en": "Zero trust security architecture requires continuous verification for every access request.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_trust_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "结构主义语言学分析语言系统中符号之间的关系网络。",
      "sentence_pinyin": "Jiégòu zhǔyì yǔyánxué fēnxī yǔyán xìtǒng zhōng fúhào zhījiān de guānxì wǎngluò.",
      "sentence_fr": "La linguistique structuraliste analyse le réseau de relations entre les signes dans le système linguistique.",
      "sentence_en": "Structuralist linguistics analyzes the network of relations between signs in the language system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "structuralist_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循环神经网络特别适合处理序列数据和时间序列预测。",
      "sentence_pinyin": "Xúnhuán shénjīng wǎngluò tèbié shìhé chǔlǐ xùliè shùjù hé shíjiān xùliè yùcè.",
      "sentence_fr": "Les réseaux neuronaux récurrents sont particulièrement adaptés au traitement des données séquentielles et à la prédiction des séries temporelles.",
      "sentence_en": "Recurrent neural networks are particularly suited for processing sequential data and time series prediction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "recurrent_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "狭义相对论揭示了时间膨胀和长度收缩等反直觉现象。",
      "sentence_pinyin": "Xiáyì xiāngduìlùn jiēshì le shíjiān péngzhàng hé chángdù shōusuō děng fǎn zhíjué xiànxiàng.",
      "sentence_fr": "La relativité restreinte révèle des phénomènes contre-intuitifs comme la dilatation du temps et la contraction des longueurs.",
      "sentence_en": "Special relativity reveals counter-intuitive phenomena such as time dilation and length contraction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "special_relativity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "私募股权投资通常涉及杠杆收购和企业重组策略。",
      "sentence_pinyin": "Sīmù gǔquán tóuzī tōngcháng shèjí gànggǎn shōugòu hé qǐyè chóngzǔ cèlüè.",
      "sentence_fr": "Les investissements en capital-investissement impliquent généralement des rachats par effet de levier et des stratégies de restructuration d'entreprise.",
      "sentence_en": "Private equity investments typically involve leveraged buyouts and corporate restructuring strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "private_equity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全运营中心全天候监控网络威胁和安全事件。",
      "sentence_pinyin": "Ānquán yùnyíng zhōngxīn quántiānhòu jiānkòng wǎngluò wēixié hé ānquán shìjiàn.",
      "sentence_fr": "Le centre des opérations de sécurité surveille les menaces réseau et les incidents de sécurité 24 heures sur 24.",
      "sentence_en": "The security operations center monitors network threats and security incidents around the clock.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_operations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后现代主义质疑宏大叙事并强调知识的相对性和多元性。",
      "sentence_pinyin": "Hòuxiàndài zhǔyì zhìyí hóngdà xùshì bìng qiángdiào zhīshì de xiāngduìxìng hé duōyuánxìng.",
      "sentence_fr": "Le postmodernisme remet en question les grands récits et souligne la relativité et la pluralité du savoir.",
      "sentence_en": "Postmodernism questions grand narratives and emphasizes the relativity and plurality of knowledge.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "postmodernist_thought",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生成对抗网络通过两个神经网络的博弈实现高质量图像生成。",
      "sentence_pinyin": "Shēngchéng duìkàng wǎngluò tōngguò liǎng gè shénjīng wǎngluò de bóyì shíxiàn gāo zhìliàng túxiàng shēngchéng.",
      "sentence_fr": "Les réseaux antagonistes génératifs réalisent la génération d'images de haute qualité par le jeu de deux réseaux neuronaux.",
      "sentence_en": "Generative adversarial networks achieve high-quality image generation through the game of two neural networks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "generative_adversarial_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
