{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个手语翻译软件帮助听障人士更好地与外界沟通交流。",
      "sentence_pinyin": "Zhège shǒuyǔ fānyì ruǎnjiàn bāngzhù tīngzhàng rénshì gèng hǎo de yǔ wàijiè gōutōng jiāoliú.",
      "sentence_fr": "Ce logiciel de traduction en langue des signes aide les personnes malentendantes à mieux communiquer avec le monde extérieur.",
      "sentence_en": "This sign language translation software helps hearing-impaired people better communicate with the outside world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sign_language_tech",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在琵琶演奏中融入了现代音乐元素，创造了独特的艺术风格。",
      "sentence_pinyin": "Tā zài pípá yǎnzòu zhōng róngrùle xiàndài yīnyuè yuánsù, chuàngzàole dútè de yìshù fēnggé.",
      "sentence_fr": "Elle a intégré des éléments de musique moderne dans son jeu de pipa, créant un style artistique unique.",
      "sentence_en": "She integrated modern music elements into her pipa playing, creating a unique artistic style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_music",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市空气质量监测网络实时发布污染物浓度数据。",
      "sentence_pinyin": "Zhège chéngshì kōngqì zhìliàng jiāncè wǎngluò shíshí fābù wūrǎnwù nóngdù shùjù.",
      "sentence_fr": "Ce réseau de surveillance de la qualité de l'air urbain publie en temps réel les données de concentration des polluants.",
      "sentence_en": "This urban air quality monitoring network publishes real-time pollutant concentration data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "air_quality_monitoring",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在创意写作课程中激发了学生的想象力和表达能力。",
      "sentence_pinyin": "Tā zài chuàngyì xiězuò kèchéng zhōng jīfāle xuésheng de xiǎngxiànglì hé biǎodá nénglì.",
      "sentence_fr": "Dans son cours d'écriture créative, il a stimulé l'imagination et les capacités d'expression des étudiants.",
      "sentence_en": "In his creative writing course, he stimulated students' imagination and expression abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "creative_writing",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个无障碍改造项目为残疾人士提供了便利的生活环境。",
      "sentence_pinyin": "Zhège wúzhàng'ài gǎizào xiàngmù wèi cánjí rénshì tígōngle biànlì de shēnghuó huánjìng.",
      "sentence_fr": "Ce projet de rénovation d'accessibilité fournit un environnement de vie pratique pour les personnes handicapées.",
      "sentence_en": "This accessibility renovation project provides a convenient living environment for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "accessibility_projects",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的行为艺术作品挑战了观众对传统艺术形式的认知。",
      "sentence_pinyin": "Tā de xíngwéi yìshù zuòpǐn tiǎozhànle guānzhòng duì chuántǒng yìshù xíngshì de rènzhī.",
      "sentence_fr": "Ses œuvres d'art performance ont défié la perception du public sur les formes d'art traditionnelles.",
      "sentence_en": "Her performance art works challenged the audience's perception of traditional art forms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "performance_art",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市湿地公园保护了多种珍稀水鸟的栖息地。",
      "sentence_pinyin": "Zhège chéngshì shīdì gōngyuán bǎohùle duō zhǒng zhēnxī shuǐniǎo de qīxīdì.",
      "sentence_fr": "Ce parc de zones humides urbaines protège les habitats de plusieurs espèces rares d'oiseaux aquatiques.",
      "sentence_en": "This urban wetland park protects the habitats of multiple rare waterbird species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wetland_conservation",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在柔道比赛中展现了高超的技术和顽强的斗志。",
      "sentence_pinyin": "Tā zài róudào bǐsài zhōng zhǎnxiànle gāochāo de jìshù hé wánqiáng de dòuzhì.",
      "sentence_fr": "Il a démontré une technique supérieure et un esprit combatif tenace lors du tournoi de judo.",
      "sentence_en": "He demonstrated superior technique and tenacious fighting spirit in the judo tournament.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "judo",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个医药研发中心专注于攻克罕见疾病的治疗难题。",
      "sentence_pinyin": "Zhège yīyào yánfā zhōngxīn zhuānzhù yú gōngkè hǎnjiàn jíbìng de zhìliáo nántí.",
      "sentence_fr": "Ce centre de recherche pharmaceutique se concentre sur la résolution des défis thérapeutiques des maladies rares.",
      "sentence_en": "This pharmaceutical research center focuses on overcoming therapeutic challenges of rare diseases.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pharmaceutical_research",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在旗袍设计中保留了传统元素并加入了现代剪裁理念。",
      "sentence_pinyin": "Tā zài qípáo shèjì zhōng bǎoliúle chuántǒng yuánsù bìng jiārùle xiàndài jiǎncái lǐniàn.",
      "sentence_fr": "Dans la conception de qipao, elle a conservé les éléments traditionnels tout en intégrant des concepts de coupe modernes.",
      "sentence_en": "In qipao design, she retained traditional elements while incorporating modern tailoring concepts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qipao_design",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线招聘平台利用人工智能技术实现精准的人岗匹配。",
      "sentence_pinyin": "Zhège zàixiàn zhāopìn píngtái lìyòng réngōng zhìnéng jìshù shíxiàn jīngzhǔn de rén gǎng pǐpèi.",
      "sentence_fr": "Cette plateforme de recrutement en ligne utilise la technologie d'intelligence artificielle pour réaliser un appariement précis entre personnes et postes.",
      "sentence_en": "This online recruitment platform uses artificial intelligence technology to achieve precise person-position matching.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "recruitment_platforms",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在纪录片拍摄中运用了航拍和延时摄影等多种手法。",
      "sentence_pinyin": "Tā zài jìlùpiàn pāishè zhōng yùnyòngle hángpāi hé yánshí shèyǐng děng duō zhǒng shǒufǎ.",
      "sentence_fr": "Dans le tournage de documentaires, il a utilisé diverses techniques comme la photographie aérienne et le time-lapse.",
      "sentence_en": "In documentary filming, he used various techniques such as aerial photography and time-lapse.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "documentary_techniques",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个绿色出行倡议鼓励市民选择公共交通和自行车代步。",
      "sentence_pinyin": "Zhège lǜsè chūxíng chàngyì gǔlì shìmín xuǎnzé gōnggòng jiāotōng hé zìxíngchē dàibù.",
      "sentence_fr": "Cette initiative de mobilité verte encourage les citoyens à choisir les transports publics et le vélo pour se déplacer.",
      "sentence_en": "This green mobility initiative encourages citizens to choose public transportation and bicycles for commuting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_mobility",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的玻璃艺术作品通过光影变化展现了独特的美感。",
      "sentence_pinyin": "Tā de bōli yìshù zuòpǐn tōngguò guāngyǐng biànhuà zhǎnxiànle dútè de měigǎn.",
      "sentence_fr": "Ses œuvres d'art en verre présentent une beauté unique à travers les changements de lumière et d'ombre.",
      "sentence_en": "Her glass art works present unique beauty through light and shadow changes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "glass_art",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技夏令营为青少年提供了机器人编程和3D打印体验。",
      "sentence_pinyin": "Zhège kējì xiàlìngyíng wèi qīngshàonián tígōngle jīqìrén biānchéng hé 3D dǎyìn tǐyàn.",
      "sentence_fr": "Ce camp d'été technologique offre aux jeunes des expériences de programmation de robots et d'impression 3D.",
      "sentence_en": "This technology summer camp offers youth robot programming and 3D printing experiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tech_camps",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在冰壶运动中掌握了精确的力度控制和战术布局。",
      "sentence_pinyin": "Tā zài bīnghú yùndòng zhōng zhǎngwòle jīngquè de lìdù kòngzhì hé zhànshù bùjú.",
      "sentence_fr": "Dans le curling, il a maîtrisé le contrôle précis de la force et la disposition tactique.",
      "sentence_en": "In curling, he mastered precise force control and tactical positioning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "curling",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区康复中心为老年人提供物理治疗和康复训练服务。",
      "sentence_pinyin": "Zhège shèqū kāngfù zhōngxīn wèi lǎoniánrén tígōng wùlǐ zhìliáo hé kāngfù xùnliàn fúwù.",
      "sentence_fr": "Ce centre de réadaptation communautaire fournit des services de physiothérapie et d'entraînement de rééducation aux personnes âgées.",
      "sentence_en": "This community rehabilitation center provides physical therapy and rehabilitation training services for the elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rehabilitation_centers",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在漫画创作中塑造了许多深受读者喜爱的经典角色。",
      "sentence_pinyin": "Tā zài mànhuà chuàngzuò zhōng sùzàole xǔduō shēnshòu dúzhě xǐ'ài de jīngdiǎn juésè.",
      "sentence_fr": "Dans la création de bandes dessinées, elle a créé de nombreux personnages classiques très appréciés des lecteurs.",
      "sentence_en": "In comic creation, she created many classic characters beloved by readers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "comic_creation",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字货币钱包采用了多重加密技术保护用户资产安全。",
      "sentence_pinyin": "Zhège shùzì huòbì qiánbāo cǎiyòngle duōchóng jiāmì jìshù bǎohù yònghù zīchǎn ānquán.",
      "sentence_fr": "Ce portefeuille de monnaie numérique adopte une technologie de cryptage multiple pour protéger la sécurité des actifs des utilisateurs.",
      "sentence_en": "This digital currency wallet adopts multiple encryption technology to protect user asset security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_wallets",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在帆船比赛中灵活应对了风向变化和海浪挑战。",
      "sentence_pinyin": "Tā zài fānchuán bǐsài zhōng línghuó yìngduìle fēngxiàng biànhuà hé hǎilàng tiǎozhàn.",
      "sentence_fr": "Lors de la course de voile, il a réagi avec flexibilité aux changements de direction du vent et aux défis des vagues.",
      "sentence_en": "In the sailing race, he flexibly responded to wind direction changes and wave challenges.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sailing",
      "created_at": "2025-11-20T19:00:00.000Z",
      "updated_at": "2025-11-20T19:00:00.000Z"
    }
  ]
}
