{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个新能源汽车展示中心展出了最新的电动车型和充电技术。",
      "sentence_pinyin": "Zhège xīn néngyuán qìchē zhǎnshì zhōngxīn zhǎnchūle zuìxīn de diàndòng chēxíng hé chōngdiàn jìshù.",
      "sentence_fr": "Ce centre d'exposition de véhicules à énergie nouvelle présente les derniers modèles électriques et technologies de recharge.",
      "sentence_en": "This new energy vehicle exhibition center displays the latest electric vehicle models and charging technologies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "automotive_exhibitions",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在戏剧表演中准确把握了角色的内心情感和性格特征。",
      "sentence_pinyin": "Tā zài xìjù biǎoyǎn zhōng zhǔnquè bǎwòle juésè de nèixīn qínggǎn hé xìnggé tèzhēng.",
      "sentence_fr": "Dans sa performance théâtrale, elle a saisi avec précision les émotions intérieures et les traits de caractère du rôle.",
      "sentence_en": "In her theatrical performance, she accurately grasped the character's inner emotions and personality traits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "theater_performance",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个空气净化器能够有效过滤室内的细菌和有害物质。",
      "sentence_pinyin": "Zhège kōngqì jìnghuàqì nénggòu yǒuxiào guòlǜ shìnèi de xìjūn hé yǒuhài wùzhì.",
      "sentence_fr": "Ce purificateur d'air peut filtrer efficacement les bactéries et substances nocives à l'intérieur.",
      "sentence_en": "This air purifier can effectively filter indoor bacteria and harmful substances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "air_purification",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在商务谈判中展现出出色的沟通技巧和应变能力。",
      "sentence_pinyin": "Tā zài shāngwù tánpàn zhōng zhǎnxiàn chū chūsè de gōutōng jìqiǎo hé yìngbiàn nénglì.",
      "sentence_fr": "Il a démontré d'excellentes compétences en communication et en adaptation lors des négociations commerciales.",
      "sentence_en": "He demonstrated excellent communication skills and adaptability in business negotiations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business_negotiation",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个古建筑修复工程严格按照传统工艺和历史资料进行。",
      "sentence_pinyin": "Zhège gǔ jiànzhù xiūfù gōngchéng yángé ànzhào chuántǒng gōngyì hé lìshǐ zīliào jìnxíng.",
      "sentence_fr": "Ce projet de restauration de bâtiment ancien est strictement réalisé selon les techniques traditionnelles et les documents historiques.",
      "sentence_en": "This ancient building restoration project is strictly carried out according to traditional craftsmanship and historical materials.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "historic_restoration",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的钢琴演奏技艺精湛，情感表达细腻动人。",
      "sentence_pinyin": "Tā de gāngqín yǎnzòu jìyì jīngzhàn, qínggǎn biǎodá xìnì dòngrén.",
      "sentence_fr": "Sa technique de piano est exquise, son expression émotionnelle délicate et touchante.",
      "sentence_en": "Her piano playing technique is exquisite, her emotional expression delicate and moving.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "piano_performance",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线问诊平台连接了患者和专业医生，提供远程医疗咨询。",
      "sentence_pinyin": "Zhège zàixiàn wènzhěn píngtái liánjiēle huànzhě hé zhuānyè yīshēng, tígōng yuǎnchéng yīliáo zīxún.",
      "sentence_fr": "Cette plateforme de consultation en ligne connecte les patients et les médecins professionnels, offrant des consultations médicales à distance.",
      "sentence_en": "This online consultation platform connects patients with professional doctors, providing remote medical consultations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_healthcare",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在研究过程中发现了一个具有重要应用价值的新材料。",
      "sentence_pinyin": "Tā zài yánjiū guòchéng zhōng fāxiànle yī ge jùyǒu zhòngyào yìngyòng jiàzhí de xīn cáiliào.",
      "sentence_fr": "Au cours de ses recherches, il a découvert un nouveau matériau ayant une importante valeur d'application.",
      "sentence_en": "During his research, he discovered a new material with important application value.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "materials_science",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个美食纪录片记录了各地独特的饮食文化和传统烹饪技艺。",
      "sentence_pinyin": "Zhège měishí jìlùpiàn jìlùle gèdì dútè de yǐnshí wénhuà hé chuántǒng pēngrèn jìyì.",
      "sentence_fr": "Ce documentaire culinaire enregistre les cultures alimentaires uniques et les techniques de cuisine traditionnelles de diverses régions.",
      "sentence_en": "This culinary documentary records unique food cultures and traditional cooking techniques from various regions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_documentaries",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过系统学习掌握了数据分析和可视化的专业技能。",
      "sentence_pinyin": "Tā tōngguò xìtǒng xuéxí zhǎngwòle shùjù fēnxī hé kěshìhuà de zhuānyè jìnéng.",
      "sentence_fr": "Grâce à un apprentissage systématique, elle a maîtrisé les compétences professionnelles en analyse de données et visualisation.",
      "sentence_en": "Through systematic learning, she mastered professional skills in data analysis and visualization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "data_visualization",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个高铁项目缩短了两座城市之间的通行时间。",
      "sentence_pinyin": "Zhège gāotiě xiàngmù suōduǎnle liǎng zuò chéngshì zhījiān de tōngxíng shíjiān.",
      "sentence_fr": "Ce projet de train à grande vitesse a réduit le temps de trajet entre les deux villes.",
      "sentence_en": "This high-speed rail project shortened the travel time between the two cities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "high_speed_rail",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在写作中运用了丰富的修辞手法，增强了文章的表现力。",
      "sentence_pinyin": "Tā zài xiězuò zhōng yùnyòngle fēngfù de xiūcí shǒufǎ, zēngqiángle wénzhāng de biǎoxiànlì.",
      "sentence_fr": "Dans son écriture, il a utilisé de riches procédés rhétoriques, renforçant l'expressivité de l'article.",
      "sentence_en": "In his writing, he used rich rhetorical devices, enhancing the article's expressiveness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rhetoric",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个宠物医院配备了先进的医疗设备和专业的兽医团队。",
      "sentence_pinyin": "Zhège chǒngwù yīyuàn pèibèile xiānjìn de yīliáo shèbèi hé zhuānyè de shòuyī tuánduì.",
      "sentence_fr": "Cet hôpital vétérinaire est équipé d'équipements médicaux avancés et d'une équipe de vétérinaires professionnels.",
      "sentence_en": "This pet hospital is equipped with advanced medical equipment and a professional veterinary team.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "veterinary_care",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的服装设计获得了国际时尚设计大奖的认可。",
      "sentence_pinyin": "Tā de fúzhuāng shèjì huòdéle guójì shíshàng shèjì dàjiǎng de rènkě.",
      "sentence_fr": "Sa création de mode a reçu la reconnaissance d'un grand prix international de design de mode.",
      "sentence_en": "Her fashion design received recognition from an international fashion design grand prix.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fashion_awards",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能停车系统通过传感器和算法优化了停车场的使用效率。",
      "sentence_pinyin": "Zhège zhìnéng tíngchē xìtǒng tōngguò chuángǎnqì hé suànfǎ yōuhuàle tíngchēchǎng de shǐyòng xiàolǜ.",
      "sentence_fr": "Ce système de stationnement intelligent optimise l'efficacité d'utilisation des parkings grâce à des capteurs et des algorithmes.",
      "sentence_en": "This intelligent parking system optimizes parking lot usage efficiency through sensors and algorithms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在电影配乐创作中融合了古典音乐和现代电子音乐元素。",
      "sentence_pinyin": "Tā zài diànyǐng pèiyuè chuàngzuò zhōng rónghéle gǔdiǎn yīnyuè hé xiàndài diànzǐ yīnyuè yuánsù.",
      "sentence_fr": "Dans la création de musiques de film, il a fusionné des éléments de musique classique et de musique électronique moderne.",
      "sentence_en": "In film score composition, he blended classical music and modern electronic music elements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "film_scoring",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个少儿编程课程培养孩子的逻辑思维和创新能力。",
      "sentence_pinyin": "Zhège shào'ér biānchéng kèchéng péiyǎng háizi de luójí sīwéi hé chuàngxīn nénglì.",
      "sentence_fr": "Ce cours de programmation pour enfants développe la pensée logique et les capacités d'innovation des enfants.",
      "sentence_en": "This children's programming course develops children's logical thinking and innovation abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "coding_education",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在社会工作中关注弱势群体的权益保障和生活改善。",
      "sentence_pinyin": "Tā zài shèhuì gōngzuò zhōng guānzhù ruòshì qúntǐ de quányì bǎozhàng hé shēnghuó gǎishàn.",
      "sentence_fr": "Dans son travail social, elle se concentre sur la protection des droits et l'amélioration de la vie des groupes vulnérables.",
      "sentence_en": "In her social work, she focuses on protecting the rights and improving the lives of vulnerable groups.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_work",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个葡萄酒庄园采用有机种植方式，酿造出高品质的葡萄酒。",
      "sentence_pinyin": "Zhège pútaojiǔ zhuāngyuán cǎiyòng yǒujī zhòngzhí fāngshì, niàngzào chū gāo pǐnzhì de pútaojiǔ.",
      "sentence_fr": "Ce domaine viticole utilise des méthodes de culture biologique pour produire des vins de haute qualité.",
      "sentence_en": "This vineyard estate uses organic farming methods to produce high-quality wines.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "winemaking",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在马拉松训练中逐步提高了耐力和速度。",
      "sentence_pinyin": "Tā zài mǎlāsōng xùnliàn zhōng zhúbù tígāole nàilì hé sùdù.",
      "sentence_fr": "Lors de son entraînement au marathon, il a progressivement amélioré son endurance et sa vitesse.",
      "sentence_en": "During marathon training, he gradually improved his endurance and speed.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "marathon_training",
      "created_at": "2025-11-20T18:15:00.000Z",
      "updated_at": "2025-11-20T18:15:00.000Z"
    }
  ]
}
