{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "赫罗图通过恒星的光度和温度揭示其演化阶段。",
      "sentence_pinyin": "Hèluó tú tōngguò héngxīng de guāngdù hé wēndù jiēshì qí yǎnhuà jiēduàn.",
      "sentence_fr": "Le diagramme de Hertzsprung-Russell révèle les stades d'évolution des étoiles par leur luminosité et leur température.",
      "sentence_en": "The Hertzsprung-Russell diagram reveals stellar evolution stages through luminosity and temperature.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hertzsprung_russell_diagram",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "乐观锁定策略通过版本控制避免并发写入冲突。",
      "sentence_pinyin": "Lèguān suǒdìng cèlüè tōngguò bǎnběn kòngzhì bìmiǎn bìngfā xiěrù chōngtū.",
      "sentence_fr": "Les stratégies de verrouillage optimiste évitent les conflits d'écriture concurrents par le contrôle de version.",
      "sentence_en": "Optimistic locking strategies avoid concurrent write conflicts through version control.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optimistic_locking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "聚合签名允许将多个签名压缩为单个验证证明。",
      "sentence_pinyin": "Jùhé qiānmíng yǔnxǔ jiāng duō gè qiānmíng yāsuō wéi dāngè yànzhèng zhèngmíng.",
      "sentence_fr": "Les signatures agrégées permettent de compresser plusieurs signatures en une seule preuve de vérification.",
      "sentence_en": "Aggregate signatures allow compressing multiple signatures into a single verification proof.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "aggregate_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学实在论认为成功的科学理论描述了真实的世界结构。",
      "sentence_pinyin": "Kēxué shízàilùn rènwéi chénggōng de kēxué lǐlùn miáoshù le zhēnshí de shìjiè jiégòu.",
      "sentence_fr": "Le réalisme scientifique soutient que les théories scientifiques réussies décrivent les structures réelles du monde.",
      "sentence_en": "Scientific realism holds that successful scientific theories describe real world structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "scientific_realism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式锁服务协调跨节点的互斥资源访问。",
      "sentence_pinyin": "Fēnbùshì suǒ fúwù xiétiáo kuà jiédiǎn de hùchì zīyuán fǎngwèn.",
      "sentence_fr": "Les services de verrou distribué coordonnent l'accès exclusif aux ressources entre les nœuds.",
      "sentence_en": "Distributed lock services coordinate mutually exclusive resource access across nodes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_locks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "主序星是恒星生命周期中氢核聚变最稳定的阶段。",
      "sentence_pinyin": "Zhǔxùxīng shì héngxīng shēngmìng zhōuqī zhōng qīng hé jùbiàn zuì wěndìng de jiēduàn.",
      "sentence_fr": "Les étoiles de la séquence principale sont au stade le plus stable de fusion de l'hydrogène du cycle de vie stellaire.",
      "sentence_en": "Main sequence stars are at the most stable hydrogen fusion stage of the stellar life cycle.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "main_sequence_stars",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "侧链技术允许资产在主链和辅助链之间双向转移。",
      "sentence_pinyin": "Cè liàn jìshù yǔnxǔ zīchǎn zài zhǔ liàn hé fǔzhù liàn zhījiān shuāngxiàng zhuǎnyí.",
      "sentence_fr": "La technologie des sidechains permet le transfert bidirectionnel d'actifs entre la chaîne principale et les chaînes auxiliaires.",
      "sentence_en": "Sidechain technology allows bidirectional asset transfer between the main chain and auxiliary chains.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sidechain_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "事件溯源模式将状态变化记录为不可变的事件序列。",
      "sentence_pinyin": "Shìjiàn sùyuán móshì jiāng zhuàngtài biànhuà jìlù wéi bùkě biàn de shìjiàn xùliè.",
      "sentence_fr": "Le modèle d'event sourcing enregistre les changements d'état sous forme de séquences d'événements immuables.",
      "sentence_en": "Event sourcing pattern records state changes as immutable event sequences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "event_sourcing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工具主义认为科学理论只是预测现象的有用工具。",
      "sentence_pinyin": "Gōngjù zhǔyì rènwéi kēxué lǐlùn zhǐshì yùcè xiànxiàng de yǒuyòng gōngjù.",
      "sentence_fr": "L'instrumentalisme soutient que les théories scientifiques ne sont que des outils utiles pour prédire les phénomènes.",
      "sentence_en": "Instrumentalism holds that scientific theories are merely useful tools for predicting phenomena.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "instrumentalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "读写分离架构将查询负载分散到从库以提高性能。",
      "sentence_pinyin": "Dú xiě fēnlí jiàgòu jiāng cháxún fùzài fēnsàn dào cóng kù yǐ tígāo xìngnéng.",
      "sentence_fr": "L'architecture de séparation lecture-écriture distribue la charge des requêtes aux réplicas pour améliorer les performances.",
      "sentence_en": "Read-write separation architecture distributes query load to replicas to improve performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "read_write_separation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "恒星光谱分类揭示恒星的化学组成和物理特性。",
      "sentence_pinyin": "Héngxīng guāngpǔ fēnlèi jiēshì héngxīng de huàxué zǔchéng hé wùlǐ tèxìng.",
      "sentence_fr": "La classification spectrale des étoiles révèle leur composition chimique et leurs propriétés physiques.",
      "sentence_en": "Stellar spectral classification reveals stars' chemical composition and physical properties.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stellar_spectral_classification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "卷积技术将大量小额交易合并为单笔链上结算。",
      "sentence_pinyin": "Juǎnjī jìshù jiāng dàliàng xiǎo'é jiāoyì hébìng wéi dān bǐ liàn shàng jiésuàn.",
      "sentence_fr": "Les techniques de rollup regroupent de nombreuses petites transactions en un seul règlement sur la chaîne.",
      "sentence_en": "Rollup technology combines many small transactions into a single on-chain settlement.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rollup_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "命令查询职责分离将读写操作分配到不同的模型。",
      "sentence_pinyin": "Mìnglìng cháxún zhízé fēnlí jiāng dú xiě cāozuò fēnpèi dào bùtóng de móxíng.",
      "sentence_fr": "La séparation des responsabilités de commande et de requête attribue les opérations de lecture et d'écriture à différents modèles.",
      "sentence_en": "Command query responsibility segregation assigns read and write operations to different models.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cqrs_pattern",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "构造经验主义接受观察等价的理论而不承诺其真理性。",
      "sentence_pinyin": "Gòuzào jīngyàn zhǔyì jiēshòu guānchá děngjià de lǐlùn ér bù chéngnuò qí zhēnlǐxìng.",
      "sentence_fr": "L'empirisme constructif accepte les théories observationnellement équivalentes sans s'engager sur leur vérité.",
      "sentence_en": "Constructive empiricism accepts observationally equivalent theories without committing to their truth.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "constructive_empiricism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据复制策略在多个节点间同步数据以提高可用性。",
      "sentence_pinyin": "Shùjù fùzhì cèlüè zài duō gè jiédiǎn jiān tóngbù shùjù yǐ tígāo kěyòngxìng.",
      "sentence_fr": "Les stratégies de réplication de données synchronisent les données entre plusieurs nœuds pour améliorer la disponibilité.",
      "sentence_en": "Data replication strategies synchronize data across multiple nodes to improve availability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_replication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "变星通过亮度变化提供测量宇宙距离的标准烛光。",
      "sentence_pinyin": "Biànxīng tōngguò liàngdù biànhuà tígōng cèliáng yǔzhòu jùlí de biāozhǔn zhúguāng.",
      "sentence_fr": "Les étoiles variables fournissent des chandelles standard pour mesurer les distances cosmiques grâce à leurs variations de luminosité.",
      "sentence_en": "Variable stars provide standard candles for measuring cosmic distances through brightness variations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "variable_stars",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "验证者节点通过质押代币参与区块链共识过程。",
      "sentence_pinyin": "Yànzhèngzhě jiédiǎn tōngguò zhìyā dàibì cānyù qūkuàiliàn gòngshí guòchéng.",
      "sentence_fr": "Les nœuds validateurs participent au processus de consensus blockchain en mettant en jeu des jetons.",
      "sentence_en": "Validator nodes participate in blockchain consensus process by staking tokens.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "validator_nodes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "最终一致性模型允许数据在短暂不一致后最终同步。",
      "sentence_pinyin": "Zuìzhōng yīzhìxìng móxíng yǔnxǔ shùjù zài duǎnzàn bù yīzhì hòu zuìzhōng tóngbù.",
      "sentence_fr": "Le modèle de cohérence éventuelle permet aux données de se synchroniser finalement après une brève incohérence.",
      "sentence_en": "Eventual consistency model allows data to eventually synchronize after brief inconsistency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "eventual_consistency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "理论负载观察认为科学观察总是受到理论预设影响。",
      "sentence_pinyin": "Lǐlùn fùzài guānchá rènwéi kēxué guānchá zǒng shì shòudào lǐlùn yùshè yǐngxiǎng.",
      "sentence_fr": "L'observation chargée de théorie soutient que les observations scientifiques sont toujours influencées par des présupposés théoriques.",
      "sentence_en": "Theory-laden observation holds that scientific observations are always influenced by theoretical presuppositions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "theory_laden_observation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分区容错性是分布式系统在网络分区时继续运行的能力。",
      "sentence_pinyin": "Fēnqū róngcuòxìng shì fēnbùshì xìtǒng zài wǎngluò fēnqū shí jìxù yùnxíng de nénglì.",
      "sentence_fr": "La tolérance aux partitions est la capacité d'un système distribué à continuer de fonctionner lors de partitions réseau.",
      "sentence_en": "Partition tolerance is a distributed system's ability to continue operating during network partitions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "partition_tolerance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
