{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "中国传统木雕工艺讲究因材施艺,根据木材的纹理特点进行创作。",
      "sentence_pinyin": "Zhōngguó chuántǒng mùdiāo gōngyì jiǎngjiù yīncái shīyì, gēnjù mùcái de wénlǐ tèdiǎn jìnxíng chuàngzuò.",
      "sentence_fr": "L'artisanat traditionnel chinois de sculpture sur bois met l'accent sur l'adaptation au matériau, créant selon les caractéristiques du grain du bois.",
      "sentence_en": "Traditional Chinese wood carving craftsmanship emphasizes adapting to the material, creating according to the wood grain characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wood_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能投影仪可以自动对焦和梯形校正,即使斜放也能投出方正画面。",
      "sentence_pinyin": "Zhìnéng tóuyǐngyí kěyǐ zìdòng duìjiāo hé tīxíng jiàozhèng, jíshǐ xiéfàng yě néng tóuchū fāngzhèng huàmiàn.",
      "sentence_fr": "Le projecteur intelligent peut effectuer automatiquement la mise au point et la correction trapézoïdale, projetant une image rectangulaire même lorsqu'il est placé de biais.",
      "sentence_en": "The smart projector can automatically focus and correct keystone distortion, projecting a rectangular image even when placed at an angle.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_projectors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "葫芦丝是云南少数民族的传统乐器,音色柔美,常用于演奏抒情曲目。",
      "sentence_pinyin": "Húlúsī shì Yúnnán shǎoshù mínzú de chuántǒng yuèqì, yīnsè róuměi, cháng yòng yú yǎnzòu shūqíng qǔmù.",
      "sentence_fr": "Le hulusi est un instrument traditionnel des minorités ethniques du Yunnan, au timbre doux, souvent utilisé pour jouer des morceaux lyriques.",
      "sentence_en": "The hulusi is a traditional instrument of Yunnan's ethnic minorities, with a soft tone, often used to play lyrical pieces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hulusi_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市共享单车系统方便了市民的短途出行,减少了交通拥堵。",
      "sentence_pinyin": "Chéngshì gòngxiǎng dānchē xìtǒng fāngbiàn le shìmín de duǎntú chūxíng, jiǎnshǎo le jiāotōng yōngdǔ.",
      "sentence_fr": "Le système de vélos partagés urbains a facilité les déplacements courts des citadins et réduit les embouteillages.",
      "sentence_en": "The urban bike-sharing system has made short-distance travel convenient for residents and reduced traffic congestion.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bike_sharing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这件紫砂壶是宜兴著名工艺师的作品,造型古朴,手感温润。",
      "sentence_pinyin": "Zhè jiàn zǐshā hú shì Yíxīng zhùmíng gōngyìshī de zuòpǐn, zàoxíng gǔpǔ, shǒugǎn wēnrùn.",
      "sentence_fr": "Cette théière en argile pourpre est l'œuvre d'un célèbre artisan de Yixing, avec une forme antique et une texture douce au toucher.",
      "sentence_en": "This purple clay teapot is the work of a famous Yixing craftsman, with an antique shape and a warm, smooth texture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "purple_clay_pottery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能烘干机可以根据衣物材质自动选择烘干程序,防止衣物损坏。",
      "sentence_pinyin": "Zhìnéng hōnggānjī kěyǐ gēnjù yīwù cáizhì zìdòng xuǎnzé hōnggān chéngxù, fángzhǐ yīwù sǔnhuài.",
      "sentence_fr": "Le sèche-linge intelligent peut sélectionner automatiquement le programme de séchage selon le tissu des vêtements, évitant de les endommager.",
      "sentence_en": "The smart dryer can automatically select the drying program based on fabric type, preventing clothing damage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_dryers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶是中国传统弹拨乐器,既能演奏文曲也能演奏武曲。",
      "sentence_pinyin": "Pípá shì Zhōngguó chuántǒng tánbō yuèqì, jì néng yǎnzòu wénqǔ yě néng yǎnzòu wǔqǔ.",
      "sentence_fr": "Le pipa est un instrument traditionnel chinois à cordes pincées, capable de jouer aussi bien des morceaux lyriques que des pièces martiales.",
      "sentence_en": "The pipa is a traditional Chinese plucked string instrument, capable of playing both lyrical and martial pieces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光伏扶贫项目让贫困村庄通过太阳能发电获得稳定收入。",
      "sentence_pinyin": "Guāngfú fúpín xiàngmù ràng pínkùn cūnzhuāng tōngguò tàiyángnéng fādiàn huòdé wěndìng shōurù.",
      "sentence_fr": "Les projets de réduction de la pauvreté par le photovoltaïque permettent aux villages pauvres d'obtenir des revenus stables grâce à l'énergie solaire.",
      "sentence_en": "Photovoltaic poverty alleviation projects enable poor villages to obtain stable income through solar power generation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "solar_poverty_alleviation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能窗帘可以根据室内光线强度自动开合,营造舒适的环境。",
      "sentence_pinyin": "Zhìnéng chuānglián kěyǐ gēnjù shìnèi guāngxiàn qiángdù zìdòng kāihé, yíngzào shūshì de huánjìng.",
      "sentence_fr": "Les rideaux intelligents peuvent s'ouvrir et se fermer automatiquement selon l'intensité lumineuse intérieure, créant un environnement confortable.",
      "sentence_en": "Smart curtains can automatically open and close based on indoor light intensity, creating a comfortable environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_curtains",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位剪纸艺人只用一把剪刀就能剪出栩栩如生的人物和动物。",
      "sentence_pinyin": "Zhè wèi jiǎnzhǐ yìrén zhǐ yòng yī bǎ jiǎndāo jiù néng jiǎnchū xǔxǔ rú shēng de rénwù hé dòngwù.",
      "sentence_fr": "Cet artisan du papier découpé peut créer des personnages et des animaux incroyablement réalistes avec seulement une paire de ciseaux.",
      "sentence_en": "This paper-cutting artist can create lifelike figures and animals with just a pair of scissors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "paper_cutting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电饭煲可以根据米的种类和数量自动调节火力和时间。",
      "sentence_pinyin": "Zhìnéng diànfànbāo kěyǐ gēnjù mǐ de zhǒnglèi hé shùliàng zìdòng tiáojié huǒlì hé shíjiān.",
      "sentence_fr": "Le cuiseur de riz intelligent peut ajuster automatiquement la puissance et le temps selon le type et la quantité de riz.",
      "sentence_en": "The smart rice cooker can automatically adjust heat and time based on the type and amount of rice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_rice_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "马头琴是蒙古族的代表性乐器,琴头雕刻着马头的造型。",
      "sentence_pinyin": "Mǎtóuqín shì Měnggǔzú de dàibiǎoxìng yuèqì, qíntóu diāokè zhe mǎtóu de zàoxíng.",
      "sentence_fr": "Le morin khuur est l'instrument représentatif du peuple mongol, avec une tête de cheval sculptée sur le manche.",
      "sentence_en": "The morin khuur is the representative instrument of the Mongolian people, with a horse head carved on the scroll.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "morin_khuur",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区养老服务中心为独居老人提供日间照料和送餐上门服务。",
      "sentence_pinyin": "Shèqū yǎnglǎo fúwù zhōngxīn wèi dújū lǎorén tígōng rìjiān zhàoliào hé sòngcān shàngmén fúwù.",
      "sentence_fr": "Le centre de services aux personnes âgées de la communauté offre aux seniors vivant seuls des soins de jour et un service de livraison de repas à domicile.",
      "sentence_en": "The community elderly care center provides daytime care and home meal delivery services for seniors living alone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_care_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能吸尘器可以识别不同类型的地面,自动调节吸力大小。",
      "sentence_pinyin": "Zhìnéng xīchénqì kěyǐ shìbié bùtóng lèixíng de dìmiàn, zìdòng tiáojié xīlì dàxiǎo.",
      "sentence_fr": "L'aspirateur intelligent peut identifier différents types de sols et ajuster automatiquement la puissance d'aspiration.",
      "sentence_en": "The smart vacuum cleaner can identify different floor types and automatically adjust suction power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_vacuums",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这幅苏绣作品采用双面绣技法,正反两面的图案完全相同。",
      "sentence_pinyin": "Zhè fú Sūxiù zuòpǐn cǎiyòng shuāngmiàn xiù jìfǎ, zhèng fǎn liǎng miàn de tú'àn wánquán xiāngtóng.",
      "sentence_fr": "Cette œuvre de broderie de Suzhou utilise la technique de la broderie double face, avec des motifs identiques des deux côtés.",
      "sentence_en": "This Suzhou embroidery work uses double-sided embroidery technique, with identical patterns on both sides.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suzhou_embroidery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能猫砂盆可以自动清理猫砂,还能监测猫咪的健康状况。",
      "sentence_pinyin": "Zhìnéng māoshā pén kěyǐ zìdòng qīnglǐ māoshā, hái néng jiāncè māomī de jiànkāng zhuàngkuàng.",
      "sentence_fr": "La litière intelligente pour chat peut nettoyer automatiquement la litière et surveiller l'état de santé du chat.",
      "sentence_en": "The smart cat litter box can automatically clean the litter and monitor the cat's health condition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_devices",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统漆器工艺需要多道工序,一件作品往往需要数月才能完成。",
      "sentence_pinyin": "Zhōngguó chuántǒng qīqì gōngyì xūyào duō dào gōngxù, yī jiàn zuòpǐn wǎngwǎng xūyào shù yuè cáinéng wánchéng.",
      "sentence_fr": "L'artisanat traditionnel chinois de la laque nécessite de nombreuses étapes, et une pièce prend souvent plusieurs mois à réaliser.",
      "sentence_en": "Traditional Chinese lacquerware craftsmanship requires many processes, and a single piece often takes several months to complete.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lacquerware",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新农村建设项目改善了农村的基础设施和居住环境。",
      "sentence_pinyin": "Xīn nóngcūn jiànshè xiàngmù gǎishàn le nóngcūn de jīchǔ shèshī hé jūzhù huánjìng.",
      "sentence_fr": "Les projets de construction de nouvelles campagnes ont amélioré les infrastructures et l'environnement de vie ruraux.",
      "sentence_en": "New rural construction projects have improved rural infrastructure and living environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_development",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能浴室镜可以显示天气预报和新闻,还能调节灯光亮度。",
      "sentence_pinyin": "Zhìnéng yùshì jìng kěyǐ xiǎnshì tiānqì yùbào hé xīnwén, hái néng tiáojié dēngguāng liàngdù.",
      "sentence_fr": "Le miroir de salle de bain intelligent peut afficher les prévisions météo et les actualités, et ajuster l'intensité lumineuse.",
      "sentence_en": "The smart bathroom mirror can display weather forecasts and news, and adjust light brightness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mirrors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笛子是中国最具代表性的竹制乐器,音色清脆明亮,穿透力强。",
      "sentence_pinyin": "Dízi shì Zhōngguó zuì jù dàibiǎoxìng de zhúzhì yuèqì, yīnsè qīngcuì míngliàng, chuāntòulì qiáng.",
      "sentence_fr": "La flûte dizi est l'instrument en bambou le plus représentatif de Chine, avec un timbre clair et brillant et une grande portée.",
      "sentence_en": "The dizi is China's most representative bamboo instrument, with a clear, bright tone and strong penetrating power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dizi_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
