{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "3D打印技术在定制化医疗植入物制造领域展现出革命性的应用前景。",
      "sentence_pinyin": "3D dǎyìn jìshù zài dìngzhì huà yīliáo zhírù wù zhìzào lǐngyù zhǎnxiàn chū gémìng xìng de yìngyòng qiánjǐng.",
      "sentence_fr": "La technologie d'impression 3D présente des perspectives d'application révolutionnaires dans le domaine de la fabrication d'implants médicaux personnalisés.",
      "sentence_en": "3D printing technology shows revolutionary application prospects in the field of customized medical implant manufacturing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "3d_printing_medical",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言濒危问题的严重性促使语言学家开展大规模的语言文献化工作。",
      "sentence_pinyin": "Yǔyán bīnwēi wèntí de yánzhòng xìng cùshǐ yǔyán xué jiā kāizhǎn dà guīmó de yǔyán wénxiàn huà gōngzuò.",
      "sentence_fr": "La gravité du problème de l'extinction des langues incite les linguistes à entreprendre des travaux de documentation linguistique à grande échelle.",
      "sentence_en": "The severity of language endangerment has prompted linguists to undertake large-scale language documentation work.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_documentation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "金融科技创新正在改变传统银行业务模式和消费者的支付习惯。",
      "sentence_pinyin": "Jīnróng kējì chuàngxīn zhèngzài gǎibiàn chuántǒng yínháng yèwù móshì hé xiāofèi zhě de zhīfù xíguàn.",
      "sentence_fr": "L'innovation fintech transforme les modèles commerciaux bancaires traditionnels et les habitudes de paiement des consommateurs.",
      "sentence_en": "Fintech innovation is changing traditional banking business models and consumer payment habits.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fintech_innovation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市绿化屋顶项目不仅美化环境，还能有效降低建筑能耗和缓解雨水径流。",
      "sentence_pinyin": "Chéngshì lǜhuà wūdǐng xiàngmù bùjǐn měihuà huánjìng, hái néng yǒuxiào jiàngdī jiànzhù néng hào hé huǎnjiě yǔshuǐ jìngliú.",
      "sentence_fr": "Les projets de toits végétalisés urbains embellissent non seulement l'environnement, mais réduisent aussi efficacement la consommation énergétique des bâtiments et atténuent le ruissellement des eaux pluviales.",
      "sentence_en": "Urban green roof projects not only beautify the environment but also effectively reduce building energy consumption and mitigate stormwater runoff.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_roofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经语言学研究大脑如何处理、存储和产生语言的复杂机制。",
      "sentence_pinyin": "Shénjīng yǔyán xué yánjiū dànǎo rúhé chǔlǐ, chǔcún hé chǎnshēng yǔyán de fùzá jīzhì.",
      "sentence_fr": "La neurolinguistique étudie les mécanismes complexes par lesquels le cerveau traite, stocke et produit le langage.",
      "sentence_en": "Neurolinguistics studies the complex mechanisms of how the brain processes, stores, and produces language.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neurolinguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "边缘计算技术将数据处理能力从云端移到更靠近数据源的位置。",
      "sentence_pinyin": "Biānyuán jìsuàn jìshù jiāng shùjù chǔlǐ nénglì cóng yúnduān yí dào gèng kàojìn shùjù yuán de wèizhì.",
      "sentence_fr": "La technologie de l'edge computing déplace la capacité de traitement des données du cloud vers des emplacements plus proches de la source des données.",
      "sentence_en": "Edge computing technology moves data processing capabilities from the cloud to locations closer to the data source.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "edge_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "积极心理学研究人类幸福感和生活满意度的科学基础与促进方法。",
      "sentence_pinyin": "Jījí xīnlǐ xué yánjiū rénlèi xìngfú gǎn hé shēnghuó mǎnyì dù de kēxué jīchǔ yǔ cùjìn fāngfǎ.",
      "sentence_fr": "La psychologie positive étudie les bases scientifiques du bonheur et de la satisfaction de vie humains ainsi que les méthodes pour les promouvoir.",
      "sentence_en": "Positive psychology studies the scientific foundations of human well-being and life satisfaction and methods to promote them.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "positive_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "垂直农业系统在有限的城市空间内实现了高效的全年农作物生产。",
      "sentence_pinyin": "Chuízhí nóngyè xìtǒng zài yǒuxiàn de chéngshì kōngjiān nèi shíxiàn le gāoxiào de quánnián nóngzuòwù shēngchǎn.",
      "sentence_fr": "Les systèmes d'agriculture verticale permettent une production agricole efficace toute l'année dans un espace urbain limité.",
      "sentence_en": "Vertical farming systems achieve efficient year-round crop production within limited urban spaces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vertical_farming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际刑事法院在追诉战争罪和反人类罪方面发挥着不可替代的作用。",
      "sentence_pinyin": "Guójì xíngshì fǎyuàn zài zhuīsù zhànzhēng zuì hé fǎn rénlèi zuì fāngmiàn fāhuī zhe bùkě tìdài de zuòyòng.",
      "sentence_fr": "La Cour pénale internationale joue un rôle irremplaçable dans la poursuite des crimes de guerre et des crimes contre l'humanité.",
      "sentence_en": "The International Criminal Court plays an irreplaceable role in prosecuting war crimes and crimes against humanity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "international_criminal_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿生学从自然界的生物结构和功能中获取灵感来解决工程技术难题。",
      "sentence_pinyin": "Fǎngshēng xué cóng zìrán jiè de shēngwù jiégòu hé gōngnéng zhōng huòqǔ línggǎn lái jiějué gōngchéng jìshù nántí.",
      "sentence_fr": "La bionique s'inspire des structures et fonctions biologiques de la nature pour résoudre des problèmes techniques d'ingénierie.",
      "sentence_en": "Biomimicry draws inspiration from biological structures and functions in nature to solve engineering challenges.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biomimicry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "远程心理咨询服务的普及使更多人能够获得专业的心理健康支持。",
      "sentence_pinyin": "Yuǎnchéng xīnlǐ zīxún fúwù de pǔjí shǐ gèng duō rén nénggòu huòdé zhuānyè de xīnlǐ jiànkāng zhīchí.",
      "sentence_fr": "La généralisation des services de conseil psychologique à distance permet à davantage de personnes d'accéder à un soutien professionnel en santé mentale.",
      "sentence_en": "The popularization of remote psychological counseling services enables more people to access professional mental health support.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "teletherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "去中心化金融系统试图通过区块链技术消除传统金融中介机构的角色。",
      "sentence_pinyin": "Qù zhōngxīn huà jīnróng xìtǒng shìtú tōngguò qūkuài liàn jìshù xiāochú chuántǒng jīnróng zhōngjiè jīgòu de juésè.",
      "sentence_fr": "Les systèmes de finance décentralisée tentent d'éliminer le rôle des intermédiaires financiers traditionnels grâce à la technologie blockchain.",
      "sentence_en": "Decentralized finance systems attempt to eliminate the role of traditional financial intermediaries through blockchain technology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "defi",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋保护区的建立对于恢复过度捕捞海域的鱼类种群至关重要。",
      "sentence_pinyin": "Hǎiyáng bǎohù qū de jiànlì duìyú huīfù guòdù bǔlāo hǎiyù de yúlèi zhǒngqún zhìguān zhòngyào.",
      "sentence_fr": "L'établissement de zones marines protégées est crucial pour la restauration des populations de poissons dans les zones de surpêche.",
      "sentence_en": "The establishment of marine protected areas is crucial for restoring fish populations in overfished waters.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_protected_areas",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算社会科学利用大规模数据分析来研究复杂的社会现象和人类行为。",
      "sentence_pinyin": "Jìsuàn shèhuì kēxué lìyòng dà guīmó shùjù fēnxī lái yánjiū fùzá de shèhuì xiànxiàng hé rénlèi xíngwéi.",
      "sentence_fr": "Les sciences sociales computationnelles utilisent l'analyse de données à grande échelle pour étudier les phénomènes sociaux complexes et le comportement humain.",
      "sentence_en": "Computational social science uses large-scale data analysis to study complex social phenomena and human behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computational_social_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "建筑节能认证体系推动了绿色建筑设计和可持续建造实践的发展。",
      "sentence_pinyin": "Jiànzhù jiénéng rènzhèng tǐxì tuīdòng le lǜsè jiànzhù shèjì hé kěchíxù jiànzào shíjiàn de fāzhǎn.",
      "sentence_fr": "Les systèmes de certification énergétique des bâtiments favorisent le développement de la conception de bâtiments écologiques et des pratiques de construction durable.",
      "sentence_en": "Building energy certification systems promote the development of green building design and sustainable construction practices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "green_building_certification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "机器翻译技术的进步正在显著降低跨语言交流的障碍。",
      "sentence_pinyin": "Jīqì fānyì jìshù de jìnbù zhèngzài xiǎnzhù jiàngdī kuà yǔyán jiāoliú de zhàng'ài.",
      "sentence_fr": "Les progrès de la technologie de traduction automatique réduisent considérablement les obstacles à la communication interlinguistique.",
      "sentence_en": "Advances in machine translation technology are significantly reducing barriers to cross-language communication.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "machine_translation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "职业倦怠已被世界卫生组织正式认定为影响健康状况的职业现象。",
      "sentence_pinyin": "Zhíyè juàndài yǐ bèi Shìjiè Wèishēng Zǔzhī zhèngshì rèndìng wéi yǐngxiǎng jiànkāng zhuàngkuàng de zhíyè xiànxiàng.",
      "sentence_fr": "L'épuisement professionnel a été officiellement reconnu par l'Organisation mondiale de la santé comme un phénomène professionnel affectant l'état de santé.",
      "sentence_en": "Occupational burnout has been officially recognized by the World Health Organization as an occupational phenomenon affecting health status.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "occupational_burnout",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "抗生素耐药性的全球蔓延对公共卫生安全构成了日益严峻的挑战。",
      "sentence_pinyin": "Kàngshēngsù nàiyào xìng de quánqiú mànyán duì gōnggòng wèishēng ānquán gòuchéng le rìyì yánjùn de tiǎozhàn.",
      "sentence_fr": "La propagation mondiale de la résistance aux antibiotiques pose un défi de plus en plus grave pour la sécurité de la santé publique.",
      "sentence_en": "The global spread of antibiotic resistance poses an increasingly severe challenge to public health security.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "antibiotic_resistance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "参与式预算机制让市民直接参与决定部分公共资金的使用方式。",
      "sentence_pinyin": "Cānyù shì yùsuàn jīzhì ràng shìmín zhíjiē cānyù juédìng bùfèn gōnggòng zījīn de shǐyòng fāngshì.",
      "sentence_fr": "Les mécanismes de budget participatif permettent aux citoyens de participer directement aux décisions concernant l'utilisation d'une partie des fonds publics.",
      "sentence_en": "Participatory budgeting mechanisms allow citizens to directly participate in deciding how some public funds are used.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "participatory_budgeting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联邦学习技术允许在不共享原始数据的情况下进行协作式机器学习模型训练。",
      "sentence_pinyin": "Liánbāng xuéxí jìshù yǔnxǔ zài bù gòngxiǎng yuánshǐ shùjù de qíngkuàng xià jìnxíng xiézuò shì jīqì xuéxí móxíng xùnliàn.",
      "sentence_fr": "La technologie d'apprentissage fédéré permet l'entraînement collaboratif de modèles d'apprentissage automatique sans partager les données brutes.",
      "sentence_en": "Federated learning technology allows collaborative machine learning model training without sharing raw data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "federated_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
