{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能厨房系统可以联动多个厨电设备,实现一键烹饪功能。",
      "sentence_pinyin": "Zhège zhìnéng chúfáng xìtǒng kěyǐ liándòng duō gè chúdiàn shèbèi, shíxiàn yī jiàn pēngrèn gōngnéng.",
      "sentence_fr": "Ce système de cuisine intelligente peut connecter plusieurs appareils de cuisine, permettant une cuisson en une touche.",
      "sentence_en": "This smart kitchen system can link multiple kitchen appliances, enabling one-touch cooking functionality.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_kitchen_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "藏戏是西藏的传统戏剧,表演形式独特,具有浓厚的宗教色彩。",
      "sentence_pinyin": "Zàngjù shì Xīzàng de chuántǒng xìjù, biǎoyǎn xíngshì dútè, jùyǒu nónghòu de zōngjiào sècǎi.",
      "sentence_fr": "L'opéra tibétain est un théâtre traditionnel du Tibet, avec une forme de représentation unique et une forte coloration religieuse.",
      "sentence_en": "Tibetan opera is a traditional theater of Tibet, with a unique performance form and strong religious coloring.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tibetan_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市湿地公园不仅为市民提供休闲场所,还能净化水质保护生态。",
      "sentence_pinyin": "Chéngshì shīdì gōngyuán bùjǐn wèi shìmín tígōng xiūxián chǎngsuǒ, hái néng jìnghuà shuǐzhì bǎohù shēngtài.",
      "sentence_fr": "Les parcs de zones humides urbaines offrent non seulement des lieux de loisirs aux citadins, mais purifient aussi l'eau et protègent l'écosystème.",
      "sentence_en": "Urban wetland parks not only provide leisure spaces for residents but also purify water and protect the ecosystem.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wetland_parks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能保温杯可以显示水温,还能通过手机设置喝水提醒。",
      "sentence_pinyin": "Zhìnéng bǎowēnbēi kěyǐ xiǎnshì shuǐwēn, hái néng tōngguò shǒujī shèzhì hēshuǐ tíxǐng.",
      "sentence_fr": "La bouteille thermos intelligente peut afficher la température de l'eau et configurer des rappels pour boire via le téléphone.",
      "sentence_en": "The smart thermos can display water temperature and set drinking reminders through a phone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bottles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的金银器制作工艺包括锤揲、錾刻、镶嵌等多种技法。",
      "sentence_pinyin": "Zhōngguó chuántǒng de jīnyínqì zhìzuò gōngyì bāokuò chuídié, zànkè, xiāngqiàn děng duō zhǒng jìfǎ.",
      "sentence_fr": "L'artisanat traditionnel chinois de l'orfèvrerie comprend diverses techniques comme le martelage, la ciselure et l'incrustation.",
      "sentence_en": "Traditional Chinese gold and silver craftsmanship includes various techniques such as hammering, chasing, and inlaying.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gold_silver_craft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物摄像头让主人外出时也能随时查看宠物的状况。",
      "sentence_pinyin": "Zhìnéng chǒngwù shèxiàngtóu ràng zhǔrén wàichū shí yě néng suíshí chákàn chǒngwù de zhuàngkuàng.",
      "sentence_fr": "La caméra intelligente pour animaux permet aux propriétaires de surveiller leurs animaux à tout moment lorsqu'ils sont sortis.",
      "sentence_en": "The smart pet camera allows owners to check on their pets anytime when they're away from home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_cameras",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "汉调二黄是湖北的地方戏曲,是京剧的重要源头之一。",
      "sentence_pinyin": "Hàndiào èrhuáng shì Húběi de dìfāng xìqǔ, shì Jīngjù de zhòngyào yuántóu zhī yī.",
      "sentence_fr": "L'opéra Handiao Erhuang est un opéra régional du Hubei, l'une des sources importantes de l'opéra de Pékin.",
      "sentence_en": "Handiao Erhuang opera is a regional opera of Hubei, one of the important origins of Peking Opera.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "handiao_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施的老旧小区改造项目改善了居民的居住环境。",
      "sentence_pinyin": "Zhèngfǔ shíshī de lǎojiù xiǎoqū gǎizào xiàngmù gǎishàn le jūmín de jūzhù huánjìng.",
      "sentence_fr": "Le projet de rénovation des vieux quartiers mis en œuvre par le gouvernement a amélioré l'environnement de vie des résidents.",
      "sentence_en": "The government's old neighborhood renovation project has improved residents' living environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_renewal",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能书桌可以调节高度和倾斜角度,满足不同学习姿势的需求。",
      "sentence_pinyin": "Zhìnéng shūzhuō kěyǐ tiáojié gāodù hé qīngxié jiǎodù, mǎnzú bùtóng xuéxí zīshì de xūqiú.",
      "sentence_fr": "Le bureau intelligent peut ajuster la hauteur et l'angle d'inclinaison pour répondre aux besoins de différentes postures d'étude.",
      "sentence_en": "The smart desk can adjust height and tilt angle to meet the needs of different study postures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_desks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的锡器工艺以云南个旧的锡器最为著名,历史悠久。",
      "sentence_pinyin": "Zhōngguó chuántǒng de xīqì gōngyì yǐ Yúnnán Gèjiù de xīqì zuìwéi zhùmíng, lìshǐ yōujiǔ.",
      "sentence_fr": "L'artisanat traditionnel chinois de l'étain est le plus célèbre pour l'étain de Gejiu au Yunnan, avec une longue histoire.",
      "sentence_en": "Traditional Chinese pewter craftsmanship is most famous for Gejiu tin in Yunnan, with a long history.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pewter_craft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能路由器可以自动优化网络信号,保证每个房间都有稳定的网速。",
      "sentence_pinyin": "Zhìnéng lùyóuqì kěyǐ zìdòng yōuhuà wǎngluò xìnhào, bǎozhèng měi gè fángjiān dōu yǒu wěndìng de wǎngsù.",
      "sentence_fr": "Le routeur intelligent peut optimiser automatiquement le signal réseau, garantissant une vitesse stable dans chaque pièce.",
      "sentence_en": "The smart router can automatically optimize network signal, ensuring stable internet speed in every room.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_routers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "花鼓戏是湖南的地方戏曲,表演活泼诙谐,深受百姓喜爱。",
      "sentence_pinyin": "Huāgǔxì shì Húnán de dìfāng xìqǔ, biǎoyǎn huópō huīxié, shēn shòu bǎixìng xǐ'ài.",
      "sentence_fr": "L'opéra Huagu est un opéra régional du Hunan, avec des performances vives et humoristiques, très appréciées du public.",
      "sentence_en": "Huagu opera is a regional opera of Hunan, with lively and humorous performances, deeply loved by the people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huagu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区食堂为附近的老年人提供价格实惠、营养均衡的饭菜。",
      "sentence_pinyin": "Shèqū shítáng wèi fùjìn de lǎoniánrén tígōng jiàgé shíhuì, yíngyǎng jūnhéng de fàncài.",
      "sentence_fr": "La cantine communautaire offre aux personnes âgées du quartier des repas abordables et nutritionnellement équilibrés.",
      "sentence_en": "The community canteen provides nearby elderly people with affordable and nutritionally balanced meals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_canteens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能垃圾分类箱可以自动识别垃圾类型,帮助居民正确投放。",
      "sentence_pinyin": "Zhìnéng lājī fēnlèi xiāng kěyǐ zìdòng shìbié lājī lèixíng, bāngzhù jūmín zhèngquè tóufàng.",
      "sentence_fr": "La poubelle de tri intelligent peut identifier automatiquement le type de déchet, aidant les résidents à trier correctement.",
      "sentence_en": "The smart waste sorting bin can automatically identify waste types, helping residents dispose of waste correctly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_waste_bins",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的景泰蓝工艺需要经过制胎、掐丝、点蓝、烧蓝、磨光等多道工序。",
      "sentence_pinyin": "Zhōngguó chuántǒng de jǐngtàilán gōngyì xūyào jīngguò zhìtāi, qiāsī, diǎnlán, shāolán, móguāng děng duō dào gōngxù.",
      "sentence_fr": "L'artisanat traditionnel chinois du cloisonné nécessite plusieurs étapes : fabrication du corps, pose des fils, application de l'émail, cuisson et polissage.",
      "sentence_en": "Traditional Chinese cloisonné craftsmanship requires multiple processes: body making, wire inlaying, enamel filling, firing, and polishing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloisonne_process",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能空调可以学习用户的使用习惯,自动调节到最舒适的温度。",
      "sentence_pinyin": "Zhìnéng kōngtiáo kěyǐ xuéxí yònghù de shǐyòng xíguàn, zìdòng tiáojié dào zuì shūshì de wēndù.",
      "sentence_fr": "La climatisation intelligente peut apprendre les habitudes d'utilisation et ajuster automatiquement la température la plus confortable.",
      "sentence_en": "The smart air conditioner can learn user habits and automatically adjust to the most comfortable temperature.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_conditioners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "采茶戏是江西的地方戏曲,表演形式轻快活泼,充满生活气息。",
      "sentence_pinyin": "Cǎicháxì shì Jiāngxī de dìfāng xìqǔ, biǎoyǎn xíngshì qīngkuài huópō, chōngmǎn shēnghuó qìxī.",
      "sentence_fr": "L'opéra de la cueillette du thé est un opéra régional du Jiangxi, avec des performances légères et vives, pleines de vie quotidienne.",
      "sentence_en": "Tea-picking opera is a regional opera of Jiangxi, with light and lively performances full of everyday life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tea_picking_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的智慧公交站台可以实时显示公交车到站时间和车厢拥挤程度。",
      "sentence_pinyin": "Zhège chéngshì de zhìhuì gōngjiāo zhàntái kěyǐ shíshí xiǎnshì gōngjiāochē dào zhàn shíjiān hé chēxiāng yōngjǐ chéngdù.",
      "sentence_fr": "Les abribus intelligents de cette ville peuvent afficher en temps réel l'heure d'arrivée des bus et le niveau d'affluence des voitures.",
      "sentence_en": "This city's smart bus stops can display real-time bus arrival times and carriage crowding levels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bus_stops",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能床头灯可以模拟日出日落,帮助用户自然入睡和醒来。",
      "sentence_pinyin": "Zhìnéng chuángtóu dēng kěyǐ mónǐ rìchū rìluò, bāngzhù yònghù zìrán rùshuì hé xǐnglái.",
      "sentence_fr": "La lampe de chevet intelligente peut simuler le lever et le coucher du soleil, aidant les utilisateurs à s'endormir et se réveiller naturellement.",
      "sentence_en": "The smart bedside lamp can simulate sunrise and sunset, helping users fall asleep and wake up naturally.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bedside_lamps",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的砖雕艺术主要用于装饰古建筑的门楼、照壁和墙面。",
      "sentence_pinyin": "Zhōngguó chuántǒng de zhuāndiāo yìshù zhǔyào yòng yú zhuāngshì gǔ jiànzhù de ménlóu, zhàobì hé qiángmiàn.",
      "sentence_fr": "L'art traditionnel chinois de la sculpture sur brique est principalement utilisé pour décorer les portes, les murs d'écran et les façades des bâtiments anciens.",
      "sentence_en": "Traditional Chinese brick carving art is mainly used to decorate gateway towers, screen walls, and wall surfaces of ancient buildings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "brick_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
