{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠缠的非定域性挑战了经典物理学对因果性的理解。",
      "sentence_pinyin": "Liàngzǐ jiūchán de fēi dìngyùxìng tiǎozhàn le jīngdiǎn wùlǐxué duì yīnguǒxìng de lǐjiě.",
      "sentence_fr": "La non-localité de l'intrication quantique remet en question la compréhension de la causalité en physique classique.",
      "sentence_en": "The non-locality of quantum entanglement challenges classical physics' understanding of causality.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_nonlocality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同态加密允许在加密数据上直接执行计算而无需解密。",
      "sentence_pinyin": "Tóngtài jiāmì yǔnxǔ zài jiāmì shùjù shàng zhíjiē zhíxíng jìsuàn ér wúxū jiěmì.",
      "sentence_fr": "Le chiffrement homomorphe permet d'effectuer des calculs directement sur des données chiffrées sans déchiffrement.",
      "sentence_en": "Homomorphic encryption allows performing computations directly on encrypted data without decryption.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homomorphic_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哥德尔不完备性定理证明任何一致的形式系统都存在不可证命题。",
      "sentence_pinyin": "Gēdé'ěr bù wánbèixìng dìnglǐ zhèngmíng rènhé yīzhì de xíngshì xìtǒng dōu cúnzài bùkě zhèng mìngtí.",
      "sentence_fr": "Les théorèmes d'incomplétude de Gödel prouvent que tout système formel cohérent contient des propositions indémontrables.",
      "sentence_en": "Gödel's incompleteness theorems prove that any consistent formal system contains unprovable propositions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "godels_incompleteness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拜占庭容错算法使分布式系统能够在恶意节点存在时达成共识。",
      "sentence_pinyin": "Bàizhàntíng róngcuò suànfǎ shǐ fēnbùshì xìtǒng nénggòu zài èyì jiédiǎn cúnzài shí dáchéng gòngshí.",
      "sentence_fr": "Les algorithmes tolérants aux fautes byzantines permettent aux systèmes distribués d'atteindre un consensus en présence de nœuds malveillants.",
      "sentence_en": "Byzantine fault-tolerant algorithms enable distributed systems to reach consensus in the presence of malicious nodes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "byzantine_fault_tolerance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "测度论为概率论和积分学提供了严格的数学基础框架。",
      "sentence_pinyin": "Cèdù lùn wèi gàilǜlùn hé jīfēnxué tígōng le yángé de shùxué jīchǔ kuàngjià.",
      "sentence_fr": "La théorie de la mesure fournit un cadre mathématique rigoureux pour la théorie des probabilités et le calcul intégral.",
      "sentence_en": "Measure theory provides a rigorous mathematical foundation framework for probability theory and integration.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "measure_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "贝尔不等式的违反实验证实了量子力学的非经典特性。",
      "sentence_pinyin": "Bèi'ěr bù děngshì de wéifǎn shíyàn zhèngshí le liàngzǐ lìxué de fēi jīngdiǎn tèxìng.",
      "sentence_fr": "Les expériences de violation des inégalités de Bell confirment les propriétés non classiques de la mécanique quantique.",
      "sentence_en": "Bell inequality violation experiments confirm the non-classical properties of quantum mechanics.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bell_inequality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "形式验证方法使用数学证明确保软件系统的正确性。",
      "sentence_pinyin": "Xíngshì yànzhèng fāngfǎ shǐyòng shùxué zhèngmíng quèbǎo ruǎnjiàn xìtǒng de zhèngquèxìng.",
      "sentence_fr": "Les méthodes de vérification formelle utilisent des preuves mathématiques pour garantir l'exactitude des systèmes logiciels.",
      "sentence_en": "Formal verification methods use mathematical proofs to ensure software system correctness.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "formal_verification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "范畴论通过研究数学结构之间的态射揭示深层统一性。",
      "sentence_pinyin": "Fànchóu lùn tōngguò yánjiū shùxué jiégòu zhījiān de tàishè jiēshì shēncéng tǒngyīxìng.",
      "sentence_fr": "La théorie des catégories révèle une unité profonde en étudiant les morphismes entre structures mathématiques.",
      "sentence_en": "Category theory reveals deep unity by studying morphisms between mathematical structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "category_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可计算性理论界定了哪些问题原则上可以被算法解决。",
      "sentence_pinyin": "Kě jìsuànxìng lǐlùn jièdìng le nǎxiē wèntí yuánzé shàng kěyǐ bèi suànfǎ jiějué.",
      "sentence_fr": "La théorie de la calculabilité délimite quels problèmes peuvent en principe être résolus par des algorithmes.",
      "sentence_en": "Computability theory delineates which problems can in principle be solved by algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "computability_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子退相干解释了宏观世界中量子叠加态的消失机制。",
      "sentence_pinyin": "Liàngzǐ tuì xiānggān jiěshì le hóngguān shìjiè zhōng liàngzǐ diéjiā tài de xiāoshī jīzhì.",
      "sentence_fr": "La décohérence quantique explique le mécanisme de disparition des états de superposition quantique dans le monde macroscopique.",
      "sentence_en": "Quantum decoherence explains the mechanism of quantum superposition state disappearance in the macroscopic world.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_decoherence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "差分隐私提供了量化个人数据隐私保护程度的数学框架。",
      "sentence_pinyin": "Chāfēn yǐnsī tígōng le liànghuà gèrén shùjù yǐnsī bǎohù chéngdù de shùxué kuàngjià.",
      "sentence_fr": "La confidentialité différentielle fournit un cadre mathématique pour quantifier le niveau de protection de la vie privée des données personnelles.",
      "sentence_en": "Differential privacy provides a mathematical framework for quantifying personal data privacy protection levels.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "differential_privacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑学研究在连续变换下保持不变的空间性质。",
      "sentence_pinyin": "Tuòpūxué yánjiū zài liánxù biànhuàn xià bǎochí bù biàn de kōngjiān xìngzhì.",
      "sentence_fr": "La topologie étudie les propriétés spatiales qui restent invariantes sous les transformations continues.",
      "sentence_en": "Topology studies spatial properties that remain invariant under continuous transformations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "图灵完备性意味着计算系统能模拟任何图灵机的运算。",
      "sentence_pinyin": "Túlíng wánbèixìng yìwèi zhe jìsuàn xìtǒng néng mónǐ rènhé Túlíng jī de yùnsuàn.",
      "sentence_fr": "La complétude de Turing signifie qu'un système informatique peut simuler n'importe quelle machine de Turing.",
      "sentence_en": "Turing completeness means a computational system can simulate any Turing machine's operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "turing_completeness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子场论描述粒子的产生和湮灭以及场的量子化行为。",
      "sentence_pinyin": "Liàngzǐ chǎnglùn miáoshù lìzǐ de chǎnshēng hé yānmiè yǐjí chǎng de liàngzǐhuà xíngwéi.",
      "sentence_fr": "La théorie quantique des champs décrit la création et l'annihilation des particules ainsi que le comportement quantifié des champs.",
      "sentence_en": "Quantum field theory describes particle creation and annihilation as well as field quantization behavior.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_field_theory_advanced",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全多方计算允许多方联合计算函数而不泄露各自输入。",
      "sentence_pinyin": "Ānquán duō fāng jìsuàn yǔnxǔ duō fāng liánhé jìsuàn hánshù ér bù xièlù gèzì shūrù.",
      "sentence_fr": "Le calcul multipartite sécurisé permet à plusieurs parties de calculer conjointement une fonction sans révéler leurs entrées respectives.",
      "sentence_en": "Secure multi-party computation allows multiple parties to jointly compute functions without revealing their respective inputs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "secure_multiparty_computation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数几何将多项式方程的解集与几何对象联系起来。",
      "sentence_pinyin": "Dàishù jǐhé jiāng duōxiàngshì fāngchéng de jiějí yǔ jǐhé duìxiàng liánxì qǐlái.",
      "sentence_fr": "La géométrie algébrique relie les ensembles de solutions des équations polynomiales aux objets géométriques.",
      "sentence_en": "Algebraic geometry connects solution sets of polynomial equations to geometric objects.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "停机问题证明了不存在能判定任意程序是否终止的算法。",
      "sentence_pinyin": "Tíngjī wèntí zhèngmíng le bù cúnzài néng pàndìng rènyì chéngxù shìfǒu zhōngzhǐ de suànfǎ.",
      "sentence_fr": "Le problème de l'arrêt prouve qu'il n'existe pas d'algorithme capable de déterminer si un programme arbitraire se termine.",
      "sentence_en": "The halting problem proves there is no algorithm that can determine whether an arbitrary program terminates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "halting_problem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠错码保护量子信息免受退相干和噪声的影响。",
      "sentence_pinyin": "Liàngzǐ jiūcuò mǎ bǎohù liàngzǐ xìnxī miǎn shòu tuì xiānggān hé zàoshēng de yǐngxiǎng.",
      "sentence_fr": "Les codes de correction d'erreur quantique protègent l'information quantique contre la décohérence et le bruit.",
      "sentence_en": "Quantum error correction codes protect quantum information from decoherence and noise effects.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_error_correction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混淆技术将程序代码转换为功能等价但难以理解的形式。",
      "sentence_pinyin": "Hùnxiáo jìshù jiāng chéngxù dàimǎ zhuǎnhuàn wéi gōngnéng děngjià dàn nán yǐ lǐjiě de xíngshì.",
      "sentence_fr": "Les techniques d'obfuscation transforment le code du programme en une forme fonctionnellement équivalente mais difficile à comprendre.",
      "sentence_en": "Obfuscation techniques transform program code into functionally equivalent but hard-to-understand forms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "code_obfuscation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黎曼假设是数论中关于黎曼zeta函数零点分布的重要猜想。",
      "sentence_pinyin": "Límàn jiǎshè shì shùlùn zhōng guānyú Límàn zeta hánshù língdiǎn fēnbù de zhòngyào cāixiǎng.",
      "sentence_fr": "L'hypothèse de Riemann est une conjecture importante en théorie des nombres concernant la distribution des zéros de la fonction zêta de Riemann.",
      "sentence_en": "The Riemann hypothesis is an important conjecture in number theory about the distribution of zeros of the Riemann zeta function.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "riemann_hypothesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
