{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "深度伪造技术的滥用对新闻真实性和公众信任构成了严重的威胁。",
      "sentence_pinyin": "Shēndù wěizào jìshù de lànyòng duì xīnwén zhēnshíxìng hé gōngzhòng xìnrèn gòuchéng le yánzhòng de wēixié.",
      "sentence_fr": "L'abus de la technologie deepfake constitue une menace sérieuse pour l'authenticité des informations et la confiance du public.",
      "sentence_en": "The abuse of deepfake technology poses a serious threat to news authenticity and public trust.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deepfake_misinformation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传统节日文化的传承需要在保持本真性的同时与现代生活方式相适应。",
      "sentence_pinyin": "Chuántǒng jiérì wénhuà de chuánchéng xūyào zài bǎochí běnzhēnxìng de tóngshí yǔ xiàndài shēnghuó fāngshì xiāng shìyìng.",
      "sentence_fr": "La transmission de la culture des fêtes traditionnelles doit s'adapter au mode de vie moderne tout en préservant son authenticité.",
      "sentence_en": "The inheritance of traditional festival culture needs to adapt to modern lifestyles while maintaining authenticity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "festival_cultural_preservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经形态芯片的设计灵感来源于人脑神经元的信息处理机制。",
      "sentence_pinyin": "Shénjīng xíngtài xīnpiàn de shèjì línggǎn láiyuán yú rénnǎo shénjīngyuán de xìnxī chǔlǐ jīzhì.",
      "sentence_fr": "La conception des puces neuromorphiques s'inspire des mécanismes de traitement de l'information des neurones du cerveau humain.",
      "sentence_en": "The design inspiration for neuromorphic chips comes from the information processing mechanisms of human brain neurons.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuromorphic_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会阶层固化现象引发了关于教育公平和机会平等的广泛社会讨论。",
      "sentence_pinyin": "Shèhuì jiēcéng gùhuà xiànxiàng yǐnfā le guānyú jiàoyù gōngpíng hé jīhuì píngděng de guǎngfàn shèhuì tǎolùn.",
      "sentence_fr": "Le phénomène de rigidification des classes sociales a suscité un large débat sur l'équité éducative et l'égalité des chances.",
      "sentence_en": "The phenomenon of social class solidification has sparked widespread social discussion about educational equity and equal opportunity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_mobility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "垂直农业技术能够在有限的城市空间内实现全年无休的农作物生产。",
      "sentence_pinyin": "Chuízhí nóngyè jìshù nénggòu zài yǒuxiàn de chéngshì kōngjiān nèi shíxiàn quánnián wúxiū de nóngzuòwù shēngchǎn.",
      "sentence_fr": "La technologie de l'agriculture verticale permet une production agricole continue toute l'année dans un espace urbain limité.",
      "sentence_en": "Vertical farming technology can achieve year-round crop production within limited urban space.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vertical_farming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位舞蹈编导的创作理念是将传统舞蹈语汇与当代身体表达相融合。",
      "sentence_pinyin": "Zhè wèi wǔdǎo biāndǎo de chuàngzuò lǐniàn shì jiāng chuántǒng wǔdǎo yǔhuì yǔ dāngdài shēntǐ biǎodá xiāng rónghé.",
      "sentence_fr": "Le concept créatif de ce chorégraphe est de fusionner le vocabulaire de la danse traditionnelle avec l'expression corporelle contemporaine.",
      "sentence_en": "This choreographer's creative concept is to fuse traditional dance vocabulary with contemporary physical expression.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_choreography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "免疫疗法的发展为癌症治疗领域带来了革命性的突破和新的希望。",
      "sentence_pinyin": "Miǎnyì liáofǎ de fāzhǎn wèi áizhèng zhìliáo lǐngyù dàilái le gémìngxìng de tūpò hé xīn de xīwàng.",
      "sentence_fr": "Le développement de l'immunothérapie a apporté des percées révolutionnaires et de nouveaux espoirs dans le traitement du cancer.",
      "sentence_en": "The development of immunotherapy has brought revolutionary breakthroughs and new hope to the field of cancer treatment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cancer_immunotherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字鸿沟的存在加剧了不同社会群体之间的信息获取和发展机会不平等。",
      "sentence_pinyin": "Shùzì hónggōu de cúnzài jiājù le bùtóng shèhuì qúntǐ zhījiān de xìnxī huòqǔ hé fāzhǎn jīhuì bù píngděng.",
      "sentence_fr": "L'existence de la fracture numérique aggrave les inégalités d'accès à l'information et aux opportunités de développement entre différents groupes sociaux.",
      "sentence_en": "The existence of the digital divide exacerbates inequality in information access and development opportunities among different social groups.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_divide",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市天际线的演变折射出不同时代的建筑审美和经济发展水平。",
      "sentence_pinyin": "Chéngshì tiānjìxiàn de yǎnbiàn zhéshè chū bùtóng shídài de jiànzhù shěnměi hé jīngjì fāzhǎn shuǐpíng.",
      "sentence_fr": "L'évolution de la ligne d'horizon urbaine reflète les goûts architecturaux et le niveau de développement économique des différentes époques.",
      "sentence_en": "The evolution of the urban skyline reflects the architectural aesthetics and economic development level of different eras.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_skyline_evolution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可穿戴设备生成的健康数据正在改变医患之间的互动方式和医疗决策过程。",
      "sentence_pinyin": "Kě chuāndài shèbèi shēngchéng de jiànkāng shùjù zhèngzài gǎibiàn yīhuàn zhījiān de hùdòng fāngshì hé yīliáo juécè guòchéng.",
      "sentence_fr": "Les données de santé générées par les appareils portables transforment les interactions médecin-patient et le processus de prise de décision médicale.",
      "sentence_en": "Health data generated by wearable devices is changing the way doctors and patients interact and the medical decision-making process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wearable_health_tech",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识图谱技术使搜索引擎能够理解用户查询背后的语义意图。",
      "sentence_pinyin": "Zhīshi túpǔ jìshù shǐ sōusuǒ yǐnqíng nénggòu lǐjiě yònghù cháxún bèihòu de yǔyì yìtú.",
      "sentence_fr": "La technologie des graphes de connaissances permet aux moteurs de recherche de comprendre l'intention sémantique derrière les requêtes des utilisateurs.",
      "sentence_en": "Knowledge graph technology enables search engines to understand the semantic intent behind user queries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "knowledge_graphs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非营利组织在弥合社会服务缺口和促进公民参与方面发挥着重要作用。",
      "sentence_pinyin": "Fēi yínglì zǔzhī zài míhé shèhuì fúwù quēkǒu hé cùjìn gōngmín cānyù fāngmiàn fāhuī zhe zhòngyào zuòyòng.",
      "sentence_fr": "Les organisations à but non lucratif jouent un rôle important pour combler les lacunes des services sociaux et promouvoir la participation citoyenne.",
      "sentence_en": "Non-profit organizations play an important role in bridging social service gaps and promoting civic participation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nonprofit_organizations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超导材料的研究突破可能彻底改变电力传输和磁悬浮交通技术。",
      "sentence_pinyin": "Chāodǎo cáiliào de yánjiū tūpò kěnéng chèdǐ gǎibiàn diànlì chuánshū hé cíxuánfú jiāotōng jìshù.",
      "sentence_fr": "Les percées dans la recherche sur les matériaux supraconducteurs pourraient transformer radicalement la transmission électrique et les transports à lévitation magnétique.",
      "sentence_en": "Research breakthroughs in superconducting materials could fundamentally transform power transmission and maglev transportation technology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "superconductor_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片揭示了快时尚产业背后的环境污染和劳工权益问题。",
      "sentence_pinyin": "Zhè bù jìlùpiàn jiēshì le kuài shíshàng chǎnyè bèihòu de huánjìng wūrǎn hé láogōng quányì wèntí.",
      "sentence_fr": "Ce documentaire révèle les problèmes de pollution environnementale et de droits des travailleurs derrière l'industrie de la mode rapide.",
      "sentence_en": "This documentary reveals the environmental pollution and labor rights issues behind the fast fashion industry.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "fast_fashion_critique",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模块化建筑技术通过预制构件大幅缩短了施工周期并减少了现场废料。",
      "sentence_pinyin": "Mókuàihuà jiànzhù jìshù tōngguò yùzhì gòujiàn dàfú suōduǎn le shīgōng zhōuqī bìng jiǎnshǎo le xiànchǎng fèiliào.",
      "sentence_fr": "La technologie de construction modulaire réduit considérablement le temps de construction et les déchets sur site grâce aux composants préfabriqués.",
      "sentence_en": "Modular construction technology significantly shortens construction time and reduces on-site waste through prefabricated components.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "modular_construction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语音助手的情感计算能力正在向更加自然和人性化的交互方向发展。",
      "sentence_pinyin": "Yǔyīn zhùshǒu de qínggǎn jìsuàn nénglì zhèngzài xiàng gèngjiā zìrán hé rénxìnghuà de jiāohù fāngxiàng fāzhǎn.",
      "sentence_fr": "Les capacités de calcul émotionnel des assistants vocaux évoluent vers des interactions plus naturelles et humanisées.",
      "sentence_en": "The emotional computing capabilities of voice assistants are developing towards more natural and humanized interaction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "affective_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "野生动物保护工作者利用卫星追踪技术监测濒危物种的迁徙路线和栖息地使用情况。",
      "sentence_pinyin": "Yěshēng dòngwù bǎohù gōngzuòzhě lìyòng wèixīng zhuīzōng jìshù jiāncè bīnwēi wùzhǒng de qiānxǐ lùxiàn hé qīxīdì shǐyòng qíngkuàng.",
      "sentence_fr": "Les protecteurs de la faune utilisent la technologie de suivi par satellite pour surveiller les routes de migration et l'utilisation de l'habitat des espèces menacées.",
      "sentence_en": "Wildlife conservationists use satellite tracking technology to monitor the migration routes and habitat use of endangered species.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wildlife_tracking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "元宇宙概念的兴起推动了虚拟空间社交互动和数字资产交易的发展。",
      "sentence_pinyin": "Yuányǔzhòu gàiniàn de xīngqǐ tuīdòng le xūnǐ kōngjiān shèjiāo hùdòng hé shùzì zīchǎn jiāoyì de fāzhǎn.",
      "sentence_fr": "L'essor du concept de métavers a stimulé le développement des interactions sociales dans l'espace virtuel et des transactions d'actifs numériques.",
      "sentence_en": "The rise of the metaverse concept has driven the development of virtual space social interaction and digital asset trading.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metaverse",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地热能作为一种稳定可靠的可再生能源在北欧国家得到了广泛应用。",
      "sentence_pinyin": "Dìrènéng zuòwéi yī zhǒng wěndìng kěkào de kě zàishēng néngyuán zài Běi'ōu guójiā dédào le guǎngfàn yìngyòng.",
      "sentence_fr": "L'énergie géothermique, en tant que source d'énergie renouvelable stable et fiable, est largement utilisée dans les pays nordiques.",
      "sentence_en": "Geothermal energy, as a stable and reliable renewable energy source, has been widely applied in Nordic countries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geothermal_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
