{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个电子病历系统实现了医疗信息的互联互通和共享。",
      "sentence_pinyin": "Zhège diànzǐ bìnglì xìtǒng shíxiànle yīliáo xìnxī de hùlián hùtōng hé gòngxiǎng.",
      "sentence_fr": "Ce système de dossiers médicaux électroniques réalise l'interconnexion et le partage des informations médicales.",
      "sentence_en": "This electronic medical record system achieves interconnection and sharing of medical information.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_records",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在京剧表演中完美诠释了花旦角色的形象和神韵。",
      "sentence_pinyin": "Tā zài jīngjù biǎoyǎn zhōng wánměi quánshìle huādàn juésè de xíngxiàng hé shényùn.",
      "sentence_fr": "Dans sa performance d'opéra de Pékin, elle a parfaitement interprété l'image et l'essence du rôle de huadan.",
      "sentence_en": "In her Peking Opera performance, she perfectly interpreted the image and essence of the huadan role.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "peking_opera",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧城市项目整合了交通、能源和公共服务的管理系统。",
      "sentence_pinyin": "Zhège zhìhuì chéngshì xiàngmù zhěnghéle jiāotōng, néngyuán hé gōnggòng fúwù de guǎnlǐ xìtǒng.",
      "sentence_fr": "Ce projet de ville intelligente intègre les systèmes de gestion des transports, de l'énergie et des services publics.",
      "sentence_en": "This smart city project integrates management systems for transportation, energy, and public services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_cities",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在短篇小说创作中擅长描绘人物的内心世界和情感变化。",
      "sentence_pinyin": "Tā zài duǎnpiān xiǎoshuō chuàngzuò zhōng shàncháng miáohuì rénwù de nèixīn shìjiè hé qínggǎn biànhuà.",
      "sentence_fr": "Dans la création de nouvelles, il excelle dans la description du monde intérieur et des changements émotionnels des personnages.",
      "sentence_en": "In short story creation, he excels at depicting characters' inner worlds and emotional changes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "short_stories",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个儿童安全座椅通过了严格的碰撞测试和安全认证。",
      "sentence_pinyin": "Zhège értóng ānquán zuòyǐ tōngguòle yángé de pèngzhuàng cèshì hé ānquán rènzhèng.",
      "sentence_fr": "Ce siège auto pour enfants a passé des tests de collision rigoureux et une certification de sécurité.",
      "sentence_en": "This child safety seat passed rigorous crash tests and safety certification.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "child_safety",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的景观设计注重生态平衡和人文关怀的和谐统一。",
      "sentence_pinyin": "Tā de jǐngguān shèjì zhùzhòng shēngtài pínghéng hé rénwén guānhuái de héxié tǒngyī.",
      "sentence_fr": "Sa conception paysagère met l'accent sur l'unité harmonieuse entre l'équilibre écologique et l'attention humaniste.",
      "sentence_en": "Her landscape design emphasizes harmonious unity between ecological balance and humanistic care.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "landscape_design",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个精准扶贫项目通过产业发展帮助贫困户实现脱贫致富。",
      "sentence_pinyin": "Zhège jīngzhǔn fúpín xiàngmù tōngguò chǎnyè fāzhǎn bāngzhù pínkùn hù shíxiàn tuōpín zhìfù.",
      "sentence_fr": "Ce projet de réduction ciblée de la pauvreté aide les ménages pauvres à sortir de la pauvreté et à prospérer grâce au développement industriel.",
      "sentence_en": "This targeted poverty alleviation project helps impoverished households escape poverty and prosper through industrial development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poverty_alleviation",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在高尔夫运动中培养了专注力和心理素质。",
      "sentence_pinyin": "Tā zài gāo'ěrfū yùndòng zhōng péiyǎngle zhuānzhùlì hé xīnlǐ sùzhì.",
      "sentence_fr": "Dans le golf, il a développé sa concentration et ses qualités psychologiques.",
      "sentence_en": "In golf, he developed his concentration and psychological qualities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "golf",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个共享办公空间为创业团队提供了灵活的工作环境。",
      "sentence_pinyin": "Zhège gòngxiǎng bàngōng kōngjiān wèi chuàngyè tuánduì tígōngle línghuó de gōngzuò huánjìng.",
      "sentence_fr": "Cet espace de coworking fournit un environnement de travail flexible pour les équipes entrepreneuriales.",
      "sentence_en": "This coworking space provides a flexible working environment for entrepreneurial teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "coworking_spaces",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在青铜器修复工作中运用了传统技艺和现代科技手段。",
      "sentence_pinyin": "Tā zài qīngtóngqì xiūfù gōngzuò zhōng yùnyòngle chuántǒng jìyì hé xiàndài kējì shǒuduàn.",
      "sentence_fr": "Dans le travail de restauration de bronzes, elle a utilisé des techniques traditionnelles et des moyens technologiques modernes.",
      "sentence_en": "In bronze restoration work, she used traditional techniques and modern technological means.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "artifact_restoration",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个电动汽车充电网络覆盖了城市的主要交通枢纽和商业区。",
      "sentence_pinyin": "Zhège diàndòng qìchē chōngdiàn wǎngluò fùgàile chéngshì de zhǔyào jiāotōng shūniǔ hé shāngyè qū.",
      "sentence_fr": "Ce réseau de recharge pour véhicules électriques couvre les principaux centres de transport et zones commerciales de la ville.",
      "sentence_en": "This electric vehicle charging network covers the city's main transportation hubs and commercial areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_charging",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在竹笛演奏中展现了高超的气息控制和指法技巧。",
      "sentence_pinyin": "Tā zài zhúdí yǎnzòu zhōng zhǎnxiànle gāochāo de qìxī kòngzhì hé zhǐfǎ jìqiǎo.",
      "sentence_fr": "Il a démontré un contrôle supérieur de la respiration et une technique de doigté dans son jeu de flûte de bambou.",
      "sentence_en": "He demonstrated superior breath control and fingering technique in his bamboo flute performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_flute",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个医疗废物处理中心采用了无害化焚烧和消毒技术。",
      "sentence_pinyin": "Zhège yīliáo fèiwù chǔlǐ zhōngxīn cǎiyòngle wúhàihuà fénshāo hé xiāodú jìshù.",
      "sentence_fr": "Ce centre de traitement des déchets médicaux adopte des technologies d'incinération inoffensive et de désinfection.",
      "sentence_en": "This medical waste treatment center adopts harmless incineration and disinfection technologies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_waste",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的混合媒介艺术作品融合了绘画、拼贴和装置等多种表现形式。",
      "sentence_pinyin": "Tā de hùnhé méijiè yìshù zuòpǐn rónghéle huìhuà, pīntiē hé zhuāngzhì děng duō zhǒng biǎoxiàn xíngshì.",
      "sentence_fr": "Ses œuvres d'art en techniques mixtes fusionnent diverses formes d'expression comme la peinture, le collage et l'installation.",
      "sentence_en": "Her mixed media art works fuse various forms of expression such as painting, collage, and installation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mixed_media_art",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个水资源管理系统优化了城市用水的调配和循环利用。",
      "sentence_pinyin": "Zhège shuǐ zīyuán guǎnlǐ xìtǒng yōuhuàle chéngshì yòngshuǐ de diàopèi hé xúnhuán lìyòng.",
      "sentence_fr": "Ce système de gestion des ressources en eau optimise la distribution et le recyclage de l'eau urbaine.",
      "sentence_en": "This water resource management system optimizes urban water distribution and recycling.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "water_management",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在散文写作中善于运用细腻的笔触描绘生活场景。",
      "sentence_pinyin": "Tā zài sǎnwén xiězuò zhōng shànyú yùnyòng xìnì de bǐchù miáohuì shēnghuó chǎngjǐng.",
      "sentence_fr": "Dans l'écriture d'essais, il excelle à utiliser des touches délicates pour dépeindre des scènes de vie.",
      "sentence_en": "In essay writing, he excels at using delicate touches to depict life scenes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "essay_writing",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地震预警系统能够在地震发生前发出预警信号。",
      "sentence_pinyin": "Zhège dìzhèn yùjǐng xìtǒng nénggòu zài dìzhèn fāshēng qián fāchū yùjǐng xìnhào.",
      "sentence_fr": "Ce système d'alerte sismique peut émettre des signaux d'alerte avant qu'un tremblement de terre ne se produise.",
      "sentence_en": "This earthquake early warning system can issue warning signals before an earthquake occurs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "earthquake_warning",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在民族舞蹈编创中融入了当地的文化特色和民俗元素。",
      "sentence_pinyin": "Tā zài mínzúwǔdǎo biānchuàng zhōng róngrùle dāngdì de wénhuà tèsè hé mínsú yuánsù.",
      "sentence_fr": "Dans la chorégraphie de danse ethnique, elle a intégré les caractéristiques culturelles locales et les éléments folkloriques.",
      "sentence_en": "In ethnic dance choreography, she integrated local cultural characteristics and folk elements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ethnic_dance",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食品安全追溯平台让消费者了解产品从农场到餐桌的全过程。",
      "sentence_pinyin": "Zhège shípǐn ānquán zhuīsù píngtái ràng xiāofèizhě liǎojiě chǎnpǐn cóng nóngchǎng dào cānzhuō de quán guòchéng.",
      "sentence_fr": "Cette plateforme de traçabilité de sécurité alimentaire permet aux consommateurs de connaître l'ensemble du processus des produits de la ferme à la table.",
      "sentence_en": "This food safety traceability platform allows consumers to understand the entire process of products from farm to table.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_safety",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在壁球运动中提高了反应速度和战术思维能力。",
      "sentence_pinyin": "Tā zài bìqiú yùndòng zhōng tígāole fǎnyìng sùdù hé zhànshù sīwéi nénglì.",
      "sentence_fr": "Dans le squash, il a amélioré sa vitesse de réaction et ses capacités de réflexion tactique.",
      "sentence_en": "In squash, he improved his reaction speed and tactical thinking abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "squash",
      "created_at": "2025-11-20T19:10:00.000Z",
      "updated_at": "2025-11-20T19:10:00.000Z"
    }
  ]
}
