{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能无线耳机可以主动降噪,提供沉浸式的音乐体验。",
      "sentence_pinyin": "Zhège zhìnéng wúxiàn ěrjī kěyǐ zhǔdòng jiàngzào, tígōng chénjìnshì de yīnyuè tǐyàn.",
      "sentence_fr": "Ces écouteurs sans fil intelligents peuvent réduire activement le bruit, offrant une expérience musicale immersive.",
      "sentence_en": "These smart wireless earbuds can actively reduce noise, providing an immersive music experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_earbuds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阿昌族的阿昌刀是云南德宏地区著名的传统手工艺品。",
      "sentence_pinyin": "Āchāngzú de Āchāngdāo shì Yúnnán Déhóng dìqū zhùmíng de chuántǒng shǒugōngyìpǐn.",
      "sentence_fr": "Le couteau Achang de l'ethnie Achang est un artisanat traditionnel célèbre de la région de Dehong au Yunnan.",
      "sentence_en": "The Achang ethnic group's Achang knife is a famous traditional handicraft of Yunnan's Dehong region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "achang_knives",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的智慧图书馆提供自助借还和电子阅读等便捷服务。",
      "sentence_pinyin": "Chéngshì de zhìhuì túshūguǎn tígōng zìzhù jiè huán hé diànzǐ yuèdú děng biànjié fúwù.",
      "sentence_fr": "Les bibliothèques intelligentes urbaines offrent des services pratiques comme l'emprunt/retour en libre-service et la lecture électronique.",
      "sentence_en": "Urban smart libraries provide convenient services like self-service borrowing and electronic reading.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_libraries",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能车载净化器可以过滤车内空气中的有害物质和异味。",
      "sentence_pinyin": "Zhìnéng chēzài jìnghuàqì kěyǐ guòlǜ chē nèi kōngqì zhōng de yǒuhài wùzhì hé yìwèi.",
      "sentence_fr": "Le purificateur d'air de voiture intelligent peut filtrer les substances nocives et les odeurs dans l'air du véhicule.",
      "sentence_en": "The smart car air purifier can filter harmful substances and odors from the air inside the vehicle.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_car_purifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的打铁花表演是元宵节期间的壮观民俗活动。",
      "sentence_pinyin": "Zhōngguó chuántǒng de dǎ tiěhuā biǎoyǎn shì Yuánxiāojié qījiān de zhuàngguān mínsú huódòng.",
      "sentence_fr": "Le spectacle traditionnel chinois des fleurs de fer est une activité folklorique spectaculaire pendant la Fête des Lanternes.",
      "sentence_en": "Traditional Chinese iron flower performance is a spectacular folk activity during the Lantern Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "iron_flower_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能儿童学习桌可以根据孩子身高自动调节桌面高度。",
      "sentence_pinyin": "Zhìnéng értóng xuéxí zhuō kěyǐ gēnjù háizi shēngāo zìdòng tiáojié zhuōmiàn gāodù.",
      "sentence_fr": "Le bureau d'étude intelligent pour enfants peut ajuster automatiquement la hauteur selon la taille de l'enfant.",
      "sentence_en": "The smart children's study desk can automatically adjust desk height based on the child's height.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_kids_desks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "普米族的大过年是云南宁蒗地区独特的传统节日。",
      "sentence_pinyin": "Pǔmǐzú de Dàguònián shì Yúnnán Nínglàng dìqū dútè de chuántǒng jiérì.",
      "sentence_fr": "Le Grand Nouvel An de l'ethnie Pumi est une fête traditionnelle unique de la région de Ninglang au Yunnan.",
      "sentence_en": "The Pumi ethnic group's Grand New Year is a unique traditional festival of Yunnan's Ninglang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pumi_new_year",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推行的乡村振兴战略促进了农村经济的全面发展。",
      "sentence_pinyin": "Zhèngfǔ tuīxíng de xiāngcūn zhènxīng zhànlüè cùjìn le nóngcūn jīngjì de quánmiàn fāzhǎn.",
      "sentence_fr": "La stratégie de revitalisation rurale promue par le gouvernement a favorisé le développement global de l'économie rurale.",
      "sentence_en": "The government's rural revitalization strategy has promoted comprehensive development of the rural economy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_revitalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子秤可以通过蓝牙将数据同步到手机健康应用。",
      "sentence_pinyin": "Zhìnéng diànzǐ chèng kěyǐ tōngguò lánya jiāng shùjù tóngbù dào shǒujī jiànkāng yìngyòng.",
      "sentence_fr": "La balance électronique intelligente peut synchroniser les données via Bluetooth avec l'application santé du téléphone.",
      "sentence_en": "The smart electronic scale can sync data to the phone health app via Bluetooth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bluetooth_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的耍社火表演是北方农村元宵节的热闹民俗。",
      "sentence_pinyin": "Zhōngguó chuántǒng de shuǎ shèhuǒ biǎoyǎn shì běifāng nóngcūn Yuánxiāojié de rènào mínsú.",
      "sentence_fr": "Le spectacle traditionnel chinois de Shehuo est une coutume populaire animée du Nouvel An dans les villages du nord.",
      "sentence_en": "Traditional Chinese Shehuo performance is a lively folk custom during Lantern Festival in northern rural areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shehuo_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能洗地机可以同时完成扫地、拖地和吸水等多项清洁工作。",
      "sentence_pinyin": "Zhìnéng xǐdìjī kěyǐ tóngshí wánchéng sǎodì, tuōdì hé xīshuǐ děng duō xiàng qīngjié gōngzuò.",
      "sentence_fr": "La machine de nettoyage de sol intelligente peut effectuer simultanément le balayage, le lavage et l'aspiration de l'eau.",
      "sentence_en": "The smart floor cleaning machine can simultaneously complete sweeping, mopping, and water absorption tasks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_floor_cleaners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "怒族的仙女节是云南怒江地区重要的传统节日。",
      "sentence_pinyin": "Nùzú de Xiānnǚjié shì Yúnnán Nùjiāng dìqū zhòngyào de chuántǒng jiérì.",
      "sentence_fr": "La Fête de la Fée de l'ethnie Nu est une fête traditionnelle importante de la région de Nujiang au Yunnan.",
      "sentence_en": "The Nu ethnic group's Fairy Festival is an important traditional festival of Yunnan's Nujiang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nu_fairy_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的口袋健身房为上班族提供了便捷的锻炼场所。",
      "sentence_pinyin": "Chéngshì de kǒudài jiànshēnfáng wèi shàngbānzú tígōng le biànjié de duànliàn chǎngsuǒ.",
      "sentence_fr": "Les mini-salles de sport urbaines offrent aux travailleurs des lieux d'exercice pratiques.",
      "sentence_en": "Urban pocket gyms provide office workers with convenient exercise venues.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pocket_gyms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物训练器可以通过声音和震动纠正宠物的不良行为。",
      "sentence_pinyin": "Zhìnéng chǒngwù xùnliànqì kěyǐ tōngguò shēngyīn hé zhèndòng jiūzhèng chǒngwù de bùliáng xíngwéi.",
      "sentence_fr": "Le dresseur d'animaux intelligent peut corriger les mauvais comportements des animaux par le son et les vibrations.",
      "sentence_en": "The smart pet trainer can correct pets' bad behaviors through sound and vibration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_trainers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的抬阁表演是庙会期间展示民间技艺的精彩节目。",
      "sentence_pinyin": "Zhōngguó chuántǒng de táigé biǎoyǎn shì miàohuì qījiān zhǎnshì mínjiān jìyì de jīngcǎi jiémù.",
      "sentence_fr": "Le spectacle traditionnel chinois du palanquin est un programme passionnant présentant les arts populaires lors des foires du temple.",
      "sentence_en": "Traditional Chinese sedan chair performance is an exciting show displaying folk skills during temple fairs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "taige_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能婴儿体温计可以贴在宝宝身上持续监测体温变化。",
      "sentence_pinyin": "Zhìnéng yīng'ér tǐwēnjì kěyǐ tiē zài bǎobao shēnshàng chíxù jiāncè tǐwēn biànhuà.",
      "sentence_fr": "Le thermomètre intelligent pour bébé peut être collé sur le bébé pour surveiller en continu les variations de température.",
      "sentence_en": "The smart baby thermometer can be attached to the baby to continuously monitor temperature changes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_baby_thermometers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "独龙族的卡雀哇节是云南独龙江地区隆重的传统节日。",
      "sentence_pinyin": "Dúlóngzú de Kǎquèwā jié shì Yúnnán Dúlóngjiāng dìqū lóngzhòng de chuántǒng jiérì.",
      "sentence_fr": "La Fête Kaquewa de l'ethnie Dulong est une fête traditionnelle solennelle de la région de Dulongjiang au Yunnan.",
      "sentence_en": "The Dulong ethnic group's Kaquewa Festival is a grand traditional festival of Yunnan's Dulongjiang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dulong_kaquewa",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区推行的垃圾定时投放制度培养了居民良好的环保习惯。",
      "sentence_pinyin": "Shèqū tuīxíng de lājī dìngshí tóufàng zhìdù péiyǎng le jūmín liánghǎo de huánbǎo xíguàn.",
      "sentence_fr": "Le système de collecte des déchets à heures fixes promu par la communauté a cultivé de bonnes habitudes environnementales chez les résidents.",
      "sentence_en": "The community's timed waste disposal system has cultivated good environmental habits among residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "timed_waste_disposal",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子琴架可以根据演奏者的身高自动调节高度。",
      "sentence_pinyin": "Zhìnéng diànzǐqín jià kěyǐ gēnjù yǎnzòuzhě de shēngāo zìdòng tiáojié gāodù.",
      "sentence_fr": "Le support de clavier intelligent peut ajuster automatiquement la hauteur selon la taille du musicien.",
      "sentence_en": "The smart keyboard stand can automatically adjust height based on the performer's height.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_keyboard_stands",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的跑旱船表演是民间节庆活动中的趣味节目。",
      "sentence_pinyin": "Zhōngguó chuántǒng de pǎo hànchuán biǎoyǎn shì mínjiān jiéqìng huódòng zhōng de qùwèi jiémù.",
      "sentence_fr": "Le spectacle traditionnel chinois du bateau terrestre est un programme amusant lors des célébrations folkloriques.",
      "sentence_en": "Traditional Chinese land boat performance is a fun show during folk festive activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "land_boat_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
