{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "精神分析心理学探索潜意识动机和早期经历对人格的影响。",
      "sentence_pinyin": "Jīngshén fēnxī xīnlǐxué tànsuǒ qiányìshí dòngjī hé zǎoqī jīnglì duì réngé de yǐngxiǎng.",
      "sentence_fr": "La psychologie psychanalytique explore les motivations inconscientes et l'influence des expériences précoces sur la personnalité.",
      "sentence_en": "Psychoanalytic psychology explores unconscious motivations and the influence of early experiences on personality.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychoanalytic_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "X射线天文学观测宇宙中高能天体的X射线辐射。",
      "sentence_pinyin": "X shèxiàn tiānwénxué guāncè yǔzhòu zhōng gāonéng tiāntǐ de X shèxiàn fúshè.",
      "sentence_fr": "L'astronomie des rayons X observe le rayonnement X des objets célestes à haute énergie dans l'univers.",
      "sentence_en": "X-ray astronomy observes X-ray radiation from high-energy celestial objects in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "xray_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "财务杠杆分析研究债务融资对公司风险和回报的影响。",
      "sentence_pinyin": "Cáiwù gànggǎn fēnxī yánjiū zhàiwù róngzī duì gōngsī fēngxiǎn hé huíbào de yǐngxiǎng.",
      "sentence_fr": "L'analyse du levier financier étudie l'impact du financement par emprunt sur le risque et le rendement de l'entreprise.",
      "sentence_en": "Financial leverage analysis studies the impact of debt financing on company risk and return.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_leverage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全基线配置定义系统和应用程序的最低安全要求。",
      "sentence_pinyin": "Ānquán jīxiàn pèizhì dìngyì xìtǒng hé yìngyòng chéngxù de zuìdī ānquán yāoqiú.",
      "sentence_fr": "La configuration de base de sécurité définit les exigences de sécurité minimales pour les systèmes et les applications.",
      "sentence_en": "Security baseline configuration defines minimum security requirements for systems and applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_baseline",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行为主义心理学关注可观察的行为以及环境刺激与反应的关系。",
      "sentence_pinyin": "Xíngwéi zhǔyì xīnlǐxué guānzhù kě guānchá de xíngwéi yǐjí huánjìng cìjī yǔ fǎnyìng de guānxì.",
      "sentence_fr": "La psychologie behavioriste se concentre sur les comportements observables et la relation entre les stimuli environnementaux et les réponses.",
      "sentence_en": "Behaviorist psychology focuses on observable behavior and the relationship between environmental stimuli and responses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "behaviorist_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "伽马射线天文学探测宇宙中最高能量的电磁辐射。",
      "sentence_pinyin": "Jiā mǎ shèxiàn tiānwénxué tàncè yǔzhòu zhōng zuì gāo néngliàng de diàncí fúshè.",
      "sentence_fr": "L'astronomie des rayons gamma détecte le rayonnement électromagnétique de plus haute énergie dans l'univers.",
      "sentence_en": "Gamma-ray astronomy detects the highest-energy electromagnetic radiation in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gamma_ray_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资本资产定价模型量化风险与预期回报之间的关系。",
      "sentence_pinyin": "Zīběn zīchǎn dìngjià móxíng liànghuà fēngxiǎn yǔ yùqī huíbào zhījiān de guānxì.",
      "sentence_fr": "Le modèle d'évaluation des actifs financiers quantifie la relation entre le risque et le rendement attendu.",
      "sentence_en": "The capital asset pricing model quantifies the relationship between risk and expected return.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "capm",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全软件开发生命周期将安全实践集成到开发的每个阶段。",
      "sentence_pinyin": "Ānquán ruǎnjiàn kāifā shēngmìng zhōuqī jiāng ānquán shíjiàn jíchéng dào kāifā de měi gè jiēduàn.",
      "sentence_fr": "Le cycle de vie de développement logiciel sécurisé intègre les pratiques de sécurité à chaque étape du développement.",
      "sentence_en": "Secure software development lifecycle integrates security practices into every stage of development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "secure_sdlc",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格式塔心理学研究人类如何将视觉元素组织成有意义的整体。",
      "sentence_pinyin": "Géshìtǎ xīnlǐxué yánjiū rénlèi rúhé jiāng shìjué yuánsù zǔzhī chéng yǒu yìyì de zhěngtǐ.",
      "sentence_fr": "La psychologie de la Gestalt étudie comment les humains organisent les éléments visuels en un tout significatif.",
      "sentence_en": "Gestalt psychology studies how humans organize visual elements into meaningful wholes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gestalt_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "红外天文学通过探测红外辐射来观测被尘埃遮挡的天体。",
      "sentence_pinyin": "Hóngwài tiānwénxué tōngguò tàncè hóngwài fúshè lái guāncè bèi chéntǔ zhēdǎng de tiāntǐ.",
      "sentence_fr": "L'astronomie infrarouge observe les objets célestes cachés par la poussière en détectant le rayonnement infrarouge.",
      "sentence_en": "Infrared astronomy observes celestial objects obscured by dust by detecting infrared radiation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "infrared_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "股息政策决定公司如何将利润分配给股东或再投资。",
      "sentence_pinyin": "Gǔxī zhèngcè juédìng gōngsī rúhé jiāng lìrùn fēnpèi gěi gǔdōng huò zài tóuzī.",
      "sentence_fr": "La politique de dividendes détermine comment une entreprise distribue les bénéfices aux actionnaires ou les réinvestit.",
      "sentence_en": "Dividend policy determines how a company distributes profits to shareholders or reinvests them.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dividend_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络防火墙根据预定义规则监控和过滤进出网络的流量。",
      "sentence_pinyin": "Wǎngluò fánghuǒqiáng gēnjù yùdìngyì guīzé jiānkòng hé guòlǜ jìnchū wǎngluò de liúliàng.",
      "sentence_fr": "Les pare-feu réseau surveillent et filtrent le trafic entrant et sortant du réseau selon des règles prédéfinies.",
      "sentence_en": "Network firewalls monitor and filter incoming and outgoing network traffic based on predefined rules.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_firewalls",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "系统心理治疗将心理问题视为家庭和社会系统互动的产物。",
      "sentence_pinyin": "Xìtǒng xīnlǐ zhìliáo jiāng xīnlǐ wèntí shì wéi jiātíng hé shèhuì xìtǒng hùdòng de chǎnwù.",
      "sentence_fr": "La psychothérapie systémique considère les problèmes psychologiques comme le produit des interactions familiales et des systèmes sociaux.",
      "sentence_en": "Systemic psychotherapy views psychological problems as products of family and social system interactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "systemic_psychotherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "紫外天文学研究恒星和星系发出的紫外线辐射特征。",
      "sentence_pinyin": "Zǐwài tiānwénxué yánjiū héngxīng hé xīngxì fāchū de zǐwàixiàn fúshè tèzhēng.",
      "sentence_fr": "L'astronomie ultraviolette étudie les caractéristiques du rayonnement ultraviolet émis par les étoiles et les galaxies.",
      "sentence_en": "Ultraviolet astronomy studies the ultraviolet radiation characteristics emitted by stars and galaxies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ultraviolet_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资本结构理论研究债务和股权融资的最优组合。",
      "sentence_pinyin": "Zīběn jiégòu lǐlùn yánjiū zhàiwù hé gǔquán róngzī de zuìyōu zǔhé.",
      "sentence_fr": "La théorie de la structure du capital étudie la combinaison optimale de financement par emprunt et par capitaux propres.",
      "sentence_en": "Capital structure theory studies the optimal combination of debt and equity financing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "capital_structure_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "防病毒软件检测和删除计算机系统中的恶意程序。",
      "sentence_pinyin": "Fáng bìngdú ruǎnjiàn jiǎncè hé shānchú jìsuànjī xìtǒng zhōng de èyì chéngxù.",
      "sentence_fr": "Les logiciels antivirus détectent et suppriment les programmes malveillants des systèmes informatiques.",
      "sentence_en": "Antivirus software detects and removes malicious programs from computer systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "antivirus_software",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "依恋理论研究早期亲子关系如何影响个人的情感发展。",
      "sentence_pinyin": "Yīliàn lǐlùn yánjiū zǎoqī qīnzǐ guānxì rúhé yǐngxiǎng gèrén de qínggǎn fāzhǎn.",
      "sentence_fr": "La théorie de l'attachement étudie comment les relations parent-enfant précoces influencent le développement émotionnel de l'individu.",
      "sentence_en": "Attachment theory studies how early parent-child relationships influence individual emotional development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "attachment_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光学天文学使用可见光波段观测恒星、行星和星系。",
      "sentence_pinyin": "Guāngxué tiānwénxué shǐyòng kějiàn guāng bōduàn guāncè héngxīng, xíngxīng hé xīngxì.",
      "sentence_fr": "L'astronomie optique utilise la bande de lumière visible pour observer les étoiles, les planètes et les galaxies.",
      "sentence_en": "Optical astronomy uses the visible light spectrum to observe stars, planets, and galaxies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "optical_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "有效市场假说认为资产价格反映了所有可获得的信息。",
      "sentence_pinyin": "Yǒuxiào shìchǎng jiǎshuō rènwéi zīchǎn jiàgé fǎnyìngle suǒyǒu kě huòdé de xìnxī.",
      "sentence_fr": "L'hypothèse de l'efficience des marchés soutient que les prix des actifs reflètent toutes les informations disponibles.",
      "sentence_en": "The efficient market hypothesis holds that asset prices reflect all available information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "efficient_market_hypothesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "入侵防御系统主动阻止检测到的网络攻击和威胁。",
      "sentence_pinyin": "Rùqīn fángyù xìtǒng zhǔdòng zǔzhǐ jiǎncè dào de wǎngluò gōngjī hé wēixié.",
      "sentence_fr": "Les systèmes de prévention des intrusions bloquent activement les attaques réseau et les menaces détectées.",
      "sentence_en": "Intrusion prevention systems actively block detected network attacks and threats.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intrusion_prevention",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
