{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "神经语言编程理论声称可以通过改变思维和语言模式来改善个人表现。",
      "sentence_pinyin": "Shénjīng yǔyán biānchéng lǐlùn chēngchèn kěyǐ tōngguò gǎibiàn sīwéi hé yǔyán móshì lái gǎishàn gèrén biǎoxiàn.",
      "sentence_fr": "La théorie de la programmation neurolinguistique prétend pouvoir améliorer la performance personnelle en modifiant les schémas de pensée et de langage.",
      "sentence_en": "Neuro-linguistic programming theory claims to improve personal performance by changing thinking and language patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neuro_linguistic_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电表使电力公司能够实时监控能源消耗并优化电网运营。",
      "sentence_pinyin": "Zhìnéng diànbiǎo shǐ diànlì gōngsī nénggòu shíshí jiānkòng néngyuán xiāohào bìng yōuhuà diànwǎng yùnyíng.",
      "sentence_fr": "Les compteurs intelligents permettent aux compagnies d'électricité de surveiller la consommation d'énergie en temps réel et d'optimiser l'exploitation du réseau.",
      "sentence_en": "Smart meters enable electricity companies to monitor energy consumption in real-time and optimize grid operations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_meters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市社会学研究城市环境中的社会关系、社区形成和空间不平等。",
      "sentence_pinyin": "Chéngshì shèhuì xué yánjiū chéngshì huánjìng zhōng de shèhuì guānxì, shèqū xíngchéng hé kōngjiān bù píngděng.",
      "sentence_fr": "La sociologie urbaine étudie les relations sociales, la formation de communautés et les inégalités spatiales dans les environnements urbains.",
      "sentence_en": "Urban sociology studies social relationships, community formation, and spatial inequality in urban environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基因编辑婴儿事件引发了全球对生殖细胞基因修改伦理边界的讨论。",
      "sentence_pinyin": "Jīyīn biānjí yīng'ér shìjiàn yǐnfā le quánqiú duì shēngzhí xìbāo jīyīn xiūgǎi lúnlǐ biānjiè de tǎolùn.",
      "sentence_fr": "L'affaire des bébés génétiquement modifiés a déclenché un débat mondial sur les limites éthiques de la modification génétique des cellules germinales.",
      "sentence_en": "The gene-edited babies incident sparked global discussion about ethical boundaries of germline genetic modification.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "germline_editing_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情感劳动研究探讨服务行业工作者管理自身情绪表达的要求和影响。",
      "sentence_pinyin": "Qínggǎn láodòng yánjiū tàntǎo fúwù hángyè gōngzuò zhě guǎnlǐ zìshēn qíngxù biǎodá de yāoqiú hé yǐngxiǎng.",
      "sentence_fr": "La recherche sur le travail émotionnel explore les exigences et les impacts de la gestion de l'expression émotionnelle des travailleurs du secteur des services.",
      "sentence_en": "Emotional labor research explores the requirements and impacts of service industry workers managing their emotional expression.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emotional_labor",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声子晶体结构可以操控热量传导以实现高效的热管理应用。",
      "sentence_pinyin": "Shēngzǐ jīngtǐ jiégòu kěyǐ cāokòng rèliàng chuándǎo yǐ shíxiàn gāoxiào de rè guǎnlǐ yìngyòng.",
      "sentence_fr": "Les structures de cristaux phononiques peuvent manipuler la conduction thermique pour des applications efficaces de gestion thermique.",
      "sentence_en": "Phononic crystal structures can manipulate heat conduction for efficient thermal management applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "phononic_crystals",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "信息架构设计确保网站和应用程序的内容组织方式便于用户查找和理解。",
      "sentence_pinyin": "Xìnxī jiàgòu shèjì quèbǎo wǎngzhàn hé yìngyòng chéngxù de nèiróng zǔzhī fāngshì biànyú yònghù cházhǎo hé lǐjiě.",
      "sentence_fr": "La conception de l'architecture de l'information garantit que l'organisation du contenu des sites web et des applications est facile à trouver et à comprendre pour les utilisateurs.",
      "sentence_en": "Information architecture design ensures website and application content organization is easy for users to find and understand.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "information_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物力学研究分析人体运动的力学原理以优化运动表现和预防损伤。",
      "sentence_pinyin": "Shēngwù lìxué yánjiū fēnxī réntǐ yùndòng de lìxué yuánlǐ yǐ yōuhuà yùndòng biǎoxiàn hé yùfáng sǔnshāng.",
      "sentence_fr": "La recherche en biomécanique analyse les principes mécaniques du mouvement humain pour optimiser la performance sportive et prévenir les blessures.",
      "sentence_en": "Biomechanics research analyzes mechanical principles of human movement to optimize athletic performance and prevent injuries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biomechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "污水处理技术的进步使城市废水能够被安全地回收利用于农业灌溉。",
      "sentence_pinyin": "Wūshuǐ chǔlǐ jìshù de jìnbù shǐ chéngshì fèishuǐ nénggòu bèi ānquán de huíshōu lìyòng yú nóngyè guàngài.",
      "sentence_fr": "Les progrès des technologies de traitement des eaux usées permettent de recycler en toute sécurité les eaux usées urbaines pour l'irrigation agricole.",
      "sentence_en": "Advances in wastewater treatment technology enable urban wastewater to be safely recycled for agricultural irrigation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wastewater_treatment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "框架效应研究表明信息呈现方式如何显著影响人们的决策和判断。",
      "sentence_pinyin": "Kuàngjià xiàoyìng yánjiū biǎomíng xìnxī chéngxiàn fāngshì rúhé xiǎnzhù yǐngxiǎng rénmen de juécè hé pànduàn.",
      "sentence_fr": "La recherche sur l'effet de cadrage montre comment la façon de présenter l'information influence significativement les décisions et les jugements des gens.",
      "sentence_en": "Framing effect research shows how information presentation significantly influences people's decisions and judgments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "framing_effect",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子点显示技术提供了更广的色域和更高的能效比传统液晶显示器。",
      "sentence_pinyin": "Liàngzǐ diǎn xiǎnshì jìshù tígōng le gèng guǎng de sèyù hé gèng gāo de néngxiào bǐ chuántǒng yèjīng xiǎnshìqì.",
      "sentence_fr": "La technologie d'affichage à points quantiques offre une gamme de couleurs plus large et une meilleure efficacité énergétique que les écrans LCD traditionnels.",
      "sentence_en": "Quantum dot display technology provides wider color gamut and higher energy efficiency than traditional LCD displays.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_dot_displays",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城乡差距研究分析农村和城市地区在经济发展和公共服务方面的不平等。",
      "sentence_pinyin": "Chéng xiāng chājù yánjiū fēnxī nóngcūn hé chéngshì dìqū zài jīngjì fāzhǎn hé gōnggòng fúwù fāngmiàn de bù píngděng.",
      "sentence_fr": "La recherche sur les disparités urbain-rural analyse les inégalités entre les zones rurales et urbaines en termes de développement économique et de services publics.",
      "sentence_en": "Urban-rural gap research analyzes inequalities between rural and urban areas in economic development and public services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_rural_inequality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基因组宽关联研究帮助识别与复杂疾病风险相关的遗传变异。",
      "sentence_pinyin": "Jīyīn zǔ kuān guānlián yánjiū bāngzhù shìbié yǔ fùzá jíbìng fēngxiǎn xiāngguān de yíchuán biànyì.",
      "sentence_fr": "Les études d'association pangénomique aident à identifier les variations génétiques associées au risque de maladies complexes.",
      "sentence_en": "Genome-wide association studies help identify genetic variants associated with complex disease risk.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gwas",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会许可概念强调企业运营需要获得当地社区的认可和支持。",
      "sentence_pinyin": "Shèhuì xǔkě gàiniàn qiángdiào qǐyè yùnyíng xūyào huòdé dāngdì shèqū de rènkě hé zhīchí.",
      "sentence_fr": "Le concept de licence sociale souligne que les opérations commerciales nécessitent l'approbation et le soutien des communautés locales.",
      "sentence_en": "The social license concept emphasizes that business operations need approval and support from local communities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_license",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人工光合作用研究试图复制植物将阳光转化为化学能的过程。",
      "sentence_pinyin": "Réngōng guānghé zuòyòng yánjiū shìtú fùzhì zhíwù jiāng yángguāng zhuǎnhuà wéi huàxué néng de guòchéng.",
      "sentence_fr": "La recherche sur la photosynthèse artificielle tente de reproduire le processus par lequel les plantes convertissent la lumière du soleil en énergie chimique.",
      "sentence_en": "Artificial photosynthesis research attempts to replicate the process by which plants convert sunlight into chemical energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "artificial_photosynthesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言演变研究追踪语言如何在数代人之间发生语音、语法和词汇变化。",
      "sentence_pinyin": "Yǔyán yǎnbiàn yánjiū zhuīzōng yǔyán rúhé zài shù dài rén zhījiān fāshēng yǔyīn, yǔfǎ hé cíhuì biànhuà.",
      "sentence_fr": "L'étude de l'évolution linguistique suit comment les langues subissent des changements phonétiques, grammaticaux et lexicaux au fil des générations.",
      "sentence_en": "Language evolution research tracks how languages undergo phonetic, grammatical, and lexical changes across generations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_evolution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "持续集成和持续部署实践加速了软件开发和交付周期。",
      "sentence_pinyin": "Chíxù jíchéng hé chíxù bùshǔ shíjiàn jiāsù le ruǎnjiàn kāifā hé jiāofù zhōuqī.",
      "sentence_fr": "Les pratiques d'intégration continue et de déploiement continu accélèrent les cycles de développement et de livraison de logiciels.",
      "sentence_en": "Continuous integration and continuous deployment practices accelerate software development and delivery cycles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ci_cd",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "婴儿认知研究揭示了婴幼儿时期大脑发育的关键窗口期。",
      "sentence_pinyin": "Yīng'ér rènzhī yánjiū jiēshì le yīngyòu'ér shíqī dànǎo fāyù de guānjiàn chuāngkǒu qī.",
      "sentence_fr": "La recherche sur la cognition infantile révèle les fenêtres critiques du développement cérébral pendant la petite enfance.",
      "sentence_en": "Infant cognition research reveals critical windows of brain development during early childhood.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "infant_cognition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络安全演习帮助组织测试和改进其应对网络攻击的能力。",
      "sentence_pinyin": "Wǎngluò ānquán yǎnxí bāngzhù zǔzhī cèshì hé gǎijìn qí yìngduì wǎngluò gōngjī de nénglì.",
      "sentence_fr": "Les exercices de cybersécurité aident les organisations à tester et à améliorer leur capacité à répondre aux cyberattaques.",
      "sentence_en": "Cybersecurity exercises help organizations test and improve their ability to respond to cyberattacks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cybersecurity_exercises",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "复杂自适应系统理论解释了生态系统和经济系统如何自组织和演化。",
      "sentence_pinyin": "Fùzá zìshìyìng xìtǒng lǐlùn jiěshì le shēngtài xìtǒng hé jīngjì xìtǒng rúhé zì zǔzhī hé yǎnhuà.",
      "sentence_fr": "La théorie des systèmes adaptatifs complexes explique comment les écosystèmes et les systèmes économiques s'auto-organisent et évoluent.",
      "sentence_en": "Complex adaptive systems theory explains how ecosystems and economic systems self-organize and evolve.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "complex_adaptive_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
