{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧校园系统实现了考勤管理、安全监控和教学资源共享的一体化。",
      "sentence_pinyin": "Zhège zhìhuì xiàoyuán xìtǒng shíxiànle kǎoqín guǎnlǐ, ānquán jiānkòng hé jiàoxué zīyuán gòngxiǎng de yītǐhuà.",
      "sentence_fr": "Ce système de campus intelligent réalise l'intégration de la gestion des présences, de la surveillance de sécurité et du partage des ressources pédagogiques.",
      "sentence_en": "This smart campus system achieves integration of attendance management, security monitoring, and teaching resource sharing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_campus",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "箫的音孔排列精确,需要掌握正确的指法和呼吸技巧才能吹好。",
      "sentence_pinyin": "Xiāo de yīnkǒng páiliè jīngquè, xūyào zhǎngwò zhèngquè de zhǐfǎ hé hūxī jìqiǎo cái néng chuī hǎo.",
      "sentence_fr": "Les trous sonores du xiao sont disposés avec précision, nécessitant une maîtrise correcte du doigté et des techniques de respiration pour bien jouer.",
      "sentence_en": "The xiao's sound holes are precisely arranged, requiring mastery of correct fingering and breathing techniques to play well.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiao_techniques",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线招聘平台利用人工智能技术实现了职位和求职者的精准匹配。",
      "sentence_pinyin": "Zhège zàixiàn zhāopìn píngtái lìyòng réngōng zhìnéng jìshù shíxiànle zhíwèi hé qiúzhízhě de jīngzhǔn pǐpèi.",
      "sentence_fr": "Cette plateforme de recrutement en ligne utilise la technologie d'intelligence artificielle pour réaliser un appariement précis entre postes et candidats.",
      "sentence_en": "This online recruitment platform uses artificial intelligence technology to achieve precise matching between positions and job seekers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_recruitment",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "羽毛画利用各种鸟类羽毛的色彩和质地,拼贴成精美的装饰画。",
      "sentence_pinyin": "Yǔmáo huà lìyòng gèzhǒng niǎolèi yǔmáo de sècǎi hé zhìdì, pīntiē chéng jīngměi de zhuāngshì huà.",
      "sentence_fr": "La peinture sur plumes utilise les couleurs et textures de diverses plumes d'oiseaux pour créer de belles peintures décoratives par collage.",
      "sentence_en": "Feather painting uses the colors and textures of various bird feathers to create beautiful decorative paintings through collage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "feather_art",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能冰箱可以自动记录食材的保质期并提醒用户及时食用。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng bīngxiāng kěyǐ zìdòng jìlù shícái de bǎozhìqī bìng tíxǐng yònghù jíshí shíyòng.",
      "sentence_fr": "Ce réfrigérateur intelligent peut enregistrer automatiquement les dates de péremption des aliments et rappeler aux utilisateurs de les consommer à temps.",
      "sentence_en": "This smart refrigerator can automatically record food expiration dates and remind users to consume them in time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fridges",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个公益助学项目已经帮助数千名贫困学生完成了学业。",
      "sentence_pinyin": "Zhège gōngyì zhùxué xiàngmù yǐjīng bāngzhù shù qiān míng pínkùn xuéshēng wánchéngle xuéyè.",
      "sentence_fr": "Ce projet caritatif d'aide aux études a déjà aidé des milliers d'étudiants pauvres à terminer leurs études.",
      "sentence_en": "This charitable education aid project has already helped thousands of impoverished students complete their studies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education_charity",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝的定弦有多种调式,演奏者需要根据曲目要求进行调弦。",
      "sentence_pinyin": "Gǔzhēng de dìngxián yǒu duō zhǒng diàoshì, yǎnzòuzhě xūyào gēnjù qǔmù yāoqiú jìnxíng tiáoxián.",
      "sentence_fr": "Le guzheng a plusieurs modes d'accord, les interprètes doivent accorder l'instrument selon les exigences du morceau.",
      "sentence_en": "The guzheng has multiple tuning modes, and performers need to tune the instrument according to the piece's requirements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_tuning",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能交通信号系统根据实时路况动态调整红绿灯时长。",
      "sentence_pinyin": "Zhège zhìnéng jiāotōng xìnhào xìtǒng gēnjù shíshí lùkuàng dòngtài tiáozhěng hónglǜdēng shícháng.",
      "sentence_fr": "Ce système de feux de circulation intelligent ajuste dynamiquement la durée des feux selon les conditions routières en temps réel.",
      "sentence_en": "This smart traffic signal system dynamically adjusts traffic light duration based on real-time traffic conditions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "adaptive_traffic_lights",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "石板画在天然石板上作画,利用石材本身的纹理增添艺术效果。",
      "sentence_pinyin": "Shíbǎn huà zài tiānrán shíbǎn shàng zuòhuà, lìyòng shícái běnshēn de wénlǐ zēngtiān yìshù xiàoguǒ.",
      "sentence_fr": "La peinture sur ardoise peint sur des ardoises naturelles, utilisant les textures de la pierre elle-même pour ajouter des effets artistiques.",
      "sentence_en": "Slate painting paints on natural slate, using the stone's own textures to add artistic effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "slate_painting",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能手环不仅能监测运动数据,还能进行移动支付。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng shǒuhuán bùjǐn néng jiāncè yùndòng shùjù, hái néng jìnxíng yídòng zhīfù.",
      "sentence_fr": "Ce bracelet intelligent peut non seulement surveiller les données d'exercice, mais aussi effectuer des paiements mobiles.",
      "sentence_en": "This smart bracelet can not only monitor exercise data but also make mobile payments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bracelets",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个水质监测系统实时检测饮用水的各项指标,保障居民用水安全。",
      "sentence_pinyin": "Zhège shuǐzhì jiāncè xìtǒng shíshí jiǎncè yǐnyòngshuǐ de gè xiàng zhǐbiāo, bǎozhàng jūmín yòngshuǐ ānquán.",
      "sentence_fr": "Ce système de surveillance de la qualité de l'eau détecte en temps réel les divers indicateurs de l'eau potable, garantissant la sécurité de l'eau pour les résidents.",
      "sentence_en": "This water quality monitoring system detects various drinking water indicators in real-time, ensuring water safety for residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "water_quality_monitoring",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡名曲《赛马》模仿了蒙古族赛马的场景,节奏欢快热烈。",
      "sentence_pinyin": "Èrhú míngqǔ 'Sàimǎ' mófǎngle Měnggǔzú sàimǎ de chǎngjǐng, jiézòu huānkuài rèliè.",
      "sentence_fr": "La célèbre pièce d'erhu 'Course de chevaux' imite la scène de course de chevaux mongole, avec un rythme joyeux et animé.",
      "sentence_en": "The famous erhu piece 'Horse Racing' imitates the Mongolian horse racing scene with a cheerful and lively rhythm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_repertoire",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个视频会议平台支持多人在线协作,提供了屏幕共享和白板功能。",
      "sentence_pinyin": "Zhège shìpín huìyì píngtái zhīchí duō rén zàixiàn xiézuò, tígōngle píngmù gòngxiǎng hé báibǎn gōngnéng.",
      "sentence_fr": "Cette plateforme de visioconférence prend en charge la collaboration en ligne multi-utilisateurs et offre des fonctions de partage d'écran et de tableau blanc.",
      "sentence_en": "This video conferencing platform supports multi-user online collaboration and provides screen sharing and whiteboard functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "video_conferencing",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "葫芦烫画在葫芦表面用烙铁烫出各种图案和文字。",
      "sentence_pinyin": "Húlu tànghuà zài húlu biǎomiàn yòng làotiě tàng chū gèzhǒng tú'àn hé wénzì.",
      "sentence_fr": "La pyrographie sur calebasse brûle divers motifs et caractères sur la surface de la calebasse avec un fer à souder.",
      "sentence_en": "Gourd pyrography burns various patterns and characters on the gourd surface with a soldering iron.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gourd_pyrography",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能烤箱可以通过手机应用远程控制温度和烘烤时间。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng kǎoxiāng kěyǐ tōngguò shǒujī yìngyòng yuǎnchéng kòngzhì wēndù hé hōngkǎo shíjiān.",
      "sentence_fr": "Ce four intelligent peut contrôler à distance la température et le temps de cuisson via une application mobile.",
      "sentence_en": "This smart oven can remotely control temperature and baking time through a mobile app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_ovens",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区养老服务站为高龄老人提供助餐、助浴和助医等服务。",
      "sentence_pinyin": "Zhège shèqū yǎnglǎo fúwù zhàn wèi gāolíng lǎorén tígōng zhùcān, zhùyù hé zhùyī děng fúwù.",
      "sentence_fr": "Cette station de services aux personnes âgées de la communauté offre des services d'aide aux repas, au bain et aux soins médicaux pour les personnes âgées.",
      "sentence_en": "This community elderly care service station provides meal assistance, bathing assistance, and medical assistance services for the elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_service_stations",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶的演奏姿势要求身体端正,琵琶斜立于胸前右侧。",
      "sentence_pinyin": "Pípá de yǎnzòu zīshì yāoqiú shēntǐ duānzhèng, pípá xiélì yú xiōngqián yòucè.",
      "sentence_fr": "La posture de jeu du pipa exige que le corps soit droit, le pipa étant incliné sur le côté droit devant la poitrine.",
      "sentence_en": "The playing posture of the pipa requires an upright body, with the pipa inclined on the right side in front of the chest.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_posture",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线借阅平台整合了全市图书馆资源,实现了通借通还。",
      "sentence_pinyin": "Zhège zàixiàn jièyuè píngtái zhěnghéle quánshì túshūguǎn zīyuán, shíxiànle tōngjiè tōnghuán.",
      "sentence_fr": "Cette plateforme de prêt en ligne intègre les ressources bibliothécaires de toute la ville, réalisant l'emprunt et le retour universels.",
      "sentence_en": "This online borrowing platform integrates library resources across the city, achieving universal borrowing and returning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "library_networks",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "烙画艺术用电烙铁在木板或葫芦上烫出深浅不一的线条和图案。",
      "sentence_pinyin": "Làohuà yìshù yòng diàn làotiě zài mùbǎn huò húlu shàng tàng chū shēnqiǎn bùyī de xiàntiáo hé tú'àn.",
      "sentence_fr": "L'art de la pyrographie utilise un fer à souder électrique pour brûler des lignes et motifs de différentes profondeurs sur bois ou calebasses.",
      "sentence_en": "Pyrography art uses an electric soldering iron to burn lines and patterns of varying depths on wood or gourds.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pyrography",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能血糖仪可以无痛采血并自动记录血糖数据生成分析报告。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xuètángyí kěyǐ wútòng cǎixiě bìng zìdòng jìlù xuètáng shùjù shēngchéng fēnxī bàogào.",
      "sentence_fr": "Ce glucomètre intelligent peut prélever du sang sans douleur et enregistrer automatiquement les données de glycémie pour générer des rapports d'analyse.",
      "sentence_en": "This smart blood glucose meter can collect blood painlessly and automatically record blood sugar data to generate analysis reports.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_glucose_meters",
      "created_at": "2025-11-20T21:30:00.000Z",
      "updated_at": "2025-11-20T21:30:00.000Z"
    }
  ]
}
