{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这座古城的修复工程严格遵循了保护文物的原真性原则。",
      "sentence_pinyin": "Zhè zuò gǔchéng de xiūfù gōngchéng yángé zūnxúnle bǎohù wénwù de yuánzhēnxìng yuánzé.",
      "sentence_fr": "Le projet de restauration de cette ville ancienne respecte strictement le principe d'authenticité dans la protection du patrimoine culturel.",
      "sentence_en": "The restoration project of this ancient city strictly follows the principle of authenticity in cultural heritage protection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "heritage_restoration",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐的声音高亢嘹亮,常用于婚丧嫁娶等民间重要场合。",
      "sentence_pinyin": "Suǒnà de shēngyīn gāokàng liáoliàng, cháng yòng yú hūnsāng jiàqǔ děng mínjiān zhòngyào chǎnghé.",
      "sentence_fr": "Le son puissant et éclatant du suona est souvent utilisé lors de cérémonies populaires importantes comme les mariages et les funérailles.",
      "sentence_en": "The loud and clear sound of the suona is often used in important folk occasions such as weddings and funerals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_music",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智慧城市建设通过大数据分析,优化了交通信号灯的配时方案。",
      "sentence_pinyin": "Zhìhuì chéngshì jiànshè tōngguò dà shùjù fēnxī, yōuhuàle jiāotōng xìnhàodēng de pèishí fāng'àn.",
      "sentence_fr": "La construction de ville intelligente optimise la synchronisation des feux de circulation grâce à l'analyse des mégadonnées.",
      "sentence_en": "Smart city development optimizes traffic light timing schemes through big data analysis.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_cities",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家公司开发的语音合成技术已经达到了接近真人的自然度。",
      "sentence_pinyin": "Zhè jiā gōngsī kāifā de yǔyīn héchéng jìshù yǐjīng dádàole jiējìn zhēnrén de zìrándu.",
      "sentence_fr": "La technologie de synthèse vocale développée par cette entreprise a atteint un niveau de naturel proche de la voix humaine.",
      "sentence_en": "The speech synthesis technology developed by this company has reached a naturalness close to that of real human voices.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "speech_synthesis",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蜡染是贵州苗族的传统印染技艺,每一块布料都是独一无二的艺术品。",
      "sentence_pinyin": "Làrǎn shì Guìzhōu Miáozú de chuántǒng yìnrǎn jìyì, měi yī kuài bùliào dōu shì dúyīwú'èr de yìshùpǐn.",
      "sentence_fr": "La cire batik est une technique traditionnelle de teinture des Miao du Guizhou, chaque tissu est une œuvre d'art unique.",
      "sentence_en": "Batik is a traditional dyeing technique of the Miao people in Guizhou, and each piece of fabric is a unique work of art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "batik_art",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无人机在农业植保领域的应用,提高了喷洒农药的效率和精准度。",
      "sentence_pinyin": "Wúrénjī zài nóngyè zhíbǎo lǐngyù de yìngyòng, tígāole pēnsǎ nóngyào de xiàolǜ hé jīngzhǔndù.",
      "sentence_fr": "L'application des drones dans la protection des cultures agricoles améliore l'efficacité et la précision de la pulvérisation de pesticides.",
      "sentence_en": "The application of drones in agricultural crop protection has improved the efficiency and precision of pesticide spraying.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_drones",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个心理咨询平台为抑郁症患者提供了24小时在线支持服务。",
      "sentence_pinyin": "Zhège xīnlǐ zīxún píngtái wèi yìyùzhèng huànzhě tígōngle èrshísì xiǎoshí zàixiàn zhīchí fúwù.",
      "sentence_fr": "Cette plateforme de conseil psychologique offre un service d'assistance en ligne 24 heures sur 24 aux patients souffrant de dépression.",
      "sentence_en": "This psychological counseling platform provides 24-hour online support services for patients with depression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_counseling",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古琴以其深邃的音色和丰富的文化内涵,被列入世界非物质文化遗产。",
      "sentence_pinyin": "Gǔqín yǐ qí shēnsuì de yīnsè hé fēngfù de wénhuà nèihán, bèi lièrù shìjiè fēiwùzhì wénhuà yíchǎn.",
      "sentence_fr": "Le guqin, avec son timbre profond et sa riche signification culturelle, est inscrit au patrimoine culturel immatériel mondial.",
      "sentence_en": "The guqin, with its profound tone and rich cultural connotations, is listed as a world intangible cultural heritage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guqin_music",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "移动支付的普及让人们出门不再需要携带现金或银行卡。",
      "sentence_pinyin": "Yídòng zhīfù de pǔjí ràng rénmen chūmén bù zài xūyào xiédài xiànjīn huò yínhángkǎ.",
      "sentence_fr": "La popularisation du paiement mobile permet aux gens de sortir sans avoir besoin d'emporter de l'argent liquide ou des cartes bancaires.",
      "sentence_en": "The popularization of mobile payment allows people to go out without needing to carry cash or bank cards.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mobile_payment",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座国家公园建立了完善的野生动物监测网络,保护珍稀物种。",
      "sentence_pinyin": "Zhè zuò guójiā gōngyuán jiànlìle wánshàn de yěshēng dòngwù jiāncè wǎngluò, bǎohù zhēnxī wùzhǒng.",
      "sentence_fr": "Ce parc national a établi un réseau complet de surveillance de la faune pour protéger les espèces rares.",
      "sentence_en": "This national park has established a comprehensive wildlife monitoring network to protect rare species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wildlife_monitoring",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "剪纸艺术家通过一把剪刀和一张红纸,就能创作出精美绝伦的作品。",
      "sentence_pinyin": "Jiǎnzhǐ yìshùjiā tōngguò yī bǎ jiǎndāo hé yī zhāng hóngzhǐ, jiù néng chuàngzuò chū jīngměi juélún de zuòpǐn.",
      "sentence_fr": "Les artistes de découpage de papier peuvent créer des œuvres d'une beauté exquise avec simplement une paire de ciseaux et une feuille de papier rouge.",
      "sentence_en": "Paper-cutting artists can create exquisitely beautiful works with just a pair of scissors and a sheet of red paper.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "paper_cutting",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线教育平台为偏远地区的孩子提供了优质的课程资源。",
      "sentence_pinyin": "Zhège zàixiàn jiàoyù píngtái wèi piānyuǎn dìqū de háizi tígōngle yōuzhì de kèchéng zīyuán.",
      "sentence_fr": "Cette plateforme d'éducation en ligne fournit des ressources pédagogiques de qualité aux enfants des régions éloignées.",
      "sentence_en": "This online education platform provides quality course resources for children in remote areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_education",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电动汽车充电桩的广泛布局,解决了新能源车主的续航焦虑问题。",
      "sentence_pinyin": "Diàndòng qìchē chōngdiànzhuāng de guǎngfàn bùjú, jiějuéle xīn néngyuán chēzhǔ de xùháng jiāolǜ wèntí.",
      "sentence_fr": "Le déploiement généralisé des bornes de recharge pour véhicules électriques résout l'anxiété liée à l'autonomie des propriétaires de voitures à énergie nouvelle.",
      "sentence_en": "The widespread deployment of electric vehicle charging stations has solved the range anxiety problem for new energy vehicle owners.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_charging",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "编钟是中国古代的打击乐器,一套编钟可以演奏完整的音阶。",
      "sentence_pinyin": "Biānzhōng shì Zhōngguó gǔdài de dǎjí yuèqì, yī tào biānzhōng kěyǐ yǎnzòu wánzhěng de yīnjiē.",
      "sentence_fr": "Le carillon de cloches est un instrument de percussion chinois antique, un ensemble peut jouer une gamme complète.",
      "sentence_en": "The bronze bell chime is an ancient Chinese percussion instrument, and a set can play a complete musical scale.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bronze_bells",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人工智能辅助诊断系统能够快速识别医学影像中的病变区域。",
      "sentence_pinyin": "Réngōng zhìnéng fǔzhù zhěnduàn xìtǒng nénggòu kuàisù shíbié yīxué yǐngxiàng zhōng de bìngbiàn qūyù.",
      "sentence_fr": "Le système de diagnostic assisté par intelligence artificielle peut identifier rapidement les zones pathologiques dans les images médicales.",
      "sentence_en": "The AI-assisted diagnostic system can quickly identify pathological areas in medical images.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_diagnostics",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区图书馆每周举办读书会,促进居民之间的文化交流。",
      "sentence_pinyin": "Zhège shèqū túshūguǎn měi zhōu jǔbàn dúshūhuì, cùjìn jūmín zhījiān de wénhuà jiāoliú.",
      "sentence_fr": "Cette bibliothèque communautaire organise chaque semaine un club de lecture pour promouvoir les échanges culturels entre les résidents.",
      "sentence_en": "This community library holds book club meetings every week to promote cultural exchange among residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_libraries",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "景泰蓝工艺以其华丽的色彩和精湛的工艺闻名于世。",
      "sentence_pinyin": "Jǐngtàilán gōngyì yǐ qí huálì de sècǎi hé jīngzhàn de gōngyì wénmíng yú shì.",
      "sentence_fr": "L'art du cloisonné est mondialement célèbre pour ses couleurs éclatantes et son savoir-faire exquis.",
      "sentence_en": "Cloisonné craftsmanship is world-renowned for its brilliant colors and exquisite workmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cloisonne",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "区块链技术在食品溯源领域的应用,让消费者能够了解产品的完整生产链条。",
      "sentence_pinyin": "Qūkuàiliàn jìshù zài shípǐn sùyuán lǐngyù de yìngyòng, ràng xiāofèizhě nénggòu liǎojiě chǎnpǐn de wánzhěng shēngchǎn liàntiáo.",
      "sentence_fr": "L'application de la technologie blockchain dans la traçabilité alimentaire permet aux consommateurs de connaître toute la chaîne de production.",
      "sentence_en": "The application of blockchain technology in food traceability allows consumers to understand the complete production chain of products.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "blockchain_traceability",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家养老院配备了先进的健康监测设备,实时关注老人的身体状况。",
      "sentence_pinyin": "Zhè jiā yǎnglǎoyuàn pèibèile xiānjìn de jiànkāng jiāncè shèbèi, shíshí guānzhù lǎorén de shēntǐ zhuàngkuàng.",
      "sentence_fr": "Cette maison de retraite est équipée de dispositifs avancés de surveillance de la santé pour suivre en temps réel l'état physique des personnes âgées.",
      "sentence_en": "This nursing home is equipped with advanced health monitoring devices to track the physical condition of the elderly in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_care_facilities",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "风筝制作是中国的传统手工艺,每年春天都有大型风筝节庆祝这项艺术。",
      "sentence_pinyin": "Fēngzhēng zhìzuò shì Zhōngguó de chuántǒng shǒugōngyì, měi nián chūntiān dōu yǒu dàxíng fēngzhēng jié qìngzhù zhè xiàng yìshù.",
      "sentence_fr": "La fabrication de cerfs-volants est un artisanat traditionnel chinois, chaque printemps un grand festival célèbre cet art.",
      "sentence_en": "Kite making is a traditional Chinese handicraft, and every spring there is a large kite festival celebrating this art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kite_making",
      "created_at": "2025-11-20T20:25:00.000Z",
      "updated_at": "2025-11-20T20:25:00.000Z"
    }
  ]
}
