{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能电饭煲可以根据米种自动调节烹饪程序,做出口感完美的米饭。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànfànbāo kěyǐ gēnjù mǐ zhǒng zìdòng tiáojié pēngrèn chéngxù, zuò chū kǒugǎn wánměi de mǐfàn.",
      "sentence_fr": "Ce cuiseur à riz intelligent ajuste automatiquement le programme de cuisson selon le type de riz pour un résultat parfait.",
      "sentence_en": "This smart rice cooker automatically adjusts cooking programs based on rice type for perfect texture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_rice_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仡佬族的地戏是古老的傩戏形式,演员戴着面具表演英雄故事。",
      "sentence_pinyin": "Gēlǎozú de dìxì shì gǔlǎo de nuóxì xíngshì, yǎnyuán dài zhe miànjù biǎoyǎn yīngxióng gùshì.",
      "sentence_fr": "Le théâtre de terrain des Gelao est une forme ancienne de théâtre nuo où les acteurs portent des masques pour jouer des histoires de héros.",
      "sentence_en": "The Gelao people's ground opera is an ancient form of nuo theater where performers wear masks to act out heroic stories.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gelao_ground_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织了消防安全演练,教居民如何正确使用灭火器和逃生方法。",
      "sentence_pinyin": "Shèqū zǔzhī le xiāofáng ānquán yǎnliàn, jiāo jūmín rúhé zhèngquè shǐyòng mièhuǒqì hé táoshēng fāngfǎ.",
      "sentence_fr": "La communauté a organisé un exercice de sécurité incendie pour apprendre aux résidents l'utilisation correcte des extincteurs et les méthodes d'évacuation.",
      "sentence_en": "The community organized a fire safety drill to teach residents how to properly use fire extinguishers and evacuation methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fire_safety_drills",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跳绳不仅是孩子们喜欢的游戏,也是一项有效的有氧运动方式。",
      "sentence_pinyin": "Tiàoshéng bùjǐn shì háizimen xǐhuān de yóuxì, yě shì yī xiàng yǒuxiào de yǒuyǎng yùndòng fāngshì.",
      "sentence_fr": "Sauter à la corde n'est pas seulement un jeu que les enfants aiment, c'est aussi une forme efficace d'exercice aérobique.",
      "sentence_en": "Jump rope is not only a game children love, but also an effective form of aerobic exercise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jump_rope_exercise",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能门铃配有高清摄像头,可以远程查看访客并与其对话。",
      "sentence_pinyin": "Zhège zhìnéng ménlíng pèi yǒu gāoqīng shèxiàngtóu, kěyǐ yuǎnchéng chákàn fǎngkè bìng yǔ qí duìhuà.",
      "sentence_fr": "Cette sonnette intelligente est équipée d'une caméra HD permettant de voir les visiteurs à distance et de leur parler.",
      "sentence_en": "This smart doorbell features an HD camera that allows remote viewing of visitors and two-way communication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_doorbells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土家族的摆手舞是集体性舞蹈,舞者围成圆圈边唱边跳热闹非凡。",
      "sentence_pinyin": "Tǔjiāzú de bǎishǒuwǔ shì jítǐxìng wǔdǎo, wǔzhě wéi chéng yuánquān biān chàng biān tiào rènào fēifán.",
      "sentence_fr": "La danse des mains des Tujia est une danse collective où les danseurs forment un cercle, chantant et dansant joyeusement.",
      "sentence_en": "The Tujia people's hand-waving dance is a collective dance where dancers form a circle, singing and dancing merrily.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tujia_hand_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府建立了食品安全追溯系统,消费者可以查询食品的生产来源。",
      "sentence_pinyin": "Zhèngfǔ jiànlì le shípǐn ānquán zhuīsù xìtǒng, xiāofèizhě kěyǐ cháxún shípǐn de shēngchǎn láiyuán.",
      "sentence_fr": "Le gouvernement a établi un système de traçabilité alimentaire permettant aux consommateurs de consulter l'origine des produits.",
      "sentence_en": "The government established a food safety traceability system allowing consumers to check the production origin of food.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_traceability_system",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能体温计可以非接触式测量体温,一秒钟就能得出准确结果。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng tǐwēnjì kěyǐ fēi jiēchùshì cèliáng tǐwēn, yī miǎozhōng jiù néng déchū zhǔnquè jiéguǒ.",
      "sentence_fr": "Ce thermomètre intelligent peut mesurer la température sans contact et donner un résultat précis en une seconde.",
      "sentence_en": "This smart thermometer can measure body temperature contactlessly and provide accurate results in one second.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_thermometers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "布朗族的蜂桶鼓舞是祭祀性舞蹈,模仿蜜蜂飞舞的动作非常独特。",
      "sentence_pinyin": "Bùlǎngzú de fēngtǒnggǔwǔ shì jìsìxìng wǔdǎo, mófǎng mìfēng fēiwǔ de dòngzuò fēicháng dútè.",
      "sentence_fr": "La danse du tambour-ruche des Blang est une danse rituelle imitant de manière unique le vol des abeilles.",
      "sentence_en": "The Blang people's beehive drum dance is a ritual dance with unique movements imitating the flight of bees.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "blang_beehive_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "老鹰捉小鸡是中国最受欢迎的儿童集体游戏之一,需要团队合作精神。",
      "sentence_pinyin": "Lǎoyīng zhuō xiǎojī shì Zhōngguó zuì shòu huānyíng de értóng jítǐ yóuxì zhī yī, xūyào tuánduì hézuò jīngshén.",
      "sentence_fr": "L'aigle attrape les poussins est l'un des jeux collectifs les plus populaires pour les enfants en Chine, nécessitant un esprit d'équipe.",
      "sentence_en": "Eagle catches chicks is one of China's most popular children's group games, requiring teamwork spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "eagle_catches_chicks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区为行动不便的居民提供上门理发和家政服务,解决生活难题。",
      "sentence_pinyin": "Shèqū wèi xíngdòng bùbiàn de jūmín tígōng shàngmén lǐfà hé jiāzhèng fúwù, jiějué shēnghuó nántí.",
      "sentence_fr": "La communauté offre des services de coiffure et d'aide ménagère à domicile pour les résidents à mobilité réduite.",
      "sentence_en": "The community provides home haircut and housekeeping services for residents with limited mobility.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "home_care_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能投影仪支持无线投屏,可以将手机内容投射到墙上观看。",
      "sentence_pinyin": "Zhège zhìnéng tóuyǐngyí zhīchí wúxiàn tóupíng, kěyǐ jiāng shǒujī nèiróng tóushè dào qiáng shàng guānkàn.",
      "sentence_fr": "Ce projecteur intelligent prend en charge la projection sans fil, permettant d'afficher le contenu du téléphone sur le mur.",
      "sentence_en": "This smart projector supports wireless screen casting, allowing phone content to be projected onto the wall.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_projectors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "普米族的四弦琴是他们的传统乐器,音色悠扬动听深受人们喜爱。",
      "sentence_pinyin": "Pǔmǐzú de sìxiánqín shì tāmen de chuántǒng yuèqì, yīnsè yōuyáng dòngtīng shēn shòu rénmen xǐ'ài.",
      "sentence_fr": "La guitare à quatre cordes des Pumi est leur instrument traditionnel, au son mélodieux très apprécié.",
      "sentence_en": "The Pumi people's four-string guitar is their traditional instrument, beloved for its melodious and pleasant sound.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pumi_four_string_guitar",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市建设了多条绿道,方便市民骑行和步行健身休闲活动。",
      "sentence_pinyin": "Chéngshì jiànshè le duō tiáo lǜdào, fāngbiàn shìmín qíxíng hé bùxíng jiànshēn xiūxián huódòng.",
      "sentence_fr": "La ville a construit plusieurs voies vertes pour faciliter le cyclisme, la marche et les activités de loisirs des citoyens.",
      "sentence_en": "The city has built multiple greenways to facilitate cycling, walking, and leisure activities for citizens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_greenways",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电热毯有多档温度调节,还能定时关闭保障安全使用。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànrètǎn yǒu duō dǎng wēndù tiáojié, hái néng dìngshí guānbì bǎozhàng ānquán shǐyòng.",
      "sentence_fr": "Cette couverture chauffante intelligente dispose de plusieurs niveaux de température et d'une minuterie pour une utilisation sécurisée.",
      "sentence_en": "This smart electric blanket has multiple temperature settings and can be timed to turn off for safe use.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_electric_blankets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "躲猫猫是世界各地孩子们都喜欢玩的经典游戏,规则简单容易上手。",
      "sentence_pinyin": "Duǒ māomāo shì shìjiè gèdì háizimen dōu xǐhuān wán de jīngdiǎn yóuxì, guīzé jiǎndān róngyì shàngshǒu.",
      "sentence_fr": "Cache-cache est un jeu classique que les enfants du monde entier aiment jouer, avec des règles simples et faciles à apprendre.",
      "sentence_en": "Hide and seek is a classic game that children around the world love to play, with simple and easy-to-learn rules.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hide_and_seek",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "怒族的怒江溜索曾是他们过江的唯一方式,现已成为旅游体验项目。",
      "sentence_pinyin": "Nùzú de Nùjiāng liūsuǒ céng shì tāmen guòjiāng de wéiyī fāngshì, xiàn yǐ chéngwéi lǚyóu tǐyàn xiàngmù.",
      "sentence_fr": "La tyrolienne du fleuve Nu des Nu était autrefois leur seul moyen de traverser la rivière, devenue aujourd'hui une attraction touristique.",
      "sentence_en": "The Nu people's Nujiang zipline was once their only way to cross the river, now a tourist experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nu_river_zipline",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区建立了换书角,居民可以把看过的书籍放在那里与邻居交换。",
      "sentence_pinyin": "Shèqū jiànlì le huànshū jiǎo, jūmín kěyǐ bǎ kàn guò de shūjí fàng zài nàlǐ yǔ línjū jiāohuàn.",
      "sentence_fr": "La communauté a créé un coin d'échange de livres où les résidents peuvent déposer leurs livres lus pour les échanger avec leurs voisins.",
      "sentence_en": "The community established a book exchange corner where residents can leave read books to exchange with neighbors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_book_exchange",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能鱼缸可以自动换水和喂食,还能监控水质参数保持鱼儿健康。",
      "sentence_pinyin": "Zhège zhìnéng yúgāng kěyǐ zìdòng huànshuǐ hé wèishí, hái néng jiānkòng shuǐzhì cānshù bǎochí yú'ér jiànkāng.",
      "sentence_fr": "Cet aquarium intelligent peut changer l'eau et nourrir automatiquement, tout en surveillant les paramètres de l'eau pour la santé des poissons.",
      "sentence_en": "This smart fish tank can automatically change water and feed, monitoring water quality parameters to keep fish healthy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fish_tanks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "独龙族的纹面习俗已经消失,但这一独特传统仍被记录在历史文献中。",
      "sentence_pinyin": "Dúlóngzú de wénmiàn xísú yǐjīng xiāoshī, dàn zhè yī dútè chuántǒng réng bèi jìlù zài lìshǐ wénxiàn zhōng.",
      "sentence_fr": "La coutume du tatouage facial des Derung a disparu, mais cette tradition unique est encore documentée dans les archives historiques.",
      "sentence_en": "The Derung people's facial tattoo custom has disappeared, but this unique tradition is still recorded in historical documents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "derung_facial_tattoos",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
