{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个农业物联网系统实时监控温室大棚的温度、湿度和光照。",
      "sentence_pinyin": "Zhège nóngyè wùliánwǎng xìtǒng shíshí jiānkòng wēnshì dàpéng de wēndù, shīdù hé guāngzhào.",
      "sentence_fr": "Ce système IoT agricole surveille en temps réel la température, l'humidité et l'éclairage des serres.",
      "sentence_en": "This agricultural IoT system monitors greenhouse temperature, humidity, and lighting in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "agricultural_iot",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在昆曲演唱中展现了婉转悠扬的唱腔和细腻的表演艺术。",
      "sentence_pinyin": "Tā zài kūnqǔ yǎnchàng zhōng zhǎnxiànle wǎnzhuǎn yōuyáng de chàngqiāng hé xìnì de biǎoyǎn yìshù.",
      "sentence_fr": "Dans son chant de Kunqu, elle a démontré une voix mélodieuse et un art de la performance délicat.",
      "sentence_en": "In her Kunqu singing, she demonstrated a melodious voice and delicate performance art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kunqu_opera",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市应急指挥中心协调处理各类突发事件和公共危机。",
      "sentence_pinyin": "Zhège chéngshì yìngjí zhǐhuī zhōngxīn xiétiáo chǔlǐ gè lèi tūfā shìjiàn hé gōnggòng wēijī.",
      "sentence_fr": "Ce centre de commandement d'urgence urbain coordonne le traitement de divers incidents soudains et crises publiques.",
      "sentence_en": "This urban emergency command center coordinates handling of various sudden incidents and public crises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "emergency_management",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在科幻小说创作中构建了宏大的未来世界观和科技体系。",
      "sentence_pinyin": "Tā zài kēhuàn xiǎoshuō chuàngzuò zhōng gòujiànle hóngdà de wèilái shìjièguān hé kējì tǐxì.",
      "sentence_fr": "Dans la création de science-fiction, il a construit une vision du monde futur grandiose et un système technologique.",
      "sentence_en": "In science fiction creation, he constructed a grand future worldview and technological system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science_fiction",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个康复机器人帮助中风患者进行肢体功能恢复训练。",
      "sentence_pinyin": "Zhège kāngfù jīqìrén bāngzhù zhòngfēng huànzhě jìnxíng zhītǐ gōngnéng huīfù xùnliàn.",
      "sentence_fr": "Ce robot de réadaptation aide les patients victimes d'AVC à effectuer un entraînement de récupération des fonctions des membres.",
      "sentence_en": "This rehabilitation robot helps stroke patients perform limb function recovery training.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rehabilitation_robotics",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的陶瓷餐具设计既实用美观又符合人体工程学原理。",
      "sentence_pinyin": "Tā de táocí cānjù shèjì jì shíyòng měiguān yòu fúhé réntǐ gōngchéngxué yuánlǐ.",
      "sentence_fr": "Sa conception de vaisselle en céramique est à la fois pratique, belle et conforme aux principes ergonomiques.",
      "sentence_en": "Her ceramic tableware design is both practical, beautiful, and conforms to ergonomic principles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tableware_design",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾分类积分系统鼓励居民养成环保习惯。",
      "sentence_pinyin": "Zhège lājī fēnlèi jīfēn xìtǒng gǔlì jūmín yǎngchéng huánbǎo xíguàn.",
      "sentence_fr": "Ce système de points pour le tri des déchets encourage les résidents à développer des habitudes écologiques.",
      "sentence_en": "This waste sorting points system encourages residents to develop environmental habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在游泳训练中提高了耐力和水中技术动作的协调性。",
      "sentence_pinyin": "Tā zài yóuyǒng xùnliàn zhōng tígāole nàilì hé shuǐ zhōng jìshù dòngzuò de xiétiáoxìng.",
      "sentence_fr": "Lors de l'entraînement de natation, il a amélioré son endurance et la coordination de ses mouvements techniques dans l'eau.",
      "sentence_en": "During swimming training, he improved his endurance and coordination of technical movements in water.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "swimming",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社会工作服务站为困难家庭提供心理咨询和生活援助。",
      "sentence_pinyin": "Zhège shèhuì gōngzuò fúwù zhàn wèi kùnnan jiātíng tígōng xīnlǐ zīxún hé shēnghuó yuánzhù.",
      "sentence_fr": "Ce poste de service de travail social fournit des conseils psychologiques et une assistance à la vie quotidienne aux familles en difficulté.",
      "sentence_en": "This social work service station provides psychological counseling and life assistance to families in difficulty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_services",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在漆器制作中运用了描金、镶嵌等传统装饰工艺。",
      "sentence_pinyin": "Tā zài qīqì zhìzuò zhōng yùnyòngle miáojīn, xiāngqiàn děng chuántǒng zhuāngshì gōngyì.",
      "sentence_fr": "Dans la fabrication de laques, elle a utilisé des techniques décoratives traditionnelles comme la dorure et l'incrustation.",
      "sentence_en": "In lacquerware making, she used traditional decorative techniques such as gold tracing and inlay.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lacquerware",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能路灯系统根据环境光线自动调节亮度并节约能源。",
      "sentence_pinyin": "Zhège zhìnéng lùdēng xìtǒng gēnjù huánjìng guāngxiàn zìdòng tiáojié liàngdù bìng jiéyuē néngyuán.",
      "sentence_fr": "Ce système d'éclairage public intelligent ajuste automatiquement la luminosité en fonction de la lumière ambiante et économise l'énergie.",
      "sentence_en": "This smart street lighting system automatically adjusts brightness based on ambient light and saves energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_lighting",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在葫芦丝演奏中表现出柔美抒情的音乐风格。",
      "sentence_pinyin": "Tā zài húlúsī yǎnzòu zhōng biǎoxiàn chū róuměi shūqíng de yīnyuè fēnggé.",
      "sentence_fr": "Il a démontré un style musical doux et lyrique dans son jeu de hulusi.",
      "sentence_en": "He demonstrated a soft and lyrical musical style in his hulusi performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hulusi_music",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个火灾自动报警系统能够快速探测烟雾和高温并启动灭火装置。",
      "sentence_pinyin": "Zhège huǒzāi zìdòng bàojǐng xìtǒng nénggòu kuàisù tàncè yānwù hé gāowēn bìng qǐdòng mièhuǒ zhuāngzhì.",
      "sentence_fr": "Ce système d'alarme incendie automatique peut détecter rapidement la fumée et les hautes températures et activer les dispositifs d'extinction.",
      "sentence_en": "This automatic fire alarm system can quickly detect smoke and high temperatures and activate fire suppression devices.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fire_safety",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的光影艺术作品利用投影技术创造了奇幻的视觉体验。",
      "sentence_pinyin": "Tā de guāngyǐng yìshù zuòpǐn lìyòng tóuyǐng jìshù chuàngzàole qíhuàn de shìjué tǐyàn.",
      "sentence_fr": "Ses œuvres d'art lumière et ombre utilisent la technologie de projection pour créer des expériences visuelles fantastiques.",
      "sentence_en": "Her light and shadow art works use projection technology to create fantastic visual experiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "projection_art",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个气象预报系统利用卫星数据和超级计算机提高预报精度。",
      "sentence_pinyin": "Zhège qìxiàng yùbào xìtǒng lìyòng wèixīng shùjù hé chāojí jìsuànjī tígāo yùbào jīngdù.",
      "sentence_fr": "Ce système de prévision météorologique utilise des données satellites et des superordinateurs pour améliorer la précision des prévisions.",
      "sentence_en": "This weather forecasting system uses satellite data and supercomputers to improve forecast accuracy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "weather_forecasting",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在翻译工作中力求准确传达原文的文化内涵和语言特色。",
      "sentence_pinyin": "Tā zài fānyì gōngzuò zhōng lìqiú zhǔnquè chuándá yuánwén de wénhuà nèihán hé yǔyán tèsè.",
      "sentence_fr": "Dans son travail de traduction, il s'efforce de transmettre avec précision la connotation culturelle et les caractéristiques linguistiques du texte original.",
      "sentence_en": "In his translation work, he strives to accurately convey the cultural connotation and linguistic characteristics of the original text.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "translation_work",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个流动图书车定期前往偏远乡村为村民提供阅读服务。",
      "sentence_pinyin": "Zhège liúdòng túshū chē dìngqí qiánwǎng piānyuǎn xiāngcūn wèi cūnmín tígōng yuèdú fúwù.",
      "sentence_fr": "Ce bibliobus se rend régulièrement dans les villages éloignés pour fournir des services de lecture aux villageois.",
      "sentence_en": "This mobile library regularly visits remote villages to provide reading services to villagers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mobile_libraries",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在击剑运动中培养了敏捷的反应和精准的判断力。",
      "sentence_pinyin": "Tā zài jījiàn yùndòng zhōng péiyǎngle mǐnjié de fǎnyìng hé jīngzhǔn de pànduànlì.",
      "sentence_fr": "Dans l'escrime, elle a développé des réactions agiles et un jugement précis.",
      "sentence_en": "In fencing, she developed agile reactions and precise judgment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fencing",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个核酸检测实验室配备了先进的自动化检测设备。",
      "sentence_pinyin": "Zhège hésuān jiǎncè shíyànshì pèibèile xiānjìn de zìdònghuà jiǎncè shèbèi.",
      "sentence_fr": "Ce laboratoire de tests d'acides nucléiques est équipé d'équipements de test automatisés avancés.",
      "sentence_en": "This nucleic acid testing laboratory is equipped with advanced automated testing equipment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "testing_labs",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在摄影后期处理中精心调整色彩和光影效果。",
      "sentence_pinyin": "Tā zài shèyǐng hòuqī chǔlǐ zhōng jīngxīn tiáozhěng sècǎi hé guāngyǐng xiàoguǒ.",
      "sentence_fr": "Dans le post-traitement photographique, il ajuste soigneusement les couleurs et les effets de lumière et d'ombre.",
      "sentence_en": "In photography post-processing, he carefully adjusts colors and light-shadow effects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "photo_editing",
      "created_at": "2025-11-20T19:15:00.000Z",
      "updated_at": "2025-11-20T19:15:00.000Z"
    }
  ]
}
