{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "计算社会科学利用大数据和算法分析大规模社会现象和人类行为模式。",
      "sentence_pinyin": "Jìsuàn shèhuì kēxué lìyòng dà shùjù hé suànfǎ fēnxī dà guīmó shèhuì xiànxiàng hé rénlèi xíngwéi móshì.",
      "sentence_fr": "Les sciences sociales computationnelles utilisent le big data et les algorithmes pour analyser les phénomènes sociaux à grande échelle et les modèles de comportement humain.",
      "sentence_en": "Computational social science uses big data and algorithms to analyze large-scale social phenomena and human behavior patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computational_social_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿生学从自然界的生物结构和功能中获取灵感来设计创新工程解决方案。",
      "sentence_pinyin": "Fǎngshēngxué cóng zìránjiè de shēngwù jiégòu hé gōngnéng zhōng huòqǔ línggǎn lái shèjì chuàngxīn gōngchéng jiějué fāng'àn.",
      "sentence_fr": "La biomimétique s'inspire des structures et fonctions biologiques de la nature pour concevoir des solutions d'ingénierie innovantes.",
      "sentence_en": "Biomimetics draws inspiration from biological structures and functions in nature to design innovative engineering solutions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biomimetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动驾驶汽车的伦理困境涉及算法在紧急情况下如何做出生死决策。",
      "sentence_pinyin": "Zìdòng jiàshǐ qìchē de lúnlǐ kùnjìng shèjí suànfǎ zài jǐnjí qíngkuàng xià rúhé zuòchū shēngsǐ juécè.",
      "sentence_fr": "Les dilemmes éthiques des voitures autonomes concernent la façon dont les algorithmes prennent des décisions de vie ou de mort dans les situations d'urgence.",
      "sentence_en": "The ethical dilemmas of autonomous vehicles involve how algorithms make life-or-death decisions in emergency situations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "autonomous_vehicle_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精准农业利用卫星图像和传感器数据优化作物产量并减少资源浪费。",
      "sentence_pinyin": "Jīngzhǔn nóngyè lìyòng wèixīng túxiàng hé chuángǎnqì shùjù yōuhuà zuòwù chǎnliàng bìng jiǎnshǎo zīyuán làngfèi.",
      "sentence_fr": "L'agriculture de précision utilise l'imagerie satellite et les données des capteurs pour optimiser les rendements des cultures et réduire le gaspillage des ressources.",
      "sentence_en": "Precision agriculture uses satellite imagery and sensor data to optimize crop yields and reduce resource waste.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "precision_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语用学研究语言在具体语境中的使用以及说话者意图与字面意义之间的关系。",
      "sentence_pinyin": "Yǔyòngxué yánjiū yǔyán zài jùtǐ yǔjìng zhōng de shǐyòng yǐjí shuōhuà zhě yìtú yǔ zìmiàn yìyì zhījiān de guānxì.",
      "sentence_fr": "La pragmatique étudie l'utilisation du langage dans des contextes spécifiques et la relation entre l'intention du locuteur et le sens littéral.",
      "sentence_en": "Pragmatics studies the use of language in specific contexts and the relationship between speaker intention and literal meaning.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pragmatics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "边缘计算将数据处理从集中式云端转移到更接近数据源的本地设备。",
      "sentence_pinyin": "Biānyuán jìsuàn jiāng shùjù chǔlǐ cóng jízhōngshì yúnduān zhuǎnyí dào gèng jiējìn shùjù yuán de běndì shèbèi.",
      "sentence_fr": "L'informatique en périphérie déplace le traitement des données du cloud centralisé vers des appareils locaux plus proches de la source des données.",
      "sentence_en": "Edge computing shifts data processing from centralized cloud to local devices closer to the data source.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "edge_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "发展心理学追踪人类从婴儿期到老年期的认知和情感变化轨迹。",
      "sentence_pinyin": "Fāzhǎn xīnlǐxué zhuīzōng rénlèi cóng yīng'ér qī dào lǎonián qī de rènzhī hé qínggǎn biànhuà guǐjì.",
      "sentence_fr": "La psychologie du développement suit la trajectoire des changements cognitifs et émotionnels de l'être humain de la petite enfance à la vieillesse.",
      "sentence_en": "Developmental psychology tracks the trajectory of cognitive and emotional changes in humans from infancy to old age.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "developmental_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "平台经济正在重新定义传统的雇佣关系和劳动者的社会保障体系。",
      "sentence_pinyin": "Píngtái jīngjì zhèngzài chóngxīn dìngyì chuántǒng de gùyòng guānxì hé láodòng zhě de shèhuì bǎozhàng tǐxì.",
      "sentence_fr": "L'économie de plateforme redéfinit les relations d'emploi traditionnelles et les systèmes de protection sociale des travailleurs.",
      "sentence_en": "The platform economy is redefining traditional employment relationships and workers' social security systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "platform_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土壤碳封存被认为是缓解气候变化的自然解决方案之一。",
      "sentence_pinyin": "Tǔrǎng tàn fēngcún bèi rènwéi shì huǎnjiě qìhòu biànhuà de zìrán jiějué fāng'àn zhī yī.",
      "sentence_fr": "La séquestration du carbone dans le sol est considérée comme l'une des solutions naturelles pour atténuer le changement climatique.",
      "sentence_en": "Soil carbon sequestration is considered one of the natural solutions to mitigate climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soil_carbon_sequestration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合现实技术融合物理世界和数字世界创造出全新的交互体验。",
      "sentence_pinyin": "Hùnhé xiànshí jìshù rónghé wùlǐ shìjiè hé shùzì shìjiè chuàngzào chū quánxīn de jiāohù tǐyàn.",
      "sentence_fr": "La technologie de réalité mixte fusionne le monde physique et le monde numérique pour créer des expériences interactives entièrement nouvelles.",
      "sentence_en": "Mixed reality technology merges the physical and digital worlds to create entirely new interactive experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mixed_reality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "批判性话语分析研究语言如何被用来构建和维持权力关系。",
      "sentence_pinyin": "Pīpànxìng huàyǔ fēnxī yánjiū yǔyán rúhé bèi yòng lái gòujiàn hé wéichí quánlì guānxì.",
      "sentence_fr": "L'analyse critique du discours étudie comment le langage est utilisé pour construire et maintenir les relations de pouvoir.",
      "sentence_en": "Critical discourse analysis studies how language is used to construct and maintain power relations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "critical_discourse_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物信息学结合计算机科学和分子生物学来分析基因组和蛋白质数据。",
      "sentence_pinyin": "Shēngwù xìnxīxué jiéhé jìsuànjī kēxué hé fēnzǐ shēngwùxué lái fēnxī jīyīn zǔ hé dànbáizhì shùjù.",
      "sentence_fr": "La bioinformatique combine l'informatique et la biologie moléculaire pour analyser les données génomiques et protéiques.",
      "sentence_en": "Bioinformatics combines computer science and molecular biology to analyze genomic and protein data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bioinformatics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "共享经济模式正在改变人们对所有权和资源利用的传统观念。",
      "sentence_pinyin": "Gòngxiǎng jīngjì móshì zhèngzài gǎibiàn rénmen duì suǒyǒuquán hé zīyuán lìyòng de chuántǒng guānniàn.",
      "sentence_fr": "Le modèle de l'économie du partage change les notions traditionnelles des gens sur la propriété et l'utilisation des ressources.",
      "sentence_en": "The sharing economy model is changing people's traditional notions of ownership and resource utilization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sharing_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "气溶胶科学研究大气中悬浮微粒对气候和人体健康的复杂影响。",
      "sentence_pinyin": "Qìróngjiāo kēxué yánjiū dàqì zhōng xuánfú wēilì duì qìhòu hé réntǐ jiànkāng de fùzá yǐngxiǎng.",
      "sentence_fr": "La science des aérosols étudie les effets complexes des particules en suspension dans l'atmosphère sur le climat et la santé humaine.",
      "sentence_en": "Aerosol science studies the complex effects of suspended particles in the atmosphere on climate and human health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "aerosol_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人机交互研究如何设计更直观和高效的用户界面和交互模式。",
      "sentence_pinyin": "Rén jī jiāohù yánjiū rúhé shèjì gèng zhíguān hé gāoxiào de yònghù jièmiàn hé jiāohù móshì.",
      "sentence_fr": "L'interaction homme-machine étudie comment concevoir des interfaces utilisateur et des modes d'interaction plus intuitifs et efficaces.",
      "sentence_en": "Human-computer interaction studies how to design more intuitive and efficient user interfaces and interaction modes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "human_computer_interaction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "组织行为学研究工作场所中个人和团队动态如何影响绩效和满意度。",
      "sentence_pinyin": "Zǔzhī xíngwéixué yánjiū gōngzuò chǎngsuǒ zhōng gèrén hé tuánduì dòngtài rúhé yǐngxiǎng jīxiào hé mǎnyìdù.",
      "sentence_fr": "Le comportement organisationnel étudie comment les dynamiques individuelles et d'équipe sur le lieu de travail affectent la performance et la satisfaction.",
      "sentence_en": "Organizational behavior studies how individual and team dynamics in the workplace affect performance and satisfaction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organizational_behavior",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电网技术整合可再生能源并优化电力分配以提高能源效率。",
      "sentence_pinyin": "Zhìnéng diànwǎng jìshù zhěnghé kě zàishēng néngyuán bìng yōuhuà diànlì fēnpèi yǐ tígāo néngyuán xiàolǜ.",
      "sentence_fr": "La technologie du réseau électrique intelligent intègre les énergies renouvelables et optimise la distribution électrique pour améliorer l'efficacité énergétique.",
      "sentence_en": "Smart grid technology integrates renewable energy and optimizes power distribution to improve energy efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_grid",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "进化博弈论将自然选择原理应用于分析竞争和合作策略的演化。",
      "sentence_pinyin": "Jìnhuà bóyì lùn jiāng zìrán xuǎnzé yuánlǐ yìngyòng yú fēnxī jìngzhēng hé hézuò cèlüè de yǎnhuà.",
      "sentence_fr": "La théorie des jeux évolutionnaire applique les principes de la sélection naturelle pour analyser l'évolution des stratégies de compétition et de coopération.",
      "sentence_en": "Evolutionary game theory applies natural selection principles to analyze the evolution of competition and cooperation strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evolutionary_game_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共健康信息学利用数据科学方法监测和预防疾病在人群中的传播。",
      "sentence_pinyin": "Gōnggòng jiànkāng xìnxīxué lìyòng shùjù kēxué fāngfǎ jiāncè hé yùfáng jíbìng zài rénqún zhōng de chuánbō.",
      "sentence_fr": "L'informatique de santé publique utilise les méthodes de science des données pour surveiller et prévenir la propagation des maladies dans les populations.",
      "sentence_en": "Public health informatics uses data science methods to monitor and prevent the spread of diseases in populations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_health_informatics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "叙事疗法帮助个人通过重新讲述和重构自己的生命故事来实现心理康复。",
      "sentence_pinyin": "Xùshì liáofǎ bāngzhù gèrén tōngguò chóngxīn jiǎngshù hé chónggòu zìjǐ de shēngmìng gùshì lái shíxiàn xīnlǐ kāngfù.",
      "sentence_fr": "La thérapie narrative aide les individus à atteindre la guérison psychologique en racontant et en reconstruisant leur histoire de vie.",
      "sentence_en": "Narrative therapy helps individuals achieve psychological recovery by retelling and reconstructing their life stories.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
