{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这家科技公司的人脸识别系统在机场安检中得到了广泛应用。",
      "sentence_pinyin": "Zhè jiā kējì gōngsī de rénliǎn shíbié xìtǒng zài jīchǎng ānjiǎn zhōng dédàole guǎngfàn yìngyòng.",
      "sentence_fr": "Le système de reconnaissance faciale de cette entreprise technologique est largement utilisé pour les contrôles de sécurité dans les aéroports.",
      "sentence_en": "This tech company's facial recognition system is widely used in airport security checks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "facial_recognition",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "在传统节日期间,舞龙舞狮表演总能吸引大批观众驻足观看。",
      "sentence_pinyin": "Zài chuántǒng jiérì qījiān, wǔlóng wǔshī biǎoyǎn zǒng néng xīyǐn dà pī guānzhòng zhùzú guānkàn.",
      "sentence_fr": "Pendant les fêtes traditionnelles, les spectacles de danse du dragon et du lion attirent toujours une foule de spectateurs.",
      "sentence_en": "During traditional festivals, dragon and lion dances always attract crowds of spectators.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dragon_lion_dance",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个跨境电商平台为中小企业提供了进入国际市场的便捷通道。",
      "sentence_pinyin": "Zhège kuàjìng diànshāng píngtái wèi zhōngxiǎo qǐyè tígōngle jìnrù guójì shìchǎng de biànjié tōngdào.",
      "sentence_fr": "Cette plateforme de commerce électronique transfrontalier offre aux PME un accès facile aux marchés internationaux.",
      "sentence_en": "This cross-border e-commerce platform provides small and medium enterprises with convenient access to international markets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cross_border_ecommerce",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她从小就跟随爷爷学习葫芦丝演奏,现在已经能独立完成复杂曲目。",
      "sentence_pinyin": "Tā cóngxiǎo jiù gēnsuí yéye xuéxí húlúsī yǎnzòu, xiànzài yǐjīng néng dúlì wánchéng fùzá qǔmù.",
      "sentence_fr": "Elle apprend à jouer du hulusi avec son grand-père depuis son enfance et peut maintenant interpréter des morceaux complexes en solo.",
      "sentence_en": "She has been learning to play the hulusi with her grandfather since childhood and can now perform complex pieces independently.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hulusi_music",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能温室通过传感器实时监测土壤湿度和温度,自动调节灌溉系统。",
      "sentence_pinyin": "Zhìnéng wēnshì tōngguò chuángǎnqì shíshí jiāncè tǔrǎng shīdù hé wēndù, zìdòng tiáojié guàngài xìtǒng.",
      "sentence_fr": "Les serres intelligentes surveillent en temps réel l'humidité et la température du sol grâce à des capteurs et ajustent automatiquement le système d'irrigation.",
      "sentence_en": "Smart greenhouses monitor soil moisture and temperature in real-time through sensors and automatically adjust the irrigation system.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_greenhouses",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部科幻小说描绘了人类在遥远未来探索银河系的宏伟场景。",
      "sentence_pinyin": "Zhè bù kēhuàn xiǎoshuō miáohuìle rénlèi zài yáoyuǎn wèilái tànsuō yínhéxì de hóngwěi chǎngjǐng.",
      "sentence_fr": "Ce roman de science-fiction dépeint les scènes grandioses de l'humanité explorant la galaxie dans un avenir lointain.",
      "sentence_en": "This science fiction novel depicts the grand scenes of humanity exploring the galaxy in the distant future.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science_fiction",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区健康服务中心为居民提供免费的慢性病管理和健康咨询服务。",
      "sentence_pinyin": "Shèqū jiànkāng fúwù zhōngxīn wèi jūmín tígōng miǎnfèi de mànxìngbìng guǎnlǐ hé jiànkāng zīxún fúwù.",
      "sentence_fr": "Le centre de services de santé communautaire offre gratuitement aux résidents la gestion des maladies chroniques et des consultations de santé.",
      "sentence_en": "The community health service center provides residents with free chronic disease management and health consultation services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_health_centers",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "攀岩运动不仅能锻炼身体,还能培养人的意志力和解决问题的能力。",
      "sentence_pinyin": "Pānyán yùndòng bùjǐn néng duànliàn shēntǐ, hái néng péiyǎng rén de yìzhìlì hé jiějué wèntí de nénglì.",
      "sentence_fr": "L'escalade ne renforce pas seulement le corps, elle développe également la volonté et la capacité à résoudre les problèmes.",
      "sentence_en": "Rock climbing not only strengthens the body but also cultivates willpower and problem-solving abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rock_climbing",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座城市的地铁系统采用了先进的信号控制技术,大幅提高了运营效率。",
      "sentence_pinyin": "Zhè zuò chéngshì de dìtiě xìtǒng cǎiyòngle xiānjìn de xìnhào kòngzhì jìshù, dàfú tígāole yùnyíng xiàolǜ.",
      "sentence_fr": "Le système de métro de cette ville utilise une technologie avancée de contrôle des signaux, améliorant considérablement l'efficacité opérationnelle.",
      "sentence_en": "The city's subway system uses advanced signal control technology, significantly improving operational efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "subway_systems",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "木偶戏是一种古老的民间艺术形式,通过操纵木偶来讲述故事。",
      "sentence_pinyin": "Mù'ǒu xì shì yī zhǒng gǔlǎo de mínjiān yìshù xíngshì, tōngguò cāozòng mù'ǒu lái jiǎngshù gùshì.",
      "sentence_fr": "Le théâtre de marionnettes est une forme d'art folklorique ancienne qui raconte des histoires en manipulant des poupées.",
      "sentence_en": "Puppet theater is an ancient folk art form that tells stories through manipulating puppets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "puppet_theater",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家初创企业研发的无人配送车已经在多个小区开始试运营。",
      "sentence_pinyin": "Zhè jiā chūchuàng qǐyè yánfā de wúrén pèisòng chē yǐjīng zài duō gè xiǎoqū kāishǐ shì yùnyíng.",
      "sentence_fr": "Les véhicules de livraison autonomes développés par cette startup ont commencé leurs tests opérationnels dans plusieurs quartiers résidentiels.",
      "sentence_en": "The autonomous delivery vehicles developed by this startup have begun trial operations in multiple residential communities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "autonomous_delivery",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "竹笛的音色清脆悠扬,在中国民族音乐中占有重要地位。",
      "sentence_pinyin": "Zhúdí de yīnsè qīngcuì yōuyáng, zài Zhōngguó mínzú yīnyuè zhōng zhànyǒu zhòngyào dìwèi.",
      "sentence_fr": "Le son clair et mélodieux de la flûte en bambou occupe une place importante dans la musique traditionnelle chinoise.",
      "sentence_en": "The clear and melodious sound of the bamboo flute holds an important place in Chinese traditional music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_flute",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "随着人工智能技术的发展,智能客服系统正在逐步取代传统人工客服。",
      "sentence_pinyin": "Suízhe réngōng zhìnéng jìshù de fāzhǎn, zhìnéng kèfú xìtǒng zhèngzài zhúbù qǔdài chuántǒng réngōng kèfú.",
      "sentence_fr": "Avec le développement de l'intelligence artificielle, les systèmes de service client intelligents remplacent progressivement le service client humain traditionnel.",
      "sentence_en": "With the development of artificial intelligence, intelligent customer service systems are gradually replacing traditional human customer service.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_customer_service",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保组织致力于推广垃圾分类知识,提高公众的环保意识。",
      "sentence_pinyin": "Zhège huánbǎo zǔzhī zhìlì yú tuīguǎng lājī fēnlèi zhīshi, tígāo gōngzhòng de huánbǎo yìshi.",
      "sentence_fr": "Cette organisation environnementale se consacre à promouvoir les connaissances sur le tri des déchets et à sensibiliser le public à l'environnement.",
      "sentence_en": "This environmental organization is dedicated to promoting waste sorting knowledge and raising public environmental awareness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting_education",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "马头琴是蒙古族的传统乐器,琴声能模仿草原上奔腾的马蹄声。",
      "sentence_pinyin": "Mǎtóuqín shì Měnggǔzú de chuántǒng yuèqì, qínshēng néng mófǎng cǎoyuán shàng bēnténg de mǎtíshēng.",
      "sentence_fr": "Le morin khuur est un instrument traditionnel mongol dont le son peut imiter le galop des chevaux dans la steppe.",
      "sentence_en": "The morin khuur is a traditional Mongolian instrument whose sound can mimic the galloping of horses on the grasslands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "morin_khuur",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "虚拟现实技术在医学培训中的应用,让学生能够进行无风险的手术练习。",
      "sentence_pinyin": "Xūnǐ xiànshí jìshù zài yīxué péixùn zhōng de yìngyòng, ràng xuéshēng nénggòu jìnxíng wú fēngxiǎn de shǒushù liànxí.",
      "sentence_fr": "L'application de la réalité virtuelle dans la formation médicale permet aux étudiants de pratiquer des opérations chirurgicales sans risque.",
      "sentence_en": "The application of virtual reality technology in medical training allows students to practice surgeries without risk.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vr_medical_training",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家博物馆新推出的数字展厅利用全息投影技术还原了古代宫廷生活。",
      "sentence_pinyin": "Zhè jiā bówùguǎn xīn tuīchū de shùzì zhǎntīng lìyòng quánxī tóuyǐng jìshù huányuánle gǔdài gōngtíng shēnghuó.",
      "sentence_fr": "La nouvelle salle d'exposition numérique de ce musée utilise la technologie de projection holographique pour recréer la vie de cour ancienne.",
      "sentence_en": "The museum's newly launched digital exhibition hall uses holographic projection technology to recreate ancient court life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "holographic_exhibitions",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "远程医疗服务让偏远山区的患者也能得到大城市专家的诊断和治疗建议。",
      "sentence_pinyin": "Yuǎnchéng yīliào fúwù ràng piānyuǎn shānqū de huànzhě yě néng dédào dà chéngshì zhuānjiā de zhěnduàn hé zhìliáo jiànyì.",
      "sentence_fr": "Les services de télémédecine permettent même aux patients des régions montagneuses éloignées d'obtenir des diagnostics et conseils de traitement d'experts des grandes villes.",
      "sentence_en": "Telemedicine services allow even patients in remote mountainous areas to receive diagnoses and treatment advice from experts in major cities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "telemedicine",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "漆器工艺以其独特的光泽和精美的图案,成为中国传统工艺的代表之一。",
      "sentence_pinyin": "Qīqì gōngyì yǐ qí dútè de guāngzé hé jīngměi de tú'àn, chéngwéi Zhōngguó chuántǒng gōngyì de dàibiǎo zhī yī.",
      "sentence_fr": "L'art de la laque, avec son lustre unique et ses motifs exquis, est devenu l'un des représentants de l'artisanat traditionnel chinois.",
      "sentence_en": "Lacquerware craftsmanship, with its unique luster and exquisite patterns, has become one of the representatives of traditional Chinese crafts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lacquerware",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "共享单车的普及极大地改善了城市最后一公里的出行问题。",
      "sentence_pinyin": "Gòngxiǎng dānchē de pǔjí jí dà de gǎishànle chéngshì zuìhòu yī gōnglǐ de chūxíng wèntí.",
      "sentence_fr": "La popularisation des vélos en libre-service a considérablement amélioré le problème du dernier kilomètre dans les déplacements urbains.",
      "sentence_en": "The popularization of shared bicycles has greatly improved the last-mile transportation problem in cities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bike_sharing",
      "created_at": "2025-11-20T20:20:00.000Z",
      "updated_at": "2025-11-20T20:20:00.000Z"
    }
  ]
}
