{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个光伏扶贫电站为贫困村集体创造了稳定的收入来源。",
      "sentence_pinyin": "Zhège guāngfú fúpín diànzhàn wèi pínkùn cūn jítǐ chuàngzàole wěndìng de shōurù láiyuán.",
      "sentence_fr": "Cette centrale photovoltaïque de réduction de la pauvreté a créé une source de revenu stable pour les collectivités villageoises pauvres.",
      "sentence_en": "This photovoltaic poverty alleviation power station created a stable income source for poor village collectives.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "solar_poverty_alleviation",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在河北梆子表演中展现了高亢激越的唱腔和粗犷豪迈的风格。",
      "sentence_pinyin": "Tā zài Héběi bāngzi biǎoyǎn zhōng zhǎnxiànle gāokàng jīyuè de chàngqiāng hé cūguǎng háomài de fēnggé.",
      "sentence_fr": "Dans sa performance d'opéra Bangzi du Hebei, elle a démontré une voix haute et passionnée et un style vigoureux et héroïque.",
      "sentence_en": "In her Hebei Bangzi Opera performance, she demonstrated a high-pitched and passionate voice and a vigorous and heroic style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hebei_bangzi",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能楼宇管理系统集成了能源、安防和设备运维功能。",
      "sentence_pinyin": "Zhège zhìnéng lóuyǔ guǎnlǐ xìtǒng jíchéngle néngyuán, ānfáng hé shèbèi yùnwéi gōngnéng.",
      "sentence_fr": "Ce système de gestion de bâtiments intelligents intègre les fonctions d'énergie, de sécurité et de maintenance des équipements.",
      "sentence_en": "This smart building management system integrates energy, security, and equipment maintenance functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "building_management",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在寓言故事创作中用浅显的语言阐述了深刻的人生哲理。",
      "sentence_pinyin": "Tā zài yùyán gùshi chuàngzuò zhōng yòng qiǎnxiǎn de yǔyán chǎnshùle shēnkè de rénshēng zhélǐ.",
      "sentence_fr": "Dans la création de fables, il explique des philosophies de vie profondes avec un langage simple.",
      "sentence_en": "In fable creation, he explains profound life philosophies with simple language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fables",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个临终关怀病房为晚期患者提供了有尊严的生命终点照护。",
      "sentence_pinyin": "Zhège línzhōng guānhuái bìngfáng wèi wǎnqī huànzhě tígōngle yǒu zūnyán de shēngmìng zhōngdiǎn zhàohù.",
      "sentence_fr": "Cette unité de soins palliatifs fournit des soins de fin de vie dignes aux patients en phase terminale.",
      "sentence_en": "This hospice ward provides dignified end-of-life care to terminal patients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hospice_care",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的字体设计既保持了汉字的传统美感又具有现代识别性。",
      "sentence_pinyin": "Tā de zìtǐ shèjì jì bǎochíle hànzì de chuántǒng měigǎn yòu jùyǒu xiàndài shíbiéxìng.",
      "sentence_fr": "Sa conception de polices de caractères préserve à la fois l'esthétique traditionnelle des caractères chinois et possède une reconnaissance moderne.",
      "sentence_en": "Her font design both preserves the traditional aesthetics of Chinese characters and has modern recognizability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "font_design",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个候鸟迁徙保护项目在迁徙路线上建立了多个保护驿站。",
      "sentence_pinyin": "Zhège hòuniǎo qiānxǐ bǎohù xiàngmù zài qiānxǐ lùxiàn shàng jiànlìle duō gè bǎohù yìzhàn.",
      "sentence_fr": "Ce projet de protection de la migration des oiseaux a établi plusieurs stations de protection le long des routes de migration.",
      "sentence_en": "This migratory bird protection project established multiple protection stations along migration routes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bird_migration",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在藤球比赛中展现了高超的脚上功夫和灵活的身体控制力。",
      "sentence_pinyin": "Tā zài téngqiú bǐsài zhōng zhǎnxiànle gāochāo de jiǎo shàng gōngfu hé línghuó de shēntǐ kòngzhìlì.",
      "sentence_fr": "Il a démontré des compétences supérieures au pied et un contrôle corporel flexible lors du match de sepak takraw.",
      "sentence_en": "He demonstrated superior footwork and flexible body control in the sepak takraw match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sepak_takraw",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区党群服务中心为党员群众提供了便捷的服务平台。",
      "sentence_pinyin": "Zhège shèqū dǎngqún fúwù zhōngxīn wèi dǎngyuán qúnzhòng tígōngle biànjié de fúwù píngtái.",
      "sentence_fr": "Ce centre de services communautaires pour le parti et les masses fournit une plateforme de services pratiques pour les membres du parti et le public.",
      "sentence_en": "This community party-mass service center provides a convenient service platform for party members and the public.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_party_centers",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在柳编工艺中编织出了造型优美、质地柔韧的工艺品。",
      "sentence_pinyin": "Tā zài liǔbiān gōngyì zhōng biānzhī chūle zàoxíng yōuměi, zhìdì róurèn de gōngyìpǐn.",
      "sentence_fr": "Dans l'artisanat de tressage de saule, elle a tissé des objets artisanaux aux formes élégantes et à la texture flexible.",
      "sentence_en": "In willow weaving craftsmanship, she wove handicrafts with elegant shapes and flexible texture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "willow_weaving",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能镜子可以显示天气、新闻和健康数据等信息。",
      "sentence_pinyin": "Zhège zhìnéng jìngzi kěyǐ xiǎnshì tiānqì, xīnwén hé jiànkāng shùjù děng xìnxī.",
      "sentence_fr": "Ce miroir intelligent peut afficher des informations comme la météo, les actualités et les données de santé.",
      "sentence_en": "This smart mirror can display information such as weather, news, and health data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mirrors",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在大阮演奏中展现了深沉浑厚的低音和稳重的音乐表达。",
      "sentence_pinyin": "Tā zài dàruǎn yǎnzòu zhōng zhǎnxiànle shēnchén húnhòu de dīyīn hé wěnzhòng de yīnyuè biǎodá.",
      "sentence_fr": "Il a démontré des basses profondes et riches et une expression musicale stable dans son jeu de daruan.",
      "sentence_en": "He demonstrated deep and rich bass tones and stable musical expression in his daruan performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "daruan_music",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个病媒生物监测网络追踪蚊虫等传病媒介的分布密度。",
      "sentence_pinyin": "Zhège bìngméi shēngwù jiāncè wǎngluò zhuīzōng wénchóng děng chuánbìng méijiè de fēnbù mìdù.",
      "sentence_fr": "Ce réseau de surveillance des vecteurs suit la densité de distribution de vecteurs de maladies comme les moustiques.",
      "sentence_en": "This disease vector monitoring network tracks the distribution density of disease vectors such as mosquitoes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "vector_surveillance",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的公共艺术作品为城市空间增添了文化气息和艺术活力。",
      "sentence_pinyin": "Tā de gōnggòng yìshù zuòpǐn wèi chéngshì kōngjiān zēngtiānle wénhuà qìxī hé yìshù huólì.",
      "sentence_fr": "Ses œuvres d'art public ajoutent une atmosphère culturelle et une vitalité artistique aux espaces urbains.",
      "sentence_en": "Her public art works add cultural atmosphere and artistic vitality to urban spaces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_art",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个雷电预警系统提前发布强对流天气的雷电活动预警。",
      "sentence_pinyin": "Zhège léidiàn yùjǐng xìtǒng tíqián fābù qiáng duìliú tiānqì de léidiàn huódòng yùjǐng.",
      "sentence_fr": "Ce système d'alerte à la foudre émet à l'avance des alertes d'activité de foudre pour les conditions météorologiques convectives fortes.",
      "sentence_en": "This lightning warning system issues lightning activity warnings for severe convective weather in advance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lightning_warning",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在音乐制作工作中运用了录音、混音和母带处理技术。",
      "sentence_pinyin": "Tā zài yīnyuè zhìzuò gōngzuò zhōng yùnyòngle lùyīn, hùnyīn hé mǔdài chǔlǐ jìshù.",
      "sentence_fr": "Dans son travail de production musicale, il a utilisé des techniques d'enregistrement, de mixage et de mastering.",
      "sentence_en": "In his music production work, he used recording, mixing, and mastering techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_production",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧养老平台为老年人提供远程健康监护和紧急呼叫服务。",
      "sentence_pinyin": "Zhège zhìhuì yǎnglǎo píngtái wèi lǎoniánrén tígōng yuǎnchéng jiànkāng jiānhù hé jǐnjí hūjiào fúwù.",
      "sentence_fr": "Cette plateforme de soins intelligents pour personnes âgées fournit des services de surveillance de santé à distance et d'appel d'urgence pour les personnes âgées.",
      "sentence_en": "This smart elderly care platform provides remote health monitoring and emergency call services for senior citizens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_elder_care",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在自由式滑雪比赛中完成了高难度的空中技巧动作。",
      "sentence_pinyin": "Tā zài zìyóushì huáxuě bǐsài zhōng wánchéngle gāo nándù de kōngzhōng jìqiǎo dòngzuò.",
      "sentence_fr": "Elle a réalisé des figures aériennes de haute difficulté lors de la compétition de ski freestyle.",
      "sentence_en": "She completed highly difficult aerial trick movements in the freestyle skiing competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "freestyle_skiing",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新型研发机构探索了政产学研用协同创新的新模式。",
      "sentence_pinyin": "Zhège xīnxíng yánfā jīgòu tànsuǒle zhèng chǎn xué yán yòng xiétóng chuàngxīn de xīn móshì.",
      "sentence_fr": "Cette nouvelle institution de R&D a exploré un nouveau modèle d'innovation collaborative entre gouvernement, industrie, université, recherche et application.",
      "sentence_en": "This new R&D institution explored a new model of collaborative innovation among government, industry, university, research, and application.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rd_institutions",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在银器锻制中运用了錾刻、拉丝等传统金工技艺。",
      "sentence_pinyin": "Tā zài yínqì duànzhì zhōng yùnyòngle zànkè, lāsī děng chuántǒng jīngōng jìyì.",
      "sentence_fr": "Dans la forge d'argenterie, il a utilisé des techniques de métallurgie traditionnelles comme la gravure au burin et le filigrane.",
      "sentence_en": "In silver forging, he used traditional metalwork techniques such as chasing and filigree.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "silversmithing",
      "created_at": "2025-11-20T20:00:00.000Z",
      "updated_at": "2025-11-20T20:00:00.000Z"
    }
  ]
}
