{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能照明系统可以根据自然光线自动调节室内灯光亮度。",
      "sentence_pinyin": "Zhège zhìnéng zhàomíng xìtǒng kěyǐ gēnjù zìrán guāngxiàn zìdòng tiáojié shìnèi dēngguāng liàngdù.",
      "sentence_fr": "Ce système d'éclairage intelligent peut ajuster automatiquement la luminosité intérieure en fonction de la lumière naturelle.",
      "sentence_en": "This smart lighting system can automatically adjust indoor brightness based on natural light.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_lighting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "木偶戏是中国传统的民间艺术,艺人操纵木偶在舞台上表演故事。",
      "sentence_pinyin": "Mù'ǒuxì shì Zhōngguó chuántǒng de mínjiān yìshù, yìrén cāozòng mù'ǒu zài wǔtái shàng biǎoyǎn gùshì.",
      "sentence_fr": "Le théâtre de marionnettes est un art populaire traditionnel chinois où les artistes manipulent des marionnettes pour raconter des histoires sur scène.",
      "sentence_en": "Puppet theater is a traditional Chinese folk art where artists manipulate puppets to perform stories on stage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "puppet_theater",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的地下管廊集中了电力、通信、供水等各种管线,便于维护管理。",
      "sentence_pinyin": "Chéngshì de dìxià guǎnláng jízhōng le diànlì, tōngxìn, gōngshuǐ děng gèzhǒng guǎnxiàn, biànyú wéihù guǎnlǐ.",
      "sentence_fr": "Les galeries souterraines urbaines regroupent diverses canalisations comme l'électricité, les communications et l'eau, facilitant la maintenance.",
      "sentence_en": "Urban underground utility tunnels consolidate various pipelines including electricity, communications, and water supply, facilitating maintenance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "underground_utilities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能闹钟可以分析睡眠周期,在用户最适合醒来的时刻叫醒他们。",
      "sentence_pinyin": "Zhìnéng nàozhōng kěyǐ fēnxī shuìmián zhōuqī, zài yònghù zuì shìhé xǐnglái de shíkè jiàoxǐng tāmen.",
      "sentence_fr": "Le réveil intelligent peut analyser le cycle de sommeil et réveiller les utilisateurs au moment le plus approprié.",
      "sentence_en": "The smart alarm clock can analyze sleep cycles and wake users at the most appropriate time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_alarm_clocks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的皮革工艺以马具制作和皮雕艺术最为精湛。",
      "sentence_pinyin": "Zhōngguó chuántǒng de pígé gōngyì yǐ mǎjù zhìzuò hé pídiāo yìshù zuìwéi jīngzhàn.",
      "sentence_fr": "L'artisanat traditionnel chinois du cuir excelle dans la fabrication de harnais et l'art de la sculpture sur cuir.",
      "sentence_en": "Traditional Chinese leather craftsmanship excels in harness making and leather carving art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "leather_craft",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能学习机可以根据学生的学习情况推荐个性化的学习内容。",
      "sentence_pinyin": "Zhìnéng xuéxíjī kěyǐ gēnjù xuéshēng de xuéxí qíngkuàng tuījiàn gèxìnghuà de xuéxí nèiróng.",
      "sentence_fr": "La tablette d'apprentissage intelligente peut recommander du contenu personnalisé en fonction des progrès de l'élève.",
      "sentence_en": "The smart learning tablet can recommend personalized learning content based on students' learning progress.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_learning_devices",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二人台是内蒙古和山西的地方戏曲,曲调欢快,表演风趣。",
      "sentence_pinyin": "Èrréntái shì Nèiměnggǔ hé Shānxī de dìfāng xìqǔ, qǔdiào huānkuài, biǎoyǎn fēngqù.",
      "sentence_fr": "L'Errentai est un opéra régional de Mongolie-Intérieure et du Shanxi, avec des mélodies joyeuses et des performances amusantes.",
      "sentence_en": "Errentai is a regional opera of Inner Mongolia and Shanxi, with cheerful tunes and amusing performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "errentai_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推行的家庭医生签约服务让居民在家门口就能享受基本医疗服务。",
      "sentence_pinyin": "Zhèngfǔ tuīxíng de jiātíng yīshēng qiānyuē fúwù ràng jūmín zài jiāménkǒu jiù néng xiǎngshòu jīběn yīliáo fúwù.",
      "sentence_fr": "Le service de médecin de famille contractuel promu par le gouvernement permet aux résidents d'accéder aux soins de base près de chez eux.",
      "sentence_en": "The government's contracted family doctor service allows residents to enjoy basic medical services at their doorstep.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family_doctor_services",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能微波炉可以自动识别食物种类,设置最佳加热时间和火力。",
      "sentence_pinyin": "Zhìnéng wēibōlú kěyǐ zìdòng shìbié shíwù zhǒnglèi, shèzhì zuìjiā jiārè shíjiān hé huǒlì.",
      "sentence_fr": "Le micro-ondes intelligent peut identifier automatiquement le type d'aliment et régler le temps et la puissance de chauffe optimaux.",
      "sentence_en": "The smart microwave can automatically identify food types and set optimal heating time and power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_microwaves",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的蓝印花布以靛蓝染料和木刻版印花工艺制作而成。",
      "sentence_pinyin": "Zhōngguó chuántǒng de lányìn huābù yǐ diànlán rǎnliào hé mùkè bǎn yìnhuā gōngyì zhìzuò ér chéng.",
      "sentence_fr": "Le tissu imprimé bleu traditionnel chinois est fabriqué avec de la teinture indigo et une technique d'impression par blocs de bois.",
      "sentence_en": "Traditional Chinese blue calico is made with indigo dye and woodblock printing techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "blue_calico",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能洗手机可以自动感应出泡沫,提醒用户洗手时间是否足够。",
      "sentence_pinyin": "Zhìnéng xǐshǒujī kěyǐ zìdòng gǎnyìng chū pàomò, tíxǐng yònghù xǐshǒu shíjiān shìfǒu zúgòu.",
      "sentence_fr": "Le distributeur de savon intelligent peut détecter automatiquement et distribuer de la mousse, rappelant si le temps de lavage est suffisant.",
      "sentence_en": "The smart hand washer can automatically sense and dispense foam, reminding users if washing time is sufficient.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_soap_dispensers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "梨园戏是福建泉州的古老剧种,保留了许多南戏的传统表演形式。",
      "sentence_pinyin": "Líyuánxì shì Fújiàn Quánzhōu de gǔlǎo jùzhǒng, bǎoliú le xǔduō Nánxì de chuántǒng biǎoyǎn xíngshì.",
      "sentence_fr": "L'opéra Liyuan est un ancien genre d'opéra de Quanzhou au Fujian, préservant de nombreuses formes traditionnelles de l'opéra du Sud.",
      "sentence_en": "Liyuan opera is an ancient opera genre from Quanzhou, Fujian, preserving many traditional performance forms of Southern opera.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "liyuan_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市绿道骑行系统串联了各个景点和公园,吸引了众多骑行爱好者。",
      "sentence_pinyin": "Chéngshì lǜdào qíxíng xìtǒng chuànlián le gègè jǐngdiǎn hé gōngyuán, xīyǐn le zhòngduō qíxíng àihàozhě.",
      "sentence_fr": "Le système de pistes cyclables vertes urbaines relie les différents sites et parcs, attirant de nombreux amateurs de vélo.",
      "sentence_en": "The urban greenway cycling system connects various attractions and parks, attracting many cycling enthusiasts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cycling_greenways",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能浴缸可以自动调节水温和水位,还能进行气泡按摩。",
      "sentence_pinyin": "Zhìnéng yùgāng kěyǐ zìdòng tiáojié shuǐwēn hé shuǐwèi, hái néng jìnxíng qìpào ànmó.",
      "sentence_fr": "La baignoire intelligente peut ajuster automatiquement la température et le niveau de l'eau, et offrir un massage à bulles.",
      "sentence_en": "The smart bathtub can automatically adjust water temperature and level, and provide bubble massage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bathtubs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的香道文化包括香料制作、香炉使用和品香仪式等内容。",
      "sentence_pinyin": "Zhōngguó chuántǒng de xiāngdào wénhuà bāokuò xiāngliào zhìzuò, xiānglú shǐyòng hé pǐnxiāng yíshì děng nèiróng.",
      "sentence_fr": "La culture traditionnelle chinoise de l'encens comprend la fabrication d'encens, l'utilisation des brûle-parfums et les rituels d'appréciation.",
      "sentence_en": "Traditional Chinese incense culture includes incense making, incense burner use, and incense appreciation rituals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "incense_culture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能晾衣系统可以根据天气预报自动收衣,避免衣物被雨淋湿。",
      "sentence_pinyin": "Zhìnéng liàngyī xìtǒng kěyǐ gēnjù tiānqì yùbào zìdòng shōuyī, bìmiǎn yīwù bèi yǔ línshī.",
      "sentence_fr": "Le système de séchage intelligent peut rentrer automatiquement les vêtements selon les prévisions météo, évitant qu'ils soient mouillés par la pluie.",
      "sentence_en": "The smart clothes drying system can automatically retract clothes based on weather forecasts, avoiding them getting wet from rain.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_drying_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高甲戏是福建的地方戏曲,表演夸张诙谐,深受闽南观众欢迎。",
      "sentence_pinyin": "Gāojiǎxì shì Fújiàn de dìfāng xìqǔ, biǎoyǎn kuāzhāng huīxié, shēn shòu Mǐnnán guānzhòng huānyíng.",
      "sentence_fr": "L'opéra Gaojia est un opéra régional du Fujian, avec des performances exagérées et humoristiques, très populaire auprès du public du sud du Fujian.",
      "sentence_en": "Gaojia opera is a regional opera of Fujian, with exaggerated and humorous performances, very popular among southern Fujian audiences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gaojia_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区建立了邻里互助平台,方便居民之间相互帮助和交流。",
      "sentence_pinyin": "Zhège shèqū jiànlì le línlǐ hùzhù píngtái, fāngbiàn jūmín zhījiān xiānghù bāngzhù hé jiāoliú.",
      "sentence_fr": "Cette communauté a créé une plateforme d'entraide entre voisins, facilitant l'aide mutuelle et les échanges entre résidents.",
      "sentence_en": "This community has established a neighborhood mutual aid platform, facilitating help and communication among residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_platforms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能地暖系统可以分房间控制温度,节省能源的同时保证舒适度。",
      "sentence_pinyin": "Zhìnéng dìnuǎn xìtǒng kěyǐ fēn fángjiān kòngzhì wēndù, jiéshěng néngyuán de tóngshí bǎozhèng shūshìdù.",
      "sentence_fr": "Le système de chauffage au sol intelligent peut contrôler la température pièce par pièce, économisant l'énergie tout en assurant le confort.",
      "sentence_en": "The smart underfloor heating system can control temperature room by room, saving energy while ensuring comfort.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_floor_heating",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的盆景艺术通过修剪和造型将植物培育成微型景观。",
      "sentence_pinyin": "Zhōngguó chuántǒng de pénjǐng yìshù tōngguò xiūjiǎn hé zàoxíng jiāng zhíwù péiyù chéng wēixíng jǐngguān.",
      "sentence_fr": "L'art traditionnel chinois du bonsaï cultive les plantes en paysages miniatures par la taille et le façonnage.",
      "sentence_en": "Traditional Chinese bonsai art cultivates plants into miniature landscapes through trimming and shaping.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bonsai_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
