{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "物联网设备的安全漏洞可能成为黑客入侵家庭网络的突破口。",
      "sentence_pinyin": "Wùliánwǎng shèbèi de ānquán lòudòng kěnéng chéngwéi hēikè rùqīn jiātíng wǎngluò de tūpòkǒu.",
      "sentence_fr": "Les failles de sécurité des appareils IoT peuvent devenir des points d'entrée pour les pirates informatiques dans les réseaux domestiques.",
      "sentence_en": "Security vulnerabilities in IoT devices can become entry points for hackers to infiltrate home networks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "iot_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位诺贝尔文学奖获得者的作品以其深刻的人文关怀和独特的叙事风格著称。",
      "sentence_pinyin": "Zhè wèi Nuòbèi'ěr wénxuéjiǎng huòdézhě de zuòpǐn yǐ qí shēnkè de rénwén guānhuái hé dútè de xùshì fēnggé zhùchēng.",
      "sentence_fr": "Les œuvres de ce lauréat du prix Nobel de littérature sont réputées pour leur profonde préoccupation humaniste et leur style narratif unique.",
      "sentence_en": "This Nobel Prize in Literature laureate's works are renowned for their profound humanistic concern and unique narrative style.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nobel_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "认知偏见会影响人们在不确定性情况下做出的投资决策和风险评估。",
      "sentence_pinyin": "Rènzhī piānjiàn huì yǐngxiǎng rénmen zài bù quèdìngxìng qíngkuàng xià zuòchū de tóuzī juécè hé fēngxiǎn pínggū.",
      "sentence_fr": "Les biais cognitifs influencent les décisions d'investissement et l'évaluation des risques des personnes dans des situations d'incertitude.",
      "sentence_en": "Cognitive biases affect people's investment decisions and risk assessments under conditions of uncertainty.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "behavioral_finance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市规划应当考虑步行友好性以鼓励居民减少对私人汽车的依赖。",
      "sentence_pinyin": "Chéngshì guīhuà yīngdāng kǎolǜ bùxíng yǒuhǎoxìng yǐ gǔlì jūmín jiǎnshǎo duì sīrén qìchē de yīlài.",
      "sentence_fr": "L'urbanisme devrait tenir compte de la convivialité piétonne pour encourager les résidents à réduire leur dépendance aux voitures personnelles.",
      "sentence_en": "Urban planning should consider walkability to encourage residents to reduce their dependence on private cars.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pedestrian_urban_planning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "干细胞研究的最新进展为组织再生和器官移植领域带来了新的希望。",
      "sentence_pinyin": "Gànxìbāo yánjiū de zuìxīn jìnzhǎn wèi zǔzhī zàishēng hé qìguān yízhí lǐngyù dàilái le xīn de xīwàng.",
      "sentence_fr": "Les dernières avancées dans la recherche sur les cellules souches apportent de nouveaux espoirs pour la régénération tissulaire et la transplantation d'organes.",
      "sentence_en": "The latest advances in stem cell research have brought new hope to the fields of tissue regeneration and organ transplantation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stem_cell_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家社会企业致力于通过商业手段解决贫困地区的教育资源不平等问题。",
      "sentence_pinyin": "Zhè jiā shèhuì qǐyè zhìlì yú tōngguò shāngyè shǒuduàn jiějué pínkùn dìqū de jiàoyù zīyuán bù píngděng wèntí.",
      "sentence_fr": "Cette entreprise sociale s'engage à résoudre les inégalités éducatives dans les régions pauvres par des moyens commerciaux.",
      "sentence_en": "This social enterprise is dedicated to solving educational resource inequality in impoverished areas through business means.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_enterprise",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络舆论场的极化现象加剧了社会不同群体之间的对立和误解。",
      "sentence_pinyin": "Wǎngluò yúlùnchǎng de jíhuà xiànxiàng jiājù le shèhuì bùtóng qúntǐ zhījiān de duìlì hé wùjiě.",
      "sentence_fr": "La polarisation de l'opinion en ligne intensifie l'opposition et les malentendus entre différents groupes sociaux.",
      "sentence_en": "The polarization phenomenon in online public opinion has intensified opposition and misunderstanding between different social groups.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "online_polarization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可持续农业实践可以在保护环境的同时提高农作物的产量和质量。",
      "sentence_pinyin": "Kě chíxù nóngyè shíjiàn kěyǐ zài bǎohù huánjìng de tóngshí tígāo nóngzuòwù de chǎnliàng hé zhìliàng.",
      "sentence_fr": "Les pratiques agricoles durables peuvent améliorer le rendement et la qualité des cultures tout en protégeant l'environnement.",
      "sentence_en": "Sustainable agricultural practices can improve crop yield and quality while protecting the environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sustainable_agriculture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位导演的新作品对消费主义社会进行了尖锐的批判和深刻的反思。",
      "sentence_pinyin": "Zhè wèi dǎoyǎn de xīn zuòpǐn duì xiāofèizhǔyì shèhuì jìnxíng le jiānruì de pīpàn hé shēnkè de fǎnsī.",
      "sentence_fr": "La nouvelle œuvre de ce réalisateur offre une critique acerbe et une réflexion profonde sur la société de consommation.",
      "sentence_en": "This director's new work offers sharp criticism and deep reflection on consumerist society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "film_social_critique",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精准医疗根据患者的基因特征制定个性化的治疗方案以提高疗效。",
      "sentence_pinyin": "Jīngzhǔn yīliáo gēnjù huànzhě de jīyīn tèzhēng zhìdìng gèxìnghuà de zhìliáo fāng'àn yǐ tígāo liáoxiào.",
      "sentence_fr": "La médecine de précision élabore des plans de traitement personnalisés basés sur les caractéristiques génétiques des patients pour améliorer l'efficacité.",
      "sentence_en": "Precision medicine develops personalized treatment plans based on patients' genetic characteristics to improve efficacy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "precision_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全球化背景下,保护本土文化传统与拥抱外来文化之间需要找到平衡点。",
      "sentence_pinyin": "Quánqiúhuà bèijǐng xià, bǎohù běntǔ wénhuà chuántǒng yǔ yōngbào wàilái wénhuà zhījiān xūyào zhǎodào pínghéngdiǎn.",
      "sentence_fr": "Dans le contexte de la mondialisation, il faut trouver un équilibre entre la préservation des traditions culturelles locales et l'ouverture aux cultures étrangères.",
      "sentence_en": "In the context of globalization, a balance needs to be found between preserving local cultural traditions and embracing foreign cultures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_globalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "边缘计算技术通过在数据源附近处理数据来减少网络延迟和带宽消耗。",
      "sentence_pinyin": "Biānyuán jìsuàn jìshù tōngguò zài shùjùyuán fùjìn chǔlǐ shùjù lái jiǎnshǎo wǎngluò yánchí hé dàikuān xiāohào.",
      "sentence_fr": "La technologie de l'edge computing réduit la latence du réseau et la consommation de bande passante en traitant les données près de leur source.",
      "sentence_en": "Edge computing technology reduces network latency and bandwidth consumption by processing data near its source.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "edge_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项研究分析了城市绿地面积与居民幸福感之间的相关性。",
      "sentence_pinyin": "Zhè xiàng yánjiū fēnxī le chéngshì lǜdì miànjī yǔ jūmín xìngfúgǎn zhījiān de xiāngguānxìng.",
      "sentence_fr": "Cette étude analyse la corrélation entre la superficie des espaces verts urbains et le bien-être des résidents.",
      "sentence_en": "This research analyzes the correlation between urban green space area and residents' sense of well-being.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_wellbeing_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "传统手工艺的数字化保护为濒临失传的技艺提供了新的传承途径。",
      "sentence_pinyin": "Chuántǒng shǒugōngyì de shùzìhuà bǎohù wèi bīnlín shīchuán de jìyì tígōng le xīn de chuánchéng tújìng.",
      "sentence_fr": "La préservation numérique de l'artisanat traditionnel offre de nouvelles voies de transmission pour les savoir-faire en voie de disparition.",
      "sentence_en": "Digital preservation of traditional crafts provides new inheritance pathways for skills on the verge of being lost.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_heritage_preservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际贸易摩擦对全球产业链的稳定性构成了严峻的挑战。",
      "sentence_pinyin": "Guójì màoyì mócā duì quánqiú chǎnyèliàn de wěndìngxìng gòuchéng le yánjùn de tiǎozhàn.",
      "sentence_fr": "Les frictions commerciales internationales posent de sérieux défis à la stabilité des chaînes industrielles mondiales.",
      "sentence_en": "International trade friction poses serious challenges to the stability of global industrial chains.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "trade_friction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位音乐家的创作融合了东西方音乐元素,开创了独特的跨文化音乐风格。",
      "sentence_pinyin": "Zhè wèi yīnyuèjiā de chuàngzuò rónghé le dōngxīfāng yīnyuè yuánsù, kāichuàng le dútè de kuà wénhuà yīnyuè fēnggé.",
      "sentence_fr": "Les créations de ce musicien fusionnent des éléments musicaux orientaux et occidentaux, créant un style musical interculturel unique.",
      "sentence_en": "This musician's creations blend Eastern and Western musical elements, pioneering a unique cross-cultural musical style.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cross_cultural_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微塑料污染已经渗透到食物链的各个层级,对人体健康的长期影响尚待研究。",
      "sentence_pinyin": "Wēi sùliào wūrǎn yǐjīng shèntòu dào shíwùliàn de gègè céngjí, duì réntǐ jiànkāng de chángqī yǐngxiǎng shàng dài yánjiū.",
      "sentence_fr": "La pollution par les microplastiques a pénétré tous les niveaux de la chaîne alimentaire, et ses effets à long terme sur la santé humaine restent à étudier.",
      "sentence_en": "Microplastic pollution has penetrated all levels of the food chain, and its long-term effects on human health remain to be studied.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microplastic_pollution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "共享经济模式重新定义了资产所有权和使用权之间的关系。",
      "sentence_pinyin": "Gòngxiǎng jīngjì móshì chóngxīn dìngyì le zīchǎn suǒyǒuquán hé shǐyòngquán zhījiān de guānxì.",
      "sentence_fr": "Le modèle de l'économie du partage redéfinit la relation entre la propriété des actifs et leur droit d'usage.",
      "sentence_en": "The sharing economy model redefines the relationship between asset ownership and usage rights.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sharing_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项关于儿童早期发展的纵向研究持续追踪了参与者二十年的成长历程。",
      "sentence_pinyin": "Zhè xiàng guānyú értóng zǎoqī fāzhǎn de zòngxiàng yánjiū chíxù zhuīzōng le cānyùzhě èrshí nián de chéngzhǎng lìchéng.",
      "sentence_fr": "Cette étude longitudinale sur le développement de la petite enfance a suivi le parcours de croissance des participants pendant vingt ans.",
      "sentence_en": "This longitudinal study on early childhood development has continuously tracked participants' growth journey for twenty years.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "longitudinal_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
