{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子蒙特卡洛方法利用随机采样估算量子系统的性质。",
      "sentence_pinyin": "Liàngzǐ Méngté Kǎluò fāngfǎ lìyòng suíjī cǎiyàng gūsuàn liàngzǐ xìtǒng de xìngzhì.",
      "sentence_fr": "Les méthodes de Monte-Carlo quantiques utilisent l'échantillonnage aléatoire pour estimer les propriétés des systèmes quantiques.",
      "sentence_en": "Quantum Monte Carlo methods use random sampling to estimate properties of quantum systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_monte_carlo",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "门限签名方案要求达到阈值数量的参与者才能生成有效签名。",
      "sentence_pinyin": "Ménxiàn qiānmíng fāng'àn yāoqiú dádào yùzhí shùliàng de cānyùzhě cáinéng shēngchéng yǒuxiào qiānmíng.",
      "sentence_fr": "Les schémas de signature à seuil exigent un nombre minimum de participants pour générer une signature valide.",
      "sentence_en": "Threshold signature schemes require a threshold number of participants to generate a valid signature.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "threshold_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "广义代数数据类型扩展了标准数据类型的表达能力。",
      "sentence_pinyin": "Guǎngyì dàishù shùjù lèixíng kuòzhǎn le biāozhǔn shùjù lèixíng de biǎodá nénglì.",
      "sentence_fr": "Les types de données algébriques généralisés étendent la capacité d'expression des types de données standard.",
      "sentence_en": "Generalized algebraic data types extend the expressive power of standard data types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "generalized_algebraic_datatypes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同调代数研究链复形及其同调群的代数结构。",
      "sentence_pinyin": "Tóngdiào dàishù yánjiū liàn fùxíng jí qí tóngdiào qún de dàishù jiégòu.",
      "sentence_fr": "L'algèbre homologique étudie les complexes de chaînes et la structure algébrique de leurs groupes d'homologie.",
      "sentence_en": "Homological algebra studies chain complexes and the algebraic structure of their homology groups.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homological_algebra",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子自旋液体是一种不存在长程磁序的奇异量子态。",
      "sentence_pinyin": "Liàngzǐ zìxuán yètǐ shì yī zhǒng bù cúnzài chángchéng cí xù de qíyì liàngzǐ tài.",
      "sentence_fr": "Les liquides de spin quantiques sont des états quantiques exotiques sans ordre magnétique à longue portée.",
      "sentence_en": "Quantum spin liquids are exotic quantum states without long-range magnetic order.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_spin_liquids",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于身份的加密使用接收者的身份作为公钥。",
      "sentence_pinyin": "Jīyú shēnfèn de jiāmì shǐyòng jiēshōuzhě de shēnfèn zuòwéi gōngyào.",
      "sentence_fr": "Le chiffrement basé sur l'identité utilise l'identité du destinataire comme clé publique.",
      "sentence_en": "Identity-based encryption uses the recipient's identity as a public key.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "identity_based_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型推断算法自动推导表达式的最通用类型。",
      "sentence_pinyin": "Lèixíng tuīduàn suànfǎ zìdòng tuīdǎo biǎodáshì de zuì tōngyòng lèixíng.",
      "sentence_fr": "Les algorithmes d'inférence de type dérivent automatiquement le type le plus général des expressions.",
      "sentence_en": "Type inference algorithms automatically derive the most general type of expressions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_inference_algorithms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微分拓扑研究光滑流形的拓扑性质和光滑结构。",
      "sentence_pinyin": "Wēifēn tuòpū yánjiū guānghuá liúxíng de tuòpū xìngzhì hé guānghuá jiégòu.",
      "sentence_fr": "La topologie différentielle étudie les propriétés topologiques et les structures lisses des variétés différentiables.",
      "sentence_en": "Differential topology studies topological properties and smooth structures of smooth manifolds.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "differential_topology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "玻色-爱因斯坦凝聚态是大量玻色子占据同一量子态的现象。",
      "sentence_pinyin": "Bōsè-Àiyīnsītǎn níngjù tài shì dàliàng bōsèzǐ zhànjù tóngyī liàngzǐ tài de xiànxiàng.",
      "sentence_fr": "La condensation de Bose-Einstein est le phénomène où de nombreux bosons occupent le même état quantique.",
      "sentence_en": "Bose-Einstein condensation is the phenomenon where many bosons occupy the same quantum state.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bose_einstein_condensation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "盲签名允许签名者在不知道消息内容的情况下签名。",
      "sentence_pinyin": "Máng qiānmíng yǔnxǔ qiānmíngzhě zài bù zhīdào xiāoxī nèiróng de qíngkuàng xià qiānmíng.",
      "sentence_fr": "Les signatures aveugles permettent aux signataires de signer sans connaître le contenu du message.",
      "sentence_en": "Blind signatures allow signers to sign without knowing the content of the message.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "blind_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多态递归允许递归函数在不同类型实例化下调用自身。",
      "sentence_pinyin": "Duōtài dìguī yǔnxǔ dìguī hánshù zài bùtóng lèixíng shílìhuà xià diàoyòng zìshēn.",
      "sentence_fr": "La récursion polymorphe permet aux fonctions récursives de s'appeler elles-mêmes avec différentes instanciations de type.",
      "sentence_en": "Polymorphic recursion allows recursive functions to call themselves with different type instantiations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "polymorphic_recursion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表示论研究代数结构通过线性变换的具体实现。",
      "sentence_pinyin": "Biǎoshì lùn yánjiū dàishù jiégòu tōngguò xiànxìng biànhuàn de jùtǐ shíxiàn.",
      "sentence_fr": "La théorie des représentations étudie les réalisations concrètes des structures algébriques par des transformations linéaires.",
      "sentence_en": "Representation theory studies concrete realizations of algebraic structures through linear transformations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "representation_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "马约拉纳费米子是自身的反粒子具有独特的量子性质。",
      "sentence_pinyin": "Mǎyuēlānà fèimǐzǐ shì zìshēn de fǎn lìzǐ jùyǒu dútè de liàngzǐ xìngzhì.",
      "sentence_fr": "Les fermions de Majorana sont leurs propres antiparticules avec des propriétés quantiques uniques.",
      "sentence_en": "Majorana fermions are their own antiparticles with unique quantum properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "majorana_fermions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环签名允许群组成员匿名签名而不暴露具体签名者。",
      "sentence_pinyin": "Huán qiānmíng yǔnxǔ qúnzǔ chéngyuán nìmíng qiānmíng ér bù bàolù jùtǐ qiānmíngzhě.",
      "sentence_fr": "Les signatures en anneau permettent aux membres d'un groupe de signer anonymement sans révéler le signataire spécifique.",
      "sentence_en": "Ring signatures allow group members to sign anonymously without revealing the specific signer.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ring_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "子结构类型系统限制变量的使用方式如线性或仿射使用。",
      "sentence_pinyin": "Zǐ jiégòu lèixíng xìtǒng xiànzhì biànliàng de shǐyòng fāngshì rú xiànxìng huò fǎngshè shǐyòng.",
      "sentence_fr": "Les systèmes de types substructurels restreignent l'utilisation des variables comme l'usage linéaire ou affine.",
      "sentence_en": "Substructural type systems restrict how variables can be used such as linear or affine usage.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "substructural_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "上同调理论提供了测量拓扑空间洞的代数工具。",
      "sentence_pinyin": "Shàng tóngdiào lǐlùn tígōng le cèliáng tuòpū kōngjiān dòng de dàishù gōngjù.",
      "sentence_fr": "La théorie de la cohomologie fournit des outils algébriques pour mesurer les trous dans les espaces topologiques.",
      "sentence_en": "Cohomology theory provides algebraic tools for measuring holes in topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cohomology_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子相变发生在绝对零度附近由量子涨落驱动。",
      "sentence_pinyin": "Liàngzǐ xiàngbiàn fāshēng zài juéduì língdù fùjìn yóu liàngzǐ zhàngluò qūdòng.",
      "sentence_fr": "Les transitions de phase quantiques se produisent près du zéro absolu et sont pilotées par les fluctuations quantiques.",
      "sentence_en": "Quantum phase transitions occur near absolute zero driven by quantum fluctuations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_phase_transitions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "群签名允许群组成员代表整个群组进行签名。",
      "sentence_pinyin": "Qún qiānmíng yǔnxǔ qúnzǔ chéngyuán dàibiǎo zhěnggè qúnzǔ jìnxíng qiānmíng.",
      "sentence_fr": "Les signatures de groupe permettent aux membres d'un groupe de signer au nom de l'ensemble du groupe.",
      "sentence_en": "Group signatures allow group members to sign on behalf of the entire group.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "group_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型级编程在编译时执行计算以确保程序正确性。",
      "sentence_pinyin": "Lèixíng jí biānchéng zài biānyì shí zhíxíng jìsuàn yǐ quèbǎo chéngxù zhèngquèxìng.",
      "sentence_fr": "La programmation au niveau des types effectue des calculs à la compilation pour garantir la correction du programme.",
      "sentence_en": "Type-level programming performs computations at compile time to ensure program correctness.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_level_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纽结理论研究嵌入三维空间的闭合曲线的拓扑性质。",
      "sentence_pinyin": "Niǔjié lǐlùn yánjiū qiànrù sānwéi kōngjiān de bìhé qūxiàn de tuòpū xìngzhì.",
      "sentence_fr": "La théorie des nœuds étudie les propriétés topologiques des courbes fermées plongées dans l'espace tridimensionnel.",
      "sentence_en": "Knot theory studies topological properties of closed curves embedded in three-dimensional space.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "knot_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
