{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "星系碰撞触发新一轮恒星形成和星系结构重组。",
      "sentence_pinyin": "Xīngxì pèngzhuàng chùfā xīn yī lún héngxīng xíngchéng hé xīngxì jiégòu chóngzǔ.",
      "sentence_fr": "Les collisions galactiques déclenchent de nouvelles vagues de formation d'étoiles et la restructuration de la galaxie.",
      "sentence_en": "Galaxy collisions trigger new rounds of star formation and galactic structure reorganization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "galaxy_collisions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代币经济学设计激励机制以促进网络参与和增长。",
      "sentence_pinyin": "Dàibì jīngjìxué shèjì jīlì jīzhì yǐ cùjìn wǎngluò cānyù hé zēngzhǎng.",
      "sentence_fr": "La tokenomique conçoit des mécanismes d'incitation pour encourager la participation et la croissance du réseau.",
      "sentence_en": "Tokenomics designs incentive mechanisms to promote network participation and growth.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tokenomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "萨迦协议允许分布式系统中的长时事务管理。",
      "sentence_pinyin": "Sàjiā xiéyì yǔnxǔ fēnbùshì xìtǒng zhōng de cháng shí shìwù guǎnlǐ.",
      "sentence_fr": "Le modèle Saga permet la gestion de transactions de longue durée dans les systèmes distribués.",
      "sentence_en": "The Saga pattern enables long-running transaction management in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "saga_pattern",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基础论认为知识体系必须建立在不可怀疑的基础信念上。",
      "sentence_pinyin": "Jīchǔlùn rènwéi zhīshì tǐxì bìxū jiànlì zài bùkě huáiyí de jīchǔ xìnniàn shàng.",
      "sentence_fr": "Le fondationnalisme soutient que les systèmes de connaissances doivent être fondés sur des croyances de base indéniables.",
      "sentence_en": "Foundationalism holds that knowledge systems must be built on undeniable basic beliefs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "foundationalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据质量维度包括准确性完整性一致性和及时性。",
      "sentence_pinyin": "Shùjù zhìliàng wéidù bāokuò zhǔnquèxìng wánzhěngxìng yīzhìxìng hé jíshíxìng.",
      "sentence_fr": "Les dimensions de qualité des données incluent l'exactitude, l'exhaustivité, la cohérence et l'actualité.",
      "sentence_en": "Data quality dimensions include accuracy, completeness, consistency, and timeliness.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_quality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "星系演化受到合并历史和环境因素的共同影响。",
      "sentence_pinyin": "Xīngxì yǎnhuà shòudào hébìng lìshǐ hé huánjìng yīnsù de gòngtóng yǐngxiǎng.",
      "sentence_fr": "L'évolution des galaxies est influencée conjointement par l'historique des fusions et les facteurs environnementaux.",
      "sentence_en": "Galaxy evolution is jointly influenced by merger history and environmental factors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "galaxy_evolution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动做市商算法根据供需自动调整交易价格。",
      "sentence_pinyin": "Zìdòng zuòshìshāng suànfǎ gēnjù gōngxū zìdòng tiáozhěng jiāoyì jiàgé.",
      "sentence_fr": "Les algorithmes de teneur de marché automatisé ajustent automatiquement les prix en fonction de l'offre et de la demande.",
      "sentence_en": "Automated market maker algorithms automatically adjust trading prices based on supply and demand.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "automated_market_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "补偿事务在分布式系统中撤销已完成操作的影响。",
      "sentence_pinyin": "Bǔcháng shìwù zài fēnbùshì xìtǒng zhōng chèxiāo yǐ wánchéng cāozuò de yǐngxiǎng.",
      "sentence_fr": "Les transactions de compensation annulent les effets des opérations terminées dans les systèmes distribués.",
      "sentence_en": "Compensating transactions undo the effects of completed operations in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "compensating_transactions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "融贯论主张信念的合理性来自其与其他信念的一致性。",
      "sentence_pinyin": "Róngguànlùn zhǔzhāng xìnniàn de hélǐxìng láizì qí yǔ qítā xìnniàn de yīzhìxìng.",
      "sentence_fr": "Le cohérentisme soutient que la rationalité des croyances provient de leur cohérence avec d'autres croyances.",
      "sentence_en": "Coherentism maintains that belief rationality comes from consistency with other beliefs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epistemological_coherentism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "元数据管理建立数据资产的分类标签和业务词汇表。",
      "sentence_pinyin": "Yuán shùjù guǎnlǐ jiànlì shùjù zīchǎn de fēnlèi biāoqiān hé yèwù cíhuìbiǎo.",
      "sentence_fr": "La gestion des métadonnées établit des classifications, des étiquettes et des glossaires métier pour les actifs de données.",
      "sentence_en": "Metadata management establishes classification tags and business glossaries for data assets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "metadata_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超大质量黑洞位于大多数大型星系的中心区域。",
      "sentence_pinyin": "Chāodà zhìliàng hēidòng wèiyú dàduōshù dàxíng xīngxì de zhōngxīn qūyù.",
      "sentence_fr": "Les trous noirs supermassifs se trouvent au centre de la plupart des grandes galaxies.",
      "sentence_en": "Supermassive black holes are located in the central regions of most large galaxies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supermassive_black_holes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无常损失是流动性提供者因价格波动遭受的潜在损失。",
      "sentence_pinyin": "Wúcháng sǔnshī shì liúdòngxìng tígōngzhě yīn jiàgé bōdòng zāoshòu de qiánzài sǔnshī.",
      "sentence_fr": "La perte impermanente est la perte potentielle subie par les fournisseurs de liquidité due aux fluctuations de prix.",
      "sentence_en": "Impermanent loss is potential loss suffered by liquidity providers due to price fluctuations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "impermanent_loss",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "外发日志确保消息传递和数据库更新的原子性。",
      "sentence_pinyin": "Wàifā rìzhì quèbǎo xiāoxī chuándì hé shùjùkù gēngxīn de yuánzǐxìng.",
      "sentence_fr": "Le journal d'envoi garantit l'atomicité de la livraison des messages et des mises à jour de la base de données.",
      "sentence_en": "Outbox pattern ensures atomicity of message delivery and database updates.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "outbox_pattern",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "外在主义认为知识的辩护条件可以包括外部因素。",
      "sentence_pinyin": "Wàizài zhǔyì rènwéi zhīshì de biànhù tiáojiàn kěyǐ bāokuò wàibù yīnsù.",
      "sentence_fr": "L'externalisme soutient que les conditions de justification de la connaissance peuvent inclure des facteurs externes.",
      "sentence_en": "Externalism holds that justification conditions for knowledge can include external factors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epistemic_externalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据治理框架定义数据管理的政策标准和职责分工。",
      "sentence_pinyin": "Shùjù zhìlǐ kuàngjià dìngyì shùjù guǎnlǐ de zhèngcè biāozhǔn hé zhízé fēngōng.",
      "sentence_fr": "Les cadres de gouvernance des données définissent les politiques, les normes et la répartition des responsabilités de gestion des données.",
      "sentence_en": "Data governance frameworks define policies, standards, and responsibility allocation for data management.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_governance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "星际介质是恒星之间充满气体和尘埃的空间区域。",
      "sentence_pinyin": "Xīngjì jièzhì shì héngxīng zhījiān chōngmǎn qìtǐ hé chéntǔ de kōngjiān qūyù.",
      "sentence_fr": "Le milieu interstellaire est la région spatiale entre les étoiles remplie de gaz et de poussière.",
      "sentence_en": "Interstellar medium is the space region between stars filled with gas and dust.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "interstellar_medium",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协议升级机制允许区块链网络在不硬分叉的情况下演进。",
      "sentence_pinyin": "Xiéyì shēngjí jīzhì yǔnxǔ qūkuàiliàn wǎngluò zài bù yìng fēnchā de qíngkuàng xià yǎnjìn.",
      "sentence_fr": "Les mécanismes de mise à niveau de protocole permettent aux réseaux blockchain d'évoluer sans hard fork.",
      "sentence_en": "Protocol upgrade mechanisms allow blockchain networks to evolve without hard forking.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "protocol_upgrades",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于时间的缓存失效策略在固定间隔后更新缓存内容。",
      "sentence_pinyin": "Jīyú shíjiān de huǎncún shīxiào cèlüè zài gùdìng jiàngé hòu gēngxīn huǎncún nèiróng.",
      "sentence_fr": "Les stratégies d'invalidation de cache basées sur le temps actualisent le contenu du cache après des intervalles fixes.",
      "sentence_en": "Time-based cache invalidation strategies update cache content after fixed intervals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cache_invalidation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内在主义要求知识辩护仅依赖于认知主体可及的因素。",
      "sentence_pinyin": "Nèizài zhǔyì yāoqiú zhīshì biànhù jǐn yīlài yú rènzhī zhǔtǐ kě jí de yīnsù.",
      "sentence_fr": "L'internalisme exige que la justification de la connaissance ne dépende que de facteurs accessibles au sujet cognitif.",
      "sentence_en": "Internalism requires that knowledge justification depend only on factors accessible to the cognitive subject.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epistemic_internalism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "主数据管理确保关键业务实体数据的单一可信来源。",
      "sentence_pinyin": "Zhǔ shùjù guǎnlǐ quèbǎo guānjiàn yèwù shítǐ shùjù de dānyī kěxìn láiyuán.",
      "sentence_fr": "La gestion des données de référence garantit une source unique et fiable pour les données des entités commerciales clés.",
      "sentence_en": "Master data management ensures a single trusted source for key business entity data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "master_data_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
