{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "地缘政治紧张局势正在重塑全球半导体供应链的战略布局。",
      "sentence_pinyin": "Dìyuán zhèngzhì jǐnzhāng júshì zhèngzài chóngsù quánqiú bàndǎotǐ gōngyìng liàn de zhànlüè bùjú.",
      "sentence_fr": "Les tensions géopolitiques remodèlent la configuration stratégique de la chaîne d'approvisionnement mondiale des semi-conducteurs.",
      "sentence_en": "Geopolitical tensions are reshaping the strategic layout of the global semiconductor supply chain.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semiconductor_geopolitics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物多样性热点地区的保护对于维持全球生态系统服务功能至关重要。",
      "sentence_pinyin": "Shēngwù duōyàng xìng rèdiǎn dìqū de bǎohù duìyú wéichí quánqiú shēngtài xìtǒng fúwù gōngnéng zhìguān zhòngyào.",
      "sentence_fr": "La protection des zones de biodiversité est cruciale pour maintenir les services écosystémiques mondiaux.",
      "sentence_en": "The protection of biodiversity hotspots is crucial for maintaining global ecosystem service functions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biodiversity_hotspots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自适应学习系统根据每个学生的学习进度和风格自动调整教学内容。",
      "sentence_pinyin": "Zìshìyìng xuéxí xìtǒng gēnjù měi gè xuéshēng de xuéxí jìndù hé fēnggé zìdòng tiáozhěng jiàoxué nèiróng.",
      "sentence_fr": "Les systèmes d'apprentissage adaptatif ajustent automatiquement le contenu pédagogique en fonction du rythme et du style d'apprentissage de chaque étudiant.",
      "sentence_en": "Adaptive learning systems automatically adjust teaching content based on each student's learning progress and style.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "adaptive_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太空碎片的增加对正在运行的卫星和未来太空任务构成越来越大的威胁。",
      "sentence_pinyin": "Tàikōng suìpiàn de zēngjiā duì zhèngzài yùnxíng de wèixīng hé wèilái tàikōng rènwù gòuchéng yuèláiyuè dà de wēixié.",
      "sentence_fr": "L'augmentation des débris spatiaux représente une menace croissante pour les satellites en fonctionnement et les futures missions spatiales.",
      "sentence_en": "The increase in space debris poses a growing threat to operating satellites and future space missions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "space_debris",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "叙事医学培训帮助医疗专业人员更好地理解患者的疾病体验和情感需求。",
      "sentence_pinyin": "Xùshì yīxué péixùn bāngzhù yīliáo zhuānyè rényuán gèng hǎo de lǐjiě huànzhě de jíbìng tǐyàn hé qínggǎn xūqiú.",
      "sentence_fr": "La formation en médecine narrative aide les professionnels de santé à mieux comprendre l'expérience de la maladie et les besoins émotionnels des patients.",
      "sentence_en": "Narrative medicine training helps healthcare professionals better understand patients' illness experiences and emotional needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "narrative_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "开源软件运动彻底改变了软件开发和知识共享的传统模式。",
      "sentence_pinyin": "Kāiyuán ruǎnjiàn yùndòng chèdǐ gǎibiàn le ruǎnjiàn kāifā hé zhīshi gòngxiǎng de chuántǒng móshì.",
      "sentence_fr": "Le mouvement du logiciel open source a radicalement transformé les modèles traditionnels de développement logiciel et de partage des connaissances.",
      "sentence_en": "The open-source software movement has fundamentally changed traditional models of software development and knowledge sharing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "open_source_movement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土壤微生物组的健康状况直接影响农作物的营养吸收和抗病能力。",
      "sentence_pinyin": "Tǔrǎng wéishēngwù zǔ de jiànkāng zhuàngkuàng zhíjiē yǐngxiǎng nóngzuòwù de yíngyǎng xīshōu hé kàng bìng nénglì.",
      "sentence_fr": "L'état de santé du microbiome du sol affecte directement l'absorption des nutriments et la résistance aux maladies des cultures.",
      "sentence_en": "The health of the soil microbiome directly affects crop nutrient absorption and disease resistance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soil_microbiome",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多模态人工智能模型能够同时处理文本、图像和音频等多种类型的输入数据。",
      "sentence_pinyin": "Duō mótài réngōng zhìnéng móxíng nénggòu tóngshí chǔlǐ wénběn, túxiàng hé yīnpín děng duō zhǒng lèixíng de shūrù shùjù.",
      "sentence_fr": "Les modèles d'intelligence artificielle multimodaux peuvent traiter simultanément plusieurs types de données d'entrée comme le texte, les images et l'audio.",
      "sentence_en": "Multimodal artificial intelligence models can simultaneously process multiple types of input data such as text, images, and audio.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multimodal_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化智力培训帮助跨国团队成员更有效地在多元文化环境中工作和协作。",
      "sentence_pinyin": "Wénhuà zhìlì péixùn bāngzhù kuàguó tuánduì chéngyuán gèng yǒuxiào de zài duōyuán wénhuà huánjìng zhōng gōngzuò hé xiézuò.",
      "sentence_fr": "La formation à l'intelligence culturelle aide les membres d'équipes multinationales à travailler et collaborer plus efficacement dans des environnements multiculturels.",
      "sentence_en": "Cultural intelligence training helps multinational team members work and collaborate more effectively in multicultural environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_intelligence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "储能技术的突破是解决可再生能源间歇性问题的关键所在。",
      "sentence_pinyin": "Chǔnéng jìshù de tūpò shì jiějué kě zàishēng néngyuán jiànxiē xìng wèntí de guānjiàn suǒzài.",
      "sentence_fr": "Les percées dans les technologies de stockage d'énergie sont essentielles pour résoudre le problème de l'intermittence des énergies renouvelables.",
      "sentence_en": "Breakthroughs in energy storage technology are key to solving the intermittency problem of renewable energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "energy_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字孪生技术允许工程师在虚拟环境中测试和优化物理系统的性能。",
      "sentence_pinyin": "Shùzì luánshēng jìshù yǔnxǔ gōngchéngshī zài xūnǐ huánjìng zhōng cèshì hé yōuhuà wùlǐ xìtǒng de xìngnéng.",
      "sentence_fr": "La technologie du jumeau numérique permet aux ingénieurs de tester et d'optimiser les performances des systèmes physiques dans un environnement virtuel.",
      "sentence_en": "Digital twin technology allows engineers to test and optimize physical system performance in a virtual environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_twin",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学哲学探讨科学知识的本质以及科学方法的有效性和局限性。",
      "sentence_pinyin": "Kēxué zhéxué tàntǎo kēxué zhīshi de běnzhì yǐjí kēxué fāngfǎ de yǒuxiào xìng hé júxiàn xìng.",
      "sentence_fr": "La philosophie des sciences explore la nature de la connaissance scientifique ainsi que l'efficacité et les limites de la méthode scientifique.",
      "sentence_en": "Philosophy of science explores the nature of scientific knowledge and the effectiveness and limitations of scientific methods.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区参与式设计方法确保城市规划项目能够真正反映居民的实际需求。",
      "sentence_pinyin": "Shèqū cānyù shì shèjì fāngfǎ quèbǎo chéngshì guīhuà xiàngmù nénggòu zhēnzhèng fǎnyìng jūmín de shíjì xūqiú.",
      "sentence_fr": "Les méthodes de conception participative communautaire garantissent que les projets d'urbanisme reflètent véritablement les besoins réels des résidents.",
      "sentence_en": "Community participatory design methods ensure that urban planning projects truly reflect residents' actual needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "participatory_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "免疫疗法的发展为许多曾被认为无法治愈的癌症类型带来了新的希望。",
      "sentence_pinyin": "Miǎnyì liáofǎ de fāzhǎn wèi xǔduō céng bèi rènwéi wúfǎ zhìyù de áizhèng lèixíng dàilái le xīn de xīwàng.",
      "sentence_fr": "Le développement de l'immunothérapie apporte un nouvel espoir pour de nombreux types de cancers autrefois considérés comme incurables.",
      "sentence_en": "The development of immunotherapy has brought new hope for many cancer types once considered incurable.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cancer_immunotherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络效应使得社交媒体平台随着用户数量的增加而变得越来越有价值。",
      "sentence_pinyin": "Wǎngluò xiàoyìng shǐdé shèjiāo méitǐ píngtái suízhe yònghù shùliàng de zēngjiā ér biàn de yuèláiyuè yǒu jiàzhí.",
      "sentence_fr": "Les effets de réseau font que les plateformes de médias sociaux deviennent de plus en plus précieuses à mesure que le nombre d'utilisateurs augmente.",
      "sentence_en": "Network effects make social media platforms become increasingly valuable as the number of users grows.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_effects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "考古遗传学通过分析古代DNA样本揭示了人类迁徙的复杂历史。",
      "sentence_pinyin": "Kǎogǔ yíchuán xué tōngguò fēnxī gǔdài DNA yàngběn jiēshì le rénlèi qiānyí de fùzá lìshǐ.",
      "sentence_fr": "L'archéogénétique révèle l'histoire complexe des migrations humaines grâce à l'analyse d'échantillons d'ADN ancien.",
      "sentence_en": "Archaeogenetics reveals the complex history of human migration through analysis of ancient DNA samples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "archaeogenetics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零信任安全架构要求对每次访问请求进行身份验证，无论其来源于网络内部还是外部。",
      "sentence_pinyin": "Líng xìnrèn ānquán jiàgòu yāoqiú duì měi cì fǎngwèn qǐngqiú jìnxíng shēnfèn yànzhèng, wúlùn qí láiyuán yú wǎngluò nèibù háishì wàibù.",
      "sentence_fr": "L'architecture de sécurité zéro confiance exige l'authentification de chaque demande d'accès, qu'elle provienne de l'intérieur ou de l'extérieur du réseau.",
      "sentence_en": "Zero-trust security architecture requires authentication for every access request, regardless of whether it originates from inside or outside the network.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_trust_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会情感学习课程帮助学生发展自我意识、同理心和人际交往技能。",
      "sentence_pinyin": "Shèhuì qínggǎn xuéxí kèchéng bāngzhù xuéshēng fāzhǎn zìwǒ yìshí, tónglǐ xīn hé rénjì jiāowǎng jìnéng.",
      "sentence_fr": "Les programmes d'apprentissage socio-émotionnel aident les élèves à développer la conscience de soi, l'empathie et les compétences interpersonnelles.",
      "sentence_en": "Social-emotional learning programs help students develop self-awareness, empathy, and interpersonal skills.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_emotional_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "固态电池技术有望解决传统锂离子电池在能量密度和安全性方面的局限。",
      "sentence_pinyin": "Gùtài diànchí jìshù yǒuwàng jiějué chuántǒng lǐ lízǐ diànchí zài néngliàng mìdù hé ānquán xìng fāngmiàn de júxiàn.",
      "sentence_fr": "La technologie des batteries à l'état solide devrait résoudre les limitations des batteries lithium-ion traditionnelles en termes de densité énergétique et de sécurité.",
      "sentence_en": "Solid-state battery technology is expected to solve the limitations of traditional lithium-ion batteries in terms of energy density and safety.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solid_state_batteries",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市考古学在现代建设项目进行前对历史遗迹进行抢救性发掘和保护。",
      "sentence_pinyin": "Chéngshì kǎogǔ xué zài xiàndài jiànshè xiàngmù jìnxíng qián duì lìshǐ yíjì jìnxíng qiǎngjiù xìng fājué hé bǎohù.",
      "sentence_fr": "L'archéologie urbaine effectue des fouilles de sauvetage et la protection des sites historiques avant les projets de construction modernes.",
      "sentence_en": "Urban archaeology conducts rescue excavations and protection of historical sites before modern construction projects proceed.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_archaeology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
