{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子计算在优化复杂物流调度问题方面展现出超越传统计算机的巨大潜力。",
      "sentence_pinyin": "Liàngzǐ jìsuàn zài yōuhuà fùzá wùliú diàodù wèntí fāngmiàn zhǎnxiàn chū chāoyuè chuántǒng jìsuànjī de jùdà qiánlì.",
      "sentence_fr": "L'informatique quantique montre un potentiel énorme supérieur aux ordinateurs traditionnels pour optimiser les problèmes complexes de planification logistique.",
      "sentence_en": "Quantum computing shows enormous potential beyond traditional computers in optimizing complex logistics scheduling problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_optimization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态旅游的可持续发展需要在经济利益与环境保护之间取得微妙平衡。",
      "sentence_pinyin": "Shēngtài lǚyóu de kěchíxù fāzhǎn xūyào zài jīngjì lìyì yǔ huánjìng bǎohù zhījiān qǔdé wēimiào pínghéng.",
      "sentence_fr": "Le développement durable de l'écotourisme nécessite un équilibre délicat entre les intérêts économiques et la protection de l'environnement.",
      "sentence_en": "The sustainable development of ecotourism requires a delicate balance between economic interests and environmental protection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecotourism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医疗人工智能在影像诊断领域的准确率已经接近甚至超过资深放射科医生。",
      "sentence_pinyin": "Yīliáo réngōng zhìnéng zài yǐngxiàng zhěnduàn lǐngyù de zhǔnquè lǜ yǐjīng jiējìn shènzhì chāoguò zīshēn fàngshè kē yīshēng.",
      "sentence_fr": "La précision de l'intelligence artificielle médicale dans le diagnostic par imagerie se rapproche voire dépasse celle des radiologues expérimentés.",
      "sentence_en": "The accuracy of medical AI in imaging diagnosis has approached or even exceeded that of senior radiologists.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "medical_ai_imaging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后殖民文学研究关注殖民历史对当代文化身份认同的持续影响。",
      "sentence_pinyin": "Hòu zhímín wénxué yánjiū guānzhù zhímín lìshǐ duì dāngdài wénhuà shēnfèn rèntóng de chíxù yǐngxiǎng.",
      "sentence_fr": "Les études littéraires postcoloniales s'intéressent à l'impact continu de l'histoire coloniale sur l'identité culturelle contemporaine.",
      "sentence_en": "Postcolonial literary studies focus on the ongoing impact of colonial history on contemporary cultural identity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "postcolonial_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能交通系统通过实时数据分析优化城市道路网络的通行效率。",
      "sentence_pinyin": "Zhìnéng jiāotōng xìtǒng tōngguò shíshí shùjù fēnxī yōuhuà chéngshì dàolù wǎngluò de tōngxíng xiàolǜ.",
      "sentence_fr": "Les systèmes de transport intelligents optimisent l'efficacité de circulation du réseau routier urbain grâce à l'analyse de données en temps réel.",
      "sentence_en": "Intelligent transportation systems optimize urban road network traffic efficiency through real-time data analysis.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intelligent_transportation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "肠道菌群失衡与多种慢性疾病之间的关联正在成为医学研究的热点领域。",
      "sentence_pinyin": "Chángdào jùnqún shīhéng yǔ duō zhǒng mànxìng jíbìng zhījiān de guānlián zhèngzài chéngwéi yīxué yánjiū de rèdiǎn lǐngyù.",
      "sentence_fr": "Le lien entre le déséquilibre du microbiote intestinal et diverses maladies chroniques devient un domaine de recherche médicale majeur.",
      "sentence_en": "The connection between gut microbiome imbalance and various chronic diseases is becoming a hot area of medical research.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gut_microbiome_health",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "设计思维方法论强调以用户为中心的迭代式问题解决流程。",
      "sentence_pinyin": "Shèjì sīwéi fāngfǎ lùn qiángdiào yǐ yònghù wéi zhōngxīn de diédài shì wèntí jiějué liúchéng.",
      "sentence_fr": "La méthodologie du design thinking met l'accent sur un processus itératif de résolution de problèmes centré sur l'utilisateur.",
      "sentence_en": "Design thinking methodology emphasizes a user-centered iterative problem-solving process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "design_thinking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海上风电场的建设正在成为沿海国家能源转型战略的重要组成部分。",
      "sentence_pinyin": "Hǎishàng fēngdiàn chǎng de jiànshè zhèngzài chéngwéi yánhǎi guójiā néngyuán zhuǎnxíng zhànlüè de zhòngyào zǔchéng bùfèn.",
      "sentence_fr": "La construction de parcs éoliens offshore devient une composante importante de la stratégie de transition énergétique des pays côtiers.",
      "sentence_en": "The construction of offshore wind farms is becoming an important component of coastal nations' energy transition strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "offshore_wind_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "媒体素养教育帮助公民识别虚假信息并培养对新闻来源的批判性思考能力。",
      "sentence_pinyin": "Méitǐ sùyǎng jiàoyù bāngzhù gōngmín shìbié xūjiǎ xìnxī bìng péiyǎng duì xīnwén láiyuán de pīpàn xìng sīkǎo nénglì.",
      "sentence_fr": "L'éducation aux médias aide les citoyens à identifier les fausses informations et à développer une pensée critique envers les sources d'information.",
      "sentence_en": "Media literacy education helps citizens identify false information and develop critical thinking about news sources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "media_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋白质工程技术使科学家能够设计具有定制功能的酶用于工业应用。",
      "sentence_pinyin": "Dànbáizhì gōngchéng jìshù shǐ kēxué jiā nénggòu shèjì jùyǒu dìngzhì gōngnéng de méi yòngyú gōngyè yìngyòng.",
      "sentence_fr": "La technologie d'ingénierie des protéines permet aux scientifiques de concevoir des enzymes aux fonctions personnalisées pour des applications industrielles.",
      "sentence_en": "Protein engineering technology enables scientists to design enzymes with customized functions for industrial applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "protein_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字人文研究方法将计算工具应用于文学、历史和艺术等传统人文学科。",
      "sentence_pinyin": "Shùzì rénwén yánjiū fāngfǎ jiāng jìsuàn gōngjù yìngyòng yú wénxué, lìshǐ hé yìshù děng chuántǒng rénwén xuékē.",
      "sentence_fr": "Les méthodes de recherche en humanités numériques appliquent des outils informatiques aux disciplines humanistes traditionnelles comme la littérature, l'histoire et l'art.",
      "sentence_en": "Digital humanities research methods apply computational tools to traditional humanities disciplines such as literature, history, and art.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_humanities",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合动力推进系统在船舶工业中的应用有助于减少航运业的碳排放。",
      "sentence_pinyin": "Hùnhé dònglì tuījìn xìtǒng zài chuánbó gōngyè zhōng de yìngyòng yǒuzhù yú jiǎnshǎo hángyùn yè de tàn páifàng.",
      "sentence_fr": "L'application des systèmes de propulsion hybride dans l'industrie maritime contribue à réduire les émissions de carbone du secteur du transport maritime.",
      "sentence_en": "The application of hybrid propulsion systems in the maritime industry helps reduce carbon emissions from the shipping sector.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hybrid_marine_propulsion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共卫生监测系统利用大数据分析预测和追踪传染病的传播模式。",
      "sentence_pinyin": "Gōnggòng wèishēng jiāncè xìtǒng lìyòng dà shùjù fēnxī yùcè hé zhuīzōng chuánrǎn bìng de chuánbō móshì.",
      "sentence_fr": "Les systèmes de surveillance de la santé publique utilisent l'analyse des mégadonnées pour prédire et suivre les modes de propagation des maladies infectieuses.",
      "sentence_en": "Public health surveillance systems use big data analysis to predict and track infectious disease transmission patterns.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "disease_surveillance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语用学研究语言在具体社会语境中的实际使用方式及其背后的意图。",
      "sentence_pinyin": "Yǔyòng xué yánjiū yǔyán zài jùtǐ shèhuì yǔjìng zhōng de shíjì shǐyòng fāngshì jí qí bèihòu de yìtú.",
      "sentence_fr": "La pragmatique étudie l'utilisation réelle du langage dans des contextes sociaux spécifiques et les intentions sous-jacentes.",
      "sentence_en": "Pragmatics studies how language is actually used in specific social contexts and the intentions behind it.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pragmatics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市韧性规划旨在增强城市应对自然灾害和气候变化冲击的能力。",
      "sentence_pinyin": "Chéngshì rènxìng guīhuà zhǐzài zēngqiáng chéngshì yìngduì zìrán zāihài hé qìhòu biànhuà chōngjī de nénglì.",
      "sentence_fr": "La planification de la résilience urbaine vise à renforcer la capacité des villes à faire face aux catastrophes naturelles et aux impacts du changement climatique.",
      "sentence_en": "Urban resilience planning aims to enhance cities' capacity to cope with natural disasters and climate change impacts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_resilience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识图谱技术帮助搜索引擎更好地理解用户查询背后的语义意图。",
      "sentence_pinyin": "Zhīshi túpǔ jìshù bāngzhù sōusuǒ yǐnqíng gèng hǎo de lǐjiě yònghù cháxún bèihòu de yǔyì yìtú.",
      "sentence_fr": "La technologie des graphes de connaissances aide les moteurs de recherche à mieux comprendre l'intention sémantique derrière les requêtes des utilisateurs.",
      "sentence_en": "Knowledge graph technology helps search engines better understand the semantic intent behind user queries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "knowledge_graphs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能性食品的研发旨在提供超出基本营养价值的健康益处。",
      "sentence_pinyin": "Gōngnéng xìng shípǐn de yánfā zhǐzài tígōng chāochū jīběn yíngyǎng jiàzhí de jiànkāng yìchù.",
      "sentence_fr": "Le développement d'aliments fonctionnels vise à offrir des bienfaits pour la santé au-delà de la valeur nutritive de base.",
      "sentence_en": "The development of functional foods aims to provide health benefits beyond basic nutritional value.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "functional_foods",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分布式计算架构允许将复杂计算任务分配到多台计算机上并行处理。",
      "sentence_pinyin": "Fēnbù shì jìsuàn jiàgòu yǔnxǔ jiāng fùzá jìsuàn rènwù fēnpèi dào duō tái jìsuànjī shàng bìngxíng chǔlǐ.",
      "sentence_fr": "L'architecture de calcul distribué permet de répartir des tâches de calcul complexes sur plusieurs ordinateurs pour un traitement parallèle.",
      "sentence_en": "Distributed computing architecture allows complex computational tasks to be distributed across multiple computers for parallel processing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "distributed_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "口述历史项目记录普通人的生活经历，为历史研究提供独特的第一手资料。",
      "sentence_pinyin": "Kǒushù lìshǐ xiàngmù jìlù pǔtōng rén de shēnghuó jīnglì, wèi lìshǐ yánjiū tígōng dútè de dìyī shǒu zīliào.",
      "sentence_fr": "Les projets d'histoire orale documentent les expériences de vie des gens ordinaires, fournissant des sources primaires uniques pour la recherche historique.",
      "sentence_en": "Oral history projects document ordinary people's life experiences, providing unique primary sources for historical research.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "oral_history",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳捕集与封存技术被认为是实现净零排放目标的重要过渡性解决方案。",
      "sentence_pinyin": "Tàn bǔjí yǔ fēngcún jìshù bèi rènwéi shì shíxiàn jìng líng páifàng mùbiāo de zhòngyào guòdù xìng jiějué fāng'àn.",
      "sentence_fr": "La technologie de capture et de stockage du carbone est considérée comme une solution de transition importante pour atteindre les objectifs de neutralité carbone.",
      "sentence_en": "Carbon capture and storage technology is considered an important transitional solution for achieving net-zero emission targets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_capture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
