{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "宇宙微波背景辐射是大爆炸残留的热辐射遗迹。",
      "sentence_pinyin": "Yǔzhòu wēibō bèijǐng fúshè shì dà bàozhà cánliú de rè fúshè yíjì.",
      "sentence_fr": "Le rayonnement du fond diffus cosmologique est le vestige du rayonnement thermique résiduel du Big Bang.",
      "sentence_en": "The cosmic microwave background radiation is the remnant thermal radiation from the Big Bang.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cosmic_background_radiation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资本充足率要求银行持有足够的资本来吸收潜在损失。",
      "sentence_pinyin": "Zīběn chōngzú lǜ yāoqiú yínháng chíyǒu zúgòu de zīběn lái xīshōu qiánzài sǔnshī.",
      "sentence_fr": "Les exigences de ratio de fonds propres obligent les banques à détenir suffisamment de capital pour absorber les pertes potentielles.",
      "sentence_en": "Capital adequacy requirements require banks to hold sufficient capital to absorb potential losses.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "capital_adequacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据丢失防护系统监控敏感信息的传输和存储行为。",
      "sentence_pinyin": "Shùjù diūshī fánghù xìtǒng jiānkòng mǐngǎn xìnxī de chuánshū hé cúnchǔ xíngwéi.",
      "sentence_fr": "Les systèmes de prévention des pertes de données surveillent les comportements de transmission et de stockage des informations sensibles.",
      "sentence_en": "Data loss prevention systems monitor the transmission and storage behavior of sensitive information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_loss_prevention",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心灵哲学探讨意识与物质世界之间的关系问题。",
      "sentence_pinyin": "Xīnlíng zhéxué tàntǎo yìshí yǔ wùzhì shìjiè zhījiān de guānxì wèntí.",
      "sentence_fr": "La philosophie de l'esprit explore les questions de la relation entre la conscience et le monde matériel.",
      "sentence_en": "Philosophy of mind explores questions about the relationship between consciousness and the material world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_mind",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经架构搜索自动化设计高效的深度学习网络结构。",
      "sentence_pinyin": "Shénjīng jiàgòu sōusuǒ zìdònghuà shèjì gāoxiào de shēndù xuéxí wǎngluò jiégòu.",
      "sentence_fr": "La recherche d'architecture neuronale automatise la conception de structures de réseaux d'apprentissage profond efficaces.",
      "sentence_en": "Neural architecture search automates the design of efficient deep learning network structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neural_architecture_search",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "红巨星是恒星演化后期核心收缩外层膨胀的阶段。",
      "sentence_pinyin": "Hóng jùxīng shì héngxīng yǎnhuà hòuqī héxīn shōusuō wàicéng péngzhàng de jiēduàn.",
      "sentence_fr": "Les géantes rouges sont un stade d'évolution stellaire tardif où le noyau se contracte et les couches externes se dilatent.",
      "sentence_en": "Red giants are a late stellar evolution stage where the core contracts and the outer layers expand.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stellar_evolution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流动性风险指金融机构无法满足短期支付义务的风险。",
      "sentence_pinyin": "Liúdòngxìng fēngxiǎn zhǐ jīnróng jīgòu wúfǎ mǎnzú duǎnqī zhīfù yìwù de fēngxiǎn.",
      "sentence_fr": "Le risque de liquidité désigne le risque qu'une institution financière ne puisse pas honorer ses obligations de paiement à court terme.",
      "sentence_en": "Liquidity risk refers to the risk that a financial institution cannot meet its short-term payment obligations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "liquidity_risk",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "特权访问管理限制和监控高权限账户的使用行为。",
      "sentence_pinyin": "Tèquán fǎngwèn guǎnlǐ xiànzhì hé jiānkòng gāo quánxiàn zhànghù de shǐyòng xíngwéi.",
      "sentence_fr": "La gestion des accès privilégiés limite et surveille les comportements d'utilisation des comptes à privilèges élevés.",
      "sentence_en": "Privileged access management restricts and monitors the usage behavior of high-privilege accounts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "privileged_access_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言哲学研究语言与思维及现实之间的复杂关系。",
      "sentence_pinyin": "Yǔyán zhéxué yánjiū yǔyán yǔ sīwéi jí xiànshí zhījiān de fùzá guānxì.",
      "sentence_fr": "La philosophie du langage étudie les relations complexes entre le langage, la pensée et la réalité.",
      "sentence_en": "Philosophy of language studies the complex relationships between language, thought, and reality.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_language",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可解释人工智能致力于使机器学习决策过程透明化。",
      "sentence_pinyin": "Kě jiěshì réngōng zhìnéng zhìlì yú shǐ jīqì xuéxí juécè guòchéng tòumínghuà.",
      "sentence_fr": "L'intelligence artificielle explicable vise à rendre les processus de décision de l'apprentissage automatique transparents.",
      "sentence_en": "Explainable artificial intelligence aims to make machine learning decision processes transparent.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "explainable_ai",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "白矮星是中低质量恒星演化终点的致密残骸天体。",
      "sentence_pinyin": "Bái ǎixīng shì zhōng dī zhìliàng héngxīng yǎnhuà zhōngdiǎn de zhìmì cánhái tiāntǐ.",
      "sentence_fr": "Les naines blanches sont des objets célestes denses, résidus de l'évolution finale des étoiles de masse faible à moyenne.",
      "sentence_en": "White dwarfs are dense celestial objects that are the end-point remnants of low to medium mass stellar evolution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "white_dwarf_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "信用评级机构评估债券发行人偿还债务的能力和意愿。",
      "sentence_pinyin": "Xìnyòng píngjí jīgòu pínggū zhàiquàn fāxíngrén chánghuán zhàiwù de nénglì hé yìyuàn.",
      "sentence_fr": "Les agences de notation évaluent la capacité et la volonté des émetteurs d'obligations à rembourser leurs dettes.",
      "sentence_en": "Credit rating agencies assess bond issuers' ability and willingness to repay their debts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "credit_rating_agencies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全意识培训帮助员工识别和应对社会工程攻击。",
      "sentence_pinyin": "Ānquán yìshí péixùn bāngzhù yuángōng shìbié hé yìngduì shèhuì gōngchéng gōngjī.",
      "sentence_fr": "La formation à la sensibilisation à la sécurité aide les employés à identifier et à répondre aux attaques d'ingénierie sociale.",
      "sentence_en": "Security awareness training helps employees identify and respond to social engineering attacks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_awareness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学哲学分析科学方法论和科学知识的本质特征。",
      "sentence_pinyin": "Kēxué zhéxué fēnxī kēxué fāngfǎlùn hé kēxué zhīshì de běnzhì tèzhēng.",
      "sentence_fr": "La philosophie des sciences analyse la méthodologie scientifique et les caractéristiques essentielles de la connaissance scientifique.",
      "sentence_en": "Philosophy of science analyzes scientific methodology and the essential characteristics of scientific knowledge.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "边缘计算将数据处理移至靠近数据源的位置以降低延迟。",
      "sentence_pinyin": "Biānyuán jìsuàn jiāng shùjù chǔlǐ yí zhì kàojìn shùjù yuán de wèizhì yǐ jiàngdī yánchí.",
      "sentence_fr": "L'informatique en périphérie déplace le traitement des données à proximité de la source des données pour réduire la latence.",
      "sentence_en": "Edge computing moves data processing closer to the data source to reduce latency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "edge_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "星系团是宇宙中由引力束缚的最大结构单元。",
      "sentence_pinyin": "Xīngxìtuán shì yǔzhòu zhōng yóu yǐnlì shùfù de zuìdà jiégòu dānyuán.",
      "sentence_fr": "Les amas de galaxies sont les plus grandes unités structurelles de l'univers liées par la gravité.",
      "sentence_en": "Galaxy clusters are the largest gravitationally bound structural units in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "galaxy_clusters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "压力测试模拟极端市场条件下金融机构的损失情况。",
      "sentence_pinyin": "Yālì cèshì mónǐ jíduān shìchǎng tiáojiàn xià jīnróng jīgòu de sǔnshī qíngkuàng.",
      "sentence_fr": "Les tests de résistance simulent les pertes des institutions financières dans des conditions de marché extrêmes.",
      "sentence_en": "Stress tests simulate financial institutions' losses under extreme market conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_stress_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "事件响应计划定义组织应对安全事件的标准流程。",
      "sentence_pinyin": "Shìjiàn xiǎngyìng jìhuà dìngyì zǔzhī yìngduì ānquán shìjiàn de biāozhǔn liúchéng.",
      "sentence_fr": "Les plans de réponse aux incidents définissent les procédures standard d'une organisation pour répondre aux incidents de sécurité.",
      "sentence_en": "Incident response plans define an organization's standard procedures for responding to security incidents.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "incident_response",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "道德相对主义认为伦理标准因文化和时代而异。",
      "sentence_pinyin": "Dàodé xiāngduì zhǔyì rènwéi lúnlǐ biāozhǔn yīn wénhuà hé shídài ér yì.",
      "sentence_fr": "Le relativisme moral soutient que les normes éthiques varient selon les cultures et les époques.",
      "sentence_en": "Moral relativism holds that ethical standards vary according to culture and era.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "moral_relativism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子计算利用量子叠加和纠缠状态实现并行计算优势。",
      "sentence_pinyin": "Liàngzǐ jìsuàn lìyòng liàngzǐ diéjiā hé jiūchán zhuàngtài shíxiàn bìngxíng jìsuàn yōushì.",
      "sentence_fr": "L'informatique quantique exploite les états de superposition et d'intrication quantiques pour obtenir des avantages de calcul parallèle.",
      "sentence_en": "Quantum computing leverages quantum superposition and entanglement states to achieve parallel computing advantages.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
