{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "球状星团是银河系中最古老的恒星群体之一。",
      "sentence_pinyin": "Qiúzhuàng xīngtuán shì yínhéxì zhōng zuì gǔlǎo de héngxīng qúntǐ zhī yī.",
      "sentence_fr": "Les amas globulaires sont parmi les plus anciennes populations d'étoiles de la galaxie.",
      "sentence_en": "Globular clusters are among the oldest stellar populations in the galaxy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "globular_clusters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "治理代币赋予持有者对协议发展方向的投票权。",
      "sentence_pinyin": "Zhìlǐ dàibì fùyǔ chíyǒuzhě duì xiéyì fāzhǎn fāngxiàng de tóupiào quán.",
      "sentence_fr": "Les jetons de gouvernance confèrent aux détenteurs un droit de vote sur l'orientation du développement du protocole.",
      "sentence_en": "Governance tokens grant holders voting rights on protocol development direction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "governance_tokens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "向量时钟算法追踪分布式系统中事件的因果关系。",
      "sentence_pinyin": "Xiàngliàng shízhōng suànfǎ zhuīzōng fēnbùshì xìtǒng zhōng shìjiàn de yīnguǒ guānxì.",
      "sentence_fr": "L'algorithme d'horloge vectorielle suit les relations causales entre les événements dans les systèmes distribués.",
      "sentence_en": "Vector clock algorithm tracks causal relationships between events in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vector_clocks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可通约性指不同科学范式之间缺乏共同的比较标准。",
      "sentence_pinyin": "Bùkě tōngyuēxìng zhǐ bùtóng kēxué fànshì zhījiān quēfá gòngtóng de bǐjiào biāozhǔn.",
      "sentence_fr": "L'incommensurabilité désigne l'absence de critères de comparaison communs entre différents paradigmes scientifiques.",
      "sentence_en": "Incommensurability refers to the lack of common comparison criteria between different scientific paradigms.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "incommensurability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据湖存储原始格式的大量结构化和非结构化数据。",
      "sentence_pinyin": "Shùjù hú cúnchǔ yuánshǐ géshì de dàliàng jiégòuhuà hé fēi jiégòuhuà shùjù.",
      "sentence_fr": "Les lacs de données stockent de grandes quantités de données structurées et non structurées dans leur format brut.",
      "sentence_en": "Data lakes store large amounts of structured and unstructured data in raw format.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_lakes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "疏散星团是银河系盘中年轻恒星的松散聚集。",
      "sentence_pinyin": "Shūsàn xīngtuán shì yínhéxì pán zhōng niánqīng héngxīng de sōngsǎn jùjí.",
      "sentence_fr": "Les amas ouverts sont des groupements lâches de jeunes étoiles dans le disque galactique.",
      "sentence_en": "Open clusters are loose groupings of young stars in the galactic disk.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "open_clusters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流动性池为去中心化交易所提供自动化做市功能。",
      "sentence_pinyin": "Liúdòngxìng chí wèi qù zhōngxīnhuà jiāoyìsuǒ tígōng zìdònghuà zuòshì gōngnéng.",
      "sentence_fr": "Les pools de liquidité fournissent des fonctions de tenue de marché automatisée pour les échanges décentralisés.",
      "sentence_en": "Liquidity pools provide automated market-making functionality for decentralized exchanges.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "liquidity_pools",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "领导者选举算法在分布式系统中选择协调节点。",
      "sentence_pinyin": "Lǐngdǎozhě xuǎnjǔ suànfǎ zài fēnbùshì xìtǒng zhōng xuǎnzé xiétiáo jiédiǎn.",
      "sentence_fr": "Les algorithmes d'élection de leader sélectionnent un nœud coordinateur dans les systèmes distribués.",
      "sentence_en": "Leader election algorithms select a coordinating node in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "leader_election",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "证据主义认为信念的合理性取决于支持证据的强度。",
      "sentence_pinyin": "Zhèngjù zhǔyì rènwéi xìnniàn de hélǐxìng qǔjué yú zhīchí zhèngjù de qiángdù.",
      "sentence_fr": "L'évidentialisme soutient que la rationalité des croyances dépend de la force des preuves qui les soutiennent.",
      "sentence_en": "Evidentialism holds that the rationality of beliefs depends on the strength of supporting evidence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evidentialism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据仓库整合来自多个源系统的数据用于分析报告。",
      "sentence_pinyin": "Shùjù cāngkù zhěnghé láizì duō gè yuán xìtǒng de shùjù yòng yú fēnxī bàogào.",
      "sentence_fr": "Les entrepôts de données intègrent des données provenant de plusieurs systèmes sources pour l'analyse et le reporting.",
      "sentence_en": "Data warehouses integrate data from multiple source systems for analysis and reporting.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_warehouses",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "星系旋臂是恒星形成活跃的螺旋结构区域。",
      "sentence_pinyin": "Xīngxì xuánbì shì héngxīng xíngchéng huóyuè de luóxuán jiégòu qūyù.",
      "sentence_fr": "Les bras spiraux des galaxies sont des régions de structure en spirale à formation stellaire active.",
      "sentence_en": "Galactic spiral arms are spiral structure regions with active star formation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "galactic_spiral_arms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "预言机网络为智能合约提供可靠的链下数据源。",
      "sentence_pinyin": "Yùyánjī wǎngluò wèi zhìnéng héyuē tígōng kěkào de liàn xià shùjù yuán.",
      "sentence_fr": "Les réseaux d'oracles fournissent des sources de données hors chaîne fiables pour les contrats intelligents.",
      "sentence_en": "Oracle networks provide reliable off-chain data sources for smart contracts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "oracle_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仲裁日志确保分布式事务在故障后可以正确恢复。",
      "sentence_pinyin": "Zhòngcái rìzhì quèbǎo fēnbùshì shìwù zài gùzhàng hòu kěyǐ zhèngquè huīfù.",
      "sentence_fr": "Les journaux d'arbitrage garantissent que les transactions distribuées peuvent être correctement récupérées après une défaillance.",
      "sentence_en": "Arbitration logs ensure distributed transactions can be correctly recovered after failures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "arbitration_logs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可靠论认为知识是由可靠认知过程产生的真信念。",
      "sentence_pinyin": "Kěkàolùn rènwéi zhīshì shì yóu kěkào rènzhī guòchéng chǎnshēng de zhēn xìnniàn.",
      "sentence_fr": "Le fiabilisme soutient que la connaissance est une croyance vraie produite par des processus cognitifs fiables.",
      "sentence_en": "Reliabilism holds that knowledge is true belief produced by reliable cognitive processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reliabilism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据网格架构将数据产品所有权分配给领域团队。",
      "sentence_pinyin": "Shùjù wǎnggé jiàgòu jiāng shùjù chǎnpǐn suǒyǒuquán fēnpèi gěi lǐngyù tuánduì.",
      "sentence_fr": "L'architecture de data mesh attribue la propriété des produits de données aux équipes de domaine.",
      "sentence_en": "Data mesh architecture assigns data product ownership to domain teams.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_mesh",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "活动星系核由超大质量黑洞吸积物质释放巨大能量。",
      "sentence_pinyin": "Huódòng xīngxì hé yóu chāodà zhìliàng hēidòng xījī wùzhì shìfàng jùdà néngliàng.",
      "sentence_fr": "Les noyaux actifs de galaxies libèrent d'énormes quantités d'énergie par l'accrétion de matière par des trous noirs supermassifs.",
      "sentence_en": "Active galactic nuclei release enormous energy through matter accretion by supermassive black holes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "active_galactic_nuclei",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "闪电网络通过支付通道实现比特币的即时微支付。",
      "sentence_pinyin": "Shǎndiàn wǎngluò tōngguò zhīfù tōngdào shíxiàn bǐtèbì de jíshí wēi zhīfù.",
      "sentence_fr": "Le réseau Lightning permet des micropaiements Bitcoin instantanés via des canaux de paiement.",
      "sentence_en": "Lightning Network enables instant Bitcoin micropayments through payment channels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "lightning_network",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "两阶段提交协议协调分布式事务的原子性提交。",
      "sentence_pinyin": "Liǎng jiēduàn tíjiāo xiéyì xiétiáo fēnbùshì shìwù de yuánzǐxìng tíjiāo.",
      "sentence_fr": "Le protocole de validation en deux phases coordonne la validation atomique des transactions distribuées.",
      "sentence_en": "Two-phase commit protocol coordinates atomic commitment of distributed transactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "two_phase_commit",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "怀疑论质疑人类是否能够获得关于世界的确定知识。",
      "sentence_pinyin": "Huáiyílùn zhìyí rénlèi shìfǒu nénggòu huòdé guānyú shìjiè de quèdìng zhīshì.",
      "sentence_fr": "Le scepticisme remet en question si les humains peuvent obtenir une connaissance certaine du monde.",
      "sentence_en": "Skepticism questions whether humans can obtain certain knowledge about the world.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophical_skepticism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据血缘追踪数据从源到目标的完整变换路径。",
      "sentence_pinyin": "Shùjù xuèyuán zhuīzōng shùjù cóng yuán dào mùbiāo de wánzhěng biànhuàn lùjìng.",
      "sentence_fr": "La lignée des données retrace le chemin complet de transformation des données de la source à la destination.",
      "sentence_en": "Data lineage tracks the complete transformation path of data from source to target.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_lineage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
