{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "对称性破缺是粒子物理标准模型的核心机制之一。",
      "sentence_pinyin": "Duìchènxìng pòquē shì lìzǐ wùlǐ biāozhǔn móxíng de héxīn jīzhì zhī yī.",
      "sentence_fr": "La brisure de symétrie est l'un des mécanismes centraux du modèle standard de la physique des particules.",
      "sentence_en": "Symmetry breaking is one of the core mechanisms of the particle physics standard model.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "symmetry_breaking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "交互式Oracle证明扩展了传统交互式证明的表达能力。",
      "sentence_pinyin": "Jiāohùshì Oracle zhèngmíng kuòzhǎn le chuántǒng jiāohùshì zhèngmíng de biǎodá nénglì.",
      "sentence_fr": "Les preuves interactives Oracle étendent le pouvoir d'expression des preuves interactives traditionnelles.",
      "sentence_en": "Interactive Oracle proofs extend the expressive power of traditional interactive proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "interactive_oracle_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型层级允许类型作为其他类型的参数避免罗素悖论。",
      "sentence_pinyin": "Lèixíng céngjí yǔnxǔ lèixíng zuòwéi qítā lèixíng de cānshù bìmiǎn Luósù bèilùn.",
      "sentence_fr": "Les hiérarchies de types permettent aux types d'être des paramètres d'autres types, évitant le paradoxe de Russell.",
      "sentence_en": "Type hierarchies allow types to be parameters of other types, avoiding Russell's paradox.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_hierarchies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模形式是数论和代数几何中具有特殊变换性质的复解析函数。",
      "sentence_pinyin": "Mó xíngshì shì shùlùn hé dàishù jǐhé zhōng jùyǒu tèshū biànhuàn xìngzhì de fù jiěxī hánshù.",
      "sentence_fr": "Les formes modulaires sont des fonctions analytiques complexes avec des propriétés de transformation spéciales en théorie des nombres et géométrie algébrique.",
      "sentence_en": "Modular forms are complex analytic functions with special transformation properties in number theory and algebraic geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "modular_forms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子存储器保存量子态以支持量子网络通信协议。",
      "sentence_pinyin": "Liàngzǐ cúnchǔqì bǎocún liàngzǐ tài yǐ zhīchí liàngzǐ wǎngluò tōngxìn xiéyì.",
      "sentence_fr": "Les mémoires quantiques préservent les états quantiques pour prendre en charge les protocoles de communication des réseaux quantiques.",
      "sentence_en": "Quantum memories preserve quantum states to support quantum network communication protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_memories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "概率可检验证明允许验证者仅读取证明的少量随机位。",
      "sentence_pinyin": "Gàilǜ kě jiǎnyàn zhèngmíng yǔnxǔ yànzhèngzhě jǐn dúqǔ zhèngmíng de shǎoliàng suíjī wèi.",
      "sentence_fr": "Les preuves vérifiables probabilistiquement permettent aux vérificateurs de ne lire qu'un petit nombre de bits aléatoires de la preuve.",
      "sentence_en": "Probabilistically checkable proofs allow verifiers to read only a small number of random bits of the proof.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "pcp_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型构造器级别的约束允许表达复杂的类型关系。",
      "sentence_pinyin": "Lèixíng gòuzàoqì jíbié de yuēshù yǔnxǔ biǎodá fùzá de lèixíng guānxì.",
      "sentence_fr": "Les contraintes au niveau des constructeurs de types permettent d'exprimer des relations de types complexes.",
      "sentence_en": "Type constructor-level constraints allow expressing complex type relationships.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_constructor_constraints",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "椭圆曲线为数论和密码学提供了丰富的代数结构。",
      "sentence_pinyin": "Tuǒyuán qūxiàn wèi shùlùn hé mìmǎxué tígōng le fēngfù de dàishù jiégòu.",
      "sentence_fr": "Les courbes elliptiques fournissent de riches structures algébriques pour la théorie des nombres et la cryptographie.",
      "sentence_en": "Elliptic curves provide rich algebraic structures for number theory and cryptography.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "elliptic_curves",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子互联网将量子计算机通过量子信道连接成网络。",
      "sentence_pinyin": "Liàngzǐ hùliánwǎng jiāng liàngzǐ jìsuànjī tōngguò liàngzǐ xìndào liánjiē chéng wǎngluò.",
      "sentence_fr": "L'internet quantique connecte les ordinateurs quantiques en réseau via des canaux quantiques.",
      "sentence_en": "The quantum internet connects quantum computers into networks through quantum channels.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_internet",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "算术化将计算问题转换为代数约束系统以构建证明。",
      "sentence_pinyin": "Suànshùhuà jiāng jìsuàn wèntí zhuǎnhuàn wéi dàishù yuēshù xìtǒng yǐ gòujiàn zhèngmíng.",
      "sentence_fr": "L'arithmétisation convertit les problèmes de calcul en systèmes de contraintes algébriques pour construire des preuves.",
      "sentence_en": "Arithmetization converts computational problems into algebraic constraint systems for constructing proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "arithmetization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多态递归允许递归函数在不同类型参数下调用自身。",
      "sentence_pinyin": "Duōtài dìguī yǔnxǔ dìguī hánshù zài bùtóng lèixíng cānshù xià diàoyòng zìshēn.",
      "sentence_fr": "La récursion polymorphe permet aux fonctions récursives de s'appeler elles-mêmes avec différents paramètres de type.",
      "sentence_en": "Polymorphic recursion allows recursive functions to call themselves with different type parameters.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "polymorphic_recursion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "朗兰兹纲领是连接数论和表示论的宏大数学统一计划。",
      "sentence_pinyin": "Lǎnglánzī gānglǐng shì liánjiē shùlùn hé biǎoshìlùn de hóngdà shùxué tǒngyī jìhuà.",
      "sentence_fr": "Le programme de Langlands est un grand projet d'unification mathématique reliant la théorie des nombres et la théorie des représentations.",
      "sentence_en": "The Langlands program is a grand mathematical unification plan connecting number theory and representation theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "langlands_program",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子保密通信利用量子力学原理防止信息被窃听。",
      "sentence_pinyin": "Liàngzǐ bǎomì tōngxìn lìyòng liàngzǐ lìxué yuánlǐ fángzhǐ xìnxī bèi qiètīng.",
      "sentence_fr": "La communication quantique sécurisée utilise les principes de la mécanique quantique pour empêcher l'écoute clandestine.",
      "sentence_en": "Quantum secure communication uses quantum mechanics principles to prevent information eavesdropping.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_secure_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "低次多项式检验是概率可检验证明的核心技术组件。",
      "sentence_pinyin": "Dīcì duōxiàngshì jiǎnyàn shì gàilǜ kě jiǎnyàn zhèngmíng de héxīn jìshù zǔjiàn.",
      "sentence_fr": "Les tests de polynômes de bas degré sont des composants techniques essentiels des preuves vérifiables probabilistiquement.",
      "sentence_en": "Low-degree polynomial testing is a core technical component of probabilistically checkable proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "low_degree_testing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型族是在类型层面定义的可计算函数。",
      "sentence_pinyin": "Lèixíng zú shì zài lèixíng céngmiàn dìngyì de kě jìsuàn hánshù.",
      "sentence_fr": "Les familles de types sont des fonctions calculables définies au niveau des types.",
      "sentence_en": "Type families are computable functions defined at the type level.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_families",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "伽罗瓦理论通过群论研究代数方程的可解性。",
      "sentence_pinyin": "Jiāluówǎ lǐlùn tōngguò qúnlùn yánjiū dàishù fāngchéng de kě jiěxìng.",
      "sentence_fr": "La théorie de Galois étudie la résolubilité des équations algébriques par la théorie des groupes.",
      "sentence_en": "Galois theory studies the solvability of algebraic equations through group theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "galois_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光量子比特是光子编码量子信息的量子计算实现方式。",
      "sentence_pinyin": "Guāng liàngzǐ bǐtè shì guāngzǐ biānmǎ liàngzǐ xìnxī de liàngzǐ jìsuàn shíxiàn fāngshì.",
      "sentence_fr": "Les qubits photoniques sont une méthode d'implémentation du calcul quantique utilisant des photons pour encoder l'information quantique.",
      "sentence_en": "Photonic qubits are a quantum computing implementation method using photons to encode quantum information.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "photonic_qubits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "折叠方案允许增量验证计算的正确性。",
      "sentence_pinyin": "Zhédié fāng'àn yǔnxǔ zēngliàng yànzhèng jìsuàn de zhèngquèxìng.",
      "sentence_fr": "Les schémas de pliage permettent de vérifier de manière incrémentale l'exactitude des calculs.",
      "sentence_en": "Folding schemes allow incremental verification of computation correctness.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "folding_schemes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型同义词为复杂类型提供更简洁的别名表示。",
      "sentence_pinyin": "Lèixíng tóngyìcí wèi fùzá lèixíng tígōng gèng jiǎnjié de biémíng biǎoshì.",
      "sentence_fr": "Les synonymes de types fournissent des représentations d'alias plus concises pour les types complexes.",
      "sentence_en": "Type synonyms provide more concise alias representations for complex types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_synonyms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同调镜像对称连接了卡拉比-丘流形的两种不同几何。",
      "sentence_pinyin": "Tóngyú jìngxiàng duìchèn liánjiē le Kǎlābǐ-Qiū liúxíng de liǎng zhǒng bùtóng jǐhé.",
      "sentence_fr": "La symétrie miroir homologique relie deux géométries différentes des variétés de Calabi-Yau.",
      "sentence_en": "Homological mirror symmetry connects two different geometries of Calabi-Yau manifolds.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "mirror_symmetry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
