{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能监控摄像头可以识别陌生人并自动发送警报到手机上。",
      "sentence_pinyin": "Zhège zhìnéng jiānkòng shèxiàngtóu kěyǐ shìbié mòshēngrén bìng zìdòng fāsòng jǐngbào dào shǒujī shàng.",
      "sentence_fr": "Cette caméra de surveillance intelligente peut identifier les étrangers et envoyer automatiquement des alertes sur votre téléphone.",
      "sentence_en": "This smart surveillance camera can identify strangers and automatically send alerts to your phone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "越剧是浙江的地方戏曲,以优美的唱腔和细腻的表演著称。",
      "sentence_pinyin": "Yuèjù shì Zhèjiāng de dìfāng xìqǔ, yǐ yōuměi de chàngqiāng hé xìnì de biǎoyǎn zhùchēng.",
      "sentence_fr": "L'opéra Yue est un opéra régional du Zhejiang, réputé pour ses mélodies gracieuses et ses performances délicates.",
      "sentence_en": "Yue opera is a regional opera of Zhejiang, renowned for its graceful singing and delicate performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yue_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市污水处理厂采用先进技术将污水净化后再排放到河流中。",
      "sentence_pinyin": "Chéngshì wūshuǐ chǔlǐchǎng cǎiyòng xiānjìn jìshù jiāng wūshuǐ jìnghuà hòu zài páifàng dào héliú zhōng.",
      "sentence_fr": "Les stations d'épuration urbaines utilisent des technologies avancées pour purifier les eaux usées avant de les rejeter dans les rivières.",
      "sentence_en": "Urban sewage treatment plants use advanced technology to purify wastewater before discharging it into rivers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wastewater_treatment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能垃圾桶可以自动感应开盖,还能压缩垃圾增加容量。",
      "sentence_pinyin": "Zhìnéng lājītǒng kěyǐ zìdòng gǎnyìng kāi gài, hái néng yāsuō lājī zēngjiā róngliàng.",
      "sentence_fr": "La poubelle intelligente peut s'ouvrir automatiquement par capteur et compresser les déchets pour augmenter sa capacité.",
      "sentence_en": "The smart trash can automatically opens its lid by sensor and can compress garbage to increase capacity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_trash_cans",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的年画以鲜艳的色彩和吉祥的图案表达人们对美好生活的向往。",
      "sentence_pinyin": "Zhōngguó chuántǒng de niánhuà yǐ xiānyàn de sècǎi hé jíxiáng de tú'àn biǎodá rénmen duì měihǎo shēnghuó de xiàngwǎng.",
      "sentence_fr": "Les peintures traditionnelles chinoises du Nouvel An expriment l'aspiration des gens à une belle vie à travers des couleurs vives et des motifs de bon augure.",
      "sentence_en": "Traditional Chinese New Year paintings express people's longing for a good life through vivid colors and auspicious patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_year_paintings",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能花盆可以自动浇水和施肥,即使外出旅行也不用担心植物。",
      "sentence_pinyin": "Zhìnéng huāpén kěyǐ zìdòng jiāoshuǐ hé shīféi, jíshǐ wàichū lǚxíng yě bùyòng dānxīn zhíwù.",
      "sentence_fr": "Le pot de fleurs intelligent peut arroser et fertiliser automatiquement, vous n'avez pas à vous soucier des plantes même en voyage.",
      "sentence_en": "The smart flower pot can automatically water and fertilize, so you don't have to worry about plants even when traveling.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_planters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "粤剧是广东的传统戏曲,唱腔高亢激昂,极具岭南特色。",
      "sentence_pinyin": "Yuèjù shì Guǎngdōng de chuántǒng xìqǔ, chàngqiāng gāokàng jī'áng, jí jù Lǐngnán tèsè.",
      "sentence_fr": "L'opéra cantonais est un opéra traditionnel du Guangdong, avec un chant puissant et passionné, très caractéristique de la région de Lingnan.",
      "sentence_en": "Cantonese opera is a traditional opera of Guangdong, with powerful and passionate singing, very characteristic of the Lingnan region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cantonese_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区为独居老人安装了紧急呼叫按钮,方便他们寻求帮助。",
      "sentence_pinyin": "Zhège shèqū wèi dújū lǎorén ānzhuāng le jǐnjí hūjiào ànniǔ, fāngbiàn tāmen xúnqiú bāngzhù.",
      "sentence_fr": "Cette communauté a installé des boutons d'appel d'urgence pour les personnes âgées vivant seules, leur facilitant la demande d'aide.",
      "sentence_en": "This community has installed emergency call buttons for elderly people living alone, making it easy for them to seek help.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_emergency_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能窗户可以根据阳光强度自动调节透光度,节省空调能耗。",
      "sentence_pinyin": "Zhìnéng chuānghù kěyǐ gēnjù yángguāng qiángdù zìdòng tiáojié tòuguāngdù, jiéshěng kōngtiáo néngháo.",
      "sentence_fr": "Les fenêtres intelligentes peuvent ajuster automatiquement la transparence selon l'intensité du soleil, économisant la consommation de climatisation.",
      "sentence_en": "Smart windows can automatically adjust transparency based on sunlight intensity, saving air conditioning energy consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_windows",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的铜雕工艺可以追溯到数千年前,技艺精湛,造型生动。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tóngdiāo gōngyì kěyǐ zhuīsù dào shù qiān nián qián, jìyì jīngzhàn, zàoxíng shēngdòng.",
      "sentence_fr": "L'artisanat traditionnel chinois de la sculpture sur bronze remonte à des milliers d'années, avec une technique exquise et des formes vivantes.",
      "sentence_en": "Traditional Chinese bronze carving craftsmanship dates back thousands of years, with exquisite skills and vivid shapes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bronze_sculpture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能鞋柜具有杀菌除臭功能,可以保持鞋子干燥清洁。",
      "sentence_pinyin": "Zhìnéng xiéguì jùyǒu shājūn chúchòu gōngnéng, kěyǐ bǎochí xiézi gānzào qīngjié.",
      "sentence_fr": "L'armoire à chaussures intelligente possède des fonctions de stérilisation et de désodorisation, gardant les chaussures sèches et propres.",
      "sentence_en": "The smart shoe cabinet has sterilization and deodorization functions, keeping shoes dry and clean.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_shoe_cabinets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黄梅戏是安徽的地方戏曲,以其清新质朴的风格深受观众喜爱。",
      "sentence_pinyin": "Huángméixì shì Ānhuī de dìfāng xìqǔ, yǐ qí qīngxīn zhìpǔ de fēnggé shēn shòu guānzhòng xǐ'ài.",
      "sentence_fr": "L'opéra Huangmei est un opéra régional de l'Anhui, très apprécié du public pour son style frais et simple.",
      "sentence_en": "Huangmei opera is a regional opera of Anhui, deeply loved by audiences for its fresh and simple style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huangmei_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的共享汽车服务非常方便,可以随时租用和归还车辆。",
      "sentence_pinyin": "Zhège chéngshì de gòngxiǎng qìchē fúwù fēicháng fāngbiàn, kěyǐ suíshí zūyòng hé guīhuán chēliàng.",
      "sentence_fr": "Le service d'autopartage de cette ville est très pratique, permettant de louer et de rendre des véhicules à tout moment.",
      "sentence_en": "This city's car-sharing service is very convenient, allowing vehicles to be rented and returned at any time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "car_sharing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电视可以通过语音控制换台和搜索节目,使用非常方便。",
      "sentence_pinyin": "Zhìnéng diànshì kěyǐ tōngguò yǔyīn kòngzhì huàn tái hé sōusuǒ jiémù, shǐyòng fēicháng fāngbiàn.",
      "sentence_fr": "La télévision intelligente peut changer de chaîne et rechercher des programmes par commande vocale, très pratique à utiliser.",
      "sentence_en": "The smart TV can change channels and search programs through voice control, very convenient to use.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_tvs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的石雕艺术以寿山石雕和青田石雕最为著名。",
      "sentence_pinyin": "Zhōngguó chuántǒng de shídiāo yìshù yǐ Shòushān shídiāo hé Qīngtián shídiāo zuìwéi zhùmíng.",
      "sentence_fr": "L'art traditionnel chinois de la sculpture sur pierre est le plus célèbre pour les sculptures de Shoushan et de Qingtian.",
      "sentence_en": "Traditional Chinese stone carving art is most famous for Shoushan stone carving and Qingtian stone carving.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stone_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能冰箱可以记录食材的保质期,并在即将过期时提醒用户。",
      "sentence_pinyin": "Zhìnéng bīngxiāng kěyǐ jìlù shícái de bǎozhìqī, bìng zài jíjiāng guòqī shí tíxǐng yònghù.",
      "sentence_fr": "Le réfrigérateur intelligent peut enregistrer les dates de péremption des aliments et avertir l'utilisateur quand ils sont sur le point d'expirer.",
      "sentence_en": "The smart refrigerator can record food expiration dates and remind users when items are about to expire.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_refrigerators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "评剧是中国北方的地方戏曲,语言通俗,贴近百姓生活。",
      "sentence_pinyin": "Píngjù shì Zhōngguó běifāng de dìfāng xìqǔ, yǔyán tōngsú, tiējìn bǎixìng shēnghuó.",
      "sentence_fr": "L'opéra Ping est un opéra régional du nord de la Chine, avec un langage populaire proche de la vie quotidienne.",
      "sentence_en": "Ping opera is a regional opera of northern China, with colloquial language close to ordinary people's lives.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ping_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的创业扶持政策帮助了许多年轻人实现了自己的创业梦想。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de chuàngyè fúchí zhèngcè bāngzhù le xǔduō niánqīngrén shíxiàn le zìjǐ de chuàngyè mèngxiǎng.",
      "sentence_fr": "Les politiques de soutien à l'entrepreneuriat lancées par le gouvernement ont aidé de nombreux jeunes à réaliser leurs rêves d'entreprise.",
      "sentence_en": "The government's entrepreneurship support policies have helped many young people realize their entrepreneurial dreams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entrepreneurship_support",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能行李箱可以自动跟随主人行走,还能通过手机定位防止丢失。",
      "sentence_pinyin": "Zhìnéng xínglixiāng kěyǐ zìdòng gēnsuí zhǔrén xíngzǒu, hái néng tōngguò shǒujī dìngwèi fángzhǐ diūshī.",
      "sentence_fr": "La valise intelligente peut suivre automatiquement son propriétaire et être localisée par téléphone pour éviter de la perdre.",
      "sentence_en": "The smart suitcase can automatically follow its owner and be located via phone to prevent loss.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_luggage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
