{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "社区心理学研究社会系统如何影响个人和群体的心理健康。",
      "sentence_pinyin": "Shèqū xīnlǐxué yánjiū shèhuì xìtǒng rúhé yǐngxiǎng gèrén hé qúntǐ de xīnlǐ jiànkāng.",
      "sentence_fr": "La psychologie communautaire étudie comment les systèmes sociaux affectent la santé mentale des individus et des groupes.",
      "sentence_en": "Community psychology studies how social systems affect the mental health of individuals and groups.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "community_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光子学研究光子的产生、操控和探测及其在通信中的应用。",
      "sentence_pinyin": "Guāngzǐxué yánjiū guāngzǐ de chǎnshēng, cāokòng hé tàncè jí qí zài tōngxìn zhōng de yìngyòng.",
      "sentence_fr": "La photonique étudie la génération, la manipulation et la détection des photons et leurs applications dans les communications.",
      "sentence_en": "Photonics studies the generation, manipulation, and detection of photons and their applications in communications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "photonics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "营运资本管理确保企业有足够的流动性来支付短期债务。",
      "sentence_pinyin": "Yíngyùn zīběn guǎnlǐ quèbǎo qǐyè yǒu zúgòu de liúdòngxìng lái zhīfù duǎnqī zhàiwù.",
      "sentence_fr": "La gestion du fonds de roulement garantit que les entreprises disposent de liquidités suffisantes pour payer leurs dettes à court terme.",
      "sentence_en": "Working capital management ensures businesses have sufficient liquidity to pay short-term debts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "working_capital",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络安全事件响应涉及检测、遏制和恢复被攻击的系统。",
      "sentence_pinyin": "Wǎngluò ānquán shìjiàn xiǎngyìng shèjí jiǎncè, èzhì hé huīfù bèi gōngjī de xìtǒng.",
      "sentence_fr": "La réponse aux incidents de cybersécurité implique la détection, le confinement et la récupération des systèmes attaqués.",
      "sentence_en": "Cybersecurity incident response involves detecting, containing, and recovering compromised systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "incident_response",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学校心理学家支持学生的学业成就和社会情感发展。",
      "sentence_pinyin": "Xuéxiào xīnlǐ xuéjiā zhīchí xuéshēng de xuéyè chéngjiù hé shèhuì qínggǎn fāzhǎn.",
      "sentence_fr": "Les psychologues scolaires soutiennent la réussite scolaire des élèves et leur développement socio-émotionnel.",
      "sentence_en": "School psychologists support students' academic achievement and social-emotional development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "school_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "磁学研究磁性材料的性质和磁场与物质的相互作用。",
      "sentence_pinyin": "Cíxué yánjiū cíxìng cáiliào de xìngzhì hé cíchǎng yǔ wùzhì de xiānghù zuòyòng.",
      "sentence_fr": "Le magnétisme étudie les propriétés des matériaux magnétiques et les interactions des champs magnétiques avec la matière.",
      "sentence_en": "Magnetism studies the properties of magnetic materials and the interactions of magnetic fields with matter.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "magnetism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "成本会计追踪和分析产品和服务的生产成本构成。",
      "sentence_pinyin": "Chéngběn kuàijì zhuīzōng hé fēnxī chǎnpǐn hé fúwù de shēngchǎn chéngběn gòuchéng.",
      "sentence_fr": "La comptabilité des coûts suit et analyse la composition des coûts de production des produits et services.",
      "sentence_en": "Cost accounting tracks and analyzes the cost composition of producing products and services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cost_accounting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全意识培训教育员工识别和应对社会工程攻击。",
      "sentence_pinyin": "Ānquán yìshí péixùn jiàoyù yuángōng shíbié hé yìngduì shèhuì gōngchéng gōngjī.",
      "sentence_fr": "La formation à la sensibilisation à la sécurité éduque les employés à reconnaître et à répondre aux attaques d'ingénierie sociale.",
      "sentence_en": "Security awareness training educates employees to recognize and respond to social engineering attacks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_awareness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "工程心理学设计人机界面以优化操作员的性能和安全。",
      "sentence_pinyin": "Gōngchéng xīnlǐxué shèjì rén jī jièmiàn yǐ yōuhuà cāozuò yuán de xìngnéng hé ānquán.",
      "sentence_fr": "La psychologie de l'ingénierie conçoit des interfaces homme-machine pour optimiser la performance et la sécurité des opérateurs.",
      "sentence_en": "Engineering psychology designs human-machine interfaces to optimize operator performance and safety.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "engineering_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳米技术在原子和分子尺度上操纵物质以创造新材料。",
      "sentence_pinyin": "Nàmǐ jìshù zài yuánzǐ hé fēnzǐ chǐdù shàng cāozòng wùzhì yǐ chuàngzào xīn cáiliào.",
      "sentence_fr": "La nanotechnologie manipule la matière à l'échelle atomique et moléculaire pour créer de nouveaux matériaux.",
      "sentence_en": "Nanotechnology manipulates matter at the atomic and molecular scale to create new materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nanotechnology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "审计程序独立验证财务报表的准确性和合规性。",
      "sentence_pinyin": "Shěnjì chéngxù dúlì yànzhèng cáiwù bàobiǎo de zhǔnquèxìng hé héguīxìng.",
      "sentence_fr": "Les procédures d'audit vérifient indépendamment l'exactitude et la conformité des états financiers.",
      "sentence_en": "Audit procedures independently verify the accuracy and compliance of financial statements.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "audit_procedures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字取证调查收集和分析电子证据以支持法律诉讼。",
      "sentence_pinyin": "Shùzì qǔzhèng diàochá shōují hé fēnxī diànzǐ zhèngjù yǐ zhīchí fǎlǜ sùsòng.",
      "sentence_fr": "L'investigation en criminalistique numérique collecte et analyse les preuves électroniques pour soutenir les procédures judiciaires.",
      "sentence_en": "Digital forensics investigation collects and analyzes electronic evidence to support legal proceedings.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_forensics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "创伤心理学研究心理创伤的影响和创伤后恢复过程。",
      "sentence_pinyin": "Chuāngshāng xīnlǐxué yánjiū xīnlǐ chuāngshāng de yǐngxiǎng hé chuāngshāng hòu huīfù guòchéng.",
      "sentence_fr": "La psychologie du traumatisme étudie l'impact du traumatisme psychologique et le processus de récupération post-traumatique.",
      "sentence_en": "Trauma psychology studies the impact of psychological trauma and the post-traumatic recovery process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "trauma_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子计算利用量子比特的叠加和纠缠来执行复杂计算。",
      "sentence_pinyin": "Liàngzǐ jìsuàn lìyòng liàngzǐ bǐtè de diéjiā hé jiūchán lái zhíxíng fùzá jìsuàn.",
      "sentence_fr": "L'informatique quantique utilise la superposition et l'intrication des qubits pour effectuer des calculs complexes.",
      "sentence_en": "Quantum computing uses qubit superposition and entanglement to perform complex calculations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "税务筹划帮助企业和个人合法地最小化税务负担。",
      "sentence_pinyin": "Shuìwù chóuhuà bāngzhù qǐyè hé gèrén héfǎ de zuìxiǎohuà shuìwù fùdān.",
      "sentence_fr": "La planification fiscale aide les entreprises et les particuliers à minimiser légalement leur charge fiscale.",
      "sentence_en": "Tax planning helps businesses and individuals legally minimize their tax burden.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tax_planning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "物联网安全保护联网设备和传感器免受网络攻击。",
      "sentence_pinyin": "Wùliánwǎng ānquán bǎohù liánwǎng shèbèi hé chuángǎnqì miǎn shòu wǎngluò gōngjī.",
      "sentence_fr": "La sécurité de l'Internet des objets protège les appareils connectés et les capteurs contre les cyberattaques.",
      "sentence_en": "Internet of Things security protects connected devices and sensors from cyber attacks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "iot_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "成瘾心理学研究物质依赖和行为成瘾的心理机制。",
      "sentence_pinyin": "Chéngyǐn xīnlǐxué yánjiū wùzhì yīlài hé xíngwéi chéngyǐn de xīnlǐ jīzhì.",
      "sentence_fr": "La psychologie de l'addiction étudie les mécanismes psychologiques de la dépendance aux substances et de l'addiction comportementale.",
      "sentence_en": "Addiction psychology studies the psychological mechanisms of substance dependence and behavioral addiction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "addiction_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表面物理学研究材料表面的结构、电子态和化学反应。",
      "sentence_pinyin": "Biǎomiàn wùlǐxué yánjiū cáiliào biǎomiàn de jiégòu, diànzǐ tài hé huàxué fǎnyìng.",
      "sentence_fr": "La physique des surfaces étudie la structure, les états électroniques et les réactions chimiques des surfaces des matériaux.",
      "sentence_en": "Surface physics studies the structure, electronic states, and chemical reactions of material surfaces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "surface_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内部控制系统防止欺诈并确保财务报告的可靠性。",
      "sentence_pinyin": "Nèibù kòngzhì xìtǒng fángzhǐ qīzhà bìng quèbǎo cáiwù bàogào de kěkàoxìng.",
      "sentence_fr": "Les systèmes de contrôle interne préviennent la fraude et garantissent la fiabilité des rapports financiers.",
      "sentence_en": "Internal control systems prevent fraud and ensure the reliability of financial reporting.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "internal_controls",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "威胁建模识别系统中的潜在安全风险和攻击路径。",
      "sentence_pinyin": "Wēixié jiànmó shíbié xìtǒng zhōng de qiánzài ānquán fēngxiǎn hé gōngjī lùjìng.",
      "sentence_fr": "La modélisation des menaces identifie les risques de sécurité potentiels et les chemins d'attaque dans les systèmes.",
      "sentence_en": "Threat modeling identifies potential security risks and attack paths in systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "threat_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
