{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能按摩枕可以针对颈部和肩部进行深层揉捏按摩。",
      "sentence_pinyin": "Zhège zhìnéng ànmó zhěn kěyǐ zhēnduì jǐngbù hé jiānbù jìnxíng shēncéng róuniē ànmó.",
      "sentence_fr": "Cet oreiller de massage intelligent peut effectuer un massage pétrissage profond pour le cou et les épaules.",
      "sentence_en": "This smart massage pillow can perform deep kneading massage targeting the neck and shoulders.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_massage_pillows",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "赫哲族的伊玛堪是中国东北地区独特的说唱文学形式。",
      "sentence_pinyin": "Hèzhézú de Yīmǎkān shì Zhōngguó dōngběi dìqū dútè de shuōchàng wénxué xíngshì.",
      "sentence_fr": "L'Yimakan de l'ethnie Hezhen est une forme littéraire unique de récit chanté du nord-est de la Chine.",
      "sentence_en": "The Hezhen ethnic group's Yimakan is a unique storytelling literary form in Northeast China.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yimakan_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的历史文化街区保护项目保留了传统建筑的原有风貌。",
      "sentence_pinyin": "Chéngshì de lìshǐ wénhuà jiēqū bǎohù xiàngmù bǎoliú le chuántǒng jiànzhù de yuányǒu fēngmào.",
      "sentence_fr": "Le projet de protection des quartiers historiques et culturels urbains a préservé l'apparence originale des bâtiments traditionnels.",
      "sentence_en": "Urban historical and cultural district protection projects have preserved the original appearance of traditional buildings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "historic_preservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能养生壶可以根据不同食材自动设置煮茶或炖汤程序。",
      "sentence_pinyin": "Zhìnéng yǎngshēnghú kěyǐ gēnjù bùtóng shícái zìdòng shèzhì zhǔchá huò dùntāng chéngxù.",
      "sentence_fr": "La bouilloire santé intelligente peut automatiquement définir des programmes de thé ou de soupe selon les ingrédients.",
      "sentence_en": "The smart health kettle can automatically set tea brewing or soup stewing programs based on different ingredients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_health_kettles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的压岁钱习俗寄托了长辈对晚辈的关爱和祝福。",
      "sentence_pinyin": "Zhōngguó chuántǒng de yāsuìqián xísú jìtuō le zhǎngbèi duì wǎnbèi de guān'ài hé zhùfú.",
      "sentence_fr": "La coutume traditionnelle chinoise de l'argent de la chance exprime l'amour et les bénédictions des aînés envers les jeunes.",
      "sentence_en": "The traditional Chinese lucky money custom expresses elders' care and blessings for younger generations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lucky_money",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能睡眠监测仪可以分析睡眠质量并提供改善建议。",
      "sentence_pinyin": "Zhìnéng shuìmián jiāncèyí kěyǐ fēnxī shuìmián zhìliàng bìng tígōng gǎishàn jiànyì.",
      "sentence_fr": "Le moniteur de sommeil intelligent peut analyser la qualité du sommeil et fournir des conseils d'amélioration.",
      "sentence_en": "The smart sleep monitor can analyze sleep quality and provide improvement suggestions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sleep_monitors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "锡伯族的贝伦舞是新疆伊犁地区独特的民族舞蹈形式。",
      "sentence_pinyin": "Xībózú de Bèilúnwǔ shì Xīnjiāng Yīlí dìqū dútè de mínzú wǔdǎo xíngshì.",
      "sentence_fr": "La danse Beilun de l'ethnie Xibe est une forme de danse ethnique unique de la région d'Ili au Xinjiang.",
      "sentence_en": "The Xibe ethnic group's Beilun dance is a unique ethnic dance form in Xinjiang's Ili region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "beilun_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府推出的农村厕所改造项目改善了农民的卫生条件。",
      "sentence_pinyin": "Zhèngfǔ tuīchū de nóngcūn cèsuǒ gǎizào xiàngmù gǎishàn le nóngmín de wèishēng tiáojiàn.",
      "sentence_fr": "Le projet de rénovation des toilettes rurales lancé par le gouvernement a amélioré les conditions sanitaires des agriculteurs.",
      "sentence_en": "The government's rural toilet renovation project has improved sanitary conditions for farmers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_sanitation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子秤可以连接手机应用,记录每日饮食的营养摄入。",
      "sentence_pinyin": "Zhìnéng diànzǐ chèng kěyǐ liánjiē shǒujī yìngyòng, jìlù měirì yǐnshí de yíngyǎng shèrù.",
      "sentence_fr": "La balance électronique intelligente peut se connecter à une application mobile pour enregistrer l'apport nutritionnel quotidien.",
      "sentence_en": "The smart electronic scale can connect to a mobile app to record daily dietary nutrient intake.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_food_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的贴窗花习俗为春节增添了喜庆的氛围。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tiē chuānghuā xísú wèi Chūnjié zēngtiān le xǐqìng de fēnwéi.",
      "sentence_fr": "La coutume traditionnelle chinoise de coller des décorations aux fenêtres ajoute une atmosphère festive au Nouvel An.",
      "sentence_en": "The traditional Chinese custom of pasting window decorations adds a festive atmosphere to the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "window_decorations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物自动喂水器可以保持水源新鲜,鼓励宠物多喝水。",
      "sentence_pinyin": "Zhìnéng chǒngwù zìdòng wèishuǐqì kěyǐ bǎochí shuǐyuán xīnxiān, gǔlì chǒngwù duō hēshuǐ.",
      "sentence_fr": "La fontaine à eau automatique pour animaux intelligente peut garder l'eau fraîche, encourageant les animaux à boire davantage.",
      "sentence_en": "The smart automatic pet water dispenser can keep water fresh, encouraging pets to drink more.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_water_dispensers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "塔吉克族的鹰舞是帕米尔高原上独特的民族舞蹈艺术。",
      "sentence_pinyin": "Tǎjíkèzú de yīngwǔ shì Pàmǐ'ěr gāoyuán shàng dútè de mínzú wǔdǎo yìshù.",
      "sentence_fr": "La danse de l'aigle de l'ethnie tadjike est un art de danse ethnique unique du plateau du Pamir.",
      "sentence_en": "The Tajik ethnic group's eagle dance is a unique ethnic dance art on the Pamir Plateau.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "eagle_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的慢行交通系统为骑行者和步行者提供了安全的出行环境。",
      "sentence_pinyin": "Chéngshì de mànxíng jiāotōng xìtǒng wèi qíxíngzhě hé bùxíngzhě tígōng le ānquán de chūxíng huánjìng.",
      "sentence_fr": "Le système de transport doux urbain offre un environnement de déplacement sûr pour les cyclistes et les piétons.",
      "sentence_en": "Urban slow traffic systems provide a safe travel environment for cyclists and pedestrians.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "slow_traffic_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电动晾衣杆可以自动升降和烘干衣物,节省空间和时间。",
      "sentence_pinyin": "Zhìnéng diàndòng liàngyīgān kěyǐ zìdòng shēngjiàng hé hōnggān yīwù, jiéshěng kōngjiān hé shíjiān.",
      "sentence_fr": "L'étendoir électrique intelligent peut automatiquement monter, descendre et sécher les vêtements, économisant espace et temps.",
      "sentence_en": "The smart electric clothes drying rack can automatically raise, lower, and dry clothes, saving space and time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_drying_racks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的元宵节灯会是欣赏花灯和猜灯谜的传统活动。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Yuánxiāojié dēnghuì shì xīnshǎng huādēng hé cāi dēngmí de chuántǒng huódòng.",
      "sentence_fr": "Le festival des lanternes traditionnel chinois est une activité traditionnelle pour admirer les lanternes et deviner les énigmes.",
      "sentence_en": "The traditional Chinese Lantern Festival lantern fair is a traditional activity for viewing lanterns and solving riddles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lantern_festival_fair",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能垃圾分类回收站可以自动识别垃圾类型并给予积分奖励。",
      "sentence_pinyin": "Zhìnéng lājī fēnlèi huíshōu zhàn kěyǐ zìdòng shìbié lājī lèixíng bìng jǐyǔ jīfēn jiǎnglì.",
      "sentence_fr": "La station de tri intelligent peut identifier automatiquement les types de déchets et offrir des points de récompense.",
      "sentence_en": "The smart waste sorting station can automatically identify waste types and give point rewards.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_recycling_stations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柯尔克孜族的玛纳斯是世界上最长的史诗之一。",
      "sentence_pinyin": "Kē'ěrkèzīzú de Mǎnàsī shì shìjiè shàng zuì cháng de shǐshī zhī yī.",
      "sentence_fr": "Le Manas de l'ethnie kirghize est l'une des plus longues épopées du monde.",
      "sentence_en": "The Kyrgyz ethnic group's Manas is one of the longest epics in the world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "manas_epic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展的文化惠民活动丰富了居民的业余文化生活。",
      "sentence_pinyin": "Shèqū kāizhǎn de wénhuà huìmín huódòng fēngfù le jūmín de yèyú wénhuà shēnghuó.",
      "sentence_fr": "Les activités culturelles populaires organisées par la communauté ont enrichi la vie culturelle des résidents.",
      "sentence_en": "Community cultural enrichment activities have enriched residents' leisure cultural life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_enrichment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子门锁可以生成临时密码,方便访客和家政服务人员进入。",
      "sentence_pinyin": "Zhìnéng diànzǐ ménsuǒ kěyǐ shēngchéng línshí mìmǎ, fāngbiàn fǎngkè hé jiāzhèng fúwù rényuán jìnrù.",
      "sentence_fr": "La serrure électronique intelligente peut générer des mots de passe temporaires pour les visiteurs et le personnel de ménage.",
      "sentence_en": "The smart electronic door lock can generate temporary passwords for visitors and housekeeping staff to enter.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_door_locks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的放鞭炮习俗在春节期间营造出热闹喜庆的气氛。",
      "sentence_pinyin": "Zhōngguó chuántǒng de fàng biānpào xísú zài Chūnjié qījiān yíngzào chū rènào xǐqìng de qìfēn.",
      "sentence_fr": "La coutume traditionnelle chinoise des pétards crée une atmosphère animée et festive pendant le Nouvel An.",
      "sentence_en": "The traditional Chinese firecracker custom creates a lively and festive atmosphere during the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "firecracker_custom",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
