{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "太阳耀斑是太阳表面突然释放大量能量的剧烈爆发。",
      "sentence_pinyin": "Tàiyáng yàobān shì tàiyáng biǎomiàn tūrán shìfàng dàliàng néngliàng de jùliè bàofā.",
      "sentence_fr": "Les éruptions solaires sont des explosions violentes libérant soudainement d'énormes quantités d'énergie à la surface du Soleil.",
      "sentence_en": "Solar flares are violent explosions suddenly releasing huge amounts of energy on the Sun's surface.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_flares",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈希时间锁定合约实现跨链原子交换的安全机制。",
      "sentence_pinyin": "Hāxī shíjiān suǒdìng héyuē shíxiàn kuà liàn yuánzǐ jiāohuàn de ānquán jīzhì.",
      "sentence_fr": "Les contrats verrouillés par hachage temporel mettent en œuvre des mécanismes sécurisés pour les échanges atomiques inter-chaînes.",
      "sentence_en": "Hash time-locked contracts implement secure mechanisms for cross-chain atomic swaps.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hash_time_locked_contracts",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声明式配置描述系统的期望状态而非执行步骤。",
      "sentence_pinyin": "Shēngmíngshì pèizhì miáoshù xìtǒng de qīwàng zhuàngtài ér fēi zhíxíng bùzhòu.",
      "sentence_fr": "La configuration déclarative décrit l'état souhaité du système plutôt que les étapes d'exécution.",
      "sentence_en": "Declarative configuration describes the desired system state rather than execution steps.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "declarative_configuration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "真理实用论认为真理是在实践中被证明有效的信念。",
      "sentence_pinyin": "Zhēnlǐ shíyònglùn rènwéi zhēnlǐ shì zài shíjiàn zhōng bèi zhèngmíng yǒuxiào de xìnniàn.",
      "sentence_fr": "La théorie pragmatique de la vérité soutient que la vérité est une croyance qui s'avère efficace dans la pratique.",
      "sentence_en": "The pragmatic theory of truth holds that truth is a belief proven effective in practice.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "pragmatic_truth_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自动扩缩容根据负载动态调整计算资源分配。",
      "sentence_pinyin": "Zìdòng kuò suōróng gēnjù fùzài dòngtài tiáozhěng jìsuàn zīyuán fēnpèi.",
      "sentence_fr": "L'auto-scaling ajuste dynamiquement l'allocation des ressources de calcul en fonction de la charge.",
      "sentence_en": "Auto-scaling dynamically adjusts compute resource allocation based on load.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "auto_scaling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳黑子是太阳表面温度较低的磁场活动区域。",
      "sentence_pinyin": "Tàiyáng hēizǐ shì tàiyáng biǎomiàn wēndù jiào dī de cíchǎng huódòng qūyù.",
      "sentence_fr": "Les taches solaires sont des régions d'activité magnétique à température plus basse sur la surface du Soleil.",
      "sentence_en": "Sunspots are regions of magnetic activity with lower temperatures on the Sun's surface.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sunspots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "默克尔树结构高效验证大数据集中的数据完整性。",
      "sentence_pinyin": "Mòkè'ěr shù jiégòu gāoxiào yànzhèng dà shùjùjí zhōng de shùjù wánzhěngxìng.",
      "sentence_fr": "La structure d'arbre de Merkle vérifie efficacement l'intégrité des données dans de grands ensembles de données.",
      "sentence_en": "Merkle tree structures efficiently verify data integrity in large datasets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "merkle_trees",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "健康检查机制自动检测并移除不健康的服务实例。",
      "sentence_pinyin": "Jiànkāng jiǎnchá jīzhì zìdòng jiǎncè bìng yíchú bù jiànkāng de fúwù shílì.",
      "sentence_fr": "Les mécanismes de vérification de santé détectent et suppriment automatiquement les instances de service défaillantes.",
      "sentence_en": "Health check mechanisms automatically detect and remove unhealthy service instances.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "health_checks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "归纳问题质疑从过去经验推导普遍规律的合理性。",
      "sentence_pinyin": "Guīnà wèntí zhìyí cóng guòqù jīngyàn tuīdǎo pǔbiàn guīlǜ de hélǐxìng.",
      "sentence_fr": "Le problème de l'induction remet en question la légitimité de déduire des lois générales à partir d'expériences passées.",
      "sentence_en": "The problem of induction questions the legitimacy of deriving universal laws from past experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "problem_of_induction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "灰度发布将新版本逐渐推广到更大范围的用户群体。",
      "sentence_pinyin": "Huīdù fābù jiāng xīn bǎnběn zhújiàn tuīguǎng dào gèng dà fànwéi de yònghù qúntǐ.",
      "sentence_fr": "Le déploiement progressif étend graduellement les nouvelles versions à un groupe d'utilisateurs de plus en plus large.",
      "sentence_en": "Gradual rollout progressively extends new versions to an increasingly larger user base.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gradual_rollout",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳活动周期约为十一年影响地球磁场和气候。",
      "sentence_pinyin": "Tàiyáng huódòng zhōuqī yuē wéi shíyī nián yǐngxiǎng dìqiú cíchǎng hé qìhòu.",
      "sentence_fr": "Le cycle d'activité solaire dure environ onze ans et affecte le champ magnétique terrestre et le climat.",
      "sentence_en": "The solar activity cycle lasts about eleven years and affects Earth's magnetic field and climate.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_cycle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分片技术将区块链数据分割到多个并行处理单元。",
      "sentence_pinyin": "Fēnpiàn jìshù jiāng qūkuàiliàn shùjù fēngē dào duō gè bìngxíng chǔlǐ dānyuán.",
      "sentence_fr": "La technique de sharding divise les données blockchain en plusieurs unités de traitement parallèles.",
      "sentence_en": "Sharding technology divides blockchain data across multiple parallel processing units.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "blockchain_sharding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资源配额限制单个租户在多租户系统中的资源使用。",
      "sentence_pinyin": "Zīyuán pèi'é xiànzhì dāngè zūhù zài duō zūhù xìtǒng zhōng de zīyuán shǐyòng.",
      "sentence_fr": "Les quotas de ressources limitent l'utilisation des ressources par un locataire individuel dans les systèmes multi-locataires.",
      "sentence_en": "Resource quotas limit resource usage by individual tenants in multi-tenant systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "resource_quotas",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "证伪主义认为科学理论的特征在于其可被证伪。",
      "sentence_pinyin": "Zhèngwěi zhǔyì rènwéi kēxué lǐlùn de tèzhēng zàiyú qí kě bèi zhèngwěi.",
      "sentence_fr": "Le falsificationnisme soutient que la caractéristique des théories scientifiques est leur réfutabilité.",
      "sentence_en": "Falsificationism holds that the characteristic of scientific theories is their falsifiability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "falsificationism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "命名空间隔离在共享集群中提供逻辑分区和访问控制。",
      "sentence_pinyin": "Mìngmíng kōngjiān gélí zài gòngxiǎng jíqún zhōng tígōng luójí fēnqū hé fǎngwèn kòngzhì.",
      "sentence_fr": "L'isolation par espace de noms fournit un partitionnement logique et un contrôle d'accès dans les clusters partagés.",
      "sentence_en": "Namespace isolation provides logical partitioning and access control in shared clusters.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "namespace_isolation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行星大气层的组成决定其保温能力和表面条件。",
      "sentence_pinyin": "Xíngxīng dàqìcéng de zǔchéng juédìng qí bǎowēn nénglì hé biǎomiàn tiáojiàn.",
      "sentence_fr": "La composition de l'atmosphère planétaire détermine sa capacité à retenir la chaleur et les conditions de surface.",
      "sentence_en": "A planet's atmospheric composition determines its heat retention capacity and surface conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "planetary_atmospheres",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "状态通道在链下进行多次交易仅在结算时上链。",
      "sentence_pinyin": "Zhuàngtài tōngdào zài liàn xià jìnxíng duō cì jiāoyì jǐn zài jiésuàn shí shàng liàn.",
      "sentence_fr": "Les canaux d'état effectuent plusieurs transactions hors chaîne et ne s'enregistrent sur la chaîne qu'au moment du règlement.",
      "sentence_en": "State channels conduct multiple transactions off-chain and only settle on-chain.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "state_channels",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "服务水平协议定义服务提供者对可用性和性能的承诺。",
      "sentence_pinyin": "Fúwù shuǐpíng xiéyì dìngyì fúwù tígōngzhě duì kěyòngxìng hé xìngnéng de chéngnuò.",
      "sentence_fr": "Les accords de niveau de service définissent les engagements des fournisseurs de services en matière de disponibilité et de performance.",
      "sentence_en": "Service level agreements define service providers' commitments to availability and performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "service_level_agreements",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学范式转换通过革命性发现根本改变学科的基本假设。",
      "sentence_pinyin": "Kēxué fànshì zhuǎnhuàn tōngguò gémìngxìng fāxiàn gēnběn gǎibiàn xuékē de jīběn jiǎshè.",
      "sentence_fr": "Les changements de paradigme scientifique modifient fondamentalement les hypothèses de base d'une discipline par des découvertes révolutionnaires.",
      "sentence_en": "Scientific paradigm shifts fundamentally change a discipline's basic assumptions through revolutionary discoveries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "paradigm_shifts",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "优雅降级确保系统在部分组件故障时仍能提供基本功能。",
      "sentence_pinyin": "Yōuyǎ jiàngjí quèbǎo xìtǒng zài bùfèn zǔjiàn gùzhàng shí réng néng tígōng jīběn gōngnéng.",
      "sentence_fr": "La dégradation gracieuse garantit que les systèmes fournissent des fonctionnalités de base même en cas de défaillance partielle des composants.",
      "sentence_en": "Graceful degradation ensures systems provide basic functionality even when some components fail.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "graceful_degradation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
