{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "创伤后应激障碍研究正在开发更有效的心理和药物治疗方法。",
      "sentence_pinyin": "Chuāngshāng hòu yìngjī zhàng'ài yánjiū zhèngzài kāifā gèng yǒuxiào de xīnlǐ hé yàowù zhìliáo fāngfǎ.",
      "sentence_fr": "La recherche sur le trouble de stress post-traumatique développe des méthodes de traitement psychologique et médicamenteux plus efficaces.",
      "sentence_en": "Post-traumatic stress disorder research is developing more effective psychological and pharmaceutical treatment methods.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ptsd_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微塑料检测技术帮助科学家追踪这些污染物在环境和食物链中的分布。",
      "sentence_pinyin": "Wēi sùliào jiǎncè jìshù bāngzhù kēxué jiā zhuīzōng zhèxiē wūrǎn wù zài huánjìng hé shíwù liàn zhōng de fēnbù.",
      "sentence_fr": "Les technologies de détection des microplastiques aident les scientifiques à suivre la distribution de ces polluants dans l'environnement et la chaîne alimentaire.",
      "sentence_en": "Microplastic detection technologies help scientists track the distribution of these pollutants in the environment and food chain.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microplastic_detection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "关系数据库管理系统仍然是企业数据存储和查询的核心基础设施。",
      "sentence_pinyin": "Guānxì shùjùkù guǎnlǐ xìtǒng réngrán shì qǐyè shùjù cúnchǔ hé cháxún de héxīn jīchǔ shèshī.",
      "sentence_fr": "Les systèmes de gestion de bases de données relationnelles restent l'infrastructure de base pour le stockage et l'interrogation des données d'entreprise.",
      "sentence_en": "Relational database management systems remain the core infrastructure for enterprise data storage and querying.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "relational_databases",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境正义运动倡导让弱势社区免受不成比例的污染负担。",
      "sentence_pinyin": "Huánjìng zhèngyì yùndòng chàngdǎo ràng ruòshì shèqū miǎnshòu bù chéng bǐlì de wūrǎn fùdān.",
      "sentence_fr": "Le mouvement pour la justice environnementale préconise de protéger les communautés défavorisées contre une charge disproportionnée de pollution.",
      "sentence_en": "The environmental justice movement advocates protecting disadvantaged communities from disproportionate pollution burdens.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_justice",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "神经网络剪枝技术减少模型参数以提高在移动设备上的运行效率。",
      "sentence_pinyin": "Shénjīng wǎngluò jiǎnzhī jìshù jiǎnshǎo móxíng cānshù yǐ tígāo zài yídòng shèbèi shàng de yùnxíng xiàolǜ.",
      "sentence_fr": "Les techniques d'élagage des réseaux de neurones réduisent les paramètres du modèle pour améliorer l'efficacité d'exécution sur les appareils mobiles.",
      "sentence_en": "Neural network pruning techniques reduce model parameters to improve running efficiency on mobile devices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neural_network_pruning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "媒体融合改变了新闻生产和消费的传统模式和商业模式。",
      "sentence_pinyin": "Méitǐ rónghé gǎibiàn le xīnwén shēngchǎn hé xiāofèi de chuántǒng móshì hé shāngyè móshì.",
      "sentence_fr": "La convergence des médias a modifié les modes traditionnels de production et de consommation de l'information ainsi que les modèles commerciaux.",
      "sentence_en": "Media convergence has changed traditional patterns and business models of news production and consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "media_convergence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "结构方程模型帮助研究人员分析复杂变量之间的因果关系网络。",
      "sentence_pinyin": "Jiégòu fāngchéng móxíng bāngzhù yánjiū rényuán fēnxī fùzá biànliàng zhījiān de yīnguǒ guānxì wǎngluò.",
      "sentence_fr": "Les modèles d'équations structurelles aident les chercheurs à analyser les réseaux de relations causales entre variables complexes.",
      "sentence_en": "Structural equation models help researchers analyze causal relationship networks among complex variables.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "structural_equation_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物炼制技术将农业废弃物转化为燃料、化学品和其他有价值的产品。",
      "sentence_pinyin": "Shēngwù liànzhì jìshù jiāng nóngyè fèiqì wù zhuǎnhuà wéi ránliào, huàxué pǐn hé qítā yǒu jiàzhí de chǎnpǐn.",
      "sentence_fr": "Les technologies de bioraffinerie convertissent les déchets agricoles en carburants, produits chimiques et autres produits de valeur.",
      "sentence_en": "Biorefinery technology converts agricultural waste into fuels, chemicals, and other valuable products.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biorefinery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市规划理论探讨如何创建更宜居、公平和可持续的城市环境。",
      "sentence_pinyin": "Chéngshì guīhuà lǐlùn tàntǎo rúhé chuàngjiàn gèng yíjū, gōngpíng hé kěchíxù de chéngshì huánjìng.",
      "sentence_fr": "La théorie de l'urbanisme explore comment créer des environnements urbains plus vivables, équitables et durables.",
      "sentence_en": "Urban planning theory explores how to create more livable, equitable, and sustainable urban environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_planning_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "疫苗技术平台使科学家能够快速开发针对新兴病原体的疫苗。",
      "sentence_pinyin": "Yìmiáo jìshù píngtái shǐ kēxué jiā nénggòu kuàisù kāifā zhēnduì xīnxīng bìngyuántǐ de yìmiáo.",
      "sentence_fr": "Les plateformes technologiques vaccinales permettent aux scientifiques de développer rapidement des vaccins contre les agents pathogènes émergents.",
      "sentence_en": "Vaccine technology platforms enable scientists to rapidly develop vaccines against emerging pathogens.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vaccine_platforms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混合现实协作工具使远程团队能够在共享的虚拟空间中协同工作。",
      "sentence_pinyin": "Hùnhé xiànshí xiézuò gōngjù shǐ yuǎnchéng tuánduì nénggòu zài gòngxiǎng de xūnǐ kōngjiān zhōng xiétóng gōngzuò.",
      "sentence_fr": "Les outils de collaboration en réalité mixte permettent aux équipes distantes de travailler ensemble dans un espace virtuel partagé.",
      "sentence_en": "Mixed reality collaboration tools enable remote teams to work together in shared virtual spaces.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mr_collaboration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "道德心理学研究人类道德判断和行为背后的认知和情感过程。",
      "sentence_pinyin": "Dàodé xīnlǐ xué yánjiū rénlèi dàodé pànduàn hé xíngwéi bèihòu de rènzhī hé qínggǎn guòchéng.",
      "sentence_fr": "La psychologie morale étudie les processus cognitifs et émotionnels derrière les jugements et comportements moraux humains.",
      "sentence_en": "Moral psychology studies cognitive and emotional processes behind human moral judgments and behaviors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "moral_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能农业传感器实时监测土壤湿度、营养和作物健康状况。",
      "sentence_pinyin": "Zhìnéng nóngyè chuángǎnqì shíshí jiāncè tǔrǎng shīdù, yíngyǎng hé zuòwù jiànkāng zhuàngkuàng.",
      "sentence_fr": "Les capteurs agricoles intelligents surveillent en temps réel l'humidité du sol, les nutriments et l'état de santé des cultures.",
      "sentence_en": "Smart agriculture sensors monitor soil moisture, nutrients, and crop health status in real-time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_agriculture_sensors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "司法独立是法治社会维护公正裁判和公民权利的基础。",
      "sentence_pinyin": "Sīfǎ dúlì shì fǎzhì shèhuì wéihù gōngzhèng cáipàn hé gōngmín quánlì de jīchǔ.",
      "sentence_fr": "L'indépendance judiciaire est le fondement du maintien d'un jugement équitable et des droits des citoyens dans une société de droit.",
      "sentence_en": "Judicial independence is the foundation for maintaining fair judgment and citizen rights in a rule of law society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "judicial_independence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "钙钛矿太阳能电池因其低成本和高效率而成为光伏研究的热点。",
      "sentence_pinyin": "Gàitài kuàng tàiyáng néng diànchí yīn qí dī chéngběn hé gāo xiàolǜ ér chéngwéi guāngfú yánjiū de rèdiǎn.",
      "sentence_fr": "Les cellules solaires à pérovskite sont devenues un point chaud de la recherche photovoltaïque en raison de leur faible coût et de leur haute efficacité.",
      "sentence_en": "Perovskite solar cells have become a hot topic in photovoltaic research due to their low cost and high efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "perovskite_solar_cells",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言态度研究探索人们对不同语言和方言的主观评价和偏见。",
      "sentence_pinyin": "Yǔyán tàidù yánjiū tànsuǒ rénmen duì bùtóng yǔyán hé fāngyán de zhǔguān píngjià hé piānjiàn.",
      "sentence_fr": "La recherche sur les attitudes linguistiques explore les évaluations subjectives et les préjugés des gens envers différentes langues et dialectes.",
      "sentence_en": "Language attitude research explores people's subjective evaluations and biases toward different languages and dialects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_attitudes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基础设施即代码方法使IT团队能够通过软件自动化管理服务器配置。",
      "sentence_pinyin": "Jīchǔ shèshī jí dàimǎ fāngfǎ shǐ IT tuánduì nénggòu tōngguò ruǎnjiàn zìdòng huà guǎnlǐ fúwùqì pèizhì.",
      "sentence_fr": "L'approche Infrastructure as Code permet aux équipes IT de gérer la configuration des serveurs par l'automatisation logicielle.",
      "sentence_en": "Infrastructure as code approach enables IT teams to manage server configuration through software automation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "infrastructure_as_code",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土著权利运动争取原住民对传统土地和自然资源的自决权。",
      "sentence_pinyin": "Tǔzhù quánlì yùndòng zhēngqǔ yuánzhùmín duì chuántǒng tǔdì hé zìrán zīyuán de zìjué quán.",
      "sentence_fr": "Le mouvement pour les droits des peuples autochtones revendique l'autodétermination des peuples autochtones sur leurs terres traditionnelles et leurs ressources naturelles.",
      "sentence_en": "Indigenous rights movements fight for indigenous peoples' self-determination over traditional lands and natural resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "indigenous_rights",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋白质组学分析细胞或生物体中所有蛋白质的表达和相互作用。",
      "sentence_pinyin": "Dànbáizhì zǔ xué fēnxī xìbāo huò shēngwùtǐ zhōng suǒyǒu dànbáizhì de biǎodá hé xiānghù zuòyòng.",
      "sentence_fr": "La protéomique analyse l'expression et les interactions de toutes les protéines dans une cellule ou un organisme.",
      "sentence_en": "Proteomics analyzes the expression and interactions of all proteins in a cell or organism.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "proteomics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字素养课程帮助学生发展在信息时代批判性使用技术的能力。",
      "sentence_pinyin": "Shùzì sùyǎng kèchéng bāngzhù xuéshēng fāzhǎn zài xìnxī shídài pīpàn xìng shǐyòng jìshù de nénglì.",
      "sentence_fr": "Les cours de littératie numérique aident les étudiants à développer la capacité d'utiliser la technologie de manière critique à l'ère de l'information.",
      "sentence_en": "Digital literacy courses help students develop the ability to critically use technology in the information age.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_literacy_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
