{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个村级电商服务站帮助农民销售土特产并代购日用品。",
      "sentence_pinyin": "Zhège cūnjí diànshāng fúwù zhàn bāngzhù nóngmín xiāoshòu tǔtèchǎn bìng dàigòu rìyòngpǐn.",
      "sentence_fr": "Ce poste de service e-commerce au niveau du village aide les agriculteurs à vendre des produits locaux spécialisés et à acheter des produits du quotidien.",
      "sentence_en": "This village-level e-commerce service station helps farmers sell local specialties and purchase daily necessities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "village_ecommerce",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在评剧演唱中展现了甜美婉转的唱腔和生动的人物塑造。",
      "sentence_pinyin": "Tā zài píngjù yǎnchàng zhōng zhǎnxiànle tiánměi wǎnzhuǎn de chàngqiāng hé shēngdòng de rénwù sùzào.",
      "sentence_fr": "Dans son chant d'opéra Pingju, elle a démontré une voix douce et mélodieuse et une caractérisation vivante.",
      "sentence_en": "In her Pingju Opera singing, she demonstrated a sweet and melodious voice and vivid characterization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pingju_opera",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能配电系统能够自动检测故障并快速恢复供电。",
      "sentence_pinyin": "Zhège zhìnéng pèidiàn xìtǒng nénggòu zìdòng jiǎncè gùzhàng bìng kuàisù huīfù gōngdiàn.",
      "sentence_fr": "Ce système de distribution électrique intelligent peut détecter automatiquement les pannes et restaurer rapidement l'alimentation.",
      "sentence_en": "This smart power distribution system can automatically detect faults and quickly restore power supply.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "power_distribution",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在童话创作中用简单的语言讲述了富有哲理的故事。",
      "sentence_pinyin": "Tā zài tónghuà chuàngzuò zhōng yòng jiǎndān de yǔyán jiǎngshùle fùyǒu zhélǐ de gùshi.",
      "sentence_fr": "Dans la création de contes de fées, il raconte des histoires riches en philosophie avec un langage simple.",
      "sentence_en": "In fairy tale creation, he tells stories rich in philosophy with simple language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fairy_tales",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个产后护理中心为新妈妈提供科学的月子调理服务。",
      "sentence_pinyin": "Zhège chǎnhòu hùlǐ zhōngxīn wèi xīn māma tígōng kēxué de yuèzi tiáolǐ fúwù.",
      "sentence_fr": "Ce centre de soins postnataux fournit des services scientifiques de confinement postnatal aux nouvelles mères.",
      "sentence_en": "This postnatal care center provides scientific postpartum confinement services to new mothers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "postnatal_care",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的灯具设计将照明功能和艺术造型完美结合。",
      "sentence_pinyin": "Tā de dēngjù shèjì jiāng zhàomíng gōngnéng hé yìshù zàoxíng wánměi jiéhé.",
      "sentence_fr": "Sa conception de luminaires combine parfaitement la fonction d'éclairage et la forme artistique.",
      "sentence_en": "Her lighting fixture design perfectly combines lighting function and artistic form.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lighting_design",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个河流生态修复工程恢复了水生植物和鱼类的生存环境。",
      "sentence_pinyin": "Zhège héliú shēngtài xiūfù gōngchéng huīfùle shuǐshēng zhíwù hé yúlèi de shēngcún huánjìng.",
      "sentence_fr": "Ce projet de restauration écologique fluviale a restauré l'habitat des plantes aquatiques et des poissons.",
      "sentence_en": "This river ecological restoration project restored the habitat of aquatic plants and fish.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "river_restoration",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在赛艇运动中锻炼了体能和团队协作精神。",
      "sentence_pinyin": "Tā zài sàitǐng yùndòng zhōng duànliànle tǐnéng hé tuánduì xiézuò jīngshén.",
      "sentence_fr": "Dans l'aviron, il a développé sa condition physique et son esprit d'équipe.",
      "sentence_en": "In rowing, he developed his physical fitness and team spirit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rowing",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区调解室帮助邻里解决矛盾纠纷并维护和谐关系。",
      "sentence_pinyin": "Zhège shèqū tiáojiě shì bāngzhù línlǐ jiějué máodùn jiūfēn bìng wéihù héxié guānxi.",
      "sentence_fr": "Ce bureau de médiation communautaire aide les voisins à résoudre les conflits et à maintenir des relations harmonieuses.",
      "sentence_en": "This community mediation office helps neighbors resolve conflicts and maintain harmonious relationships.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_mediation",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在根雕艺术中保留了树根的自然形态并赋予其艺术生命。",
      "sentence_pinyin": "Tā zài gēndiāo yìshù zhōng bǎoliúle shùgēn de zìrán xíngtài bìng fùyǔ qí yìshù shēngmìng.",
      "sentence_fr": "Dans l'art de la sculpture sur racines, elle préserve la forme naturelle des racines d'arbres et leur donne une vie artistique.",
      "sentence_en": "In root carving art, she preserves the natural form of tree roots and gives them artistic life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "root_carving",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能仓储系统利用机器人实现货物的自动分拣和搬运。",
      "sentence_pinyin": "Zhège zhìnéng cāngchǔ xìtǒng lìyòng jīqìrén shíxiàn huòwù de zìdòng fēnjiǎn hé bānyùn.",
      "sentence_fr": "Ce système d'entreposage intelligent utilise des robots pour réaliser le tri et le transport automatiques des marchandises.",
      "sentence_en": "This smart warehousing system uses robots to achieve automatic sorting and transportation of goods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_warehousing",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在箜篌演奏中展现了古朴典雅的音乐风格。",
      "sentence_pinyin": "Tā zài kōnghóu yǎnzòu zhōng zhǎnxiànle gǔpǔ diǎnyǎ de yīnyuè fēnggé.",
      "sentence_fr": "Il a démontré un style musical antique et élégant dans son jeu de konghou.",
      "sentence_en": "He demonstrated an antique and elegant musical style in his konghou performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "konghou_music",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个噪音监测网络实时记录城市各区域的噪声分贝数据。",
      "sentence_pinyin": "Zhège zàoyīn jiāncè wǎngluò shíshí jìlù chéngshì gè qūyù de zàoshēng fēnbèi shùjù.",
      "sentence_fr": "Ce réseau de surveillance du bruit enregistre en temps réel les données de décibels sonores dans diverses zones de la ville.",
      "sentence_en": "This noise monitoring network records real-time sound decibel data in various urban areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "noise_monitoring",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的概念艺术作品用观念和思想挑战了传统的艺术定义。",
      "sentence_pinyin": "Tā de gàiniàn yìshù zuòpǐn yòng guānniàn hé sīxiǎng tiǎozhànle chuántǒng de yìshù dìngyì.",
      "sentence_fr": "Ses œuvres d'art conceptuel défient la définition traditionnelle de l'art avec des concepts et des idées.",
      "sentence_en": "Her conceptual art works challenge the traditional definition of art with concepts and ideas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "conceptual_art",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个山洪预警系统通过雨量监测提前发布灾害预警信息。",
      "sentence_pinyin": "Zhège shānhóng yùjǐng xìtǒng tōngguò yǔliàng jiāncè tíqián fābù zāihài yùjǐng xìnxī.",
      "sentence_fr": "Ce système d'alerte aux crues éclair émet à l'avance des informations d'alerte aux catastrophes grâce à la surveillance des précipitations.",
      "sentence_en": "This flash flood warning system issues disaster warning information in advance through rainfall monitoring.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "flood_warning",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在文学评论工作中深入分析了作品的主题思想和艺术特色。",
      "sentence_pinyin": "Tā zài wénxué pínglùn gōngzuò zhōng shēnrù fēnxīle zuòpǐn de zhǔtí sīxiǎng hé yìshù tèsè.",
      "sentence_fr": "Dans son travail de critique littéraire, il analyse en profondeur les thèmes et les caractéristiques artistiques des œuvres.",
      "sentence_en": "In his literary criticism work, he deeply analyzes the thematic ideas and artistic characteristics of works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literary_criticism",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个老年公寓配备了完善的医疗保健和生活照料设施。",
      "sentence_pinyin": "Zhège lǎonián gōngyù pèibèile wánshàn de yīliáo bǎojiàn hé shēnghuó zhàoliào shèshī.",
      "sentence_fr": "Cette résidence pour seniors est équipée d'installations complètes de soins de santé et d'assistance à la vie quotidienne.",
      "sentence_en": "This senior apartment is equipped with complete healthcare and daily care facilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "senior_housing",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在花样滑冰表演中完成了高难度的跳跃和旋转动作。",
      "sentence_pinyin": "Tā zài huāyàng huábīng biǎoyǎn zhōng wánchéngle gāo nándù de tiàoyuè hé xuánzhuǎn dòngzuò.",
      "sentence_fr": "Dans sa performance de patinage artistique, elle a réalisé des sauts et des rotations de haute difficulté.",
      "sentence_en": "In her figure skating performance, she completed highly difficult jumps and spins.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "figure_skating",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技成果转化平台促进了高校研发成果的产业化应用。",
      "sentence_pinyin": "Zhège kējì chéngguǒ zhuǎnhuà píngtái cùjìnle gāoxiào yánfā chéngguǒ de chǎnyèhuà yìngyòng.",
      "sentence_fr": "Cette plateforme de transfert de résultats scientifiques et technologiques promeut l'application industrielle des résultats de R&D universitaires.",
      "sentence_en": "This technology transfer platform promotes the industrial application of university R&D results.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tech_transfer",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在砖雕工艺中雕刻出了栩栩如生的人物和动物形象。",
      "sentence_pinyin": "Tā zài zhuāndiāo gōngyì zhōng diāokè chūle xǔxǔrúshēng de rénwù hé dòngwù xíngxiàng.",
      "sentence_fr": "Dans l'artisanat de sculpture sur brique, il a sculpté des personnages et des animaux vivants.",
      "sentence_en": "In brick carving craftsmanship, he carved lifelike human and animal figures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "brick_carving",
      "created_at": "2025-11-20T19:30:00.000Z",
      "updated_at": "2025-11-20T19:30:00.000Z"
    }
  ]
}
