{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能电表可以分时段记录用电量,帮助用户了解用电习惯。",
      "sentence_pinyin": "Zhège zhìnéng diànbiǎo kěyǐ fēn shíduàn jìlù yòngdiànliàng, bāngzhù yònghù liǎojiě yòngdiàn xíguàn.",
      "sentence_fr": "Ce compteur électrique intelligent peut enregistrer la consommation par période, aidant les utilisateurs à comprendre leurs habitudes.",
      "sentence_en": "This smart electric meter can record electricity usage by time period, helping users understand their usage habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_electric_meters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "彝剧是云南彝族的传统戏剧,具有独特的民族风格和艺术魅力。",
      "sentence_pinyin": "Yíjù shì Yúnnán Yízú de chuántǒng xìjù, jùyǒu dútè de mínzú fēnggé hé yìshù mèilì.",
      "sentence_fr": "L'opéra Yi est un théâtre traditionnel de l'ethnie Yi du Yunnan, avec un style ethnique unique et un charme artistique.",
      "sentence_en": "Yi opera is a traditional theater of the Yi ethnic group in Yunnan, with unique ethnic style and artistic charm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yi_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的雨水花园可以收集和净化雨水,减少城市内涝风险。",
      "sentence_pinyin": "Chéngshì de yǔshuǐ huāyuán kěyǐ shōují hé jìnghuà yǔshuǐ, jiǎnshǎo chéngshì nèilào fēngxiǎn.",
      "sentence_fr": "Les jardins de pluie urbains peuvent collecter et purifier l'eau de pluie, réduisant les risques d'inondation urbaine.",
      "sentence_en": "Urban rain gardens can collect and purify rainwater, reducing urban flooding risks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rain_gardens",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能眼部按摩仪可以通过热敷和振动缓解眼部疲劳。",
      "sentence_pinyin": "Zhìnéng yǎnbù ànmóyí kěyǐ tōngguò rèfū hé zhèndòng huǎnjiě yǎnbù píláo.",
      "sentence_fr": "Le masseur oculaire intelligent peut soulager la fatigue oculaire par la chaleur et les vibrations.",
      "sentence_en": "The smart eye massager can relieve eye fatigue through heat compression and vibration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_eye_massagers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的绘画装裱工艺可以让书画作品保存更长久。",
      "sentence_pinyin": "Zhōngguó chuántǒng de huìhuà zhuāngbiǎo gōngyì kěyǐ ràng shūhuà zuòpǐn bǎocún gèng chángjiǔ.",
      "sentence_fr": "L'art traditionnel chinois de l'encadrement peut préserver les œuvres de calligraphie et de peinture plus longtemps.",
      "sentence_en": "Traditional Chinese painting mounting craft can preserve calligraphy and painting works for longer.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "painting_mounting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能足浴盆可以自动加热和按摩,帮助放松身心。",
      "sentence_pinyin": "Zhìnéng zúyùpén kěyǐ zìdòng jiārè hé ànmó, bāngzhù fàngsōng shēnxīn.",
      "sentence_fr": "Le bain de pieds intelligent peut chauffer et masser automatiquement, aidant à détendre le corps et l'esprit.",
      "sentence_en": "The smart foot bath can automatically heat and massage, helping to relax body and mind.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_foot_baths",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "苗剧是贵州苗族的传统戏剧,融合了苗族的歌舞和故事传说。",
      "sentence_pinyin": "Miáojù shì Guìzhōu Miáozú de chuántǒng xìjù, rónghé le Miáozú de gēwǔ hé gùshì chuánshuō.",
      "sentence_fr": "L'opéra Miao est un théâtre traditionnel de l'ethnie Miao du Guizhou, combinant chants, danses et légendes Miao.",
      "sentence_en": "Miao opera is a traditional theater of the Miao ethnic group in Guizhou, combining Miao songs, dances, and legends.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "miao_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府建设的农村文化活动中心丰富了村民的精神文化生活。",
      "sentence_pinyin": "Zhèngfǔ jiànshè de nóngcūn wénhuà huódòng zhōngxīn fēngfù le cūnmín de jīngshén wénhuà shēnghuó.",
      "sentence_fr": "Les centres d'activités culturelles rurales construits par le gouvernement ont enrichi la vie culturelle des villageois.",
      "sentence_en": "The government-built rural cultural activity centers have enriched villagers' cultural and spiritual life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_culture_centers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能面包机可以自动揉面、发酵和烘烤,轻松制作新鲜面包。",
      "sentence_pinyin": "Zhìnéng miànbāojī kěyǐ zìdòng róumiàn, fājiào hé hōngkǎo, qīngsōng zhìzuò xīnxiān miànbāo.",
      "sentence_fr": "La machine à pain intelligente peut automatiquement pétrir, lever et cuire, préparant facilement du pain frais.",
      "sentence_en": "The smart bread maker can automatically knead, ferment, and bake, easily making fresh bread.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bread_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的虎头鞋以其可爱的造型和吉祥的寓意深受欢迎。",
      "sentence_pinyin": "Zhōngguó chuántǒng de hǔtóuxié yǐ qí kě'ài de zàoxíng hé jíxiáng de yùyì shēn shòu huānyíng.",
      "sentence_fr": "Les chaussures traditionnelles chinoises en forme de tête de tigre sont très populaires pour leur forme mignonne et leur signification porte-bonheur.",
      "sentence_en": "Traditional Chinese tiger-head shoes are popular for their cute shape and auspicious meaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tiger_head_shoes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能体脂秤可以测量多项身体指标,帮助用户科学管理体重。",
      "sentence_pinyin": "Zhìnéng tǐzhīchèng kěyǐ cèliáng duō xiàng shēntǐ zhǐbiāo, bāngzhù yònghù kēxué guǎnlǐ tǐzhòng.",
      "sentence_fr": "La balance intelligente peut mesurer plusieurs indicateurs corporels, aidant les utilisateurs à gérer leur poids scientifiquement.",
      "sentence_en": "The smart body fat scale can measure multiple body indicators, helping users manage weight scientifically.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_body_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "维吾尔族的木卡姆艺术是中国重要的非物质文化遗产之一。",
      "sentence_pinyin": "Wéiwú'ěrzú de Mùkǎmǔ yìshù shì Zhōngguó zhòngyào de fēi wùzhì wénhuà yíchǎn zhī yī.",
      "sentence_fr": "L'art du Muqam ouïghour est l'un des patrimoines culturels immatériels importants de la Chine.",
      "sentence_en": "Uyghur Muqam art is one of China's important intangible cultural heritages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "muqam_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的透水人行道可以让雨水自然渗入地下,补充地下水资源。",
      "sentence_pinyin": "Chéngshì de tòushuǐ rénxíngdào kěyǐ ràng yǔshuǐ zìrán shènrù dìxià, bǔchōng dìxià shuǐ zīyuán.",
      "sentence_fr": "Les trottoirs perméables urbains permettent à l'eau de pluie de s'infiltrer naturellement, reconstituant les ressources en eau souterraine.",
      "sentence_en": "Urban permeable sidewalks allow rainwater to naturally seep underground, replenishing groundwater resources.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "permeable_pavements",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能颈椎按摩仪可以通过脉冲和热敷缓解颈部僵硬。",
      "sentence_pinyin": "Zhìnéng jǐngzhuī ànmóyí kěyǐ tōngguò màichōng hé rèfū huǎnjiě jǐngbù jiāngyìng.",
      "sentence_fr": "Le masseur cervical intelligent peut soulager la raideur du cou par impulsions et chaleur.",
      "sentence_en": "The smart neck massager can relieve neck stiffness through pulse and heat compression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_neck_massagers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的织锦工艺以南京云锦和苏州宋锦最为著名。",
      "sentence_pinyin": "Zhōngguó chuántǒng de zhījǐn gōngyì yǐ Nánjīng Yúnjǐn hé Sūzhōu Sòngjǐn zuìwéi zhùmíng.",
      "sentence_fr": "L'artisanat traditionnel chinois du brocart est le plus célèbre pour le Yunjin de Nanjing et le Songjin de Suzhou.",
      "sentence_en": "Traditional Chinese brocade weaving is most famous for Nanjing Yunjin and Suzhou Songjin.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "brocade_weaving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能除螨仪可以深层清洁床铺,去除尘螨和过敏原。",
      "sentence_pinyin": "Zhìnéng chúmǎnyí kěyǐ shēncéng qīngjié chuángpù, qùchú chénmǎn hé guòmǐnyuán.",
      "sentence_fr": "L'appareil anti-acariens intelligent peut nettoyer en profondeur le lit, éliminant les acariens et les allergènes.",
      "sentence_en": "The smart mite remover can deep clean bedding, removing dust mites and allergens.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mite_removers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈萨克族的阿肯弹唱是草原上流传的即兴表演艺术。",
      "sentence_pinyin": "Hāsàkèzú de Ākěn tánchàng shì cǎoyuán shàng liúchuán de jíxìng biǎoyǎn yìshù.",
      "sentence_fr": "Le chant et la récitation Aken des Kazakhs est un art de performance improvisée transmis dans les prairies.",
      "sentence_en": "Kazakh Aken singing and recitation is an improvisational performance art passed down on the grasslands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "aken_singing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展的垃圾分类宣传活动提高了居民的环保意识。",
      "sentence_pinyin": "Shèqū kāizhǎn de lājī fēnlèi xuānchuán huódòng tígāo le jūmín de huánbǎo yìshí.",
      "sentence_fr": "Les campagnes de sensibilisation au tri des déchets menées par la communauté ont renforcé la conscience environnementale des résidents.",
      "sentence_en": "The community's waste sorting awareness campaigns have improved residents' environmental consciousness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电压力锅可以快速烹饪食物,同时保留营养成分。",
      "sentence_pinyin": "Zhìnéng diàn yālìguō kěyǐ kuàisù pēngrèn shíwù, tóngshí bǎoliú yíngyǎng chéngfèn.",
      "sentence_fr": "L'autocuiseur électrique intelligent peut cuire rapidement les aliments tout en préservant les nutriments.",
      "sentence_en": "The smart electric pressure cooker can quickly cook food while preserving nutrients.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pressure_cookers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的灯笼制作工艺在春节期间展示出其独特的魅力。",
      "sentence_pinyin": "Zhōngguó chuántǒng de dēnglóng zhìzuò gōngyì zài Chūnjié qījiān zhǎnshì chū qí dútè de mèilì.",
      "sentence_fr": "L'artisanat traditionnel chinois de fabrication de lanternes dévoile son charme unique pendant le Nouvel An chinois.",
      "sentence_en": "Traditional Chinese lantern making craftsmanship displays its unique charm during the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lantern_craftsmanship",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
