{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠缠单子是量子网络中的基本资源单元。",
      "sentence_pinyin": "Liàngzǐ jiūchán dānzǐ shì liàngzǐ wǎngluò zhōng de jīběn zīyuán dānyuán.",
      "sentence_fr": "Les unités d'intrication quantique sont les unités de ressources fondamentales dans les réseaux quantiques.",
      "sentence_en": "Quantum entanglement units are fundamental resource units in quantum networks.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_units",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "决策迪菲-赫尔曼假设是许多密码协议的安全基础。",
      "sentence_pinyin": "Juécè Dífēi-Hè'ěrmàn jiǎshè shì xǔduō mìmǎ xiéyì de ānquán jīchǔ.",
      "sentence_fr": "L'hypothèse décisionnelle de Diffie-Hellman est le fondement de sécurité de nombreux protocoles cryptographiques.",
      "sentence_en": "The decisional Diffie-Hellman assumption is the security foundation of many cryptographic protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ddh_assumption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型同构表明两个类型在结构上完全等价。",
      "sentence_pinyin": "Lèixíng tónggòu biǎomíng liǎng gè lèixíng zài jiégòu shàng wánquán děngjià.",
      "sentence_fr": "L'isomorphisme de types indique que deux types sont structurellement complètement équivalents.",
      "sentence_en": "Type isomorphism indicates two types are structurally completely equivalent.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_isomorphism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "紧致性是拓扑空间的重要整体性质。",
      "sentence_pinyin": "Jǐnzhìxìng shì tuòpū kōngjiān de zhòngyào zhěngtǐ xìngzhì.",
      "sentence_fr": "La compacité est une propriété globale importante des espaces topologiques.",
      "sentence_en": "Compactness is an important global property of topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_compactness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子复杂度类BQP包含量子计算机能高效解决的问题。",
      "sentence_pinyin": "Liàngzǐ fùzádù lèi BQP bāohán liàngzǐ jìsuànjī néng gāoxiào jiějué de wèntí.",
      "sentence_fr": "La classe de complexité quantique BQP contient les problèmes que les ordinateurs quantiques peuvent résoudre efficacement.",
      "sentence_en": "Quantum complexity class BQP contains problems quantum computers can efficiently solve.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bqp_complexity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学习带误差问题是后量子密码学的基础困难问题。",
      "sentence_pinyin": "Xuéxí dài wùchā wèntí shì hòu liàngzǐ mìmǎxué de jīchǔ kùnnán wèntí.",
      "sentence_fr": "Le problème d'apprentissage avec erreurs est un problème difficile fondamental de la cryptographie post-quantique.",
      "sentence_en": "Learning with errors problem is a fundamental hard problem for post-quantum cryptography.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "learning_with_errors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型论中命题即类型原则统一了逻辑与计算。",
      "sentence_pinyin": "Lèixíng lùn zhōng mìngtí jí lèixíng yuánzé tǒngyī le luójí yǔ jìsuàn.",
      "sentence_fr": "Le principe des propositions comme types en théorie des types unifie la logique et le calcul.",
      "sentence_en": "The propositions-as-types principle in type theory unifies logic and computation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "propositions_as_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "连通性描述拓扑空间能否被分成不相交的开集。",
      "sentence_pinyin": "Liántōngxìng miáoshù tuòpū kōngjiān néng fǒu bèi fēn chéng bù xiāngjiāo de kāi jí.",
      "sentence_fr": "La connexité décrit si un espace topologique peut être divisé en ensembles ouverts disjoints.",
      "sentence_en": "Connectedness describes whether a topological space can be divided into disjoint open sets.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_connectedness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠度量化不同纠缠态之间的转换效率。",
      "sentence_pinyin": "Liàngzǐ jiūchán dù liànghuà bùtóng jiūchán tài zhījiān de zhuǎnhuàn xiàolǜ.",
      "sentence_fr": "Les mesures d'intrication quantique quantifient l'efficacité de conversion entre différents états intriqués.",
      "sentence_en": "Quantum entanglement measures quantify conversion efficiency between different entangled states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_measures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算性迪菲-赫尔曼假设比决策版本弱但更易满足。",
      "sentence_pinyin": "Jìsuànxìng Dífēi-Hè'ěrmàn jiǎshè bǐ juécè bǎnběn ruò dàn gèng yì mǎnzú.",
      "sentence_fr": "L'hypothèse computationnelle de Diffie-Hellman est plus faible que la version décisionnelle mais plus facile à satisfaire.",
      "sentence_en": "Computational Diffie-Hellman assumption is weaker than decisional version but easier to satisfy.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cdh_assumption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型规则定义如何推导和验证程序表达式的类型。",
      "sentence_pinyin": "Lèixíng guīzé dìngyì rúhé tuīdǎo hé yànzhèng chéngxù biǎodáshì de lèixíng.",
      "sentence_fr": "Les règles de type définissent comment dériver et vérifier les types des expressions de programme.",
      "sentence_en": "Type rules define how to derive and verify types of program expressions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_rules",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "正则性假设拓扑空间中点和闭集能被开集分离。",
      "sentence_pinyin": "Zhèngzéxìng jiǎshè tuòpū kōngjiān zhōng diǎn hé bì jí néng bèi kāi jí fēnlí.",
      "sentence_fr": "La régularité suppose que les points et les ensembles fermés dans les espaces topologiques peuvent être séparés par des ensembles ouverts.",
      "sentence_en": "Regularity assumes points and closed sets in topological spaces can be separated by open sets.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_regularity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子态纯化将混合态表示为更大系统纯态的部分追迹。",
      "sentence_pinyin": "Liàngzǐ tài chúnhuà jiāng hùnhé tài biǎoshì wéi gèng dà xìtǒng chún tài de bùfèn zhuījì.",
      "sentence_fr": "La purification d'état quantique représente les états mixtes comme des traces partielles d'états purs de systèmes plus grands.",
      "sentence_en": "Quantum state purification represents mixed states as partial traces of pure states of larger systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "state_purification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "随机可提取承诺可以模拟理想功能下的安全承诺。",
      "sentence_pinyin": "Suíjī kě tíqǔ chéngnuò kěyǐ mónǐ lǐxiǎng gōngnéng xià de ānquán chéngnuò.",
      "sentence_fr": "Les engagements extractibles aléatoires peuvent simuler des engagements sécurisés sous une fonctionnalité idéale.",
      "sentence_en": "Randomly extractable commitments can simulate secure commitments under ideal functionality.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "extractable_commitments_random",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型判断指定在给定上下文中表达式具有某种类型。",
      "sentence_pinyin": "Lèixíng pànduàn zhǐdìng zài gěidìng shàngxiàwén zhōng biǎodáshì jùyǒu mǒu zhǒng lèixíng.",
      "sentence_fr": "Les jugements de type spécifient qu'une expression a un certain type dans un contexte donné.",
      "sentence_en": "Type judgments specify that an expression has a certain type in a given context.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_judgments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "豪斯多夫空间要求任意两个不同点可被开集分离。",
      "sentence_pinyin": "Háosīduōfū kōngjiān yāoqiú rènyì liǎng gè bùtóng diǎn kě bèi kāi jí fēnlí.",
      "sentence_fr": "Les espaces de Hausdorff exigent que deux points distincts quelconques puissent être séparés par des ensembles ouverts.",
      "sentence_en": "Hausdorff spaces require any two distinct points can be separated by open sets.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hausdorff_spaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子不可克隆定理禁止完美复制未知量子态。",
      "sentence_pinyin": "Liàngzǐ bùkě kèlóng dìnglǐ jìnzhǐ wánměi fùzhì wèizhī liàngzǐ tài.",
      "sentence_fr": "Le théorème de non-clonage quantique interdit la copie parfaite d'états quantiques inconnus.",
      "sentence_en": "The quantum no-cloning theorem prohibits perfect copying of unknown quantum states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "no_cloning_theorem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协议模拟器在安全证明中模拟诚实方与攻击者的交互。",
      "sentence_pinyin": "Xiéyì mónǐqì zài ānquán zhèngmíng zhōng mónǐ chéngshí fāng yǔ gōngjīzhě de jiāohù.",
      "sentence_fr": "Les simulateurs de protocole simulent l'interaction entre les parties honnêtes et l'attaquant dans les preuves de sécurité.",
      "sentence_en": "Protocol simulators simulate interaction between honest parties and attackers in security proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "protocol_simulators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型安全保证良类型程序不会产生运行时类型错误。",
      "sentence_pinyin": "Lèixíng ānquán bǎozhèng liáng lèixíng chéngxù bù huì chǎnshēng yùnxíng shí lèixíng cuòwù.",
      "sentence_fr": "La sûreté de type garantit que les programmes bien typés ne produisent pas d'erreurs de type à l'exécution.",
      "sentence_en": "Type safety guarantees well-typed programs do not produce runtime type errors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_safety",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "度量空间用距离函数定义点之间的接近程度。",
      "sentence_pinyin": "Dùliàng kōngjiān yòng jùlí hánshù dìngyì diǎn zhījiān de jiējìn chéngdù.",
      "sentence_fr": "Les espaces métriques définissent la proximité entre les points à l'aide d'une fonction de distance.",
      "sentence_en": "Metric spaces define proximity between points using a distance function.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "metric_spaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
