{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "卡拉比-丘流形是弦理论中紧致化额外维度的候选空间。",
      "sentence_pinyin": "Kǎlābǐ-Qiū liúxíng shì xián lǐlùn zhōng jǐnzhìhuà éwài wéidù de hòuxuǎn kōngjiān.",
      "sentence_fr": "Les variétés de Calabi-Yau sont des espaces candidats pour la compactification des dimensions supplémentaires en théorie des cordes.",
      "sentence_en": "Calabi-Yau manifolds are candidate spaces for compactifying extra dimensions in string theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "calabi_yau_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可验证随机函数产生可证明公平且不可预测的伪随机输出。",
      "sentence_pinyin": "Kě yànzhèng suíjī hánshù chǎnshēng kě zhèngmíng gōngpíng qiě bùkě yùcè de wěi suíjī shūchū.",
      "sentence_fr": "Les fonctions aléatoires vérifiables produisent des sorties pseudo-aléatoires prouvablement équitables et imprévisibles.",
      "sentence_en": "Verifiable random functions produce provably fair and unpredictable pseudo-random outputs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "verifiable_random_functions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "子结构类型系统限制变量的使用次数和使用顺序。",
      "sentence_pinyin": "Zǐ jiégòu lèixíng xìtǒng xiànzhì biànliàng de shǐyòng cìshù hé shǐyòng shùnxù.",
      "sentence_fr": "Les systèmes de types sous-structurels limitent le nombre d'utilisations et l'ordre d'utilisation des variables.",
      "sentence_en": "Substructural type systems restrict the number of uses and order of use of variables.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "substructural_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "导出范畴在代数几何中用于研究上同调和态射复形。",
      "sentence_pinyin": "Dǎochū fànchóu zài dàishù jǐhé zhōng yòng yú yánjiū shàngtóngyú hé tàishè fùxíng.",
      "sentence_fr": "Les catégories dérivées sont utilisées en géométrie algébrique pour étudier la cohomologie et les complexes de morphismes.",
      "sentence_en": "Derived categories are used in algebraic geometry to study cohomology and morphism complexes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "derived_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子密钥分发利用量子力学原理实现理论上无条件安全的密钥交换。",
      "sentence_pinyin": "Liàngzǐ mìyào fēnfā lìyòng liàngzǐ lìxué yuánlǐ shíxiàn lǐlùn shàng wú tiáojiàn ānquán de mìyào jiāohuàn.",
      "sentence_fr": "La distribution de clés quantiques utilise les principes de la mécanique quantique pour réaliser un échange de clés théoriquement inconditionnellement sûr.",
      "sentence_en": "Quantum key distribution uses quantum mechanics principles to achieve theoretically unconditionally secure key exchange.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_key_distribution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可区分混淆将程序转换为功能等价但无法理解其实现的形式。",
      "sentence_pinyin": "Bùkě qūfēn hùnxiáo jiāng chéngxù zhuǎnhuàn wéi gōngnéng děngjià dàn wúfǎ lǐjiě qí shíxiàn de xíngshì.",
      "sentence_fr": "L'obfuscation indistinguable transforme les programmes en formes fonctionnellement équivalentes mais dont l'implémentation est incompréhensible.",
      "sentence_en": "Indistinguishability obfuscation transforms programs into functionally equivalent forms whose implementation cannot be understood.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "indistinguishability_obfuscation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "路径依赖类型允许类型引用封闭对象中其他成员的类型。",
      "sentence_pinyin": "Lùjìng yīlài lèixíng yǔnxǔ lèixíng yǐnyòng fēngbì duìxiàng zhōng qítā chéngyuán de lèixíng.",
      "sentence_fr": "Les types dépendant du chemin permettent aux types de référencer les types d'autres membres dans l'objet englobant.",
      "sentence_en": "Path-dependent types allow types to reference types of other members in the enclosing object.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "path_dependent_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同调代数研究链复形和导出函子的性质。",
      "sentence_pinyin": "Tóngyú dàishù yánjiū liàn fùxíng hé dǎochū hánzǐ de xìngzhì.",
      "sentence_fr": "L'algèbre homologique étudie les propriétés des complexes de chaînes et des foncteurs dérivés.",
      "sentence_en": "Homological algebra studies properties of chain complexes and derived functors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homological_algebra",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子隐形传态在不传输物理粒子的情况下传递量子状态信息。",
      "sentence_pinyin": "Liàngzǐ yǐnxíng chuántài zài bù chuánshū wùlǐ lìzǐ de qíngkuàng xià chuándì liàngzǐ zhuàngtài xìnxī.",
      "sentence_fr": "La téléportation quantique transfère l'information d'état quantique sans transmettre de particules physiques.",
      "sentence_en": "Quantum teleportation transmits quantum state information without transmitting physical particles.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_teleportation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "遗忘性随机存取机器隐藏数据访问模式以防止侧信道攻击。",
      "sentence_pinyin": "Yíwàngxìng suíjī cúnqǔ jīqì yǐncáng shùjù fǎngwèn móshì yǐ fángzhǐ cè xìndào gōngjī.",
      "sentence_fr": "Les machines d'accès aléatoire oblivious cachent les modèles d'accès aux données pour prévenir les attaques par canaux auxiliaires.",
      "sentence_en": "Oblivious RAM hides data access patterns to prevent side-channel attacks.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "oblivious_ram",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "会话类型在类型系统中编码通信协议的结构和顺序。",
      "sentence_pinyin": "Huìhuà lèixíng zài lèixíng xìtǒng zhōng biānmǎ tōngxìn xiéyì de jiégòu hé shùnxù.",
      "sentence_fr": "Les types de session encodent la structure et l'ordre des protocoles de communication dans les systèmes de types.",
      "sentence_en": "Session types encode communication protocol structure and sequence in type systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "session_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "稳定无穷范畴是导出代数几何和拓扑的核心工具。",
      "sentence_pinyin": "Wěndìng wúqióng fànchóu shì dǎochū dàishù jǐhé hé tuòpū de héxīn gōngjù.",
      "sentence_fr": "Les catégories infinies stables sont des outils essentiels en géométrie algébrique dérivée et en topologie.",
      "sentence_en": "Stable infinity categories are core tools in derived algebraic geometry and topology.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "stable_infinity_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子优越性展示了量子系统在特定问题上的计算优势。",
      "sentence_pinyin": "Liàngzǐ yōuyuèxìng zhǎnshì le liàngzǐ xìtǒng zài tèdìng wèntí shàng de jìsuàn yōushì.",
      "sentence_fr": "L'avantage quantique démontre les avantages computationnels des systèmes quantiques sur des problèmes spécifiques.",
      "sentence_en": "Quantum advantage demonstrates computational advantages of quantum systems on specific problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_advantage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可否认加密允许产生多个似是而非的明文解释同一密文。",
      "sentence_pinyin": "Kě fǒurèn jiāmì yǔnxǔ chǎnshēng duō gè sì shì ér fēi de míngwén jiěshì tóngyī mìwén.",
      "sentence_fr": "Le chiffrement déniable permet de produire plusieurs interprétations plausibles du texte clair pour un même texte chiffré.",
      "sentence_en": "Deniable encryption allows producing multiple plausible plaintext interpretations of the same ciphertext.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "deniable_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "液态类型结合静态类型检查和运行时精化类型验证。",
      "sentence_pinyin": "Yètài lèixíng jiéhé jìngtài lèixíng jiǎnchá hé yùnxíng shí jīnghuà lèixíng yànzhèng.",
      "sentence_fr": "Les types liquides combinent la vérification de type statique avec la vérification de type raffiné à l'exécution.",
      "sentence_en": "Liquid types combine static type checking with runtime refinement type verification.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "liquid_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "谱序列是计算同调和上同调群的强大代数工具。",
      "sentence_pinyin": "Pǔ xùliè shì jìsuàn tóngyúqún hé shàngtóngyúqún de qiángdà dàishù gōngjù.",
      "sentence_fr": "Les suites spectrales sont de puissants outils algébriques pour calculer les groupes d'homologie et de cohomologie.",
      "sentence_en": "Spectral sequences are powerful algebraic tools for computing homology and cohomology groups.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "spectral_sequences",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子随机数发生器利用量子过程的内在随机性产生真随机数。",
      "sentence_pinyin": "Liàngzǐ suíjī shù fāshēngqì lìyòng liàngzǐ guòchéng de nèizài suíjīxìng chǎnshēng zhēn suíjī shù.",
      "sentence_fr": "Les générateurs de nombres aléatoires quantiques exploitent le caractère aléatoire intrinsèque des processus quantiques pour produire de vrais nombres aléatoires.",
      "sentence_en": "Quantum random number generators exploit the intrinsic randomness of quantum processes to produce true random numbers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_random_generators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可信执行环境提供硬件级别的代码和数据隔离保护。",
      "sentence_pinyin": "Kěxìn zhíxíng huánjìng tígōng yìngjiàn jíbié de dàimǎ hé shùjù gélí bǎohù.",
      "sentence_fr": "Les environnements d'exécution de confiance fournissent une protection de l'isolation du code et des données au niveau matériel.",
      "sentence_en": "Trusted execution environments provide hardware-level code and data isolation protection.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "trusted_execution_environments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "归一化类型系统确保所有良类型程序终止。",
      "sentence_pinyin": "Guīyīhuà lèixíng xìtǒng quèbǎo suǒyǒu liáng lèixíng chéngxù zhōngzhǐ.",
      "sentence_fr": "Les systèmes de types normalisants garantissent que tous les programmes bien typés se terminent.",
      "sentence_en": "Normalizing type systems ensure all well-typed programs terminate.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "normalizing_type_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模空间参数化给定约束下所有几何对象的等价类。",
      "sentence_pinyin": "Mó kōngjiān cānshùhuà gěidìng yuēshù xià suǒyǒu jǐhé duìxiàng de děngjià lèi.",
      "sentence_fr": "Les espaces de modules paramétrisent les classes d'équivalence de tous les objets géométriques sous des contraintes données.",
      "sentence_en": "Moduli spaces parameterize equivalence classes of all geometric objects under given constraints.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "moduli_spaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
