{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧农业平台整合了天气预报、病虫害预警和市场行情信息。",
      "sentence_pinyin": "Zhège zhìhuì nóngyè píngtái zhěnghéle tiānqì yùbào, bìngchónghài yùjǐng hé shìchǎng hángqíng xìnxī.",
      "sentence_fr": "Cette plateforme d'agriculture intelligente intègre les prévisions météorologiques, les alertes de maladies et de ravageurs, et les informations sur le marché.",
      "sentence_en": "This smart agriculture platform integrates weather forecasts, pest and disease alerts, and market information.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_agriculture",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在豫剧表演中将声腔艺术和表演技巧完美融合。",
      "sentence_pinyin": "Tā zài yùjù biǎoyǎn zhōng jiāng shēngqiāng yìshù hé biǎoyǎn jìqiǎo wánměi rónghé.",
      "sentence_fr": "Dans sa performance d'opéra Henan, elle a parfaitement fusionné l'art vocal et les techniques de jeu.",
      "sentence_en": "In her Henan Opera performance, she perfectly fused vocal art and performance techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "henan_opera",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个交通信号优化系统根据实时路况动态调整红绿灯时长。",
      "sentence_pinyin": "Zhège jiāotōng xìnhào yōuhuà xìtǒng gēnjù shíshí lùkuàng dòngtài tiáozhěng hónglǜdēng shícháng.",
      "sentence_fr": "Ce système d'optimisation des feux de circulation ajuste dynamiquement la durée des feux selon les conditions routières en temps réel.",
      "sentence_en": "This traffic signal optimization system dynamically adjusts traffic light duration based on real-time road conditions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "traffic_optimization",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在悬疑小说写作中善于设置悬念和反转情节。",
      "sentence_pinyin": "Tā zài xuányí xiǎoshuō xiězuò zhōng shànyú shèzhì xuánniàn hé fǎnzhuǎn qíngjié.",
      "sentence_fr": "Dans l'écriture de romans à suspense, il excelle à créer du suspense et des rebondissements.",
      "sentence_en": "In suspense novel writing, he excels at creating suspense and plot twists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suspense_writing",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个母婴护理中心为新手父母提供专业的育儿指导服务。",
      "sentence_pinyin": "Zhège mǔyīng hùlǐ zhōngxīn wèi xīnshǒu fùmǔ tígōng zhuānyè de yù'ér zhǐdǎo fúwù.",
      "sentence_fr": "Ce centre de soins maternels et infantiles fournit des services de guidance parentale professionnels aux nouveaux parents.",
      "sentence_en": "This maternal and infant care center provides professional parenting guidance services to new parents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maternal_care",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的建筑模型制作精细准确，真实再现了设计方案的每个细节。",
      "sentence_pinyin": "Tā de jiànzhù móxíng zhìzuò jīngxì zhǔnquè, zhēnshí zàixiànle shèjì fāng'àn de měi gè xìjié.",
      "sentence_fr": "Sa fabrication de maquettes architecturales est fine et précise, reproduisant fidèlement chaque détail du projet de conception.",
      "sentence_en": "Her architectural model making is fine and accurate, faithfully reproducing every detail of the design plan.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "architectural_models",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生物多样性保护区为濒危物种提供了安全的栖息环境。",
      "sentence_pinyin": "Zhège shēngwù duōyàngxìng bǎohù qū wèi bīnwēi wùzhǒng tígōngle ānquán de qīxī huánjìng.",
      "sentence_fr": "Cette zone de protection de la biodiversité fournit un environnement d'habitat sûr pour les espèces en danger.",
      "sentence_en": "This biodiversity protection zone provides a safe habitat environment for endangered species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biodiversity",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在跆拳道比赛中凭借精准的腿法和灵活的步伐获胜。",
      "sentence_pinyin": "Tā zài táiquándào bǐsài zhōng píngjie jīngzhǔn de tuǐfǎ hé línghuó de bùfá huòshèng.",
      "sentence_fr": "Il a gagné le tournoi de taekwondo grâce à des coups de pied précis et des pas agiles.",
      "sentence_en": "He won the taekwondo tournament with precise kicks and agile footwork.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "taekwondo",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职工培训学院开设了技能提升和职业转型课程。",
      "sentence_pinyin": "Zhège zhígōng péixùn xuéyuàn kāishèle jìnéng tíshēng hé zhíyè zhuǎnxíng kèchéng.",
      "sentence_fr": "Cette école de formation des employés propose des cours d'amélioration des compétences et de reconversion professionnelle.",
      "sentence_en": "This employee training college offers skill enhancement and career transition courses.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "employee_training",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在玉石雕刻中运用了圆雕、浮雕和镂空等多种技法。",
      "sentence_pinyin": "Tā zài yùshí diāokè zhōng yùnyòngle yuándiāo, fúdiāo hé lòukōng děng duō zhǒng jìfǎ.",
      "sentence_fr": "Dans la sculpture de jade, elle a utilisé diverses techniques comme la ronde-bosse, le relief et l'ajourage.",
      "sentence_en": "In jade carving, she used various techniques such as round carving, relief, and openwork.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jade_carving",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能门禁系统支持人脸识别、指纹和门禁卡多种验证方式。",
      "sentence_pinyin": "Zhège zhìnéng ménjìn xìtǒng zhīchí rénliǎn shíbié, zhǐwén hé ménjìn kǎ duō zhǒng yànzhèng fāngshì.",
      "sentence_fr": "Ce système de contrôle d'accès intelligent prend en charge plusieurs méthodes de vérification comme la reconnaissance faciale, les empreintes digitales et les cartes d'accès.",
      "sentence_en": "This smart access control system supports multiple verification methods including facial recognition, fingerprints, and access cards.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "access_control",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在笙演奏中展现了和声丰富和音色独特的艺术魅力。",
      "sentence_pinyin": "Tā zài shēng yǎnzòu zhōng zhǎnxiànle héshēng fēngfù hé yīnsè dútè de yìshù mèilì.",
      "sentence_fr": "Il a démontré le charme artistique des harmonies riches et du timbre unique dans son jeu de sheng.",
      "sentence_en": "He demonstrated the artistic charm of rich harmonies and unique timbre in his sheng performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_music",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个工业废水处理厂采用了生化和物化相结合的处理工艺。",
      "sentence_pinyin": "Zhège gōngyè fèishuǐ chǔlǐ chǎng cǎiyòngle shēnghuà hé wùhuà xiāng jiéhé de chǔlǐ gōngyì.",
      "sentence_fr": "Cette usine de traitement des eaux usées industrielles adopte un processus de traitement combinant méthodes biologiques et physico-chimiques.",
      "sentence_en": "This industrial wastewater treatment plant adopts a treatment process combining biological and physicochemical methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wastewater_treatment",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的纤维艺术作品用纺织材料表达了对自然和生命的感悟。",
      "sentence_pinyin": "Tā de xiānwéi yìshù zuòpǐn yòng fǎngzhī cáiliào biǎodále duì zìrán hé shēngmìng de gǎnwù.",
      "sentence_fr": "Ses œuvres d'art textile expriment avec des matériaux textiles sa compréhension de la nature et de la vie.",
      "sentence_en": "Her fiber art works express with textile materials her insights into nature and life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fiber_art",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地下综合管廊集中敷设了供水、供电和通信等多种管线。",
      "sentence_pinyin": "Zhège dìxià zōnghé guǎnláng jízhōng fūshèle gōngshuǐ, gōngdiàn hé tōngxìn děng duō zhǒng guǎnxiàn.",
      "sentence_fr": "Ce corridor de services publics souterrain intégré concentre divers conduits comme l'eau, l'électricité et les communications.",
      "sentence_en": "This underground integrated utility corridor concentrates various pipelines such as water supply, power supply, and communications.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "utility_corridors",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在戏剧导演工作中注重演员表演和舞台调度的统一。",
      "sentence_pinyin": "Tā zài xìjù dǎoyǎn gōngzuò zhōng zhùzhòng yǎnyuán biǎoyǎn hé wǔtái diàodù de tǒngyī.",
      "sentence_fr": "Dans son travail de mise en scène théâtrale, il met l'accent sur l'unité entre le jeu des acteurs et la mise en scène.",
      "sentence_en": "In his theater directing work, he emphasizes the unity between actor performance and stage blocking.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "theater_directing",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个志愿者管理平台帮助组织招募、培训和调配志愿者资源。",
      "sentence_pinyin": "Zhège zhìyuànzhě guǎnlǐ píngtái bāngzhù zǔzhī zhāomù, péixùn hé diàopèi zhìyuànzhě zīyuán.",
      "sentence_fr": "Cette plateforme de gestion des bénévoles aide les organisations à recruter, former et allouer les ressources bénévoles.",
      "sentence_en": "This volunteer management platform helps organizations recruit, train, and allocate volunteer resources.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volunteer_management",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在蹦床运动中掌握了空中翻转和扭转的高难度技术动作。",
      "sentence_pinyin": "Tā zài bèngchuáng yùndòng zhōng zhǎngwòle kōngzhōng fānzhuǎn hé niǔzhuǎn de gāo nándù jìshù dòngzuò.",
      "sentence_fr": "Dans le trampoline, elle a maîtrisé des mouvements techniques difficiles de retournement et de vrille aériens.",
      "sentence_en": "In trampoline, she mastered difficult technical movements of aerial flips and twists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "trampoline",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个知识产权保护平台为创新成果提供专利申请和维权服务。",
      "sentence_pinyin": "Zhège zhīshi chǎnquán bǎohù píngtái wèi chuàngxīn chéngguǒ tígōng zhuānlì shēnqǐng hé wéiquán fúwù.",
      "sentence_fr": "Cette plateforme de protection de la propriété intellectuelle fournit des services de demande de brevet et de protection des droits pour les résultats innovants.",
      "sentence_en": "This intellectual property protection platform provides patent application and rights protection services for innovative achievements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ip_protection",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在骨雕艺术中将微雕技艺和传统纹饰巧妙融合。",
      "sentence_pinyin": "Tā zài gǔdiāo yìshù zhōng jiāng wēidiāo jìyì hé chuántǒng wénshì qiǎomiào rónghé.",
      "sentence_fr": "Dans l'art de la sculpture sur os, il fusionne habilement les techniques de micro-sculpture et les motifs traditionnels.",
      "sentence_en": "In bone carving art, he skillfully fuses micro-carving techniques and traditional patterns.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bone_carving",
      "created_at": "2025-11-20T19:25:00.000Z",
      "updated_at": "2025-11-20T19:25:00.000Z"
    }
  ]
}
