{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "计量经济学将统计方法应用于经济数据以检验理论假设和进行预测。",
      "sentence_pinyin": "Jìliàng jīngjìxué jiāng tǒngjì fāngfǎ yìngyòng yú jīngjì shùjù yǐ jiǎnyàn lǐlùn jiǎshè hé jìnxíng yùcè.",
      "sentence_fr": "L'économétrie applique des méthodes statistiques aux données économiques pour tester les hypothèses théoriques et faire des prévisions.",
      "sentence_en": "Econometrics applies statistical methods to economic data to test theoretical hypotheses and make predictions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "econometrics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人工神经网络的训练过程涉及通过反向传播算法调整连接权重。",
      "sentence_pinyin": "Réngōng shénjīng wǎngluò de xùnliàn guòchéng shèjí tōngguò fǎnxiàng chuánbō suànfǎ tiáozhěng liánjiē quánzhòng.",
      "sentence_fr": "Le processus d'entraînement des réseaux neuronaux artificiels implique l'ajustement des poids de connexion par l'algorithme de rétropropagation.",
      "sentence_en": "The training process of artificial neural networks involves adjusting connection weights through the backpropagation algorithm.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "neural_network_training",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "森林生态学研究森林群落的结构、动态和与环境的相互作用。",
      "sentence_pinyin": "Sēnlín shēngtàixué yánjiū sēnlín qúnluò de jiégòu, dòngtài hé yǔ huánjìng de xiānghù zuòyòng.",
      "sentence_fr": "L'écologie forestière étudie la structure, la dynamique des communautés forestières et leurs interactions avec l'environnement.",
      "sentence_en": "Forest ecology studies the structure, dynamics of forest communities and their interactions with the environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "forest_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "道德心理学研究人们如何形成道德判断和做出伦理决策。",
      "sentence_pinyin": "Dàodé xīnlǐxué yánjiū rénmen rúhé xíngchéng dàodé pànduàn hé zuòchū lúnlǐ juécè.",
      "sentence_fr": "La psychologie morale étudie comment les gens forment des jugements moraux et prennent des décisions éthiques.",
      "sentence_en": "Moral psychology studies how people form moral judgments and make ethical decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "moral_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "函数式编程范式强调不可变数据和纯函数以提高代码可预测性。",
      "sentence_pinyin": "Hánshùshì biānchéng fànshì qiángdiào bùkě biàn shùjù hé chún hánshù yǐ tígāo dàimǎ kě yùcèxìng.",
      "sentence_fr": "Le paradigme de programmation fonctionnelle met l'accent sur les données immuables et les fonctions pures pour améliorer la prévisibilité du code.",
      "sentence_en": "The functional programming paradigm emphasizes immutable data and pure functions to improve code predictability.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "functional_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地震学研究地震波传播以了解地球内部结构和预测地震活动。",
      "sentence_pinyin": "Dìzhènxué yánjiū dìzhèn bō chuánbō yǐ liǎojiě dìqiú nèibù jiégòu hé yùcè dìzhèn huódòng.",
      "sentence_fr": "La sismologie étudie la propagation des ondes sismiques pour comprendre la structure interne de la Terre et prédire l'activité sismique.",
      "sentence_en": "Seismology studies seismic wave propagation to understand Earth's internal structure and predict seismic activity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "seismology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "法律经济学分析法律规则如何影响经济效率和资源配置。",
      "sentence_pinyin": "Fǎlǜ jīngjìxué fēnxī fǎlǜ guīzé rúhé yǐngxiǎng jīngjì xiàolǜ hé zīyuán pèizhì.",
      "sentence_fr": "L'analyse économique du droit étudie comment les règles juridiques affectent l'efficacité économique et l'allocation des ressources.",
      "sentence_en": "Law and economics analyzes how legal rules affect economic efficiency and resource allocation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "law_and_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "内分泌学研究激素系统如何调节身体的新陈代谢和生理功能。",
      "sentence_pinyin": "Nèifēnmì xué yánjiū jīsù xìtǒng rúhé tiáojié shēntǐ de xīnchén dàixiè hé shēnglǐ gōngnéng.",
      "sentence_fr": "L'endocrinologie étudie comment le système hormonal régule le métabolisme et les fonctions physiologiques du corps.",
      "sentence_en": "Endocrinology studies how the hormone system regulates the body's metabolism and physiological functions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "endocrinology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代码重构改善软件的内部结构而不改变其外部行为。",
      "sentence_pinyin": "Dàimǎ chónggòu gǎishàn ruǎnjiàn de nèibù jiégòu ér bù gǎibiàn qí wàibù xíngwéi.",
      "sentence_fr": "Le refactoring de code améliore la structure interne du logiciel sans modifier son comportement externe.",
      "sentence_en": "Code refactoring improves software's internal structure without changing its external behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "code_refactoring",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政治心理学研究政治态度、领导风格和选民行为的心理基础。",
      "sentence_pinyin": "Zhèngzhì xīnlǐxué yánjiū zhèngzhì tàidù, lǐngdǎo fēnggé hé xuǎnmín xíngwéi de xīnlǐ jīchǔ.",
      "sentence_fr": "La psychologie politique étudie les fondements psychologiques des attitudes politiques, des styles de leadership et du comportement électoral.",
      "sentence_en": "Political psychology studies the psychological foundations of political attitudes, leadership styles, and voter behavior.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "political_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态系统建模帮助科学家预测环境变化对生物群落的影响。",
      "sentence_pinyin": "Shēngtài xìtǒng jiànmó bāngzhù kēxuéjiā yùcè huánjìng biànhuà duì shēngwù qúnluò de yǐngxiǎng.",
      "sentence_fr": "La modélisation des écosystèmes aide les scientifiques à prédire l'impact des changements environnementaux sur les communautés biologiques.",
      "sentence_en": "Ecosystem modeling helps scientists predict the impact of environmental changes on biological communities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecosystem_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无障碍设计确保数字产品和服务可供残障人士使用。",
      "sentence_pinyin": "Wú zhàng'ài shèjì quèbǎo shùzì chǎnpǐn hé fúwù kě gōng cánzhàng rénshì shǐyòng.",
      "sentence_fr": "La conception accessible garantit que les produits et services numériques sont utilisables par les personnes handicapées.",
      "sentence_en": "Accessible design ensures digital products and services are usable by people with disabilities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "accessible_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "健康经济学评估医疗干预措施的成本效益和资源配置。",
      "sentence_pinyin": "Jiànkāng jīngjìxué pínggū yīliáo gānyù cuòshī de chéngběn xiàoyì hé zīyuán pèizhì.",
      "sentence_fr": "L'économie de la santé évalue le rapport coût-efficacité des interventions médicales et l'allocation des ressources.",
      "sentence_en": "Health economics evaluates the cost-effectiveness of medical interventions and resource allocation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "health_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微生物学研究细菌、病毒和真菌等微生物的生物学特性。",
      "sentence_pinyin": "Wēishēngwùxué yánjiū xìjūn, bìngdú hé zhēnjūn děng wēishēngwù de shēngwùxué tèxìng.",
      "sentence_fr": "La microbiologie étudie les caractéristiques biologiques des micro-organismes tels que les bactéries, les virus et les champignons.",
      "sentence_en": "Microbiology studies the biological characteristics of microorganisms such as bacteria, viruses, and fungi.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microbiology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "设计模式提供了软件开发中常见问题的经过验证的解决方案。",
      "sentence_pinyin": "Shèjì móshì tígōngle ruǎnjiàn kāifā zhōng chángjiàn wèntí de jīngguò yànzhèng de jiějué fāng'àn.",
      "sentence_fr": "Les modèles de conception fournissent des solutions éprouvées aux problèmes courants du développement logiciel.",
      "sentence_en": "Design patterns provide proven solutions to common problems in software development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "design_patterns",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学传播研究如何有效地向公众传达复杂的科学知识。",
      "sentence_pinyin": "Kēxué chuánbō yánjiū rúhé yǒuxiào de xiàng gōngzhòng chuándá fùzá de kēxué zhīshi.",
      "sentence_fr": "La communication scientifique étudie comment transmettre efficacement des connaissances scientifiques complexes au public.",
      "sentence_en": "Science communication studies how to effectively convey complex scientific knowledge to the public.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "science_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "免疫学研究免疫系统如何识别和对抗病原体和异常细胞。",
      "sentence_pinyin": "Miǎnyìxué yánjiū miǎnyì xìtǒng rúhé shíbié hé duìkàng bìngyuántǐ hé yìcháng xìbāo.",
      "sentence_fr": "L'immunologie étudie comment le système immunitaire reconnaît et combat les pathogènes et les cellules anormales.",
      "sentence_en": "Immunology studies how the immune system recognizes and fights pathogens and abnormal cells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immunology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "组织社会学研究正式组织的结构、过程和与环境的关系。",
      "sentence_pinyin": "Zǔzhī shèhuìxué yánjiū zhèngshì zǔzhī de jiégòu, guòchéng hé yǔ huánjìng de guānxì.",
      "sentence_fr": "La sociologie des organisations étudie la structure, les processus des organisations formelles et leur relation avec l'environnement.",
      "sentence_en": "Organizational sociology studies the structure, processes of formal organizations and their relationship with the environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organizational_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "并发编程需要仔细处理多个线程之间的同步和资源共享。",
      "sentence_pinyin": "Bìngfā biānchéng xūyào zǐxì chǔlǐ duō gè xiànchéng zhījiān de tóngbù hé zīyuán gòngxiǎng.",
      "sentence_fr": "La programmation concurrente nécessite une gestion attentive de la synchronisation et du partage des ressources entre plusieurs threads.",
      "sentence_en": "Concurrent programming requires careful handling of synchronization and resource sharing between multiple threads.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "concurrent_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "大气科学研究气象现象、气候模式和大气化学过程。",
      "sentence_pinyin": "Dàqì kēxué yánjiū qìxiàng xiànxiàng, qìhòu móshì hé dàqì huàxué guòchéng.",
      "sentence_fr": "Les sciences atmosphériques étudient les phénomènes météorologiques, les modèles climatiques et les processus chimiques atmosphériques.",
      "sentence_en": "Atmospheric science studies meteorological phenomena, climate patterns, and atmospheric chemical processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "atmospheric_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
