{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能体脂仪可以通过手机应用追踪用户的健康数据变化趋势。",
      "sentence_pinyin": "Zhège zhìnéng tǐzhīyí kěyǐ tōngguò shǒujī yìngyòng zhuīzōng yònghù de jiànkāng shùjù biànhuà qūshì.",
      "sentence_fr": "Cet analyseur de graisse corporelle intelligent peut suivre les tendances des données de santé via une application mobile.",
      "sentence_en": "This smart body fat analyzer can track user health data trends through a mobile app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_body_analyzers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水族的水书是中国少数民族中独特的象形文字系统。",
      "sentence_pinyin": "Shuǐzú de shuǐshū shì Zhōngguó shǎoshù mínzú zhōng dútè de xiàngxíng wénzì xìtǒng.",
      "sentence_fr": "L'écriture Shui de l'ethnie Sui est un système d'écriture pictographique unique parmi les minorités ethniques de Chine.",
      "sentence_en": "The Shui script of the Sui ethnic group is a unique pictographic writing system among China's ethnic minorities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shui_script",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的夜景灯光设计让古建筑在夜间展现出独特的魅力。",
      "sentence_pinyin": "Chéngshì de yèjǐng dēngguāng shèjì ràng gǔ jiànzhù zài yèjiān zhǎnxiàn chū dútè de mèilì.",
      "sentence_fr": "La conception de l'éclairage nocturne urbain permet aux bâtiments anciens de révéler leur charme unique la nuit.",
      "sentence_en": "Urban night lighting design allows ancient buildings to display their unique charm at night.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "night_lighting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能豆浆机可以自动研磨和熬煮,快速制作新鲜豆浆。",
      "sentence_pinyin": "Zhìnéng dòujiāngjī kěyǐ zìdòng yánmó hé áozhǔ, kuàisù zhìzuò xīnxiān dòujiāng.",
      "sentence_fr": "La machine à lait de soja intelligente peut moudre et cuire automatiquement, préparant rapidement du lait de soja frais.",
      "sentence_en": "The smart soy milk maker can automatically grind and boil, quickly making fresh soy milk.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_soy_milk_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的七夕节乞巧习俗寄托了女子对心灵手巧的美好追求。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Qīxījié qǐqiǎo xísú jìtuō le nǚzǐ duì xīnlíng shǒuqiǎo de měihǎo zhuīqiú.",
      "sentence_fr": "La coutume traditionnelle chinoise de demander l'habileté lors de Qixi exprime l'aspiration des femmes à l'adresse et à l'intelligence.",
      "sentence_en": "The traditional Chinese Qixi Festival custom of praying for skill expresses women's pursuit of cleverness and dexterity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qixi_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子血压袖带可以与手机同步,方便医生远程监测病人健康。",
      "sentence_pinyin": "Zhìnéng diànzǐ xuèyā xiùdài kěyǐ yǔ shǒujī tóngbù, fāngbiàn yīshēng yuǎnchéng jiāncè bìngrén jiànkāng.",
      "sentence_fr": "Le brassard de tensiomètre intelligent peut se synchroniser avec le téléphone, permettant aux médecins de surveiller la santé des patients à distance.",
      "sentence_en": "The smart electronic blood pressure cuff can sync with phones, allowing doctors to remotely monitor patient health.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bp_cuffs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "满族的萨满舞蹈是东北地区古老的宗教仪式表演形式。",
      "sentence_pinyin": "Mǎnzú de sàmǎn wǔdǎo shì dōngběi dìqū gǔlǎo de zōngjiào yíshì biǎoyǎn xíngshì.",
      "sentence_fr": "La danse chamanique de l'ethnie mandchoue est une ancienne forme de performance rituelle religieuse du nord-est de la Chine.",
      "sentence_en": "Manchu shamanic dance is an ancient religious ritual performance form in Northeast China.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shaman_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施的残疾人就业帮扶政策帮助残疾人实现自立自强。",
      "sentence_pinyin": "Zhèngfǔ shíshī de cánjírén jiùyè bāngfú zhèngcè bāngzhù cánjírén shíxiàn zìlì zìqiáng.",
      "sentence_fr": "La politique d'aide à l'emploi des personnes handicapées mise en œuvre par le gouvernement les aide à devenir autonomes.",
      "sentence_en": "The government's employment assistance policy for disabled people helps them achieve self-reliance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disability_employment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能泡脚桶可以恒温加热和按摩足底,促进血液循环。",
      "sentence_pinyin": "Zhìnéng pàojiǎotǒng kěyǐ héngwēn jiārè hé ànmó zúdǐ, cùjìn xuèyè xúnhuán.",
      "sentence_fr": "Le bain de pieds intelligent peut chauffer à température constante et masser la plante des pieds, favorisant la circulation sanguine.",
      "sentence_en": "The smart foot soaking tub can maintain constant temperature heating and massage the soles, promoting blood circulation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_foot_tubs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的冬至饺子习俗寓意防寒保暖,团圆幸福。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Dōngzhì jiǎozi xísú yùyì fánghán bǎonuǎn, tuányuán xìngfú.",
      "sentence_fr": "La coutume traditionnelle chinoise de manger des raviolis au solstice d'hiver symbolise la protection contre le froid et le bonheur familial.",
      "sentence_en": "The traditional Chinese Winter Solstice dumpling custom symbolizes keeping warm and family happiness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "winter_solstice",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能奶泡机可以制作细腻绵密的奶泡,提升咖啡的口感。",
      "sentence_pinyin": "Zhìnéng nǎipàojī kěyǐ zhìzuò xìnì miánmì de nǎipào, tíshēng kāfēi de kǒugǎn.",
      "sentence_fr": "Le mousseur à lait intelligent peut créer une mousse fine et onctueuse, améliorant le goût du café.",
      "sentence_en": "The smart milk frother can create fine and dense milk foam, enhancing the coffee taste.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_milk_frothers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "达斡尔族的乌钦是黑龙江地区独特的说唱艺术形式。",
      "sentence_pinyin": "Dáwò'ěrzú de Wūqīn shì Hēilóngjiāng dìqū dútè de shuōchàng yìshù xíngshì.",
      "sentence_fr": "L'Uchin de l'ethnie Daur est une forme unique d'art du récit chanté de la région du Heilongjiang.",
      "sentence_en": "Daur ethnic group's Uchin is a unique storytelling singing art form in the Heilongjiang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "uchin_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的自行车友好型道路建设鼓励市民绿色出行。",
      "sentence_pinyin": "Chéngshì de zìxíngchē yǒuhǎoxíng dàolù jiànshè gǔlì shìmín lǜsè chūxíng.",
      "sentence_fr": "La construction de routes adaptées aux vélos encourage les déplacements verts des citadins.",
      "sentence_en": "Urban bicycle-friendly road construction encourages residents to travel green.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bicycle_friendly_roads",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能调奶器可以精确控温,为宝宝冲泡合适温度的奶粉。",
      "sentence_pinyin": "Zhìnéng tiáonǎiqì kěyǐ jīngquè kòngwēn, wèi bǎobao chōngpào héshì wēndù de nǎifěn.",
      "sentence_fr": "Le préparateur de lait intelligent peut contrôler précisément la température pour préparer du lait en poudre à la bonne température pour bébé.",
      "sentence_en": "The smart formula maker can precisely control temperature to prepare formula at the right temperature for babies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_formula_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的小年祭灶习俗是春节前的重要准备活动。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Xiǎonián jìzào xísú shì Chūnjié qián de zhòngyào zhǔnbèi huódòng.",
      "sentence_fr": "La coutume traditionnelle chinoise de sacrifier au Dieu du foyer pendant Xiaonian est une activité de préparation importante avant le Nouvel An.",
      "sentence_en": "The traditional Chinese Little New Year kitchen god worship custom is an important preparation activity before Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "little_new_year",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能牙线器可以通过水流清洁牙缝,预防牙周疾病。",
      "sentence_pinyin": "Zhìnéng yáxiànqì kěyǐ tōngguò shuǐliú qīngjié yáfèng, yùfáng yázhōu jíbìng.",
      "sentence_fr": "Le fil dentaire intelligent peut nettoyer les espaces interdentaires avec un jet d'eau, prévenant les maladies parodontales.",
      "sentence_en": "The smart water flosser can clean between teeth with water flow, preventing periodontal disease.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_flossers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "鄂伦春族的篝火节是大兴安岭地区独特的民族节日。",
      "sentence_pinyin": "Èlúnchūnzú de gōuhuǒjié shì Dàxīng'ānlǐng dìqū dútè de mínzú jiérì.",
      "sentence_fr": "La Fête du feu de camp de l'ethnie Oroqen est une fête ethnique unique de la région du Grand Khingan.",
      "sentence_en": "The Oroqen ethnic group's Bonfire Festival is a unique ethnic festival in the Greater Khingan region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bonfire_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展的邻里守望活动增强了居民之间的互助意识。",
      "sentence_pinyin": "Shèqū kāizhǎn de línlǐ shǒuwàng huódòng zēngqiáng le jūmín zhījiān de hùzhù yìshí.",
      "sentence_fr": "Les activités de surveillance de quartier organisées par la communauté ont renforcé la conscience d'entraide entre les résidents.",
      "sentence_en": "Community neighborhood watch activities have strengthened mutual aid awareness among residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "neighborhood_watch",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能料理棒可以快速搅拌和打碎食材,制作各种酱料和汤品。",
      "sentence_pinyin": "Zhìnéng liàolǐbàng kěyǐ kuàisù jiǎobàn hé dǎsuì shícái, zhìzuò gèzhǒng jiàngliào hé tāngpǐn.",
      "sentence_fr": "Le mixeur plongeant intelligent peut rapidement mélanger et broyer les ingrédients, préparant diverses sauces et soupes.",
      "sentence_en": "The smart immersion blender can quickly mix and crush ingredients, making various sauces and soups.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_immersion_blenders",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的除夕守岁习俗寄托了人们对新年的美好期盼。",
      "sentence_pinyin": "Zhōngguó chuántǒng de chúxī shǒusuì xísú jìtuō le rénmen duì xīnnián de měihǎo qīpàn.",
      "sentence_fr": "La coutume traditionnelle chinoise de veiller la nuit de la Saint-Sylvestre exprime les belles attentes des gens pour la nouvelle année.",
      "sentence_en": "The traditional Chinese New Year's Eve vigil custom expresses people's beautiful expectations for the new year.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "new_years_eve",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
