{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这款智能扫地机器人能够自动规划清扫路线并避开障碍物。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng sǎodì jīqìrén nénggòu zìdòng guīhuà qīngsǎo lùxiàn bìng bìkāi zhàng'àiwù.",
      "sentence_fr": "Ce robot aspirateur intelligent peut planifier automatiquement son itinéraire de nettoyage et éviter les obstacles.",
      "sentence_en": "This smart robot vacuum can automatically plan cleaning routes and avoid obstacles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "robot_vacuum_cleaners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "撒拉族的骆驼泉传说讲述了他们祖先从中亚迁徙至青海的故事。",
      "sentence_pinyin": "Sālāzú de luòtuóquán chuánshuō jiǎngshù le tāmen zǔxiān cóng Zhōngyà qiānxǐ zhì Qīnghǎi de gùshì.",
      "sentence_fr": "La légende de la source du chameau des Salar raconte l'histoire de la migration de leurs ancêtres d'Asie centrale au Qinghai.",
      "sentence_en": "The Salar people's Camel Spring legend tells the story of their ancestors' migration from Central Asia to Qinghai.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "salar_camel_spring_legend",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区组织了亲子运动会,增进家长和孩子之间的情感交流。",
      "sentence_pinyin": "Shèqū zǔzhī le qīnzǐ yùndònghuì, zēngjìn jiāzhǎng hé háizi zhījiān de qínggǎn jiāoliú.",
      "sentence_fr": "La communauté a organisé des jeux sportifs parents-enfants pour renforcer les liens affectifs entre parents et enfants.",
      "sentence_en": "The community organized parent-child sports games to enhance emotional bonding between parents and children.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "parent_child_sports",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "陀螺是中国古老的玩具之一,需要用鞭子不断抽打才能保持旋转。",
      "sentence_pinyin": "Tuóluó shì Zhōngguó gǔlǎo de wánjù zhī yī, xūyào yòng biānzi bùduàn chōudǎ cáinéng bǎochí xuánzhuǎn.",
      "sentence_fr": "La toupie est l'un des plus anciens jouets chinois, nécessitant des coups de fouet continus pour maintenir sa rotation.",
      "sentence_en": "The spinning top is one of China's oldest toys, requiring continuous whipping to keep spinning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "spinning_top_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能空调能学习用户习惯并自动调节温度,实现个性化舒适体验。",
      "sentence_pinyin": "Zhège zhìnéng kōngtiáo néng xuéxí yònghù xíguàn bìng zìdòng tiáojié wēndù, shíxiàn gèxìnghuà shūshì tǐyàn.",
      "sentence_fr": "Ce climatiseur intelligent apprend les habitudes des utilisateurs et ajuste automatiquement la température pour une expérience personnalisée.",
      "sentence_en": "This smart air conditioner learns user habits and automatically adjusts temperature for a personalized comfort experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_conditioners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "东乡族的花儿民歌旋律优美,是西北地区重要的音乐文化遗产。",
      "sentence_pinyin": "Dōngxiāngzú de huā'ér míngē xuánlǜ yōuměi, shì xīběi dìqū zhòngyào de yīnyuè wénhuà yíchǎn.",
      "sentence_fr": "Les chansons folkloriques Hua'er des Dongxiang ont de belles mélodies et constituent un important patrimoine musical du nord-ouest.",
      "sentence_en": "The Dongxiang people's Hua'er folk songs have beautiful melodies and are an important musical heritage of the northwest region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dongxiang_huaer_songs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府建立了城市应急救援体系,提高了灾害响应和处置能力。",
      "sentence_pinyin": "Zhèngfǔ jiànlì le chéngshì yìngjí jiùyuán tǐxì, tígāo le zāihài xiǎngyìng hé chǔzhì nénglì.",
      "sentence_fr": "Le gouvernement a établi un système de secours d'urgence urbain, améliorant les capacités de réponse et de gestion des catastrophes.",
      "sentence_en": "The government established an urban emergency rescue system, improving disaster response and handling capabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_emergency_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能电子秤可以连接手机记录每日饮食,帮助用户控制热量摄入。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng diànzǐchèng kěyǐ liánjiē shǒujī jìlù měirì yǐnshí, bāngzhù yònghù kòngzhì rèliàng shèrù.",
      "sentence_fr": "Cette balance électronique intelligente se connecte au téléphone pour enregistrer les repas quotidiens et aider à contrôler l'apport calorique.",
      "sentence_en": "This smart electronic scale connects to phones to record daily diet, helping users control calorie intake.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_food_scales",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土族的轮子秋是独特的传统体育项目,两人坐在轮子两端旋转升降。",
      "sentence_pinyin": "Tǔzú de lúnziqiū shì dútè de chuántǒng tǐyù xiàngmù, liǎng rén zuò zài lúnzi liǎng duān xuánzhuǎn shēngjiàng.",
      "sentence_fr": "La balançoire à roue des Tu est un sport traditionnel unique où deux personnes s'assoient aux extrémités d'une roue qui tourne et monte.",
      "sentence_en": "The Tu people's wheel swing is a unique traditional sport where two people sit on opposite ends of a wheel that rotates and rises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tu_wheel_swing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "放风筝是春天最受欢迎的户外活动之一,人们喜欢在空旷的地方放飞风筝。",
      "sentence_pinyin": "Fàng fēngzhēng shì chūntiān zuì shòu huānyíng de hùwài huódòng zhī yī, rénmen xǐhuān zài kōngkuàng de dìfāng fàngfēi fēngzhēng.",
      "sentence_fr": "Le cerf-volant est l'une des activités de plein air les plus populaires au printemps, les gens aiment faire voler des cerfs-volants dans les espaces ouverts.",
      "sentence_en": "Kite flying is one of the most popular outdoor activities in spring, with people enjoying flying kites in open spaces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "spring_kite_flying",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区设立了便民服务中心,居民可以一站式办理各种生活事务。",
      "sentence_pinyin": "Shèqū shèlì le biànmín fúwù zhōngxīn, jūmín kěyǐ yīzhànshì bànlǐ gèzhǒng shēnghuó shìwù.",
      "sentence_fr": "La communauté a établi un centre de services aux résidents pour gérer diverses affaires quotidiennes en un seul endroit.",
      "sentence_en": "The community established a convenience service center where residents can handle various daily matters in one place.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_service_centers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能窗帘可以根据日出日落时间自动开合,还能语音控制。",
      "sentence_pinyin": "Zhège zhìnéng chuānglián kěyǐ gēnjù rìchū rìluò shíjiān zìdòng kāihé, hái néng yǔyīn kòngzhì.",
      "sentence_fr": "Ce rideau intelligent s'ouvre et se ferme automatiquement selon les heures de lever et coucher du soleil, avec contrôle vocal.",
      "sentence_en": "This smart curtain automatically opens and closes based on sunrise and sunset times, with voice control capability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_curtains",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "羌族的羊皮鼓舞是祈求风调雨顺的仪式舞蹈,动作粗犷有力。",
      "sentence_pinyin": "Qiāngzú de yángpígǔwǔ shì qíqiú fēngtiáoyǔshùn de yíshì wǔdǎo, dòngzuò cūguǎng yǒulì.",
      "sentence_fr": "La danse du tambour en peau de mouton des Qiang est une danse rituelle pour prier pour le beau temps, avec des mouvements vigoureux et puissants.",
      "sentence_en": "The Qiang people's sheepskin drum dance is a ritual dance praying for good weather, with bold and powerful movements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qiang_sheepskin_drum_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市推广立体停车场建设,有效缓解了停车位紧张的问题。",
      "sentence_pinyin": "Chéngshì tuīguǎng lìtǐ tíngchēchǎng jiànshè, yǒuxiào huǎnjiě le tíngchēwèi jǐnzhāng de wèntí.",
      "sentence_fr": "La ville promeut la construction de parkings à étages, soulageant efficacement le problème du manque de places de stationnement.",
      "sentence_en": "The city promotes multi-story parking garage construction, effectively alleviating the parking shortage problem.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "multi_story_parking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能牙刷能够记录刷牙时间和覆盖区域,帮助改善口腔卫生习惯。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yáshuā nénggòu jìlù shuāyá shíjiān hé fùgài qūyù, bāngzhù gǎishàn kǒuqiāng wèishēng xíguàn.",
      "sentence_fr": "Cette brosse à dents intelligente enregistre le temps de brossage et les zones couvertes pour améliorer les habitudes d'hygiène bucco-dentaire.",
      "sentence_en": "This smart toothbrush records brushing time and coverage areas, helping improve oral hygiene habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toothbrushes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "捉迷藏是最简单也是最有趣的童年游戏,不需要任何道具就能玩。",
      "sentence_pinyin": "Zhuō mícáng shì zuì jiǎndān yě shì zuì yǒuqù de tóngnián yóuxì, bù xūyào rènhé dàojù jiù néng wán.",
      "sentence_fr": "Cache-cache est le jeu d'enfance le plus simple et le plus amusant, ne nécessitant aucun accessoire pour jouer.",
      "sentence_en": "Hide and seek is the simplest and most fun childhood game, requiring no props to play.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hide_and_seek_game",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水族的水书是中国现存的活象形文字,被称为文字的活化石。",
      "sentence_pinyin": "Shuǐzú de shuǐshū shì Zhōngguó xiàncún de huó xiàngxíng wénzì, bèi chēng wéi wénzì de huóhuàshí.",
      "sentence_fr": "L'écriture Shui des Shui est une écriture pictographique vivante en Chine, appelée le fossile vivant de l'écriture.",
      "sentence_en": "The Shui people's Shui script is a living pictographic writing system in China, called a living fossil of writing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shui_pictographic_script",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区建立了老年人日间照料中心,为独居老人提供日间陪伴和照顾。",
      "sentence_pinyin": "Shèqū jiànlì le lǎoniánrén rìjiān zhàoliào zhōngxīn, wèi dújū lǎorén tígōng rìjiān péibàn hé zhàogù.",
      "sentence_fr": "La communauté a établi un centre de soins de jour pour personnes âgées, offrant compagnie et soins aux seniors vivant seuls.",
      "sentence_en": "The community established an elderly day care center, providing daytime companionship and care for seniors living alone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "elderly_day_care",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能插座可以远程控制家用电器开关,还能监测用电量。",
      "sentence_pinyin": "Zhège zhìnéng chāzuò kěyǐ yuǎnchéng kòngzhì jiāyòng diànqì kāiguān, hái néng jiāncè yòngdiànliàng.",
      "sentence_fr": "Cette prise intelligente permet de contrôler les appareils à distance et de surveiller la consommation électrique.",
      "sentence_en": "This smart plug can remotely control home appliance switches and monitor electricity usage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_plugs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "京族的独弦琴音色独特悠扬,是中国唯一的海洋民族的代表性乐器。",
      "sentence_pinyin": "Jīngzú de dúxiánqín yīnsè dútè yōuyáng, shì Zhōngguó wéiyī de hǎiyáng mínzú de dàibiǎoxìng yuèqì.",
      "sentence_fr": "Le monocorde des Jing a un son unique et mélodieux, étant l'instrument représentatif du seul peuple maritime de Chine.",
      "sentence_en": "The Jing people's single-string instrument has a unique and melodious sound, being the representative instrument of China's only maritime ethnic group.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jing_single_string_instrument",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
