{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子傅里叶变换是许多量子算法的核心组成部分。",
      "sentence_pinyin": "Liàngzǐ Fùlǐyè biànhuàn shì xǔduō liàngzǐ suànfǎ de héxīn zǔchéng bùfèn.",
      "sentence_fr": "La transformée de Fourier quantique est un composant central de nombreux algorithmes quantiques.",
      "sentence_en": "The quantum Fourier transform is a core component of many quantum algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_fourier_transform",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "BLS签名方案支持高效的签名聚合和验证。",
      "sentence_pinyin": "BLS qiānmíng fāng'àn zhīchí gāoxiào de qiānmíng jùhé hé yànzhèng.",
      "sentence_fr": "Le schéma de signature BLS prend en charge l'agrégation et la vérification efficaces des signatures.",
      "sentence_en": "The BLS signature scheme supports efficient signature aggregation and verification.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bls_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型类提供了临时多态性的类型安全实现方式。",
      "sentence_pinyin": "Lèixíng lèi tígōng le línshí duōtàixìng de lèixíng ānquán shíxiàn fāngshì.",
      "sentence_fr": "Les classes de types fournissent une implémentation sécurisée du polymorphisme ad hoc.",
      "sentence_en": "Type classes provide a type-safe implementation of ad hoc polymorphism.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_classes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "德拉姆上同调将微分形式与拓扑不变量联系起来。",
      "sentence_pinyin": "Délāmǔ shàng tóngdiào jiāng wēifēn xíngshì yǔ tuòpū bùbiànliàng liánxì qǐlái.",
      "sentence_fr": "La cohomologie de de Rham relie les formes différentielles aux invariants topologiques.",
      "sentence_en": "De Rham cohomology connects differential forms with topological invariants.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "de_rham_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格罗弗算法为无序搜索问题提供平方加速。",
      "sentence_pinyin": "Géluòfú suànfǎ wèi wúxù sōusuǒ wèntí tígōng píngfāng jiāsù.",
      "sentence_fr": "L'algorithme de Grover fournit une accélération quadratique pour les problèmes de recherche non ordonnée.",
      "sentence_en": "Grover's algorithm provides quadratic speedup for unordered search problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "grovers_algorithm",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零知识可验证计算让验证者确信计算正确而不学习任何额外信息。",
      "sentence_pinyin": "Líng zhīshì kě yànzhèng jìsuàn ràng yànzhèngzhě quèxìn jìsuàn zhèngquè ér bù xuéxí rènhé éwài xìnxī.",
      "sentence_fr": "Le calcul vérifiable à connaissance nulle convainc le vérificateur de la correction sans révéler d'informations supplémentaires.",
      "sentence_en": "Zero-knowledge verifiable computation convinces the verifier of correctness without learning any extra information.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "zk_verifiable_computation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "参数化类型抽象数据结构的元素类型实现代码复用。",
      "sentence_pinyin": "Cānshùhuà lèixíng chōuxiàng shùjù jiégòu de yuánsù lèixíng shíxiàn dàimǎ fùyòng.",
      "sentence_fr": "Les types paramétriques abstraient le type d'élément des structures de données pour la réutilisation du code.",
      "sentence_en": "Parametric types abstract data structure element types to achieve code reuse.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "parametric_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "切赫上同调使用开覆盖定义拓扑空间的上同调群。",
      "sentence_pinyin": "Qièhè shàng tóngdiào shǐyòng kāi fùgài dìngyì tuòpū kōngjiān de shàng tóngdiào qún.",
      "sentence_fr": "La cohomologie de Čech définit les groupes de cohomologie des espaces topologiques à l'aide de recouvrements ouverts.",
      "sentence_en": "Čech cohomology defines cohomology groups of topological spaces using open covers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cech_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "肖尔算法利用量子计算威胁现有公钥密码系统的安全性。",
      "sentence_pinyin": "Xiào'ěr suànfǎ lìyòng liàngzǐ jìsuàn wēixié xiànyǒu gōngyào mìmǎ xìtǒng de ānquánxìng.",
      "sentence_fr": "L'algorithme de Shor menace la sécurité des systèmes cryptographiques à clé publique existants grâce au calcul quantique.",
      "sentence_en": "Shor's algorithm threatens the security of existing public-key cryptographic systems through quantum computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "shors_algorithm",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可提取见证加密要求解密者必须知道某个困难问题的解。",
      "sentence_pinyin": "Kě tíqǔ jiànzhèng jiāmì yāoqiú jiěmìzhě bìxū zhīdào mǒu gè kùnnán wèntí de jiě.",
      "sentence_fr": "Le chiffrement à témoin extractible exige que le déchiffreur connaisse la solution d'un problème difficile.",
      "sentence_en": "Extractable witness encryption requires the decryptor to know the solution to a hard problem.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "witness_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多态lambda演算为泛型编程提供了理论基础。",
      "sentence_pinyin": "Duōtài lambda yǎnsuàn wèi fànxíng biānchéng tígōng le lǐlùn jīchǔ.",
      "sentence_fr": "Le lambda-calcul polymorphe fournit une base théorique pour la programmation générique.",
      "sentence_en": "Polymorphic lambda calculus provides a theoretical foundation for generic programming.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "polymorphic_lambda_calculus",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纤维丛理论研究局部平凡但整体可能非平凡的空间结构。",
      "sentence_pinyin": "Xiānwéi cù lǐlùn yánjiū júbù píngfán dàn zhěngtǐ kěnéng fēi píngfán de kōngjiān jiégòu.",
      "sentence_fr": "La théorie des fibrés étudie les structures d'espaces localement triviales mais potentiellement non triviales globalement.",
      "sentence_en": "Fiber bundle theory studies space structures that are locally trivial but potentially globally non-trivial.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "fiber_bundles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子行走是经典随机行走的量子力学模拟。",
      "sentence_pinyin": "Liàngzǐ xíngzǒu shì jīngdiǎn suíjī xíngzǒu de liàngzǐ lìxué mónǐ.",
      "sentence_fr": "La marche quantique est l'analogue de mécanique quantique de la marche aléatoire classique.",
      "sentence_en": "Quantum walk is the quantum mechanical analog of classical random walk.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_walks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增量可验证计算允许逐步验证长计算链的正确性。",
      "sentence_pinyin": "Zēngliàng kě yànzhèng jìsuàn yǔnxǔ zhúbù yànzhèng cháng jìsuàn liàn de zhèngquèxìng.",
      "sentence_fr": "Le calcul vérifiable incrémental permet de vérifier progressivement l'exactitude de longues chaînes de calcul.",
      "sentence_en": "Incremental verifiable computation allows progressive verification of long computation chains' correctness.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "incremental_verifiable_computation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高阶抽象语法将变量绑定表示为元语言中的函数。",
      "sentence_pinyin": "Gāo jiē chōuxiàng yǔfǎ jiāng biànliàng bǎngdìng biǎoshì wéi yuán yǔyán zhōng de hánshù.",
      "sentence_fr": "La syntaxe abstraite d'ordre supérieur représente la liaison de variables comme des fonctions dans le métalangage.",
      "sentence_en": "Higher-order abstract syntax represents variable binding as functions in the metalanguage.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "higher_order_abstract_syntax",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "丘-斯伯定理将代数拓扑与微分几何深刻联系起来。",
      "sentence_pinyin": "Qiū-Sībó dìnglǐ jiāng dàishù tuòpū yǔ wēifēn jǐhé shēnkè liánxì qǐlái.",
      "sentence_fr": "Le théorème de Chern-Gauss-Bonnet relie profondément la topologie algébrique à la géométrie différentielle.",
      "sentence_en": "The Chern-Gauss-Bonnet theorem deeply connects algebraic topology with differential geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "chern_gauss_bonnet",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子近似优化算法是混合量子-经典算法的典型代表。",
      "sentence_pinyin": "Liàngzǐ jìnsì yōuhuà suànfǎ shì hùnhé liàngzǐ-jīngdiǎn suànfǎ de diǎnxíng dàibiǎo.",
      "sentence_fr": "L'algorithme d'optimisation approximative quantique est un représentant typique des algorithmes hybrides quantiques-classiques.",
      "sentence_en": "The quantum approximate optimization algorithm is a typical representative of hybrid quantum-classical algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "qaoa_algorithm",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "随机预言机模型是密码学协议安全证明的理想化框架。",
      "sentence_pinyin": "Suíjī yùyán jī móxíng shì mìmǎxué xiéyì ānquán zhèngmíng de lǐxiǎnghuà kuàngjià.",
      "sentence_fr": "Le modèle de l'oracle aléatoire est un cadre idéalisé pour les preuves de sécurité des protocoles cryptographiques.",
      "sentence_en": "The random oracle model is an idealized framework for cryptographic protocol security proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "random_oracle_model",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型擦除在运行时移除泛型类型信息以实现向后兼容。",
      "sentence_pinyin": "Lèixíng cāchú zài yùnxíng shí yíchú fànxíng lèixíng xìnxī yǐ shíxiàn xiàng hòu jiānróng.",
      "sentence_fr": "L'effacement de type supprime les informations de type générique à l'exécution pour assurer la rétrocompatibilité.",
      "sentence_en": "Type erasure removes generic type information at runtime to achieve backward compatibility.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_erasure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "规范场论描述基本粒子相互作用的数学框架。",
      "sentence_pinyin": "Guīfàn chǎng lùn miáoshù jīběn lìzǐ xiānghù zuòyòng de shùxué kuàngjià.",
      "sentence_fr": "La théorie de jauge décrit le cadre mathématique des interactions des particules fondamentales.",
      "sentence_en": "Gauge theory describes the mathematical framework for fundamental particle interactions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "gauge_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
