{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个食品安全追溯平台让消费者能够扫码查询产品的完整生产和流通信息。",
      "sentence_pinyin": "Zhège shípǐn ānquán zhuīsù píngtái ràng xiāofèizhě nénggòu sǎomǎ cháxún chǎnpǐn de wánzhěng shēngchǎn hé liútōng xìnxī.",
      "sentence_fr": "Cette plateforme de traçabilité de la sécurité alimentaire permet aux consommateurs de scanner un code pour consulter les informations complètes de production et de distribution du produit.",
      "sentence_en": "This food safety traceability platform allows consumers to scan codes to query complete production and distribution information of products.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_traceability",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "大阮是民族乐队中的低音乐器,音色浑厚沉稳,为乐队提供和声基础。",
      "sentence_pinyin": "Dàruǎn shì mínzú yuèduì zhōng de dīyīn yuèqì, yīnsè húnhòu chénwěn, wèi yuèduì tígōng héshēng jīchǔ.",
      "sentence_fr": "Le daruan est un instrument de basse dans les orchestres traditionnels, avec un ton riche et stable, fournissant la base harmonique de l'orchestre.",
      "sentence_en": "The daruan is a bass instrument in traditional orchestras, with a rich and stable tone, providing the harmonic foundation for the orchestra.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "daruan_music",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区图书馆采用了自助借还系统,让读者能够随时借阅图书。",
      "sentence_pinyin": "Zhège shèqū túshūguǎn cǎiyòngle zìzhù jièhuán xìtǒng, ràng dúzhě nénggòu suíshí jièyuè túshū.",
      "sentence_fr": "Cette bibliothèque communautaire utilise un système de prêt et retour en libre-service permettant aux lecteurs d'emprunter des livres à tout moment.",
      "sentence_en": "This community library uses a self-service borrowing and return system, allowing readers to borrow books at any time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "self_service_libraries",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "核雕艺术在微小的果核上雕刻出精细的图案和文字,展现了极高的技艺水平。",
      "sentence_pinyin": "Hédiāo yìshù zài wēixiǎo de guǒhé shàng diāokè chū jīngxì de tú'àn hé wénzì, zhǎnxiànle jí gāo de jìyì shuǐpíng.",
      "sentence_fr": "L'art de la sculpture sur noyau grave des motifs et des caractères délicats sur de minuscules noyaux de fruits, démontrant un niveau de compétence extrêmement élevé.",
      "sentence_en": "The art of nuclear carving engraves intricate patterns and characters on tiny fruit pits, demonstrating an extremely high level of skill.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pit_carving",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能音箱不仅能播放音乐,还能控制家中的各种智能设备。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yīnxiāng bùjǐn néng bòfàng yīnyuè, hái néng kòngzhì jiāzhōng de gèzhǒng zhìnéng shèbèi.",
      "sentence_fr": "Cette enceinte intelligente peut non seulement jouer de la musique, mais aussi contrôler divers appareils intelligents dans la maison.",
      "sentence_en": "This smart speaker can not only play music but also control various smart devices in the home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_speakers",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个生态修复项目通过种植本土植物,恢复了退化湿地的生态功能。",
      "sentence_pinyin": "Zhège shēngtài xiūfù xiàngmù tōngguò zhòngzhí běntǔ zhíwù, huīfùle tuìhuà shīdì de shēngtài gōngnéng.",
      "sentence_fr": "Ce projet de restauration écologique a rétabli les fonctions écologiques des zones humides dégradées en plantant des plantes indigènes.",
      "sentence_en": "This ecological restoration project has restored the ecological functions of degraded wetlands by planting native plants.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecological_restoration",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙管演奏需要掌握正确的呼吸方法,才能吹出优美的和声。",
      "sentence_pinyin": "Shēngguǎn yǎnzòu xūyào zhǎngwò zhèngquè de hūxī fāngfǎ, cái néng chuī chū yōuměi de héshēng.",
      "sentence_fr": "Jouer du sheng nécessite de maîtriser les bonnes techniques de respiration pour produire de belles harmonies.",
      "sentence_en": "Playing the sheng requires mastering correct breathing techniques to produce beautiful harmonies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_music",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家医院的远程会诊系统让基层医生能够获得专家的实时指导。",
      "sentence_pinyin": "Zhè jiā yīyuàn de yuǎnchéng huìzhěn xìtǒng ràng jīcéng yīshēng nénggòu huòdé zhuānjiā de shíshí zhǐdǎo.",
      "sentence_fr": "Le système de consultation à distance de cet hôpital permet aux médecins de première ligne d'obtenir des conseils d'experts en temps réel.",
      "sentence_en": "This hospital's remote consultation system allows grassroots doctors to receive real-time guidance from experts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "remote_consultation",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "苗银工艺以其精美的錾花和镶嵌技术,展现了苗族的传统审美情趣。",
      "sentence_pinyin": "Miáoyín gōngyì yǐ qí jīngměi de zànhuā hé xiāngqiàn jìshù, zhǎnxiànle Miáozú de chuántǒng shěnměi qíngqù.",
      "sentence_fr": "L'orfèvrerie Miao, avec ses techniques exquises de ciselure et d'incrustation, reflète l'esthétique traditionnelle du peuple Miao.",
      "sentence_en": "Miao silverwork, with its exquisite chasing and inlay techniques, reflects the traditional aesthetic taste of the Miao people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "miao_silverwork",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧农业平台通过数据分析,为农民提供精准的种植和施肥建议。",
      "sentence_pinyin": "Zhège zhìhuì nóngyè píngtái tōngguò shùjù fēnxī, wèi nóngmín tígōng jīngzhǔn de zhòngzhí hé shīféi jiànyì.",
      "sentence_fr": "Cette plateforme d'agriculture intelligente fournit aux agriculteurs des recommandations précises de plantation et de fertilisation grâce à l'analyse de données.",
      "sentence_en": "This smart agriculture platform provides farmers with precise planting and fertilization recommendations through data analysis.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "precision_agriculture",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "瓷器烧制需要经过选料、成型、施釉、烧制等多道复杂工序。",
      "sentence_pinyin": "Cíqì shāozhì xūyào jīngguò xuǎnliào, chéngxíng, shīyòu, shāozhì děng duō dào fùzá gōngxù.",
      "sentence_fr": "La fabrication de la porcelaine nécessite plusieurs processus complexes tels que la sélection des matériaux, le façonnage, l'émaillage et la cuisson.",
      "sentence_en": "Porcelain production requires multiple complex processes such as material selection, molding, glazing, and firing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "porcelain_making",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾发电厂将城市生活垃圾转化为清洁电能,实现了资源化利用。",
      "sentence_pinyin": "Zhège lājī fādiànchǎng jiāng chéngshì shēnghuó lājī zhuǎnhuà wéi qīngjié diànnéng, shíxiànle zīyuánhuà lìyòng.",
      "sentence_fr": "Cette centrale de valorisation énergétique des déchets transforme les ordures ménagères urbaines en énergie électrique propre, réalisant une utilisation des ressources.",
      "sentence_en": "This waste-to-energy plant converts urban household waste into clean electrical energy, achieving resource utilization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_to_energy",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "葫芦丝的音色柔和甜美,能够演奏出富有民族特色的优美旋律。",
      "sentence_pinyin": "Húlúsī de yīnsè róuhé tiánměi, nénggòu yǎnzòu chū fùyǒu mínzú tèsè de yōuměi xuánlǜ.",
      "sentence_fr": "Le hulusi a un son doux et mélodieux, capable de jouer de belles mélodies aux caractéristiques ethniques.",
      "sentence_en": "The hulusi has a soft and sweet tone, capable of playing beautiful melodies with ethnic characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hulusi_music",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款健身应用提供了个性化的训练计划和营养指导,帮助用户科学锻炼。",
      "sentence_pinyin": "Zhè kuǎn jiànshēn yìngyòng tígōngle gèxìnghuà de xùnliàn jìhuà hé yíngyǎng zhǐdǎo, bāngzhù yònghù kēxué duànliàn.",
      "sentence_fr": "Cette application de fitness fournit des plans d'entraînement personnalisés et des conseils nutritionnels pour aider les utilisateurs à s'entraîner de manière scientifique.",
      "sentence_en": "This fitness app provides personalized training plans and nutritional guidance to help users exercise scientifically.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness_apps",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个志愿服务平台连接了需要帮助的人群和愿意提供帮助的志愿者。",
      "sentence_pinyin": "Zhège zhìyuàn fúwù píngtái liánjiēle xūyào bāngzhù de rénqún hé yuànyì tígōng bāngzhù de zhìyuànzhě.",
      "sentence_fr": "Cette plateforme de services bénévoles relie les personnes qui ont besoin d'aide et les volontaires désireux de fournir de l'aide.",
      "sentence_en": "This volunteer service platform connects people in need of help with volunteers willing to provide assistance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volunteer_platforms",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "皮影戏通过光影和精巧的人物造型,讲述了一个又一个动人的故事。",
      "sentence_pinyin": "Píyǐngxì tōngguò guāngyǐng hé jīngqiǎo de rénwù zàoxíng, jiǎngshùle yī gè yòu yī gè dòngrén de gùshì.",
      "sentence_fr": "Le théâtre d'ombres raconte des histoires émouvantes l'une après l'autre grâce aux jeux de lumière et aux silhouettes élaborées des personnages.",
      "sentence_en": "Shadow puppet theater tells moving stories one after another through light and shadow and elaborate character designs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shadow_puppetry",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的雨水收集系统将雨水净化后用于绿化灌溉和道路清洗。",
      "sentence_pinyin": "Zhège chéngshì de yǔshuǐ shōují xìtǒng jiāng yǔshuǐ jìnghuà hòu yòng yú lǜhuà guàngài hé dàolù qīngxǐ.",
      "sentence_fr": "Le système de collecte des eaux de pluie de cette ville purifie l'eau de pluie pour l'utiliser dans l'irrigation des espaces verts et le nettoyage des routes.",
      "sentence_en": "This city's rainwater collection system purifies rainwater for use in green space irrigation and road cleaning.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rainwater_harvesting",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "陶笛是一种陶土制成的吹奏乐器,音色空灵悠远,易于学习和掌握。",
      "sentence_pinyin": "Táodí shì yī zhǒng táotǔ zhìchéng de chuīzòu yuèqì, yīnsè kōnglíng yōuyuǎn, yì yú xuéxí hé zhǎngwò.",
      "sentence_fr": "L'ocarina est un instrument à vent en terre cuite au son éthéré et lointain, facile à apprendre et à maîtriser.",
      "sentence_en": "The ocarina is a wind instrument made of clay with an ethereal and distant tone, easy to learn and master.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ocarina_music",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家科技公司开发的翻译软件支持一百多种语言的实时互译。",
      "sentence_pinyin": "Zhè jiā kējì gōngsī kāifā de fānyì ruǎnjiàn zhīchí yī bǎi duō zhǒng yǔyán de shíshí hùyì.",
      "sentence_fr": "Le logiciel de traduction développé par cette entreprise technologique prend en charge la traduction en temps réel de plus de cent langues.",
      "sentence_en": "The translation software developed by this tech company supports real-time mutual translation of over one hundred languages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "translation_software",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区康复中心为残疾人提供了物理治疗、职业培训和心理支持。",
      "sentence_pinyin": "Zhège shèqū kāngfù zhōngxīn wèi cánjírén tígōngle wùlǐ zhìliáo, zhíyè péixùn hé xīnlǐ zhīchí.",
      "sentence_fr": "Ce centre de réadaptation communautaire offre physiothérapie, formation professionnelle et soutien psychologique aux personnes handicapées.",
      "sentence_en": "This community rehabilitation center provides physical therapy, vocational training, and psychological support for people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rehabilitation_centers",
      "created_at": "2025-11-20T20:45:00.000Z",
      "updated_at": "2025-11-20T20:45:00.000Z"
    }
  ]
}
