{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个垃圾分类积分系统鼓励居民正确分类,可用积分兑换生活用品。",
      "sentence_pinyin": "Zhège lājī fēnlèi jīfēn xìtǒng gǔlì jūmín zhèngquè fēnlèi, kě yòng jīfēn duìhuàn shēnghuó yòngpǐn.",
      "sentence_fr": "Ce système de points pour le tri des déchets encourage les résidents à trier correctement et permet d'échanger des points contre des produits ménagers.",
      "sentence_en": "This waste sorting point system encourages residents to sort correctly and allows points to be exchanged for household items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_sorting_incentives",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中胡的音色介于二胡和大胡之间,在民乐队中担任中音声部。",
      "sentence_pinyin": "Zhōnghú de yīnsè jièyú èrhú hé dàhú zhījiān, zài mínyuè duì zhōng dānrèn zhōngyīn shēngbù.",
      "sentence_fr": "Le zhonghu a un son entre l'erhu et le dahu, jouant la partie médium dans les orchestres de musique traditionnelle.",
      "sentence_en": "The zhonghu's tone is between the erhu and dahu, playing the middle voice part in traditional music orchestras.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zhonghu_music",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个无人超市利用人脸识别和自动结算技术,实现了24小时无人值守运营。",
      "sentence_pinyin": "Zhège wúrén chāoshì lìyòng rénliǎn shíbié hé zìdòng jiésuàn jìshù, shíxiànle èrshísì xiǎoshí wúrén zhíshǒu yùnyíng.",
      "sentence_fr": "Ce supermarché sans personnel utilise la reconnaissance faciale et la technologie de paiement automatique pour fonctionner 24 heures sur 24 sans surveillance.",
      "sentence_en": "This unmanned supermarket uses facial recognition and automatic checkout technology to operate 24/7 without staff.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "unmanned_stores",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "贝雕艺术将各种贝壳粘贴拼接,创作出精美的装饰画和工艺品。",
      "sentence_pinyin": "Bèidiāo yìshù jiāng gèzhǒng bèiké zhāntiē pīnjiē, chuàngzuò chū jīngměi de zhuāngshì huà hé gōngyìpǐn.",
      "sentence_fr": "L'art de la sculpture de coquillages colle et assemble diverses coquilles pour créer de belles peintures décoratives et artisanats.",
      "sentence_en": "Shell carving art glues and assembles various shells to create beautiful decorative paintings and crafts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shell_carving",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能药盒能够定时提醒服药,并记录用药情况发送给家人。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yàohé nénggòu dìngshí tíxǐng fúyào, bìng jìlù yòngyào qíngkuàng fāsòng gěi jiārén.",
      "sentence_fr": "Cette boîte à médicaments intelligente peut rappeler la prise de médicaments à des heures fixes et enregistrer l'historique pour l'envoyer à la famille.",
      "sentence_en": "This smart pill box can remind medication times and record medication history to send to family members.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pill_boxes",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个乡村振兴项目通过发展乡村旅游,带动了当地经济发展。",
      "sentence_pinyin": "Zhège xiāngcūn zhènxīng xiàngmù tōngguò fāzhǎn xiāngcūn lǚyóu, dàidòngle dāngdì jīngjì fāzhǎn.",
      "sentence_fr": "Ce projet de revitalisation rurale stimule le développement économique local en développant le tourisme rural.",
      "sentence_en": "This rural revitalization project drives local economic development by developing rural tourism.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_revitalization",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "大鼓的音色浑厚有力,在戏曲和民间音乐中常用来烘托气氛。",
      "sentence_pinyin": "Dàgǔ de yīnsè húnhòu yǒulì, zài xìqǔ hé mínjiān yīnyuè zhōng cháng yòng lái hōngtuō qìfēn.",
      "sentence_fr": "Le grand tambour a un son riche et puissant, souvent utilisé dans l'opéra et la musique folklorique pour créer l'atmosphère.",
      "sentence_en": "The large drum has a rich and powerful sound, often used in opera and folk music to create atmosphere.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "chinese_drums",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字孪生系统为工厂建立了虚拟模型,可以模拟生产过程并优化效率。",
      "sentence_pinyin": "Zhège shùzì luánshēng xìtǒng wèi gōngchǎng jiànlìle xūnǐ móxíng, kěyǐ mónǐ shēngchǎn guòchéng bìng yōuhuà xiàolǜ.",
      "sentence_fr": "Ce système de jumeau numérique crée un modèle virtuel pour l'usine, pouvant simuler le processus de production et optimiser l'efficacité.",
      "sentence_en": "This digital twin system creates a virtual model for the factory, capable of simulating production processes and optimizing efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_twins",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "剪纸传承人通过开设培训班,将这门古老技艺传授给年轻一代。",
      "sentence_pinyin": "Jiǎnzhǐ chuánchéngrén tōngguò kāishè péixùnbān, jiāng zhè mén gǔlǎo jìyì chuánshòu gěi niánqīng yīdài.",
      "sentence_fr": "Les héritiers de la découpe de papier transmettent cet art ancien à la jeune génération en organisant des cours de formation.",
      "sentence_en": "Paper-cutting inheritors transmit this ancient art to the younger generation by organizing training classes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_heritage_transmission",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能电表可以实时显示用电情况,帮助用户合理安排用电时间。",
      "sentence_pinyin": "Zhège zhìnéng diànbiǎo kěyǐ shíshí xiǎnshì yòngdiàn qíngkuàng, bāngzhù yònghù hélǐ ānpái yòngdiàn shíjiān.",
      "sentence_fr": "Ce compteur électrique intelligent peut afficher en temps réel la consommation d'électricité, aidant les utilisateurs à planifier raisonnablement leur utilisation.",
      "sentence_en": "This smart electricity meter can display power consumption in real-time, helping users reasonably plan their electricity usage time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_meters",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区食堂为独居老人提供营养均衡的一日三餐服务。",
      "sentence_pinyin": "Zhège shèqū shítáng wèi dújū lǎorén tígōng yíngyǎng jūnhéng de yī rì sān cān fúwù.",
      "sentence_fr": "Cette cantine communautaire fournit trois repas équilibrés par jour aux personnes âgées vivant seules.",
      "sentence_en": "This community canteen provides nutritionally balanced three meals a day service for elderly people living alone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_canteens",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐曲牌丰富多样,既有欢快热烈的喜庆曲目,也有低沉哀婉的悼念曲。",
      "sentence_pinyin": "Suǒnà qǔpái fēngfù duōyàng, jì yǒu huānkuài rèliè de xǐqìng qǔmù, yě yǒu dīchén āiwǎn de dàoniàn qū.",
      "sentence_fr": "Le répertoire du suona est riche et varié, avec des pièces joyeuses et festives ainsi que des mélodies mélancoliques de commémoration.",
      "sentence_en": "The suona repertoire is rich and diverse, with both joyful celebratory pieces and melancholic commemorative melodies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_repertoire",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线拍卖平台为艺术品和收藏品提供了安全透明的交易环境。",
      "sentence_pinyin": "Zhège zàixiàn pāimài píngtái wèi yìshùpǐn hé shōucángpǐn tígōngle ānquán tòumíng de jiāoyì huánjìng.",
      "sentence_fr": "Cette plateforme d'enchères en ligne fournit un environnement de transaction sûr et transparent pour les œuvres d'art et les objets de collection.",
      "sentence_en": "This online auction platform provides a safe and transparent trading environment for artworks and collectibles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "online_auctions",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋雕艺术在脆弱的蛋壳上雕刻出精细的图案,展现了高超的技艺。",
      "sentence_pinyin": "Dàndiāo yìshù zài cuìruò de dànké shàng diāokè chū jīngxì de tú'àn, zhǎnxiànle gāochāo de jìyì.",
      "sentence_fr": "L'art de la gravure sur coquille d'œuf sculpte des motifs délicats sur des coquilles fragiles, démontrant une grande habileté.",
      "sentence_en": "Egg carving art engraves intricate patterns on fragile eggshells, demonstrating superb craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "egg_carving",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能血压计可以自动测量并上传数据到云端,方便医生远程监控。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng xuèyājì kěyǐ zìdòng cèliáng bìng shàngchuán shùjù dào yúnduān, fāngbiàn yīshēng yuǎnchéng jiānkòng.",
      "sentence_fr": "Ce tensiomètre intelligent peut mesurer automatiquement et télécharger les données vers le cloud, facilitant la surveillance à distance par les médecins.",
      "sentence_en": "This smart blood pressure monitor can automatically measure and upload data to the cloud, facilitating remote monitoring by doctors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_blood_pressure_monitors",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海洋清洁项目利用无人船收集海面漂浮垃圾,保护海洋生态。",
      "sentence_pinyin": "Zhège hǎiyáng qīngjié xiàngmù lìyòng wúrén chuán shōují hǎimiàn piāofú lājī, bǎohù hǎiyáng shēngtài.",
      "sentence_fr": "Ce projet de nettoyage océanique utilise des bateaux sans pilote pour collecter les déchets flottants en surface et protéger l'écosystème marin.",
      "sentence_en": "This ocean cleanup project uses unmanned boats to collect floating surface debris and protect the marine ecosystem.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ocean_cleanup",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡名曲《二泉映月》通过凄美的旋律,表达了作者对生活的感悟。",
      "sentence_pinyin": "Èrhú míngqǔ 'Èr quán yìng yuè' tōngguò qīměi de xuánlǜ, biǎodále zuòzhě duì shēnghuó de gǎnwù.",
      "sentence_fr": "La célèbre pièce d'erhu 'La Lune reflétée dans la Deuxième Source' exprime les réflexions de l'auteur sur la vie à travers une mélodie poignante.",
      "sentence_en": "The famous erhu piece 'Moon Reflected on Second Spring' expresses the author's reflections on life through a poignant melody.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_repertoire",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众创空间为创业者提供了办公场地、技术支持和投融资对接服务。",
      "sentence_pinyin": "Zhège zhòngchuàng kōngjiān wèi chuàngyèzhě tígōngle bàngōng chǎngdì, jìshù zhīchí hé tóu rónzī duìjiē fúwù.",
      "sentence_fr": "Cet espace de co-création offre aux entrepreneurs des locaux de bureau, un soutien technique et des services de mise en relation pour le financement.",
      "sentence_en": "This maker space provides entrepreneurs with office space, technical support, and investment financing connection services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maker_spaces",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "景德镇瓷器以其洁白细腻的质地和精美的绘画而享誉世界。",
      "sentence_pinyin": "Jǐngdézhèn cíqì yǐ qí jiébái xìnì de zhìdì hé jīngměi de huìhuà ér xiǎngyù shìjiè.",
      "sentence_fr": "La porcelaine de Jingdezhen est mondialement réputée pour sa texture blanche et délicate et ses peintures exquises.",
      "sentence_en": "Jingdezhen porcelain is world-renowned for its white and delicate texture and exquisite paintings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jingdezhen_porcelain",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能马桶盖具有自动冲洗、加热和烘干等多种功能。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng mǎtǒnggài jùyǒu zìdòng chōngxǐ, jiārè hé hōnggān děng duō zhǒng gōngnéng.",
      "sentence_fr": "Ce siège de toilette intelligent possède plusieurs fonctions telles que le rinçage automatique, le chauffage et le séchage.",
      "sentence_en": "This smart toilet seat has multiple functions such as automatic rinsing, heating, and drying.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toilets",
      "created_at": "2025-11-20T21:10:00.000Z",
      "updated_at": "2025-11-20T21:10:00.000Z"
    }
  ]
}
