{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "进化心理学从自然选择的角度解释人类心理机制和行为倾向的起源。",
      "sentence_pinyin": "Jìnhuà xīnlǐxué cóng zìrán xuǎnzé de jiǎodù jiěshì rénlèi xīnlǐ jīzhì hé xíngwéi qīngxiàng de qǐyuán.",
      "sentence_fr": "La psychologie évolutionniste explique l'origine des mécanismes psychologiques humains et des tendances comportementales du point de vue de la sélection naturelle.",
      "sentence_en": "Evolutionary psychology explains the origin of human psychological mechanisms and behavioral tendencies from a natural selection perspective.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evolutionary_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "并行计算技术通过同时执行多个计算任务来大幅提高处理速度。",
      "sentence_pinyin": "Bìngxíng jìsuàn jìshù tōngguò tóngshí zhíxíng duō gè jìsuàn rènwù lái dàfú tígāo chǔlǐ sùdù.",
      "sentence_fr": "La technologie de calcul parallèle améliore considérablement la vitesse de traitement en exécutant plusieurs tâches de calcul simultanément.",
      "sentence_en": "Parallel computing technology significantly improves processing speed by executing multiple computing tasks simultaneously.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "parallel_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物地理学研究物种分布的地理模式以及历史和生态因素的影响。",
      "sentence_pinyin": "Shēngwù dìlǐxué yánjiū wùzhǒng fēnbù de dìlǐ móshì yǐjí lìshǐ hé shēngtài yīnsù de yǐngxiǎng.",
      "sentence_fr": "La biogéographie étudie les modèles géographiques de distribution des espèces et l'influence des facteurs historiques et écologiques.",
      "sentence_en": "Biogeography studies the geographical patterns of species distribution and the influence of historical and ecological factors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biogeography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宏观审慎监管旨在识别和缓解整个金融系统的系统性风险。",
      "sentence_pinyin": "Hóngguān shěnshèn jiānguǎn zhǐzài shíbié hé huǎnjiě zhěnggè jīnróng xìtǒng de xìtǒngxìng fēngxiǎn.",
      "sentence_fr": "La régulation macroprudentielle vise à identifier et à atténuer les risques systémiques dans l'ensemble du système financier.",
      "sentence_en": "Macroprudential regulation aims to identify and mitigate systemic risks across the entire financial system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "macroprudential_regulation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蛋白质组学研究细胞内所有蛋白质的表达、修饰和相互作用。",
      "sentence_pinyin": "Dànbáizhì zǔxué yánjiū xìbāo nèi suǒyǒu dànbáizhì de biǎodá, xiūshì hé xiānghù zuòyòng.",
      "sentence_fr": "La protéomique étudie l'expression, les modifications et les interactions de toutes les protéines dans les cellules.",
      "sentence_en": "Proteomics studies the expression, modification, and interaction of all proteins within cells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "proteomics_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "词汇学研究语言中词的形式、意义、用法及其历史发展变化。",
      "sentence_pinyin": "Cíhuìxué yánjiū yǔyán zhōng cí de xíngshì, yìyì, yòngfǎ jí qí lìshǐ fāzhǎn biànhuà.",
      "sentence_fr": "La lexicologie étudie la forme, le sens, l'usage des mots dans les langues et leur développement historique.",
      "sentence_en": "Lexicology studies the form, meaning, usage of words in languages and their historical development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "lexicology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "API设计原则确保软件接口易于使用、一致且向后兼容。",
      "sentence_pinyin": "API shèjì yuánzé quèbǎo ruǎnjiàn jiēkǒu yìyú shǐyòng, yīzhì qiě xiàng hòu jiānróng.",
      "sentence_fr": "Les principes de conception d'API garantissent que les interfaces logicielles sont faciles à utiliser, cohérentes et rétrocompatibles.",
      "sentence_en": "API design principles ensure software interfaces are easy to use, consistent, and backward compatible.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "api_design",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生态毒理学研究污染物对生态系统和野生动物种群的影响。",
      "sentence_pinyin": "Shēngtài dúlǐxué yánjiū wūrǎn wù duì shēngtài xìtǒng hé yěshēng dòngwù zhǒngqún de yǐngxiǎng.",
      "sentence_fr": "L'écotoxicologie étudie les effets des polluants sur les écosystèmes et les populations d'animaux sauvages.",
      "sentence_en": "Ecotoxicology studies the effects of pollutants on ecosystems and wildlife populations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecotoxicology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识产权法律保护创新者的发明、商标和创意作品的权利。",
      "sentence_pinyin": "Zhīshi chǎnquán fǎlǜ bǎohù chuàngxīn zhě de fāmíng, shāngbiāo hé chuàngyì zuòpǐn de quánlì.",
      "sentence_fr": "Le droit de la propriété intellectuelle protège les droits des innovateurs sur les inventions, les marques et les œuvres créatives.",
      "sentence_en": "Intellectual property law protects innovators' rights to inventions, trademarks, and creative works.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intellectual_property",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "对话系统设计需要处理自然语言理解、对话管理和响应生成。",
      "sentence_pinyin": "Duìhuà xìtǒng shèjì xūyào chǔlǐ zìrán yǔyán lǐjiě, duìhuà guǎnlǐ hé xiǎngyìng shēngchéng.",
      "sentence_fr": "La conception de systèmes de dialogue nécessite de gérer la compréhension du langage naturel, la gestion du dialogue et la génération de réponses.",
      "sentence_en": "Dialogue system design needs to handle natural language understanding, dialogue management, and response generation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dialogue_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市社会学研究城市化进程如何影响社会结构和人际关系。",
      "sentence_pinyin": "Chéngshì shèhuìxué yánjiū chéngshìhuà jìnchéng rúhé yǐngxiǎng shèhuì jiégòu hé rénjì guānxì.",
      "sentence_fr": "La sociologie urbaine étudie comment le processus d'urbanisation affecte la structure sociale et les relations interpersonnelles.",
      "sentence_en": "Urban sociology studies how the urbanization process affects social structure and interpersonal relationships.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "热力学定律描述了能量转换和传递的基本物理原理。",
      "sentence_pinyin": "Rèlìxué dìnglǜ miáoshùle néngyuán zhuǎnhuàn hé chuándì de jīběn wùlǐ yuánlǐ.",
      "sentence_fr": "Les lois de la thermodynamique décrivent les principes physiques fondamentaux de la conversion et du transfert d'énergie.",
      "sentence_en": "The laws of thermodynamics describe the fundamental physical principles of energy conversion and transfer.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "thermodynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化遗产保护工作致力于保存具有历史和文化意义的建筑与文物。",
      "sentence_pinyin": "Wénhuà yíchǎn bǎohù gōngzuò zhìlì yú bǎocún jùyǒu lìshǐ hé wénhuà yìyì de jiànzhù yǔ wénwù.",
      "sentence_fr": "Le travail de préservation du patrimoine culturel vise à conserver les bâtiments et les artefacts ayant une signification historique et culturelle.",
      "sentence_en": "Cultural heritage preservation work is dedicated to conserving buildings and artifacts with historical and cultural significance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_heritage_preservation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "软件工程方法论提供了系统化管理软件开发项目的框架和实践。",
      "sentence_pinyin": "Ruǎnjiàn gōngchéng fāngfǎlùn tígōngle xìtǒnghuà guǎnlǐ ruǎnjiàn kāifā xiàngmù de kuàngjià hé shíjiàn.",
      "sentence_fr": "Les méthodologies de génie logiciel fournissent des cadres et des pratiques pour gérer systématiquement les projets de développement logiciel.",
      "sentence_en": "Software engineering methodologies provide frameworks and practices for systematically managing software development projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "software_engineering_methodology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "土壤学研究土壤的物理化学和生物特性以及其对农业生产的影响。",
      "sentence_pinyin": "Tǔrǎngxué yánjiū tǔrǎng de wùlǐ huàxué hé shēngwù tèxìng yǐjí qí duì nóngyè shēngchǎn de yǐngxiǎng.",
      "sentence_fr": "La pédologie étudie les propriétés physiques, chimiques et biologiques des sols ainsi que leur impact sur la production agricole.",
      "sentence_en": "Soil science studies the physical, chemical, and biological properties of soils and their impact on agricultural production.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soil_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "性别研究分析性别身份和性别关系如何在社会中被建构和协商。",
      "sentence_pinyin": "Xìngbié yánjiū fēnxī xìngbié shēnfèn hé xìngbié guānxì rúhé zài shèhuì zhōng bèi jiàngòu hé xiéshāng.",
      "sentence_fr": "Les études de genre analysent comment l'identité de genre et les relations de genre sont construites et négociées dans la société.",
      "sentence_en": "Gender studies analyze how gender identity and gender relations are constructed and negotiated in society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gender_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "病毒学研究病毒的结构、复制机制和与宿主细胞的相互作用。",
      "sentence_pinyin": "Bìngdúxué yánjiū bìngdú de jiégòu, fùzhì jīzhì hé yǔ sùzhǔ xìbāo de xiānghù zuòyòng.",
      "sentence_fr": "La virologie étudie la structure des virus, leurs mécanismes de réplication et leurs interactions avec les cellules hôtes.",
      "sentence_en": "Virology studies the structure of viruses, their replication mechanisms, and interactions with host cells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "virology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据库索引策略对于优化查询性能和减少响应时间至关重要。",
      "sentence_pinyin": "Shùjùkù suǒyǐn cèlüè duìyú yōuhuà cháxún xìngnéng hé jiǎnshǎo xiǎngyìng shíjiān zhìguān zhòngyào.",
      "sentence_fr": "Les stratégies d'indexation de base de données sont cruciales pour optimiser les performances des requêtes et réduire les temps de réponse.",
      "sentence_en": "Database indexing strategies are crucial for optimizing query performance and reducing response time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "database_indexing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "空气质量监测系统跟踪污染物浓度并向公众发布健康预警。",
      "sentence_pinyin": "Kōngqì zhìliàng jiāncè xìtǒng zhuīzōng wūrǎn wù nóngdù bìng xiàng gōngzhòng fābù jiànkāng yùjǐng.",
      "sentence_fr": "Les systèmes de surveillance de la qualité de l'air suivent les concentrations de polluants et émettent des alertes sanitaires au public.",
      "sentence_en": "Air quality monitoring systems track pollutant concentrations and issue health warnings to the public.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "air_quality_monitoring",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会运动理论研究集体行动如何形成、发展和产生社会变革。",
      "sentence_pinyin": "Shèhuì yùndòng lǐlùn yánjiū jítǐ xíngdòng rúhé xíngchéng, fāzhǎn hé chǎnshēng shèhuì biàngé.",
      "sentence_fr": "La théorie des mouvements sociaux étudie comment l'action collective se forme, se développe et produit un changement social.",
      "sentence_en": "Social movement theory studies how collective action forms, develops, and produces social change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_movement_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
