{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能家居中控系统可以通过语音控制全屋的电器设备。",
      "sentence_pinyin": "Zhège zhìnéng jiājū zhōngkòng xìtǒng kěyǐ tōngguò yǔyīn kòngzhì quánwū de diànqì shèbèi.",
      "sentence_fr": "Ce système de contrôle central de maison intelligente peut contrôler tous les appareils électriques de la maison par commande vocale.",
      "sentence_en": "This smart home central control system can control all electrical devices in the house through voice commands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_home_hubs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "越调是河南的地方戏曲之一,唱腔高亢,表演粗犷豪放。",
      "sentence_pinyin": "Yuèdiào shì Hénán de dìfāng xìqǔ zhī yī, chàngqiāng gāokàng, biǎoyǎn cūguǎng háofàng.",
      "sentence_fr": "L'opéra Yuediao est l'un des opéras régionaux du Henan, avec un chant puissant et des performances robustes et audacieuses.",
      "sentence_en": "Yuediao opera is one of Henan's regional operas, with powerful singing and robust, bold performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yuediao_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的智慧路灯可以根据行人和车辆数量自动调节亮度。",
      "sentence_pinyin": "Chéngshì de zhìhuì lùdēng kěyǐ gēnjù xíngrén hé chēliàng shùliàng zìdòng tiáojié liàngdù.",
      "sentence_fr": "Les lampadaires intelligents de la ville peuvent ajuster automatiquement leur luminosité selon le nombre de piétons et de véhicules.",
      "sentence_en": "The city's smart street lights can automatically adjust brightness based on the number of pedestrians and vehicles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_street_lights",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子琴可以教初学者弹奏,并实时纠正弹奏错误。",
      "sentence_pinyin": "Zhìnéng diànzǐqín kěyǐ jiāo chūxuézhě tánzòu, bìng shíshí jiūzhèng tánzòu cuòwù.",
      "sentence_fr": "Le piano électronique intelligent peut enseigner aux débutants à jouer et corriger les erreurs en temps réel.",
      "sentence_en": "The smart electronic piano can teach beginners to play and correct mistakes in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_instruments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的团扇制作工艺包括选材、制骨、蒙面和装饰等步骤。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tuánshàn zhìzuò gōngyì bāokuò xuǎncái, zhìgǔ, méngmiàn hé zhuāngshì děng bùzhòu.",
      "sentence_fr": "L'artisanat traditionnel chinois de fabrication d'éventails ronds comprend la sélection des matériaux, la fabrication de l'armature, le revêtement et la décoration.",
      "sentence_en": "Traditional Chinese round fan making includes selecting materials, making the frame, covering, and decoration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fan_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能门禁系统支持人脸识别、刷卡和密码等多种进入方式。",
      "sentence_pinyin": "Zhìnéng ménjìn xìtǒng zhīchí rénliǎn shìbié, shuākǎ hé mìmǎ děng duō zhǒng jìnrù fāngshì.",
      "sentence_fr": "Le système de contrôle d'accès intelligent prend en charge plusieurs méthodes d'entrée : reconnaissance faciale, carte et mot de passe.",
      "sentence_en": "The smart access control system supports multiple entry methods: facial recognition, card swipe, and password.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_access_control",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "婺剧是浙江的地方戏曲,融合了多种声腔,表演风格多样。",
      "sentence_pinyin": "Wùjù shì Zhèjiāng de dìfāng xìqǔ, rónghé le duō zhǒng shēngqiāng, biǎoyǎn fēnggé duōyàng.",
      "sentence_fr": "L'opéra Wu est un opéra régional du Zhejiang, combinant plusieurs styles vocaux avec des performances variées.",
      "sentence_en": "Wu opera is a regional opera of Zhejiang, combining multiple vocal styles with diverse performance styles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wu_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府建设的廉租房项目为低收入家庭提供了负担得起的住房。",
      "sentence_pinyin": "Zhèngfǔ jiànshè de liánzūfáng xiàngmù wèi dī shōurù jiātíng tígōng le fùdān dé qǐ de zhùfáng.",
      "sentence_fr": "Le projet de logements à loyer modéré construit par le gouvernement offre des logements abordables aux familles à faibles revenus.",
      "sentence_en": "The government's low-rent housing project provides affordable housing for low-income families.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "affordable_housing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能香薰机可以根据时间和场景自动释放不同的香味。",
      "sentence_pinyin": "Zhìnéng xiāngxūnjī kěyǐ gēnjù shíjiān hé chǎngjǐng zìdòng shìfàng bùtóng de xiāngwèi.",
      "sentence_fr": "Le diffuseur d'arômes intelligent peut libérer automatiquement différents parfums selon l'heure et la situation.",
      "sentence_en": "The smart aroma diffuser can automatically release different fragrances based on time and scenario.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_diffusers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的砚台雕刻以端砚、歙砚最为著名,工艺精湛。",
      "sentence_pinyin": "Zhōngguó chuántǒng de yàntái diāokè yǐ Duānyàn, Shèyàn zuìwéi zhùmíng, gōngyì jīngzhàn.",
      "sentence_fr": "La sculpture traditionnelle chinoise de pierres à encre est la plus célèbre pour les pierres Duan et She, avec un artisanat exquis.",
      "sentence_en": "Traditional Chinese inkstone carving is most famous for Duan and She inkstones, with exquisite craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "inkstone_carving",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物饮水机可以过滤水质,保持水的清洁和新鲜。",
      "sentence_pinyin": "Zhìnéng chǒngwù yǐnshuǐjī kěyǐ guòlǜ shuǐzhì, bǎochí shuǐ de qīngjié hé xīnxiān.",
      "sentence_fr": "La fontaine à eau intelligente pour animaux peut filtrer l'eau, la gardant propre et fraîche.",
      "sentence_en": "The smart pet water fountain can filter water quality, keeping the water clean and fresh.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_pet_fountains",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "五音戏是山东的地方戏曲,唱腔婉转动听,富有乡土气息。",
      "sentence_pinyin": "Wǔyīnxì shì Shāndōng de dìfāng xìqǔ, chàngqiāng wǎnzhuǎn dòngtīng, fùyǒu xiāngtǔ qìxī.",
      "sentence_fr": "L'opéra Wuyin est un opéra régional du Shandong, avec un chant mélodieux et plein de charme rural.",
      "sentence_en": "Wuyin opera is a regional opera of Shandong, with melodious singing full of rural charm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wuyin_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的智慧停车场可以通过手机查看空位并预约车位。",
      "sentence_pinyin": "Chéngshì de zhìhuì tíngchēchǎng kěyǐ tōngguò shǒujī chákàn kòngwèi bìng yùyuē chēwèi.",
      "sentence_fr": "Les parkings intelligents de la ville permettent de consulter les places disponibles et de réserver via téléphone.",
      "sentence_en": "The city's smart parking lots allow checking available spaces and reserving spots via phone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking_lots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能儿童陪伴机器人可以讲故事、回答问题,陪伴孩子成长。",
      "sentence_pinyin": "Zhìnéng értóng péibàn jīqìrén kěyǐ jiǎng gùshì, huídá wèntí, péibàn háizi chéngzhǎng.",
      "sentence_fr": "Le robot compagnon intelligent pour enfants peut raconter des histoires, répondre aux questions et accompagner la croissance des enfants.",
      "sentence_en": "The smart companion robot for children can tell stories, answer questions, and accompany children's growth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_companion_robots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的毛笔制作讲究选料精良,工艺复杂,以湖笔最为著名。",
      "sentence_pinyin": "Zhōngguó chuántǒng de máobǐ zhìzuò jiǎngjiù xuǎnliào jīngliáng, gōngyì fùzá, yǐ Húbǐ zuìwéi zhùmíng.",
      "sentence_fr": "La fabrication traditionnelle chinoise de pinceaux met l'accent sur des matériaux de qualité et un processus complexe, les pinceaux Hu étant les plus célèbres.",
      "sentence_en": "Traditional Chinese brush making emphasizes quality materials and complex processes, with Hu brushes being most famous.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "brush_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电动牙刷可以记录刷牙数据,并提醒用户改善刷牙习惯。",
      "sentence_pinyin": "Zhìnéng diàndòng yáshuā kěyǐ jìlù shuāyá shùjù, bìng tíxǐng yònghù gǎishàn shuāyá xíguàn.",
      "sentence_fr": "La brosse à dents électrique intelligente peut enregistrer les données de brossage et rappeler aux utilisateurs d'améliorer leurs habitudes.",
      "sentence_en": "The smart electric toothbrush can record brushing data and remind users to improve their brushing habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toothbrushes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柳子戏是山东的古老剧种,唱腔古朴苍劲,具有独特的艺术魅力。",
      "sentence_pinyin": "Liǔzixì shì Shāndōng de gǔlǎo jùzhǒng, chàngqiāng gǔpǔ cāngjìn, jùyǒu dútè de yìshù mèilì.",
      "sentence_fr": "L'opéra Liuzi est un ancien genre d'opéra du Shandong, avec un chant ancien et puissant, possédant un charme artistique unique.",
      "sentence_en": "Liuzi opera is an ancient opera genre of Shandong, with ancient and vigorous singing, possessing unique artistic charm.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "liuzi_opera",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区为老年人开设了免费的健康讲座,普及健康养生知识。",
      "sentence_pinyin": "Shèqū wèi lǎoniánrén kāishè le miǎnfèi de jiànkāng jiǎngzuò, pǔjí jiànkāng yǎngshēng zhīshì.",
      "sentence_fr": "La communauté organise des conférences gratuites sur la santé pour les personnes âgées, diffusant des connaissances sur le bien-être.",
      "sentence_en": "The community offers free health lectures for the elderly, spreading health and wellness knowledge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电蒸锅可以同时蒸煮多层食物,保持食物的营养和口感。",
      "sentence_pinyin": "Zhìnéng diàn zhēngguō kěyǐ tóngshí zhēngzhǔ duō céng shíwù, bǎochí shíwù de yíngyǎng hé kǒugǎn.",
      "sentence_fr": "Le cuiseur vapeur électrique intelligent peut cuire plusieurs niveaux d'aliments simultanément, préservant leur nutrition et leur texture.",
      "sentence_en": "The smart electric steamer can steam multiple layers of food simultaneously, preserving nutrition and texture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_steamers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的宣纸制作需要经过一百多道工序,历时三年才能完成。",
      "sentence_pinyin": "Zhōngguó chuántǒng de xuānzhǐ zhìzuò xūyào jīngguò yībǎi duō dào gōngxù, lìshí sān nián cáinéng wánchéng.",
      "sentence_fr": "La fabrication traditionnelle chinoise du papier Xuan nécessite plus de cent étapes et prend trois ans pour être complétée.",
      "sentence_en": "Traditional Chinese Xuan paper making requires over one hundred processes and takes three years to complete.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xuan_paper",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
