{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子控制非门是双量子比特系统中最基本的纠缠门。",
      "sentence_pinyin": "Liàngzǐ kòngzhì fēi mén shì shuāng liàngzǐ bǐtè xìtǒng zhōng zuì jīběn de jiūchán mén.",
      "sentence_fr": "La porte NON contrôlée quantique est la porte d'intrication la plus fondamentale dans les systèmes à deux qubits.",
      "sentence_en": "The quantum controlled-NOT gate is the most fundamental entangling gate in two-qubit systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cnot_gate",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模拟性证明表明新协议的安全性归约到已知安全协议。",
      "sentence_pinyin": "Mónǐxìng zhèngmíng biǎomíng xīn xiéyì de ānquánxìng guīyuē dào yǐzhī ānquán xiéyì.",
      "sentence_fr": "Les preuves de simulation montrent que la sécurité de nouveaux protocoles se réduit à des protocoles de sécurité connus.",
      "sentence_en": "Simulation proofs show that new protocol security reduces to known secure protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "simulation_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "结构化类型系统根据类型结构而非名称确定类型兼容性。",
      "sentence_pinyin": "Jiégòuhuà lèixíng xìtǒng gēnjù lèixíng jiégòu ér fēi míngchēng quèdìng lèixíng jiānróngxìng.",
      "sentence_fr": "Les systèmes de types structurels déterminent la compatibilité des types selon leur structure plutôt que leur nom.",
      "sentence_en": "Structural type systems determine type compatibility based on type structure rather than names.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "structural_typing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黎曼流形是具有黎曼度量的光滑流形结构。",
      "sentence_pinyin": "Límàn liúxíng shì jùyǒu Límàn dùliàng de guānghuá liúxíng jiégòu.",
      "sentence_fr": "Les variétés riemanniennes sont des structures de variétés lisses avec une métrique riemannienne.",
      "sentence_en": "Riemannian manifolds are smooth manifold structures with a Riemannian metric.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "riemannian_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠熵量化量子系统之间的纠缠程度。",
      "sentence_pinyin": "Liàngzǐ jiūchán shāng liànghuà liàngzǐ xìtǒng zhījiān de jiūchán chéngdù.",
      "sentence_fr": "L'entropie d'intrication quantique quantifie le degré d'intrication entre les systèmes quantiques.",
      "sentence_en": "Quantum entanglement entropy quantifies the degree of entanglement between quantum systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_entropy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "标准模型安全性在随机预言机假设下可证明安全。",
      "sentence_pinyin": "Biāozhǔn móxíng ānquánxìng zài suíjī yùyán jī jiǎshè xià kě zhèngmíng ānquán.",
      "sentence_fr": "La sécurité du modèle standard est prouvablement sûre sous l'hypothèse de l'oracle aléatoire.",
      "sentence_en": "Standard model security is provably secure under the random oracle assumption.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "standard_model_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "名义类型系统根据类型声明的名称判断类型等价性。",
      "sentence_pinyin": "Míngyì lèixíng xìtǒng gēnjù lèixíng shēngmíng de míngchēng pànduàn lèixíng děngjià xìng.",
      "sentence_fr": "Les systèmes de types nominaux jugent l'équivalence des types selon le nom de leur déclaration.",
      "sentence_en": "Nominal type systems judge type equivalence based on type declaration names.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "nominal_typing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "卡拉比-丘流形在弦理论中扮演着紧化额外维度的关键角色。",
      "sentence_pinyin": "Kǎlābǐ-Qiū liúxíng zài xián lǐlùn zhōng bànyǎn zhe jǐnhuà éwài wéidù de guānjiàn juésè.",
      "sentence_fr": "Les variétés de Calabi-Yau jouent un rôle clé dans la compactification des dimensions supplémentaires en théorie des cordes.",
      "sentence_en": "Calabi-Yau manifolds play a key role in compactifying extra dimensions in string theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "calabi_yau_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "泡利矩阵构成单量子比特操作的完整基底。",
      "sentence_pinyin": "Pàolì jǔzhèn gòuchéng dān liàngzǐ bǐtè cāozuò de wánzhěng jīdǐ.",
      "sentence_fr": "Les matrices de Pauli forment une base complète pour les opérations à un seul qubit.",
      "sentence_en": "Pauli matrices form a complete basis for single-qubit operations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "pauli_matrices",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "通用组合性框架允许模块化构建复杂密码协议。",
      "sentence_pinyin": "Tōngyòng zǔhéxìng kuàngjià yǔnxǔ mókuàihuà gòujiàn fùzá mìmǎ xiéyì.",
      "sentence_fr": "Le cadre de composabilité universelle permet de construire de manière modulaire des protocoles cryptographiques complexes.",
      "sentence_en": "Universal composability framework allows modular construction of complex cryptographic protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_composability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "渐进类型系统允许程序员选择性地添加类型标注。",
      "sentence_pinyin": "Jiànjìn lèixíng xìtǒng yǔnxǔ chéngxùyuán xuǎnzéxìng de tiānjiā lèixíng biāozhù.",
      "sentence_fr": "Les systèmes de types graduels permettent aux programmeurs d'ajouter sélectivement des annotations de type.",
      "sentence_en": "Gradual type systems allow programmers to selectively add type annotations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "gradual_typing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "庞加莱对偶性联系了流形的同调群和上同调群。",
      "sentence_pinyin": "Pángjiālái duìǒuxìng liánxì le liúxíng de tóngdiào qún hé shàng tóngdiào qún.",
      "sentence_fr": "La dualité de Poincaré relie les groupes d'homologie et de cohomologie des variétés.",
      "sentence_en": "Poincaré duality connects the homology and cohomology groups of manifolds.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "poincare_duality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "布洛赫球面几何表示单量子比特的所有可能纯态。",
      "sentence_pinyin": "Bùluòhè qiúmiàn jǐhé biǎoshì dān liàngzǐ bǐtè de suǒyǒu kěnéng chún tài.",
      "sentence_fr": "La géométrie de la sphère de Bloch représente tous les états purs possibles d'un seul qubit.",
      "sentence_en": "Bloch sphere geometry represents all possible pure states of a single qubit.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bloch_sphere",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "选择明文攻击假设攻击者可以获取任意明文的密文。",
      "sentence_pinyin": "Xuǎnzé míngwén gōngjī jiǎshè gōngjīzhě kěyǐ huòqǔ rènyì míngwén de mìwén.",
      "sentence_fr": "L'attaque à texte clair choisi suppose que l'attaquant peut obtenir le chiffré de n'importe quel texte clair.",
      "sentence_en": "Chosen plaintext attack assumes the attacker can obtain ciphertext of arbitrary plaintext.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "chosen_plaintext_attack",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流类型通过静态分析跟踪程序中值的可能类型。",
      "sentence_pinyin": "Liú lèixíng tōngguò jìngtài fēnxī gēnzōng chéngxù zhōng zhí de kěnéng lèixíng.",
      "sentence_fr": "Les types de flux suivent les types possibles des valeurs dans les programmes par analyse statique.",
      "sentence_en": "Flow types track possible types of values in programs through static analysis.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "flow_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "正交群是保持内积不变的线性变换构成的李群。",
      "sentence_pinyin": "Zhèngjiāo qún shì bǎochí nèijī bù biàn de xiànxìng biànhuàn gòuchéng de Lǐ qún.",
      "sentence_fr": "Le groupe orthogonal est un groupe de Lie formé par les transformations linéaires préservant le produit scalaire.",
      "sentence_en": "The orthogonal group is a Lie group formed by linear transformations preserving inner products.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "orthogonal_groups",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "贝尔不等式实验验证量子力学预言与局域实在论的冲突。",
      "sentence_pinyin": "Bèi'ěr bù děngshì shíyàn yànzhèng liàngzǐ lìxué yùyán yǔ júyù shízài lùn de chōngtū.",
      "sentence_fr": "Les expériences d'inégalité de Bell vérifient le conflit entre les prédictions de la mécanique quantique et le réalisme local.",
      "sentence_en": "Bell inequality experiments verify the conflict between quantum mechanics predictions and local realism.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bell_inequality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语义安全保证密文不泄露明文的任何可计算信息。",
      "sentence_pinyin": "Yǔyì ānquán bǎozhèng mìwén bù xièlòu míngwén de rènhé kě jìsuàn xìnxī.",
      "sentence_fr": "La sécurité sémantique garantit que le chiffré ne révèle aucune information calculable sur le texte clair.",
      "sentence_en": "Semantic security guarantees ciphertext reveals no computationally obtainable information about plaintext.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "semantic_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿射类型介于线性类型和普通类型之间允许丢弃但不允许复制。",
      "sentence_pinyin": "Fǎngshè lèixíng jièyú xiànxìng lèixíng hé pǔtōng lèixíng zhījiān yǔnxǔ diūqì dàn bù yǔnxǔ fùzhì.",
      "sentence_fr": "Les types affines se situent entre les types linéaires et ordinaires, permettant l'abandon mais pas la copie.",
      "sentence_en": "Affine types lie between linear and ordinary types allowing discard but not copy.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "affine_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "李代数是李群切空间上定义的代数结构。",
      "sentence_pinyin": "Lǐ dàishù shì Lǐ qún qiè kōngjiān shàng dìngyì de dàishù jiégòu.",
      "sentence_fr": "Les algèbres de Lie sont des structures algébriques définies sur l'espace tangent des groupes de Lie.",
      "sentence_en": "Lie algebras are algebraic structures defined on the tangent space of Lie groups.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "lie_algebras",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
