{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "合成生物学的进步使科学家能够设计具有全新功能的微生物用于工业生产。",
      "sentence_pinyin": "Héchéng shēngwù xué de jìnbù shǐ kēxué jiā nénggòu shèjì jùyǒu quánxīn gōngnéng de wéishēngwù yòngyú gōngyè shēngchǎn.",
      "sentence_fr": "Les progrès de la biologie synthétique permettent aux scientifiques de concevoir des micro-organismes aux fonctions entièrement nouvelles pour la production industrielle.",
      "sentence_en": "Advances in synthetic biology enable scientists to design microorganisms with entirely new functions for industrial production.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "synthetic_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化遗产数字化项目正在利用三维扫描技术永久保存濒危的历史建筑。",
      "sentence_pinyin": "Wénhuà yíchǎn shùzì huà xiàngmù zhèngzài lìyòng sānwéi sǎomiáo jìshù yǒngjiǔ bǎocún bīnwēi de lìshǐ jiànzhù.",
      "sentence_fr": "Les projets de numérisation du patrimoine culturel utilisent la technologie de numérisation 3D pour préserver de manière permanente les bâtiments historiques menacés.",
      "sentence_en": "Cultural heritage digitization projects are using 3D scanning technology to permanently preserve endangered historical buildings.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_heritage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微电网技术为偏远地区提供了独立于主电网的可靠可再生能源解决方案。",
      "sentence_pinyin": "Wēi diànwǎng jìshù wèi piānyuǎn dìqū tígōng le dúlì yú zhǔ diànwǎng de kěkào kě zàishēng néngyuán jiějué fāng'àn.",
      "sentence_fr": "La technologie des microréseaux offre aux régions éloignées des solutions d'énergie renouvelable fiables, indépendantes du réseau électrique principal.",
      "sentence_en": "Microgrid technology provides remote areas with reliable renewable energy solutions independent of the main power grid.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microgrid_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨学科研究方法在解决气候变化等复杂全球性问题时展现出独特优势。",
      "sentence_pinyin": "Kuà xuékē yánjiū fāngfǎ zài jiějué qìhòu biànhuà děng fùzá quánqiú xìng wèntí shí zhǎnxiàn chū dútè yōushì.",
      "sentence_fr": "Les méthodes de recherche interdisciplinaires présentent des avantages uniques pour résoudre des problèmes mondiaux complexes comme le changement climatique.",
      "sentence_en": "Interdisciplinary research methods show unique advantages in solving complex global issues like climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "interdisciplinary_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情感计算技术使计算机能够识别和响应用户的情绪状态以提供更人性化的交互体验。",
      "sentence_pinyin": "Qínggǎn jìsuàn jìshù shǐ jìsuànjī nénggòu shìbié hé xiǎngyìng yònghù de qíngxù zhuàngtài yǐ tígōng gèng rénxìng huà de jiāohù tǐyàn.",
      "sentence_fr": "La technologie de l'informatique affective permet aux ordinateurs de reconnaître et de répondre aux états émotionnels des utilisateurs pour offrir une expérience d'interaction plus humanisée.",
      "sentence_en": "Affective computing technology enables computers to recognize and respond to users' emotional states to provide more humanized interaction experiences.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "affective_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市绿道网络的建设不仅促进了居民健康，还增强了城市的生态连通性。",
      "sentence_pinyin": "Chéngshì lǜdào wǎngluò de jiànshè bùjǐn cùjìn le jūmín jiànkāng, hái zēngqiáng le chéngshì de shēngtài liántōng xìng.",
      "sentence_fr": "La construction de réseaux de voies vertes urbaines favorise non seulement la santé des résidents, mais renforce également la connectivité écologique de la ville.",
      "sentence_en": "The construction of urban greenway networks not only promotes resident health but also enhances the city's ecological connectivity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_greenways",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语音识别系统在处理方言和口音变体方面仍然面临重大技术挑战。",
      "sentence_pinyin": "Yǔyīn shìbié xìtǒng zài chǔlǐ fāngyán hé kǒuyīn biàntǐ fāngmiàn réngrán miànlín zhòngdà jìshù tiǎozhàn.",
      "sentence_fr": "Les systèmes de reconnaissance vocale font encore face à des défis techniques majeurs dans le traitement des dialectes et des variantes d'accent.",
      "sentence_en": "Speech recognition systems still face significant technical challenges in handling dialects and accent variations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "speech_recognition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会流动性研究揭示了教育机会不平等对代际贫困传递的深远影响。",
      "sentence_pinyin": "Shèhuì liúdòng xìng yánjiū jiēshì le jiàoyù jīhuì bù píngděng duì dàijì pínkùn chuándì de shēnyuǎn yǐngxiǎng.",
      "sentence_fr": "Les études sur la mobilité sociale révèlent l'impact profond de l'inégalité des opportunités éducatives sur la transmission intergénérationnelle de la pauvreté.",
      "sentence_en": "Social mobility research reveals the profound impact of educational opportunity inequality on intergenerational poverty transmission.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_mobility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳米材料在药物递送系统中的应用大大提高了癌症治疗的靶向性和效果。",
      "sentence_pinyin": "Nàmǐ cáiliào zài yàowù dìsòng xìtǒng zhōng de yìngyòng dàdà tígāo le áizhèng zhìliáo de bǎoxiàng xìng hé xiàoguǒ.",
      "sentence_fr": "L'application des nanomatériaux dans les systèmes d'administration de médicaments a considérablement amélioré le ciblage et l'efficacité des traitements contre le cancer.",
      "sentence_en": "The application of nanomaterials in drug delivery systems has greatly improved the targeting and effectiveness of cancer treatments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nanomedicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "批判性思维教育应该贯穿于各个学科，而不仅仅是作为独立课程来教授。",
      "sentence_pinyin": "Pīpàn xìng sīwéi jiàoyù yīnggāi guànchuān yú gège xuékē, ér bùjǐn jǐn shì zuòwéi dúlì kèchéng lái jiàoshòu.",
      "sentence_fr": "L'éducation à la pensée critique devrait être intégrée à toutes les disciplines, et pas seulement enseignée comme un cours indépendant.",
      "sentence_en": "Critical thinking education should be integrated across all disciplines, not just taught as a standalone course.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "critical_thinking_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "深海采矿活动可能对尚未被充分研究的海底生态系统造成不可逆转的损害。",
      "sentence_pinyin": "Shēnhǎi cǎikuàng huódòng kěnéng duì shàngwèi bèi chōngfèn yánjiū de hǎidǐ shēngtài xìtǒng zàochéng bùkě nìzhuǎn de sǔnhài.",
      "sentence_fr": "Les activités minières en eaux profondes pourraient causer des dommages irréversibles aux écosystèmes des fonds marins qui n'ont pas encore été suffisamment étudiés.",
      "sentence_en": "Deep-sea mining activities may cause irreversible damage to seabed ecosystems that have not yet been adequately studied.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deep_sea_mining",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "增强现实技术正在改变零售业的购物体验，让消费者可以虚拟试穿商品。",
      "sentence_pinyin": "Zēngqiáng xiànshí jìshù zhèngzài gǎibiàn língshòu yè de gòuwù tǐyàn, ràng xiāofèi zhě kěyǐ xūnǐ shìchuān shāngpǐn.",
      "sentence_fr": "La technologie de réalité augmentée transforme l'expérience d'achat dans le commerce de détail, permettant aux consommateurs d'essayer virtuellement les produits.",
      "sentence_en": "Augmented reality technology is changing the retail shopping experience, allowing consumers to virtually try on products.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ar_retail",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际人道主义法在武装冲突中保护平民和战俘方面发挥着至关重要的作用。",
      "sentence_pinyin": "Guójì réndào zhǔyì fǎ zài wǔzhuāng chōngtū zhōng bǎohù píngmín hé zhànfú fāngmiàn fāhuī zhe zhìguān zhòngyào de zuòyòng.",
      "sentence_fr": "Le droit international humanitaire joue un rôle crucial dans la protection des civils et des prisonniers de guerre pendant les conflits armés.",
      "sentence_en": "International humanitarian law plays a crucial role in protecting civilians and prisoners of war during armed conflicts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "humanitarian_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "计算流体动力学模拟帮助工程师优化飞机机翼设计以减少燃油消耗。",
      "sentence_pinyin": "Jìsuàn liútǐ dònglì xué mónǐ bāngzhù gōngchéngshī yōuhuà fēijī jīyì shèjì yǐ jiǎnshǎo rányóu xiāohào.",
      "sentence_fr": "Les simulations de dynamique des fluides computationnelle aident les ingénieurs à optimiser la conception des ailes d'avion pour réduire la consommation de carburant.",
      "sentence_en": "Computational fluid dynamics simulations help engineers optimize aircraft wing design to reduce fuel consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "computational_fluid_dynamics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "正念冥想训练已被证明能有效降低压力水平并改善整体心理健康状况。",
      "sentence_pinyin": "Zhèngniàn míngxiǎng xùnliàn yǐ bèi zhèngmíng néng yǒuxiào jiàngdī yālì shuǐpíng bìng gǎishàn zhěngtǐ xīnlǐ jiànkāng zhuàngkuàng.",
      "sentence_fr": "L'entraînement à la méditation de pleine conscience s'est avéré efficace pour réduire le niveau de stress et améliorer la santé mentale globale.",
      "sentence_en": "Mindfulness meditation training has been proven to effectively reduce stress levels and improve overall mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mindfulness_meditation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "食品科技初创企业正在开发植物基替代品以减少畜牧业对环境的影响。",
      "sentence_pinyin": "Shípǐn kējì chūchuàng qǐyè zhèngzài kāifā zhíwù jī tìdài pǐn yǐ jiǎnshǎo xùmù yè duì huánjìng de yǐngxiǎng.",
      "sentence_fr": "Les startups de technologie alimentaire développent des substituts à base de plantes pour réduire l'impact environnemental de l'élevage.",
      "sentence_en": "Food tech startups are developing plant-based alternatives to reduce the environmental impact of livestock farming.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据可视化技术帮助决策者更直观地理解复杂数据集中的模式和趋势。",
      "sentence_pinyin": "Shùjù kěshì huà jìshù bāngzhù juécè zhě gèng zhíguān de lǐjiě fùzá shùjù jí zhōng de móshì hé qūshì.",
      "sentence_fr": "Les techniques de visualisation de données aident les décideurs à comprendre de manière plus intuitive les modèles et les tendances dans les ensembles de données complexes.",
      "sentence_en": "Data visualization techniques help decision-makers more intuitively understand patterns and trends in complex datasets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_visualization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言权利运动倡导保护少数民族语言免受主流语言同化的威胁。",
      "sentence_pinyin": "Yǔyán quánlì yùndòng chàngdǎo bǎohù shǎoshù mínzú yǔyán miǎnshòu zhǔliú yǔyán tónghuà de wēixié.",
      "sentence_fr": "Le mouvement pour les droits linguistiques préconise la protection des langues minoritaires contre la menace d'assimilation par les langues dominantes.",
      "sentence_en": "The linguistic rights movement advocates protecting minority languages from the threat of assimilation by dominant languages.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "linguistic_rights",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "机器人辅助外科手术系统使外科医生能够进行更加精确的微创手术操作。",
      "sentence_pinyin": "Jīqìrén fǔzhù wàikē shǒushù xìtǒng shǐ wàikē yīshēng nénggòu jìnxíng gèngjiā jīngquè de wēichuàng shǒushù cāozuò.",
      "sentence_fr": "Les systèmes de chirurgie assistée par robot permettent aux chirurgiens d'effectuer des opérations mini-invasives plus précises.",
      "sentence_en": "Robot-assisted surgical systems enable surgeons to perform more precise minimally invasive surgical operations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "robotic_surgery",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可持续时尚运动鼓励消费者选择高质量耐用服装而非快时尚产品。",
      "sentence_pinyin": "Kěchíxù shízhuāng yùndòng gǔlì xiāofèi zhě xuǎnzé gāo zhìliàng nàiyòng fúzhuāng ér fēi kuài shízhuāng chǎnpǐn.",
      "sentence_fr": "Le mouvement de la mode durable encourage les consommateurs à choisir des vêtements de qualité et durables plutôt que des produits de la fast fashion.",
      "sentence_en": "The sustainable fashion movement encourages consumers to choose high-quality durable clothing rather than fast fashion products.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sustainable_fashion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
