{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个生物科技公司专注于基因治疗和精准医疗领域的研究开发。",
      "sentence_pinyin": "Zhège shēngwù kējì gōngsī zhuānzhù yú jīyīn zhìliáo hé jīngzhǔn yīliáo lǐngyù de yánjiū kāifā.",
      "sentence_fr": "Cette entreprise de biotechnologie se concentre sur la recherche et le développement dans les domaines de la thérapie génique et de la médecine de précision.",
      "sentence_en": "This biotech company focuses on research and development in gene therapy and precision medicine.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "biotechnology",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的陶艺作品将实用功能和艺术美感巧妙结合。",
      "sentence_pinyin": "Tā de táoyì zuòpǐn jiāng shíyòng gōngnéng hé yìshù měigǎn qiǎomiào jiéhé.",
      "sentence_fr": "Ses œuvres en céramique combinent habilement fonctionnalité pratique et esthétique artistique.",
      "sentence_en": "Her ceramic works skillfully combine practical functionality with artistic aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ceramics",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职业指导中心帮助求职者提升面试技巧和职业规划能力。",
      "sentence_pinyin": "Zhège zhíyè zhǐdǎo zhōngxīn bāngzhù qiúzhízhě tíshēng miànshì jìqiǎo hé zhíyè guīhuà nénglì.",
      "sentence_fr": "Ce centre d'orientation professionnelle aide les chercheurs d'emploi à améliorer leurs compétences en entretien et leurs capacités de planification de carrière.",
      "sentence_en": "This career guidance center helps job seekers improve their interview skills and career planning abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "career_counseling",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在登山探险中积累了丰富的野外生存经验和技能。",
      "sentence_pinyin": "Tā zài dēngshān tànxiǎn zhōng jīlěile fēngfù de yěwài shēngcún jīngyàn hé jìnéng.",
      "sentence_fr": "Il a accumulé une riche expérience et des compétences de survie en pleine nature lors d'explorations en montagne.",
      "sentence_en": "He accumulated rich wilderness survival experience and skills during mountain expeditions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wilderness_survival",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个图书出版项目获得了国家文化基金的资助和支持。",
      "sentence_pinyin": "Zhège túshū chūbǎn xiàngmù huòdéle guójiā wénhuà jījīn de zīzhù hé zhīchí.",
      "sentence_fr": "Ce projet de publication de livres a obtenu le financement et le soutien du Fonds national de la culture.",
      "sentence_en": "This book publishing project received funding and support from the National Culture Fund.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "book_publishing",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过制定合理的投资策略实现了财富的稳健增长。",
      "sentence_pinyin": "Tā tōngguò zhìdìng hélǐ de tóuzī cèlüè shíxiànle cáifù de wěnjiàn zēngzhǎng.",
      "sentence_fr": "Elle a réalisé une croissance stable de sa richesse en élaborant des stratégies d'investissement raisonnables.",
      "sentence_en": "She achieved stable wealth growth by developing reasonable investment strategies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wealth_management",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个机场采用了人脸识别和自助值机等智能化服务系统。",
      "sentence_pinyin": "Zhège jīchǎng cǎiyòngle rénliǎn shíbié hé zìzhù zhíjī děng zhìnénghuà fúwù xìtǒng.",
      "sentence_fr": "Cet aéroport a adopté des systèmes de services intelligents tels que la reconnaissance faciale et l'enregistrement en libre-service.",
      "sentence_en": "This airport adopted intelligent service systems such as facial recognition and self-check-in.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "airport_technology",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在音乐教学中注重激发学生的创造力和音乐表现力。",
      "sentence_pinyin": "Tā zài yīnyuè jiàoxué zhōng zhùzhòng jīfā xuésheng de chuàngzàolì hé yīnyuè biǎoxiànlì.",
      "sentence_fr": "Dans l'enseignement musical, il met l'accent sur le développement de la créativité et de l'expression musicale des étudiants.",
      "sentence_en": "In music teaching, he emphasizes developing students' creativity and musical expression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_teaching",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保组织发起了保护海洋生态的公益倡导活动。",
      "sentence_pinyin": "Zhège huánbǎo zǔzhī fāqǐle bǎohù hǎiyáng shēngtài de gōngyì chàngdǎo huódòng.",
      "sentence_fr": "Cette organisation environnementale a lancé une campagne de sensibilisation pour la protection de l'écosystème marin.",
      "sentence_en": "This environmental organization launched a public advocacy campaign for marine ecosystem protection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ocean_conservation",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的插花作品充满诗意，展现了东方美学的独特魅力。",
      "sentence_pinyin": "Tā de chāhuā zuòpǐn chōngmǎn shīyì, zhǎnxiànle dōngfāng měixué de dútè mèilì.",
      "sentence_fr": "Ses arrangements floraux sont pleins de poésie, montrant le charme unique de l'esthétique orientale.",
      "sentence_en": "Her floral arrangements are full of poetry, showcasing the unique charm of Eastern aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "floral_art",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创客空间为发明爱好者提供工具设备和技术指导。",
      "sentence_pinyin": "Zhège chuàngkè kōngjiān wèi fāmíng àihàozhě tígōng gōngjù shèbèi hé jìshù zhǐdǎo.",
      "sentence_fr": "Cet espace maker fournit outils, équipements et conseils techniques aux passionnés d'invention.",
      "sentence_en": "This maker space provides tools, equipment, and technical guidance to invention enthusiasts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "maker_spaces",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在竞赛准备过程中培养了坚韧不拔的意志品质。",
      "sentence_pinyin": "Tā zài jìngsài zhǔnbèi guòchéng zhōng péiyǎngle jiānrèn bùbá de yìzhì pǐnzhì.",
      "sentence_fr": "Il a développé une volonté tenace et persévérante lors de la préparation de la compétition.",
      "sentence_en": "He developed tenacious and persevering willpower during competition preparation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "character_development",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧农业项目实现了农作物生长的精准监测和管理。",
      "sentence_pinyin": "Zhège zhìhuì nóngyè xiàngmù shíxiànle nóngzuòwù shēngzhǎng de jīngzhǔn jiāncè hé guǎnlǐ.",
      "sentence_fr": "Ce projet d'agriculture intelligente a réalisé la surveillance et la gestion précises de la croissance des cultures.",
      "sentence_en": "This smart agriculture project achieved precise monitoring and management of crop growth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_agriculture",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在纪录片制作中真实记录了普通人的生活故事和情感。",
      "sentence_pinyin": "Tā zài jìlùpiàn zhìzuò zhōng zhēnshí jìlùle pǔtōngrén de shēnghuó gùshi hé qínggǎn.",
      "sentence_fr": "Dans la production de documentaires, elle enregistre authentiquement les histoires de vie et les émotions des gens ordinaires.",
      "sentence_en": "In documentary production, she authentically records the life stories and emotions of ordinary people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "documentary_filmmaking",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个健康监测设备可以实时追踪用户的各项生命体征数据。",
      "sentence_pinyin": "Zhège jiànkāng jiāncè shèbèi kěyǐ shíshí zhuīzōng yònghù de gè xiàng shēngmìng tǐzhēng shùjù.",
      "sentence_fr": "Cet appareil de surveillance de la santé peut suivre en temps réel diverses données de signes vitaux des utilisateurs.",
      "sentence_en": "This health monitoring device can track various vital sign data of users in real time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_monitoring",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在创业初期克服了资金短缺和市场竞争等诸多困难。",
      "sentence_pinyin": "Tā zài chuàngyè chūqī kèfúle zījīn duǎnquē hé shìchǎng jìngzhēng děng zhūduō kùnnan.",
      "sentence_fr": "Au début de son entreprise, il a surmonté de nombreuses difficultés telles que le manque de financement et la concurrence du marché.",
      "sentence_en": "In the early stages of starting his business, he overcame many difficulties such as funding shortages and market competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startup_challenges",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个文化馆定期举办非遗传承和民俗体验活动。",
      "sentence_pinyin": "Zhège wénhuàguǎn dìngqī jǔbàn fēiyí chuánchéng hé mínsú tǐyàn huódòng.",
      "sentence_fr": "Cette maison de la culture organise régulièrement des activités de transmission du patrimoine immatériel et d'expérience folklorique.",
      "sentence_en": "This cultural center regularly holds intangible heritage transmission and folk custom experience activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_heritage",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的教育研究成果为改进教学方法提供了理论依据。",
      "sentence_pinyin": "Tā de jiàoyù yánjiū chéngguǒ wèi gǎijìn jiàoxué fāngfǎ tígōngle lǐlùn yījù.",
      "sentence_fr": "Ses résultats de recherche en éducation fournissent une base théorique pour améliorer les méthodes d'enseignement.",
      "sentence_en": "Her educational research results provide theoretical basis for improving teaching methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "educational_research",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社交软件注重保护用户隐私和数据安全。",
      "sentence_pinyin": "Zhège shèjiāo ruǎnjiàn zhùzhòng bǎohù yònghù yǐnsī hé shùjù ānquán.",
      "sentence_fr": "Cette application sociale met l'accent sur la protection de la vie privée des utilisateurs et la sécurité des données.",
      "sentence_en": "This social software emphasizes protecting user privacy and data security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "data_privacy",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在工艺品制作中传承了家族世代相传的传统技艺。",
      "sentence_pinyin": "Tā zài gōngyìpǐn zhìzuò zhōng chuánchéngle jiāzú shìdài xiāngchuán de chuántǒng jìyì.",
      "sentence_fr": "Dans la fabrication d'artisanat, il perpétue les techniques traditionnelles transmises de génération en génération dans sa famille.",
      "sentence_en": "In crafts making, he inherits traditional skills passed down through generations in his family.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "traditional_crafts",
      "created_at": "2025-11-20T18:05:00.000Z",
      "updated_at": "2025-11-20T18:05:00.000Z"
    }
  ]
}
