{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个公益图书馆为偏远地区的孩子们提供了丰富的阅读资源。",
      "sentence_pinyin": "Zhège gōngyì túshūguǎn wèi piānyuǎn dìqū de háizimen tígōngle fēngfù de yuèdú zīyuán.",
      "sentence_fr": "Cette bibliothèque caritative fournit des ressources de lecture abondantes aux enfants des régions éloignées.",
      "sentence_en": "This charitable library provides abundant reading resources for children in remote areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charitable_libraries",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在陶艺制作中体验到了从泥土到艺术品的创作过程。",
      "sentence_pinyin": "Tā zài táoyì zhìzuò zhōng tǐyàn dàole cóng nítǔ dào yìshùpǐn de chuàngzuò guòchéng.",
      "sentence_fr": "Dans la création de céramique, elle a vécu le processus créatif de la terre à l'œuvre d'art.",
      "sentence_en": "In pottery making, she experienced the creative process from clay to artwork.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pottery",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧停车系统通过手机应用帮助司机快速找到停车位。",
      "sentence_pinyin": "Zhège zhìhuì tíngchē xìtǒng tōngguò shǒujī yìngyòng bāngzhù sījī kuàisù zhǎodào tíngchēwèi.",
      "sentence_fr": "Ce système de stationnement intelligent aide les conducteurs à trouver rapidement une place de parking via une application mobile.",
      "sentence_en": "This smart parking system helps drivers quickly find parking spots through a mobile app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在摄影展中展出了一组记录城市变迁的黑白照片。",
      "sentence_pinyin": "Tā zài shèyǐng zhǎn zhōng zhǎnchūle yī zǔ jìlù chéngshì biànqiān de hēibái zhàopiàn.",
      "sentence_fr": "Il a exposé lors de l'exposition photographique une série de photos en noir et blanc documentant les transformations urbaines.",
      "sentence_en": "He exhibited a series of black and white photos documenting urban transformation at the photography exhibition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_photography",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个家庭医生服务为社区居民提供了便捷的基础医疗保健。",
      "sentence_pinyin": "Zhège jiātíng yīshēng fúwù wèi shèqū jūmín tígōngle biànjié de jīchǔ yīliáo bǎojiàn.",
      "sentence_fr": "Ce service de médecin de famille fournit des soins de santé de base pratiques aux résidents de la communauté.",
      "sentence_en": "This family doctor service provides convenient basic healthcare to community residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family_medicine",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的油画作品色彩浓郁，充满了强烈的情感表达。",
      "sentence_pinyin": "Tā de yóuhuà zuòpǐn sècǎi nóngyù, chōngmǎnle qiángliè de qínggǎn biǎodá.",
      "sentence_fr": "Ses peintures à l'huile ont des couleurs riches et sont remplies d'expressions émotionnelles intenses.",
      "sentence_en": "Her oil paintings have rich colors and are filled with intense emotional expression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "oil_painting",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创业加速器为初创公司提供导师指导和融资对接服务。",
      "sentence_pinyin": "Zhège chuàngyè jiāsùqì wèi chūchuàng gōngsī tígōng dǎoshī zhǐdǎo hé róngzī duìjiē fúwù.",
      "sentence_fr": "Cet accélérateur de startups fournit des services de mentorat et de mise en relation avec des financements pour les jeunes entreprises.",
      "sentence_en": "This startup accelerator provides mentorship and financing matchmaking services for young companies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startup_accelerators",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在攀岩运动中锻炼了体能和克服困难的勇气。",
      "sentence_pinyin": "Tā zài pānyán yùndòng zhōng duànliànle tǐnéng hé kèfú kùnnan de yǒngqì.",
      "sentence_fr": "Dans l'escalade, il a développé sa condition physique et son courage pour surmonter les difficultés.",
      "sentence_en": "In rock climbing, he developed his physical fitness and courage to overcome difficulties.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rock_climbing",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字博物馆利用虚拟现实技术重现了古代文明的辉煌。",
      "sentence_pinyin": "Zhège shùzì bówùguǎn lìyòng xūnǐ xiànshí jìshù chóngxiànle gǔdài wénmíng de huīhuáng.",
      "sentence_fr": "Ce musée numérique utilise la technologie de réalité virtuelle pour recréer la splendeur des civilisations anciennes.",
      "sentence_en": "This digital museum uses virtual reality technology to recreate the splendor of ancient civilizations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_museums",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在非遗传承工作中努力保护和弘扬传统民间艺术。",
      "sentence_pinyin": "Tā zài fēiyí chuánchéng gōngzuò zhōng nǔlì bǎohù hé hóngyáng chuántǒng mínjiān yìshù.",
      "sentence_fr": "Dans le travail de transmission du patrimoine culturel immatériel, elle s'efforce de protéger et de promouvoir l'art folklorique traditionnel.",
      "sentence_en": "In intangible cultural heritage transmission work, she strives to protect and promote traditional folk art.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_heritage",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个太阳能发电系统为偏远山区带来了稳定的电力供应。",
      "sentence_pinyin": "Zhège tàiyángnéng fādiàn xìtǒng wèi piānyuǎn shānqū dàiláile wěndìng de diànlì gōngyìng.",
      "sentence_fr": "Ce système de production d'énergie solaire apporte une alimentation électrique stable aux régions montagneuses éloignées.",
      "sentence_en": "This solar power generation system brings stable electricity supply to remote mountainous areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "solar_energy",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在民族音乐研究中发掘整理了大量珍贵的传统曲目。",
      "sentence_pinyin": "Tā zài mínzú yīnyuè yánjiū zhōng fājué zhěnglǐle dàliàng zhēnguì de chuántǒng qǔmù.",
      "sentence_fr": "Dans ses recherches sur la musique ethnique, il a découvert et compilé de nombreuses pièces traditionnelles précieuses.",
      "sentence_en": "In his ethnic music research, he discovered and compiled numerous precious traditional pieces.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ethnic_music",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食品溯源系统让消费者可以查询产品的完整生产链信息。",
      "sentence_pinyin": "Zhège shípǐn sùyuán xìtǒng ràng xiāofèizhě kěyǐ cháxún chǎnpǐn de wánzhěng shēngchǎn liàn xìnxī.",
      "sentence_fr": "Ce système de traçabilité alimentaire permet aux consommateurs de consulter les informations complètes de la chaîne de production des produits.",
      "sentence_en": "This food traceability system allows consumers to check complete production chain information of products.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_traceability",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在花艺设计中巧妙融合了东西方的审美理念。",
      "sentence_pinyin": "Tā zài huāyì shèjì zhōng qiǎomiào rónghéle dōngxīfāng de shěnměi lǐniàn.",
      "sentence_fr": "Dans la conception florale, elle a habilement fusionné les concepts esthétiques orientaux et occidentaux.",
      "sentence_en": "In floral design, she skillfully blended Eastern and Western aesthetic concepts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "floral_design",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个远程医疗平台连接了城乡医疗资源，缩小了医疗服务差距。",
      "sentence_pinyin": "Zhège yuǎnchéng yīliáo píngtái liánjiēle chéngxiāng yīliáo zīyuán, suōxiǎole yīliáo fúwù chājù.",
      "sentence_fr": "Cette plateforme de télémédecine connecte les ressources médicales urbaines et rurales, réduisant l'écart des services de santé.",
      "sentence_en": "This telemedicine platform connects urban and rural medical resources, narrowing the healthcare service gap.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "telemedicine",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在棒球训练中培养了团队协作精神和快速反应能力。",
      "sentence_pinyin": "Tā zài bàngqiú xùnliàn zhōng péiyǎngle tuánduì xiézuò jīngshén hé kuàisù fǎnyìng nénglì.",
      "sentence_fr": "Lors de l'entraînement au baseball, il a développé l'esprit d'équipe et la capacité de réaction rapide.",
      "sentence_en": "During baseball training, he developed teamwork spirit and quick reaction ability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "baseball",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职业咨询中心帮助年轻人规划职业发展道路和提升就业技能。",
      "sentence_pinyin": "Zhège zhíyè zīxún zhōngxīn bāngzhù niánqīngrén guīhuà zhíyè fāzhǎn dàolù hé tíshēng jiùyè jìnéng.",
      "sentence_fr": "Ce centre de conseil en carrière aide les jeunes à planifier leur parcours professionnel et à améliorer leurs compétences d'emploi.",
      "sentence_en": "This career counseling center helps young people plan their career paths and improve employment skills.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "career_counseling",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的装置艺术作品用日常物品表达了对现代生活的思考。",
      "sentence_pinyin": "Tā de zhuāngzhì yìshù zuòpǐn yòng rìcháng wùpǐn biǎodále duì xiàndài shēnghuó de sīkǎo.",
      "sentence_fr": "Ses œuvres d'installation artistique utilisent des objets quotidiens pour exprimer une réflexion sur la vie moderne.",
      "sentence_en": "Her installation art works use everyday objects to express reflections on modern life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "installation_art",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个区块链应用确保了交易数据的安全性和不可篡改性。",
      "sentence_pinyin": "Zhège qūkuàiliàn yìngyòng quèbǎole jiāoyì shùjù de ānquánxìng hé bù kě cuàngǎi xìng.",
      "sentence_fr": "Cette application blockchain assure la sécurité et l'inaltérabilité des données de transaction.",
      "sentence_en": "This blockchain application ensures the security and immutability of transaction data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "blockchain",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在排球比赛中展现了出色的拦网技术和比赛意识。",
      "sentence_pinyin": "Tā zài páiqiú bǐsài zhōng zhǎnxiànle chūsè de lánwǎng jìshù hé bǐsài yìshí.",
      "sentence_fr": "Il a démontré une excellente technique de blocage et une conscience du jeu lors du match de volley-ball.",
      "sentence_en": "He demonstrated excellent blocking technique and game awareness in the volleyball match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volleyball",
      "created_at": "2025-11-20T18:50:00.000Z",
      "updated_at": "2025-11-20T18:50:00.000Z"
    }
  ]
}
