{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子态密度矩阵完整描述混合量子态的统计性质。",
      "sentence_pinyin": "Liàngzǐ tài mìdù jǔzhèn wánzhěng miáoshù hùnhé liàngzǐ tài de tǒngjì xìngzhì.",
      "sentence_fr": "La matrice densité d'état quantique décrit complètement les propriétés statistiques des états quantiques mixtes.",
      "sentence_en": "Quantum state density matrices completely describe statistical properties of mixed quantum states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "density_matrices",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "递归简洁非交互知识论证实现了超紧凑的证明验证。",
      "sentence_pinyin": "Dìguī jiǎnjié fēi jiāohù zhīshì lùnzhèng shíxiàn le chāo jǐncòu de zhèngmíng yànzhèng.",
      "sentence_fr": "Les arguments de connaissance succincts non interactifs récursifs permettent une vérification de preuve ultra-compacte.",
      "sentence_en": "Recursive succinct non-interactive arguments of knowledge enable ultra-compact proof verification.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "recursive_snarks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协变和逆变描述类型构造器对子类型关系的保持或反转。",
      "sentence_pinyin": "Xiébiàn hé nìbiàn miáoshù lèixíng gòuzào qì duì zǐ lèixíng guānxì de bǎochí huò fǎnzhuǎn.",
      "sentence_fr": "La covariance et la contravariance décrivent la préservation ou l'inversion des relations de sous-typage par les constructeurs de types.",
      "sentence_en": "Covariance and contravariance describe type constructors' preservation or reversal of subtyping relations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "variance_in_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "格罗滕迪克宇宙为范畴论提供了处理大小问题的基础。",
      "sentence_pinyin": "Géluòténgdíkè yǔzhòu wèi fànchóu lùn tígōng le chǔlǐ dàxiǎo wèntí de jīchǔ.",
      "sentence_fr": "Les univers de Grothendieck fournissent une base pour traiter les questions de taille en théorie des catégories.",
      "sentence_en": "Grothendieck universes provide a foundation for handling size issues in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "grothendieck_universes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子比特测量将叠加态坍缩到确定的本征态之一。",
      "sentence_pinyin": "Liàngzǐ bǐtè cèliáng jiāng diéjiā tài tāsù dào quèdìng de běnzhēng tài zhī yī.",
      "sentence_fr": "La mesure de qubit fait s'effondrer l'état de superposition vers l'un des états propres déterminés.",
      "sentence_en": "Qubit measurement collapses superposition states to one of the definite eigenstates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_measurement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基于配对的密码学利用椭圆曲线双线性映射构建新型协议。",
      "sentence_pinyin": "Jīyú pèiduì de mìmǎxué lìyòng tuǒyuán qūxiàn shuāng xiànxìng yìngshè gòujiàn xīnxíng xiéyì.",
      "sentence_fr": "La cryptographie basée sur les appariements utilise les applications bilinéaires sur courbes elliptiques pour construire de nouveaux protocoles.",
      "sentence_en": "Pairing-based cryptography uses elliptic curve bilinear maps to construct novel protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "pairing_based_crypto",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全称量化类型允许函数对所有类型参数统一定义。",
      "sentence_pinyin": "Quánchēng liànghuà lèixíng yǔnxǔ hánshù duì suǒyǒu lèixíng cānshù tǒngyī dìngyì.",
      "sentence_fr": "Les types universellement quantifiés permettent aux fonctions d'être définies uniformément pour tous les paramètres de type.",
      "sentence_en": "Universally quantified types allow functions to be defined uniformly for all type parameters.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_quantification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑场论研究具有拓扑不变性的量子场论结构。",
      "sentence_pinyin": "Tuòpū chǎng lùn yánjiū jùyǒu tuòpū bùbiànxìng de liàngzǐ chǎng lùn jiégòu.",
      "sentence_fr": "La théorie des champs topologiques étudie les structures de théorie quantique des champs avec une invariance topologique.",
      "sentence_en": "Topological field theory studies quantum field theory structures with topological invariance.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topological_field_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子相位估计算法精确测量量子系统的能级结构。",
      "sentence_pinyin": "Liàngzǐ xiàngwèi gūjì suànfǎ jīngquè cèliáng liàngzǐ xìtǒng de néng jí jiégòu.",
      "sentence_fr": "L'algorithme d'estimation de phase quantique mesure précisément la structure des niveaux d'énergie des systèmes quantiques.",
      "sentence_en": "Quantum phase estimation algorithm precisely measures quantum system energy level structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_phase_estimation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可证明安全的密码构造基于计算复杂性假设提供安全保证。",
      "sentence_pinyin": "Kě zhèngmíng ānquán de mìmǎ gòuzào jīyú jìsuàn fùzáxìng jiǎshè tígōng ānquán bǎozhèng.",
      "sentence_fr": "Les constructions cryptographiques prouvablement sûres fournissent des garanties de sécurité basées sur des hypothèses de complexité computationnelle.",
      "sentence_en": "Provably secure cryptographic constructions provide security guarantees based on computational complexity assumptions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "provable_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "交叉类型将多个类型的约束同时应用于同一值。",
      "sentence_pinyin": "Jiāochā lèixíng jiāng duō gè lèixíng de yuēshù tóngshí yìngyòng yú tóngyī zhí.",
      "sentence_fr": "Les types d'intersection appliquent simultanément les contraintes de plusieurs types à la même valeur.",
      "sentence_en": "Intersection types simultaneously apply constraints of multiple types to the same value.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "intersection_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无穷小变形理论研究数学结构的微小变化特性。",
      "sentence_pinyin": "Wúqióng xiǎo biànxíng lǐlùn yánjiū shùxué jiégòu de wēixiǎo biànhuà tèxìng.",
      "sentence_fr": "La théorie des déformations infinitésimales étudie les caractéristiques des variations infinitésimales des structures mathématiques.",
      "sentence_en": "Infinitesimal deformation theory studies characteristics of small variations in mathematical structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "deformation_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈密顿量子演化遵循薛定谔方程描述的时间演化规律。",
      "sentence_pinyin": "Hāmìdùn liàngzǐ yǎnhuà zūnxún Xuēdìngè fāngchéng miáoshù de shíjiān yǎnhuà guīlǜ.",
      "sentence_fr": "L'évolution quantique hamiltonienne suit les lois d'évolution temporelle décrites par l'équation de Schrödinger.",
      "sentence_en": "Hamiltonian quantum evolution follows time evolution laws described by the Schrödinger equation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hamiltonian_evolution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识的证明系统证明证明者确实知道某个秘密值。",
      "sentence_pinyin": "Zhīshì de zhèngmíng xìtǒng zhèngmíng zhèngmíngzhě quèshí zhīdào mǒu gè mìmì zhí.",
      "sentence_fr": "Les systèmes de preuve de connaissance prouvent que le prouveur connaît effectivement une certaine valeur secrète.",
      "sentence_en": "Proof of knowledge systems prove that the prover indeed knows a certain secret value.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "proof_of_knowledge",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联合类型允许值属于多个可能类型中的任意一个。",
      "sentence_pinyin": "Liánhé lèixíng yǔnxǔ zhí shǔyú duō gè kěnéng lèixíng zhōng de rènyì yī gè.",
      "sentence_fr": "Les types union permettent aux valeurs d'appartenir à n'importe lequel de plusieurs types possibles.",
      "sentence_en": "Union types allow values to belong to any one of multiple possible types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "union_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "堆栈理论推广了模空间的概念以处理更复杂的分类问题。",
      "sentence_pinyin": "Duīzhàn lǐlùn tuīguǎng le mó kōngjiān de gàiniàn yǐ chǔlǐ gèng fùzá de fēnlèi wèntí.",
      "sentence_fr": "La théorie des champs algébriques généralise le concept d'espace de modules pour traiter des problèmes de classification plus complexes.",
      "sentence_en": "Stack theory generalizes the concept of moduli spaces to handle more complex classification problems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_stacks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子信道刻画量子信息传输和噪声的数学模型。",
      "sentence_pinyin": "Liàngzǐ xìndào kèhuà liàngzǐ xìnxī chuánshū hé zàoshēng de shùxué móxíng.",
      "sentence_fr": "Les canaux quantiques caractérisent les modèles mathématiques de transmission d'information quantique et de bruit.",
      "sentence_en": "Quantum channels characterize mathematical models of quantum information transmission and noise.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_channels",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "交互式证明系统通过多轮交互实现高效的计算验证。",
      "sentence_pinyin": "Jiāohù shì zhèngmíng xìtǒng tōngguò duō lún jiāohù shíxiàn gāoxiào de jìsuàn yànzhèng.",
      "sentence_fr": "Les systèmes de preuve interactifs réalisent une vérification de calcul efficace par des interactions à plusieurs tours.",
      "sentence_en": "Interactive proof systems achieve efficient computation verification through multiple rounds of interaction.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "interactive_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型级自然数在编译时表示和计算固定大小数组的长度。",
      "sentence_pinyin": "Lèixíng jí zìránshù zài biānyì shí biǎoshì hé jìsuàn gùdìng dàxiǎo shùzǔ de chángdù.",
      "sentence_fr": "Les nombres naturels au niveau des types représentent et calculent la longueur des tableaux de taille fixe à la compilation.",
      "sentence_en": "Type-level natural numbers represent and compute fixed-size array lengths at compile time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_level_naturals",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "K3曲面是代数几何中具有特殊性质的复代数曲面。",
      "sentence_pinyin": "K3 qūmiàn shì dàishù jǐhé zhōng jùyǒu tèshū xìngzhì de fù dàishù qūmiàn.",
      "sentence_fr": "Les surfaces K3 sont des surfaces algébriques complexes avec des propriétés spéciales en géométrie algébrique.",
      "sentence_en": "K3 surfaces are complex algebraic surfaces with special properties in algebraic geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "k3_surfaces",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
