{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个精准农业项目通过卫星遥感技术监测作物长势和病虫害。",
      "sentence_pinyin": "Zhège jīngzhǔn nóngyè xiàngmù tōngguò wèixīng yáogǎn jìshù jiāncè zuòwù zhǎngshì hé bìngchónghài.",
      "sentence_fr": "Ce projet d'agriculture de précision surveille la croissance des cultures et les maladies grâce à la technologie de télédétection par satellite.",
      "sentence_en": "This precision agriculture project monitors crop growth and pests through satellite remote sensing technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "precision_agriculture",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在黄梅戏表演中展现了委婉动听的唱腔和细腻的情感表达。",
      "sentence_pinyin": "Tā zài huángméixì biǎoyǎn zhōng zhǎnxiànle wěiwǎn dòngtīng de chàngqiāng hé xìnì de qínggǎn biǎodá.",
      "sentence_fr": "Dans sa performance d'opéra Huangmei, elle a démontré une voix délicate et mélodieuse et une expression émotionnelle subtile.",
      "sentence_en": "In her Huangmei Opera performance, she demonstrated a delicate and melodious voice and subtle emotional expression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huangmei_opera",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能电梯系统能够预测维护需求并优化运行效率。",
      "sentence_pinyin": "Zhège zhìnéng diàntī xìtǒng nénggòu yùcè wéihù xūqiú bìng yōuhuà yùnxíng xiàolǜ.",
      "sentence_fr": "Ce système d'ascenseur intelligent peut prédire les besoins de maintenance et optimiser l'efficacité opérationnelle.",
      "sentence_en": "This smart elevator system can predict maintenance needs and optimize operational efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_elevators",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在报告文学创作中真实记录了时代变迁和社会发展。",
      "sentence_pinyin": "Tā zài bàogào wénxué chuàngzuò zhōng zhēnshí jìlùle shídài biànqiān hé shèhuì fāzhǎn.",
      "sentence_fr": "Dans la création de littérature de reportage, il a authentiquement enregistré les changements d'époque et le développement social.",
      "sentence_en": "In reportage literature creation, he authentically recorded era changes and social development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "reportage_literature",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个婴幼儿早教中心采用蒙台梭利教育理念培养孩子的能力。",
      "sentence_pinyin": "Zhège yīngyòu'ér zǎojiào zhōngxīn cǎiyòng Méngtáisuōlì jiàoyù lǐniàn péiyǎng háizi de nénglì.",
      "sentence_fr": "Ce centre d'éducation précoce pour bébés et jeunes enfants adopte les principes éducatifs Montessori pour développer les capacités des enfants.",
      "sentence_en": "This early childhood education center adopts Montessori educational principles to develop children's abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "early_education",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的家具设计追求功能性和美观性的平衡统一。",
      "sentence_pinyin": "Tā de jiājù shèjì zhuīqiú gōngnéngxìng hé měiguānxìng de pínghéng tǒngyī.",
      "sentence_fr": "Sa conception de meubles recherche l'équilibre unifié entre fonctionnalité et esthétique.",
      "sentence_en": "Her furniture design pursues a balanced unity between functionality and aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "furniture_design",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个草原生态保护项目实施了禁牧轮牧和植被恢复措施。",
      "sentence_pinyin": "Zhège cǎoyuán shēngtài bǎohù xiàngmù shíshīle jìnmù lúnmù hé zhíbèi huīfù cuòshī.",
      "sentence_fr": "Ce projet de protection écologique des prairies a mis en œuvre des mesures d'interdiction et de rotation du pâturage ainsi que de restauration de la végétation.",
      "sentence_en": "This grassland ecological protection project implemented grazing ban and rotation measures as well as vegetation restoration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grassland_protection",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在皮划艇运动中掌握了划桨技术和水流判断能力。",
      "sentence_pinyin": "Tā zài píchuántǐng yùndòng zhōng zhǎngwòle huájiǎng jìshù hé shuǐliú pànduàn nénglì.",
      "sentence_fr": "Dans le canoë-kayak, il a maîtrisé les techniques de pagaie et la capacité de jugement des courants.",
      "sentence_en": "In canoeing and kayaking, he mastered paddling techniques and current judgment ability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "canoeing_kayaking",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区法律援助工作站为困难群众提供免费的法律咨询。",
      "sentence_pinyin": "Zhège shèqū fǎlǜ yuánzhù gōngzuò zhàn wèi kùnnan qúnzhòng tígōng miǎnfèi de fǎlǜ zīxún.",
      "sentence_fr": "Ce poste d'aide juridique communautaire fournit des consultations juridiques gratuites aux personnes en difficulté.",
      "sentence_en": "This community legal aid station provides free legal consultation to people in difficulty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "legal_aid",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在竹编工艺中编织出了精巧实用的篮筐和器皿。",
      "sentence_pinyin": "Tā zài zhúbiān gōngyì zhōng biānzhī chūle jīngqiǎo shíyòng de lánkuāng hé qìmǐn.",
      "sentence_fr": "Dans l'artisanat de tressage de bambou, elle a tissé des paniers et des récipients ingénieux et pratiques.",
      "sentence_en": "In bamboo weaving craftsmanship, she wove ingenious and practical baskets and vessels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_weaving",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能会议室配备了视频会议和无线投屏等现代化设备。",
      "sentence_pinyin": "Zhège zhìnéng huìyì shì pèibèile shìpín huìyì hé wúxiàn tóupíng děng xiàndàihuà shèbèi.",
      "sentence_fr": "Cette salle de conférence intelligente est équipée d'équipements modernes comme la visioconférence et la projection sans fil.",
      "sentence_en": "This smart conference room is equipped with modern equipment such as video conferencing and wireless projection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_conference_rooms",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在尺八演奏中传达了空灵悠远的禅意境界。",
      "sentence_pinyin": "Tā zài chǐbā yǎnzòu zhōng chuándále kōnglíng yōuyuǎn de chán yìjìng.",
      "sentence_fr": "Il a transmis une ambiance zen éthérée et lointaine dans son jeu de shakuhachi.",
      "sentence_en": "He conveyed an ethereal and distant Zen artistic conception in his shakuhachi performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shakuhachi_music",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个辐射监测站实时检测环境中的放射性物质含量。",
      "sentence_pinyin": "Zhège fúshè jiāncè zhàn shíshí jiǎncè huánjìng zhōng de fàngshèxìng wùzhí hánliàng.",
      "sentence_fr": "Cette station de surveillance des radiations détecte en temps réel la teneur en substances radioactives dans l'environnement.",
      "sentence_en": "This radiation monitoring station detects radioactive substance content in the environment in real-time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "radiation_monitoring",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的影像艺术作品探讨了记忆、身份和文化认同等主题。",
      "sentence_pinyin": "Tā de yǐngxiàng yìshù zuòpǐn tàntǎole jìyì, shēnfèn hé wénhuà rèntóng děng zhǔtí.",
      "sentence_fr": "Ses œuvres d'art vidéo explorent des thèmes comme la mémoire, l'identité et l'identification culturelle.",
      "sentence_en": "Her video art works explore themes such as memory, identity, and cultural identification.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "video_art",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地质灾害监测系统预警滑坡、泥石流等自然灾害风险。",
      "sentence_pinyin": "Zhège dìzhì zāihài jiāncè xìtǒng yùjǐng huápō, níshíliú děng zìrán zāihài fēngxiǎn.",
      "sentence_fr": "Ce système de surveillance des risques géologiques alerte sur les risques de catastrophes naturelles comme les glissements de terrain et les coulées de boue.",
      "sentence_en": "This geological disaster monitoring system warns of natural disaster risks such as landslides and mudflows.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "geological_monitoring",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在编剧工作中善于构思戏剧冲突和塑造鲜明的人物形象。",
      "sentence_pinyin": "Tā zài biānjù gōngzuò zhōng shànyú gòusī xìjù chōngtū hé sùzào xiānmíng de rénwù xíngxiàng.",
      "sentence_fr": "Dans son travail de scénariste, il excelle à concevoir des conflits dramatiques et à créer des personnages distincts.",
      "sentence_en": "In his screenwriting work, he excels at conceiving dramatic conflicts and creating distinct character images.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "scriptwriting",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个居家养老服务中心提供上门护理和日常生活协助。",
      "sentence_pinyin": "Zhège jūjiā yǎnglǎo fúwù zhōngxīn tígōng shàngmén hùlǐ hé rìcháng shēnghuó xiézhù.",
      "sentence_fr": "Ce centre de services de soins aux personnes âgées à domicile fournit des soins à domicile et une assistance à la vie quotidienne.",
      "sentence_en": "This home-based elderly care service center provides home nursing care and daily living assistance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "home_care",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在艺术体操表演中展现了柔美的身体线条和优雅的动作编排。",
      "sentence_pinyin": "Tā zài yìshù tǐcāo biǎoyǎn zhōng zhǎnxiànle róuměi de shēntǐ xiàntiáo hé yōuyǎ de dòngzuò biānpái.",
      "sentence_fr": "Dans sa performance de gymnastique rythmique, elle a démontré des lignes corporelles gracieuses et une chorégraphie élégante.",
      "sentence_en": "In her rhythmic gymnastics performance, she demonstrated graceful body lines and elegant choreography.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rhythmic_gymnastics",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个产学研合作基地推动了科研成果向市场的转化。",
      "sentence_pinyin": "Zhège chǎn xué yán hézuò jīdì tuīdòngle kēyán chéngguǒ xiàng shìchǎng de zhuǎnhuà.",
      "sentence_fr": "Cette base de coopération industrie-université-recherche promeut la transformation des résultats de recherche vers le marché.",
      "sentence_en": "This industry-university-research cooperation base promotes the transformation of research results to the market.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "industry_university_research",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在瓷器绘制中运用青花、粉彩等传统装饰技法。",
      "sentence_pinyin": "Tā zài cíqì huìzhì zhōng yùnyòng qīnghuā, fěncǎi děng chuántǒng zhuāngshì jìfǎ.",
      "sentence_fr": "Dans la peinture sur porcelaine, il utilise des techniques décoratives traditionnelles comme le bleu et blanc et la famille rose.",
      "sentence_en": "In porcelain painting, he uses traditional decorative techniques such as blue and white and famille rose.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "porcelain_painting",
      "created_at": "2025-11-20T19:35:00.000Z",
      "updated_at": "2025-11-20T19:35:00.000Z"
    }
  ]
}
