{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能空气检测仪可以监测室内的甲醛、PM2.5和二氧化碳浓度。",
      "sentence_pinyin": "Zhège zhìnéng kōngqì jiǎncèyí kěyǐ jiāncè shìnèi de jiǎquán, PM2.5 hé èryǎnghuàtàn nóngdù.",
      "sentence_fr": "Ce détecteur d'air intelligent peut surveiller les concentrations de formaldéhyde, PM2.5 et CO2 à l'intérieur.",
      "sentence_en": "This smart air detector can monitor indoor formaldehyde, PM2.5, and carbon dioxide concentrations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_air_detectors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "蒙古族的呼麦是一种独特的喉音歌唱艺术,一个人能同时发出两个声部。",
      "sentence_pinyin": "Měnggǔzú de hūmài shì yī zhǒng dútè de hóuyīn gēchàng yìshù, yī gè rén néng tóngshí fāchū liǎng gè shēngbù.",
      "sentence_fr": "Le chant diphonique mongol Khoomei est un art vocal unique où une personne peut émettre deux voix simultanément.",
      "sentence_en": "Mongolian Khoomei is a unique throat singing art where one person can produce two voice parts simultaneously.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "throat_singing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的生态廊道为野生动物提供了安全的迁徙通道。",
      "sentence_pinyin": "Chéngshì de shēngtài lángdào wèi yěshēng dòngwù tígōng le ānquán de qiānxǐ tōngdào.",
      "sentence_fr": "Les corridors écologiques urbains offrent aux animaux sauvages des passages de migration sécurisés.",
      "sentence_en": "Urban ecological corridors provide wildlife with safe migration passages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecological_corridors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能拖把可以自动清洗拖布和烘干,使用更加方便卫生。",
      "sentence_pinyin": "Zhìnéng tuōbǎ kěyǐ zìdòng qīngxǐ tuōbù hé hōnggān, shǐyòng gèngjiā fāngbiàn wèishēng.",
      "sentence_fr": "La serpillière intelligente peut automatiquement laver et sécher la tête de balai, rendant l'utilisation plus pratique et hygiénique.",
      "sentence_en": "The smart mop can automatically wash and dry the mop head, making it more convenient and hygienic to use.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_mops",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的年糕制作是春节期间重要的年俗活动之一。",
      "sentence_pinyin": "Zhōngguó chuántǒng de niángāo zhìzuò shì Chūnjié qījiān zhòngyào de niánsú huódòng zhī yī.",
      "sentence_fr": "La fabrication traditionnelle chinoise de gâteaux de riz est l'une des activités importantes du Nouvel An.",
      "sentence_en": "Traditional Chinese rice cake making is one of the important New Year activities during the Spring Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rice_cake_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能炒菜机可以根据食谱自动翻炒,解放双手轻松烹饪。",
      "sentence_pinyin": "Zhìnéng chǎocàijī kěyǐ gēnjù shípǔ zìdòng fānchǎo, jiěfàng shuāngshǒu qīngsōng pēngrèn.",
      "sentence_fr": "Le wok automatique intelligent peut remuer automatiquement selon les recettes, libérant les mains pour cuisiner facilement.",
      "sentence_en": "The smart stir-fry machine can automatically stir-fry according to recipes, freeing hands for easy cooking.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_wok_machines",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "回族的花儿是西北地区流传的山歌形式,旋律优美动人。",
      "sentence_pinyin": "Huízú de huā'er shì xīběi dìqū liúchuán de shāngē xíngshì, xuánlǜ yōuměi dòngrén.",
      "sentence_fr": "Le Hua'er de l'ethnie Hui est une forme de chant de montagne du nord-ouest de la Chine, aux mélodies belles et émouvantes.",
      "sentence_en": "Hui ethnic group's Hua'er is a mountain song form spread in Northwest China, with beautiful and moving melodies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huaer_singing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施的学前教育普惠政策让更多儿童享受到优质教育。",
      "sentence_pinyin": "Zhèngfǔ shíshī de xuéqián jiàoyù pǔhuì zhèngcè ràng gèng duō értóng xiǎngshòu dào yōuzhì jiàoyù.",
      "sentence_fr": "La politique d'éducation préscolaire universelle mise en œuvre par le gouvernement permet à plus d'enfants de bénéficier d'une éducation de qualité.",
      "sentence_en": "The government's universal preschool education policy enables more children to enjoy quality education.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "preschool_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能干衣机可以根据衣物材质自动选择烘干温度和时间。",
      "sentence_pinyin": "Zhìnéng gānyījī kěyǐ gēnjù yīwù cáizhì zìdòng xuǎnzé hōnggān wēndù hé shíjiān.",
      "sentence_fr": "Le sèche-linge intelligent peut sélectionner automatiquement la température et le temps de séchage selon le tissu.",
      "sentence_en": "The smart clothes dryer can automatically select drying temperature and time based on fabric type.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_clothes_dryers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的饺子包制技艺在北方地区代代相传。",
      "sentence_pinyin": "Zhōngguó chuántǒng de jiǎozi bāozhì jìyì zài běifāng dìqū dàidài xiāngchuán.",
      "sentence_fr": "L'art traditionnel chinois de confection des raviolis se transmet de génération en génération dans le nord de la Chine.",
      "sentence_en": "Traditional Chinese dumpling making skills have been passed down through generations in northern regions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dumpling_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能温度计可以无接触测量体温,并通过手机记录健康数据。",
      "sentence_pinyin": "Zhìnéng wēndùjì kěyǐ wú jiēchù cèliáng tǐwēn, bìng tōngguò shǒujī jìlù jiànkāng shùjù.",
      "sentence_fr": "Le thermomètre intelligent peut mesurer la température corporelle sans contact et enregistrer les données de santé via téléphone.",
      "sentence_en": "The smart thermometer can measure body temperature contactlessly and record health data through a phone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_thermometers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "瑶族的长鼓舞是广西瑶族节庆活动中的传统舞蹈。",
      "sentence_pinyin": "Yáozú de chánggǔwǔ shì Guǎngxī Yáozú jiéqìng huódòng zhōng de chuántǒng wǔdǎo.",
      "sentence_fr": "La danse du tambour long de l'ethnie Yao est une danse traditionnelle des célébrations Yao au Guangxi.",
      "sentence_en": "The Yao ethnic group's long drum dance is a traditional dance in Guangxi Yao festival activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yao_drum_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的共享充电宝服务解决了手机用户的临时充电需求。",
      "sentence_pinyin": "Chéngshì de gòngxiǎng chōngdiànbǎo fúwù jiějué le shǒujī yònghù de línshí chōngdiàn xūqiú.",
      "sentence_fr": "Le service de batteries portables partagées en ville résout les besoins de recharge temporaires des utilisateurs de téléphones.",
      "sentence_en": "Urban shared power bank services solve mobile phone users' temporary charging needs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shared_power_banks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能门禁对讲机可以通过手机远程开门和与访客视频通话。",
      "sentence_pinyin": "Zhìnéng ménjìn duìjiǎngjī kěyǐ tōngguò shǒujī yuǎnchéng kāimén hé yǔ fǎngkè shìpín tōnghuà.",
      "sentence_fr": "L'interphone intelligent peut ouvrir la porte à distance et passer des appels vidéo avec les visiteurs via téléphone.",
      "sentence_en": "The smart intercom can remotely open doors and make video calls with visitors through a phone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_intercoms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的元宵节汤圆制作象征着团圆和美满。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Yuánxiāojié tāngyuán zhìzuò xiàngzhēng zhe tuányuán hé měimǎn.",
      "sentence_fr": "La fabrication traditionnelle chinoise des boulettes de riz glutineux pour la Fête des Lanternes symbolise la réunion et le bonheur.",
      "sentence_en": "Traditional Chinese Lantern Festival tangyuan making symbolizes reunion and happiness.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tangyuan_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能洗鞋机可以自动清洗和烘干运动鞋,保持鞋子清洁。",
      "sentence_pinyin": "Zhìnéng xǐxiéjī kěyǐ zìdòng qīngxǐ hé hōnggān yùndòngxié, bǎochí xiézi qīngjié.",
      "sentence_fr": "La machine à laver les chaussures intelligente peut automatiquement laver et sécher les baskets, gardant les chaussures propres.",
      "sentence_en": "The smart shoe washer can automatically clean and dry sneakers, keeping shoes clean.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_shoe_washers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "羌族的碉楼建筑是四川羌族地区独特的传统建筑形式。",
      "sentence_pinyin": "Qiāngzú de diāolóu jiànzhù shì Sìchuān Qiāngzú dìqū dútè de chuántǒng jiànzhù xíngshì.",
      "sentence_fr": "Les tours de guet de l'ethnie Qiang sont une forme d'architecture traditionnelle unique de la région Qiang au Sichuan.",
      "sentence_en": "Qiang ethnic group's watchtower architecture is a unique traditional building form in the Sichuan Qiang region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qiang_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开设的老年大学让退休老人有机会学习新知识和技能。",
      "sentence_pinyin": "Shèqū kāishè de lǎonián dàxué ràng tuìxiū lǎorén yǒu jīhuì xuéxí xīn zhīshì hé jìnéng.",
      "sentence_fr": "Les universités pour seniors ouvertes par les communautés donnent aux retraités l'occasion d'acquérir de nouvelles connaissances et compétences.",
      "sentence_en": "Community-run senior universities give retired elderly people opportunities to learn new knowledge and skills.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "senior_education",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能冰淇淋机可以在家轻松制作各种口味的冰淇淋。",
      "sentence_pinyin": "Zhìnéng bīngqílínjī kěyǐ zài jiā qīngsōng zhìzuò gèzhǒng kǒuwèi de bīngqílín.",
      "sentence_fr": "La sorbetière intelligente permet de préparer facilement des glaces de différents parfums à la maison.",
      "sentence_en": "The smart ice cream maker can easily make various flavors of ice cream at home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_ice_cream_makers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的中秋节月饼制作是家庭团聚的重要活动之一。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Zhōngqiūjié yuèbǐng zhìzuò shì jiātíng tuánjù de zhòngyào huódòng zhī yī.",
      "sentence_fr": "La fabrication traditionnelle des gâteaux de lune pour la Fête de la Mi-Automne est l'une des activités importantes de réunion familiale.",
      "sentence_en": "Traditional Chinese Mid-Autumn Festival mooncake making is one of the important family reunion activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mooncake_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
