{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "生物信息学整合计算机科学和分子生物学来分析大规模基因组数据。",
      "sentence_pinyin": "Shēngwù xìnxī xué zhěnghé jìsuànjī kēxué hé fēnzǐ shēngwù xué lái fēnxī dà guīmó jīyīn zǔ shùjù.",
      "sentence_fr": "La bioinformatique intègre l'informatique et la biologie moléculaire pour analyser les données génomiques à grande échelle.",
      "sentence_en": "Bioinformatics integrates computer science and molecular biology to analyze large-scale genomic data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "bioinformatics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "战略传播学研究组织如何通过有意义的信息传递来实现其目标。",
      "sentence_pinyin": "Zhànlüè chuánbō xué yánjiū zǔzhī rúhé tōngguò yǒu yìyì de xìnxī chuándì lái shíxiàn qí mùbiāo.",
      "sentence_fr": "La communication stratégique étudie comment les organisations atteignent leurs objectifs par une transmission significative de l'information.",
      "sentence_en": "Strategic communication studies how organizations achieve their goals through meaningful information transmission.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "strategic_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电化学储能技术在平衡电网负载和整合可再生能源方面发挥关键作用。",
      "sentence_pinyin": "Diànhuà xué chǔnéng jìshù zài pínghéng diànwǎng fùzài hé zhěnghé kě zàishēng néngyuán fāngmiàn fāhuī guānjiàn zuòyòng.",
      "sentence_fr": "La technologie de stockage électrochimique joue un rôle clé dans l'équilibrage de la charge du réseau et l'intégration des énergies renouvelables.",
      "sentence_en": "Electrochemical storage technology plays a key role in balancing grid load and integrating renewable energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "electrochemical_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化人类学通过田野调查深入研究不同社会的信仰、习俗和社会组织。",
      "sentence_pinyin": "Wénhuà rénlèi xué tōngguò tiányě diàochá shēnrù yánjiū bùtóng shèhuì de xìnyǎng, xísú hé shèhuì zǔzhī.",
      "sentence_fr": "L'anthropologie culturelle étudie en profondeur les croyances, les coutumes et l'organisation sociale de différentes sociétés par le travail de terrain.",
      "sentence_en": "Cultural anthropology studies different societies' beliefs, customs, and social organization in depth through fieldwork.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cultural_anthropology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字版权管理系统保护创作者的知识产权但也引发了用户权利的争议。",
      "sentence_pinyin": "Shùzì bǎnquán guǎnlǐ xìtǒng bǎohù chuàngzuò zhě de zhīshi chǎnquán dàn yě yǐnfā le yònghù quánlì de zhēngyì.",
      "sentence_fr": "Les systèmes de gestion des droits numériques protègent la propriété intellectuelle des créateurs mais suscitent également des controverses sur les droits des utilisateurs.",
      "sentence_en": "Digital rights management systems protect creators' intellectual property but also spark controversies about user rights.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_rights_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市代谢研究将城市视为消耗资源并产生废物的生态系统进行分析。",
      "sentence_pinyin": "Chéngshì dàixiè yánjiū jiāng chéngshì shì wéi xiāohào zīyuán bìng chǎnshēng fèiwù de shēngtài xìtǒng jìnxíng fēnxī.",
      "sentence_fr": "L'étude du métabolisme urbain analyse les villes comme des écosystèmes consommant des ressources et produisant des déchets.",
      "sentence_en": "Urban metabolism research analyzes cities as ecosystems that consume resources and produce waste.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_metabolism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "液态活检技术通过分析血液样本检测癌症和其他疾病的生物标志物。",
      "sentence_pinyin": "Yètài huójiǎn jìshù tōngguò fēnxī xuèyè yàngběn jiǎncè áizhèng hé qítā jíbìng de shēngwù biāozhì wù.",
      "sentence_fr": "La technologie de biopsie liquide détecte les biomarqueurs du cancer et d'autres maladies en analysant des échantillons sanguins.",
      "sentence_en": "Liquid biopsy technology detects biomarkers of cancer and other diseases by analyzing blood samples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "liquid_biopsy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "博弈论在经济学、政治学和进化生物学中有着广泛的应用。",
      "sentence_pinyin": "Bóyì lùn zài jīngjì xué, zhèngzhì xué hé jìnhuà shēngwù xué zhōng yǒuzhe guǎngfàn de yìngyòng.",
      "sentence_fr": "La théorie des jeux a de larges applications en économie, en science politique et en biologie évolutive.",
      "sentence_en": "Game theory has widespread applications in economics, political science, and evolutionary biology.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "game_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可穿戴健康监测设备让个人能够持续追踪自己的生理指标变化。",
      "sentence_pinyin": "Kě chuāndài jiànkāng jiāncè shèbèi ràng gèrén nénggòu chíxù zhuīzōng zìjǐ de shēnglǐ zhǐbiāo biànhuà.",
      "sentence_fr": "Les dispositifs de surveillance de santé portables permettent aux individus de suivre en continu les changements de leurs indicateurs physiologiques.",
      "sentence_en": "Wearable health monitoring devices enable individuals to continuously track changes in their physiological indicators.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "wearable_health_tech",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "教育神经科学研究大脑发育和学习过程以优化教学方法和策略。",
      "sentence_pinyin": "Jiàoyù shénjīng kēxué yánjiū dànǎo fāyù hé xuéxí guòchéng yǐ yōuhuà jiàoxué fāngfǎ hé cèlüè.",
      "sentence_fr": "Les neurosciences éducatives étudient le développement cérébral et les processus d'apprentissage pour optimiser les méthodes et stratégies d'enseignement.",
      "sentence_en": "Educational neuroscience studies brain development and learning processes to optimize teaching methods and strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "educational_neuroscience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模块化建筑技术通过工厂预制组件缩短了建设周期并提高了质量控制。",
      "sentence_pinyin": "Mókuài huà jiànzhù jìshù tōngguò gōngchǎng yùzhì zǔjiàn suōduǎn le jiànshè zhōuqī bìng tígāo le zhìliàng kòngzhì.",
      "sentence_fr": "La technologie de construction modulaire raccourcit les délais de construction et améliore le contrôle qualité grâce à des composants préfabriqués en usine.",
      "sentence_en": "Modular construction technology shortens construction periods and improves quality control through factory-prefabricated components.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "modular_construction",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学素养教育帮助公民理解科学研究方法并批判性地评估科学信息。",
      "sentence_pinyin": "Kēxué sùyǎng jiàoyù bāngzhù gōngmín lǐjiě kēxué yánjiū fāngfǎ bìng pīpàn xìng de pínggū kēxué xìnxī.",
      "sentence_fr": "L'éducation à la culture scientifique aide les citoyens à comprendre les méthodes de recherche scientifique et à évaluer de manière critique les informations scientifiques.",
      "sentence_en": "Scientific literacy education helps citizens understand scientific research methods and critically evaluate scientific information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "scientific_literacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "地热能开发利用地球内部热量提供稳定的基载可再生能源。",
      "sentence_pinyin": "Dìrè néng kāifā lìyòng dìqiú nèibù rèliàng tígōng wěndìng de jī zài kě zàishēng néngyuán.",
      "sentence_fr": "Le développement de l'énergie géothermique utilise la chaleur interne de la Terre pour fournir une énergie renouvelable de base stable.",
      "sentence_en": "Geothermal energy development uses Earth's internal heat to provide stable baseload renewable energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geothermal_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "组织行为学研究人们在工作场所的行为模式以及如何提高组织效能。",
      "sentence_pinyin": "Zǔzhī xíngwéi xué yánjiū rénmen zài gōngzuò chǎngsuǒ de xíngwéi móshì yǐjí rúhé tígāo zǔzhī xiàonéng.",
      "sentence_fr": "Le comportement organisationnel étudie les modèles de comportement des personnes sur le lieu de travail et comment améliorer l'efficacité organisationnelle.",
      "sentence_en": "Organizational behavior studies people's behavioral patterns in the workplace and how to improve organizational effectiveness.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organizational_behavior",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自主武器系统的发展引发了国际社会关于战争伦理和法律责任的激烈辩论。",
      "sentence_pinyin": "Zìzhǔ wǔqì xìtǒng de fāzhǎn yǐnfā le guójì shèhuì guānyú zhànzhēng lúnlǐ hé fǎlǜ zérèn de jīliè biànlùn.",
      "sentence_fr": "Le développement des systèmes d'armes autonomes a déclenché un vif débat international sur l'éthique de la guerre et la responsabilité juridique.",
      "sentence_en": "The development of autonomous weapons systems has sparked intense international debate about war ethics and legal responsibility.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "autonomous_weapons",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "微塑料污染已经渗透到食物链的各个层面，对生态系统和人类健康构成威胁。",
      "sentence_pinyin": "Wēi sùliào wūrǎn yǐjīng shèntòu dào shíwù liàn de gège céngmiàn, duì shēngtài xìtǒng hé rénlèi jiànkāng gòuchéng wēixié.",
      "sentence_fr": "La pollution par les microplastiques a pénétré tous les niveaux de la chaîne alimentaire, menaçant les écosystèmes et la santé humaine.",
      "sentence_en": "Microplastic pollution has penetrated all levels of the food chain, posing threats to ecosystems and human health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "microplastic_pollution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "身份验证技术正从传统密码向生物特征识别和无密码方案演进。",
      "sentence_pinyin": "Shēnfèn yànzhèng jìshù zhèng cóng chuántǒng mìmǎ xiàng shēngwù tèzhēng shìbié hé wú mìmǎ fāng'àn yǎnjìn.",
      "sentence_fr": "La technologie d'authentification évolue des mots de passe traditionnels vers la reconnaissance biométrique et les solutions sans mot de passe.",
      "sentence_en": "Authentication technology is evolving from traditional passwords toward biometric recognition and passwordless solutions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "authentication_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "记忆研究揭示了人类记忆并非完美的录像机而是一个重构性的过程。",
      "sentence_pinyin": "Jìyì yánjiū jiēshì le rénlèi jìyì bìngfēi wánměi de lùxiàngjī ér shì yīgè chónggòu xìng de guòchéng.",
      "sentence_fr": "La recherche sur la mémoire révèle que la mémoire humaine n'est pas un enregistreur vidéo parfait mais un processus de reconstruction.",
      "sentence_en": "Memory research reveals that human memory is not a perfect video recorder but a reconstructive process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "memory_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "稀土元素对于生产高科技产品至关重要，但其开采带来严重的环境问题。",
      "sentence_pinyin": "Xītǔ yuánsù duìyú shēngchǎn gāo kējì chǎnpǐn zhìguān zhòngyào, dàn qí kāicǎi dàilái yánzhòng de huánjìng wèntí.",
      "sentence_fr": "Les terres rares sont cruciales pour la production de produits de haute technologie, mais leur extraction pose de graves problèmes environnementaux.",
      "sentence_en": "Rare earth elements are crucial for producing high-tech products, but their mining causes serious environmental problems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "rare_earth_elements",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业社会责任实践要求公司在追求利润的同时考虑对社会和环境的影响。",
      "sentence_pinyin": "Qǐyè shèhuì zérèn shíjiàn yāoqiú gōngsī zài zhuīqiú lìrùn de tóngshí kǎolǜ duì shèhuì hé huánjìng de yǐngxiǎng.",
      "sentence_fr": "Les pratiques de responsabilité sociale des entreprises exigent que les entreprises prennent en compte leur impact sur la société et l'environnement tout en recherchant le profit.",
      "sentence_en": "Corporate social responsibility practices require companies to consider their impact on society and the environment while pursuing profits.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_social_responsibility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
