{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个无人机航拍服务为房地产和旅游业提供了高质量的影像资料。",
      "sentence_pinyin": "Zhège wúrénjī hángpāi fúwù wèi fángdìchǎn hé lǚyóuyè tígōngle gāo zhìliàng de yǐngxiàng zīliào.",
      "sentence_fr": "Ce service de photographie aérienne par drone fournit des images de haute qualité à l'immobilier et au tourisme.",
      "sentence_en": "This drone aerial photography service provides high-quality image materials for real estate and tourism.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "drone_photography",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在营养学研究中提出了科学合理的膳食指导方案。",
      "sentence_pinyin": "Tā zài yíngyǎngxué yánjiū zhōng tíchūle kēxué hélǐ de shànshí zhǐdǎo fāng'àn.",
      "sentence_fr": "Dans ses recherches en nutrition, elle a proposé des plans de guidance diététique scientifiques et raisonnables.",
      "sentence_en": "In her nutrition research, she proposed scientific and reasonable dietary guidance plans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "nutrition_science",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个虚拟博物馆让观众足不出户就能欣赏到世界名画。",
      "sentence_pinyin": "Zhège xūnǐ bówùguǎn ràng guānzhòng zú bù chū hù jiù néng xīnshǎng dào shìjiè mínghuà.",
      "sentence_fr": "Ce musée virtuel permet au public d'admirer des peintures mondiales célèbres sans sortir de chez soi.",
      "sentence_en": "This virtual museum allows the public to appreciate world-famous paintings without leaving home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "virtual_museums",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在创新创业大赛中凭借独特的商业模式获得了投资。",
      "sentence_pinyin": "Tā zài chuàngxīn chuàngyè dàsài zhōng píngjie dútè de shāngyè móshì huòdéle tóuzī.",
      "sentence_fr": "Il a obtenu un investissement lors du concours d'innovation et d'entrepreneuriat grâce à son modèle commercial unique.",
      "sentence_en": "He obtained investment in the innovation and entrepreneurship competition with his unique business model.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "startup_competitions",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个植物园收集培育了数千种珍稀濒危植物。",
      "sentence_pinyin": "Zhège zhíwùyuán shōují péiyùle shù qiān zhǒng zhēnxī bīnwēi zhíwù.",
      "sentence_fr": "Ce jardin botanique a collecté et cultivé des milliers d'espèces végétales rares et menacées.",
      "sentence_en": "This botanical garden has collected and cultivated thousands of rare and endangered plant species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "botanical_gardens",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的芭蕾舞表演技艺高超，动作优雅流畅。",
      "sentence_pinyin": "Tā de bāléiwǔ biǎoyǎn jìyì gāochāo, dòngzuò yōuyǎ liúchàng.",
      "sentence_fr": "Sa technique de ballet est superbe, ses mouvements élégants et fluides.",
      "sentence_en": "Her ballet performance technique is superb, her movements elegant and fluid.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ballet",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个人工智能诊断系统辅助医生提高了疾病诊断的准确率。",
      "sentence_pinyin": "Zhège réngōng zhìnéng zhěnduàn xìtǒng fǔzhù yīshēng tígāole jíbìng zhěnduàn de zhǔnquèlǜ.",
      "sentence_fr": "Ce système de diagnostic par intelligence artificielle aide les médecins à améliorer la précision du diagnostic des maladies.",
      "sentence_en": "This AI diagnostic system assists doctors in improving disease diagnosis accuracy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ai_diagnostics",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在纪实摄影中用镜头记录了社会底层人民的真实生活。",
      "sentence_pinyin": "Tā zài jìshí shèyǐng zhōng yòng jìngtóu jìlùle shèhuì dǐcéng rénmín de zhēnshí shēnghuó.",
      "sentence_fr": "Dans sa photographie documentaire, il a enregistré avec son objectif la vie réelle des classes populaires.",
      "sentence_en": "In his documentary photography, he recorded the real lives of grassroots people with his camera.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_documentary",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐治疗项目帮助患者缓解焦虑和抑郁情绪。",
      "sentence_pinyin": "Zhège yīnyuè zhìliáo xiàngmù bāngzhù huànzhě huǎnjiě jiāolǜ hé yìyù qíngxù.",
      "sentence_fr": "Ce programme de musicothérapie aide les patients à soulager l'anxiété et la dépression.",
      "sentence_en": "This music therapy program helps patients relieve anxiety and depression.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_therapy",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过参加国际会议建立了广泛的学术交流网络。",
      "sentence_pinyin": "Tā tōngguò cānjiā guójì huìyì jiànlìle guǎngfàn de xuéshù jiāoliú wǎngluò.",
      "sentence_fr": "Elle a établi un vaste réseau d'échanges académiques en participant à des conférences internationales.",
      "sentence_en": "She established a broad academic exchange network by participating in international conferences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "academic_networking",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能翻译设备支持多种语言的实时语音翻译。",
      "sentence_pinyin": "Zhège zhìnéng fānyì shèbèi zhīchí duō zhǒng yǔyán de shíshí yǔyīn fānyì.",
      "sentence_fr": "Cet appareil de traduction intelligent prend en charge la traduction vocale en temps réel dans plusieurs langues.",
      "sentence_en": "This intelligent translation device supports real-time voice translation in multiple languages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "translation_devices",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在企业文化建设中强调员工的价值认同和团队凝聚力。",
      "sentence_pinyin": "Tā zài qǐyè wénhuà jiànshè zhōng qiángdiào yuángōng de jiàzhí rèntóng hé tuánduì níngjùlì.",
      "sentence_fr": "Dans la construction de la culture d'entreprise, il souligne l'adhésion aux valeurs et la cohésion d'équipe des employés.",
      "sentence_en": "In corporate culture building, he emphasizes employees' value identification and team cohesion.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "corporate_values",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个宠物寄养中心为出行的宠物主人提供专业的照料服务。",
      "sentence_pinyin": "Zhège chǒngwù jìyǎng zhōngxīn wèi chūxíng de chǒngwù zhǔrén tígōng zhuānyè de zhàoliào fúwù.",
      "sentence_fr": "Ce centre de pension pour animaux fournit des services de soins professionnels aux propriétaires d'animaux en déplacement.",
      "sentence_en": "This pet boarding center provides professional care services for pet owners who are traveling.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pet_boarding",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的版画作品线条简洁有力，构图新颖独特。",
      "sentence_pinyin": "Tā de bǎnhuà zuòpǐn xiàntiáo jiǎnjié yǒulì, gòutú xīnyǐng dútè.",
      "sentence_fr": "Ses estampes ont des lignes simples et puissantes, avec des compositions originales et uniques.",
      "sentence_en": "Her prints have simple and powerful lines with original and unique compositions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "printmaking",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线法律咨询平台为民众提供便捷的法律服务。",
      "sentence_pinyin": "Zhège zàixiàn fǎlǜ zīxún píngtái wèi mínzhòng tígōng biànjié de fǎlǜ fúwù.",
      "sentence_fr": "Cette plateforme de consultation juridique en ligne fournit des services juridiques pratiques au public.",
      "sentence_en": "This online legal consultation platform provides convenient legal services to the public.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "legal_services",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在滑雪运动中不断突破自我，挑战更高难度的动作。",
      "sentence_pinyin": "Tā zài huáxuě yùndòng zhōng bùduàn tūpò zìwǒ, tiǎozhàn gèng gāo nándù de dòngzuò.",
      "sentence_fr": "Dans le ski, il repousse constamment ses limites, défiant des mouvements de plus grande difficulté.",
      "sentence_en": "In skiing, he constantly pushes his limits, challenging more difficult moves.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "skiing",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个老年大学开设了书法、绘画、音乐等多种兴趣课程。",
      "sentence_pinyin": "Zhège lǎonián dàxué kāishèle shūfǎ, huìhuà, yīnyuè děng duō zhǒng xìngqù kèchéng.",
      "sentence_fr": "Cette université pour seniors propose divers cours d'intérêt comme la calligraphie, la peinture et la musique.",
      "sentence_en": "This senior university offers various interest courses such as calligraphy, painting, and music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "senior_education",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的室内设计作品注重空间利用和色彩搭配的和谐统一。",
      "sentence_pinyin": "Tā de shìnèi shèjì zuòpǐn zhùzhòng kōngjiān lìyòng hé sècǎi dāpèi de héxié tǒngyī.",
      "sentence_fr": "Ses créations de design d'intérieur mettent l'accent sur l'utilisation de l'espace et l'harmonie des combinaisons de couleurs.",
      "sentence_en": "Her interior design works emphasize space utilization and harmonious color combinations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "interior_design",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个风力发电场为周边地区提供了清洁可再生能源。",
      "sentence_pinyin": "Zhège fēnglì fādiànchǎng wèi zhōubiān dìqū tígōngle qīngjié kě zàishēng néngyuán.",
      "sentence_fr": "Ce parc éolien fournit de l'énergie propre et renouvelable aux régions environnantes.",
      "sentence_en": "This wind farm provides clean renewable energy to surrounding areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wind_energy",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在经济学研究中提出了具有创新性的理论观点。",
      "sentence_pinyin": "Tā zài jīngjìxué yánjiū zhōng tíchūle jùyǒu chuàngxīnxìng de lǐlùn guāndiǎn.",
      "sentence_fr": "Dans ses recherches en économie, il a proposé des points de vue théoriques innovants.",
      "sentence_en": "In his economics research, he proposed innovative theoretical viewpoints.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "economics",
      "created_at": "2025-11-20T18:25:00.000Z",
      "updated_at": "2025-11-20T18:25:00.000Z"
    }
  ]
}
