{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "磁单极子是粒子物理学中预言但尚未发现的假想粒子。",
      "sentence_pinyin": "Cí dānjízǐ shì lìzǐ wùlǐxué zhōng yùyán dàn shàngwèi fāxiàn de jiǎxiǎng lìzǐ.",
      "sentence_fr": "Les monopôles magnétiques sont des particules hypothétiques prédites par la physique des particules mais pas encore découvertes.",
      "sentence_en": "Magnetic monopoles are hypothetical particles predicted by particle physics but not yet discovered.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "magnetic_monopoles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多项式承诺方案允许高效验证多项式在特定点的求值。",
      "sentence_pinyin": "Duōxiàngshì chéngnuò fāng'àn yǔnxǔ gāoxiào yànzhèng duōxiàngshì zài tèdìng diǎn de qiúzhí.",
      "sentence_fr": "Les schémas d'engagement polynomial permettent de vérifier efficacement l'évaluation de polynômes en des points spécifiques.",
      "sentence_en": "Polynomial commitment schemes allow efficient verification of polynomial evaluations at specific points.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "polynomial_commitments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "幽灵类型在编译时携带额外信息但在运行时没有表示。",
      "sentence_pinyin": "Yōulíng lèixíng zài biānyì shí xiédài éwài xìnxī dàn zài yùnxíng shí méiyǒu biǎoshì.",
      "sentence_fr": "Les types fantômes portent des informations supplémentaires à la compilation mais n'ont pas de représentation à l'exécution.",
      "sentence_en": "Phantom types carry additional information at compile time but have no runtime representation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "phantom_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "奇点理论研究函数在临界点附近的行为和分类。",
      "sentence_pinyin": "Qídiǎn lǐlùn yánjiū hánshù zài línjiè diǎn fùjìn de xíngwéi hé fēnlèi.",
      "sentence_fr": "La théorie des singularités étudie le comportement et la classification des fonctions près des points critiques.",
      "sentence_en": "Singularity theory studies behavior and classification of functions near critical points.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "singularity_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠错表面码是实现容错量子计算的主要候选方案。",
      "sentence_pinyin": "Liàngzǐ jiūcuò biǎomiàn mǎ shì shíxiàn róngcuò liàngzǐ jìsuàn de zhǔyào hòuxuǎn fāng'àn.",
      "sentence_fr": "Les codes de surface de correction d'erreur quantique sont un candidat majeur pour réaliser le calcul quantique tolérant aux erreurs.",
      "sentence_en": "Quantum error correction surface codes are a major candidate for achieving fault-tolerant quantum computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "surface_codes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "向量承诺支持对承诺向量任意位置的高效开放。",
      "sentence_pinyin": "Xiàngliàng chéngnuò zhīchí duì chéngnuò xiàngliàng rènyì wèizhì de gāoxiào kāifàng.",
      "sentence_fr": "Les engagements vectoriels prennent en charge l'ouverture efficace à n'importe quelle position du vecteur engagé.",
      "sentence_en": "Vector commitments support efficient opening at arbitrary positions of the committed vector.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "vector_commitments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型类提供了一种在类型系统中实现特设多态的机制。",
      "sentence_pinyin": "Lèixíng lèi tígōng le yī zhǒng zài lèixíng xìtǒng zhōng shíxiàn tèshè duōtài de jīzhì.",
      "sentence_fr": "Les classes de types fournissent un mécanisme pour implémenter le polymorphisme ad hoc dans les systèmes de types.",
      "sentence_en": "Type classes provide a mechanism for implementing ad hoc polymorphism in type systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_classes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非交换几何将几何概念推广到非交换代数上。",
      "sentence_pinyin": "Fēi jiāohuàn jǐhé jiāng jǐhé gàiniàn tuīguǎng dào fēi jiāohuàn dàishù shàng.",
      "sentence_fr": "La géométrie non commutative généralise les concepts géométriques aux algèbres non commutatives.",
      "sentence_en": "Noncommutative geometry generalizes geometric concepts to noncommutative algebras.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "noncommutative_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "含噪中等规模量子设备是当前量子硬件发展阶段的特征。",
      "sentence_pinyin": "Hán zào zhōngděng guīmó liàngzǐ shèbèi shì dāngqián liàngzǐ yìngjiàn fāzhǎn jiēduàn de tèzhēng.",
      "sentence_fr": "Les dispositifs quantiques à échelle intermédiaire bruyants caractérisent l'étape actuelle du développement du matériel quantique.",
      "sentence_en": "Noisy intermediate-scale quantum devices characterize the current stage of quantum hardware development.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "nisq_devices",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "累加器允许简洁表示大量元素的集合成员关系。",
      "sentence_pinyin": "Lěijiāqì yǔnxǔ jiǎnjié biǎoshì dàliàng yuánsù de jíhé chéngyuán guānxì.",
      "sentence_fr": "Les accumulateurs permettent une représentation succincte de l'appartenance à un ensemble pour de nombreux éléments.",
      "sentence_en": "Accumulators allow succinct representation of set membership for large numbers of elements.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cryptographic_accumulators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型推断算法自动推导表达式的最一般类型。",
      "sentence_pinyin": "Lèixíng tuīduàn suànfǎ zìdòng tuīdǎo biǎodáshì de zuì yībān lèixíng.",
      "sentence_fr": "Les algorithmes d'inférence de type déduisent automatiquement le type le plus général des expressions.",
      "sentence_en": "Type inference algorithms automatically deduce the most general type of expressions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_inference",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "解析延拓将复分析函数扩展到更大的定义域。",
      "sentence_pinyin": "Jiěxī yántuò jiāng fù fēnxī hánshù kuòzhǎn dào gèng dà de dìngyìyù.",
      "sentence_fr": "Le prolongement analytique étend les fonctions d'analyse complexe à des domaines de définition plus grands.",
      "sentence_en": "Analytic continuation extends complex analysis functions to larger domains of definition.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "analytic_continuation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠蒸馏从噪声纠缠中提纯高保真度的纠缠态。",
      "sentence_pinyin": "Liàngzǐ jiūchán zhēngliù cóng zàoshēng jiūchán zhōng tíchún gāo bǎozhēndù de jiūchán tài.",
      "sentence_fr": "La distillation d'intrication quantique purifie les états intriqués à haute fidélité à partir d'intrication bruitée.",
      "sentence_en": "Quantum entanglement distillation purifies high-fidelity entangled states from noisy entanglement.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_distillation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可验证延迟函数确保计算需要最少的顺序时间。",
      "sentence_pinyin": "Kě yànzhèng yánchí hánshù quèbǎo jìsuàn xūyào zuìshǎo de shùnxù shíjiān.",
      "sentence_fr": "Les fonctions de délai vérifiables garantissent que le calcul nécessite un temps séquentiel minimum.",
      "sentence_en": "Verifiable delay functions ensure computations require minimum sequential time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "verifiable_delay_functions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "渐进类型结合静态和动态类型检查的优点。",
      "sentence_pinyin": "Jiànjìn lèixíng jiéhé jìngtài hé dòngtài lèixíng jiǎnchá de yōudiǎn.",
      "sentence_fr": "Les types graduels combinent les avantages de la vérification de type statique et dynamique.",
      "sentence_en": "Gradual types combine advantages of static and dynamic type checking.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "gradual_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "泊松几何统一了辛几何和复几何的核心概念。",
      "sentence_pinyin": "Bósòng jǐhé tǒngyī le xīn jǐhé hé fù jǐhé de héxīn gàiniàn.",
      "sentence_fr": "La géométrie de Poisson unifie les concepts fondamentaux de la géométrie symplectique et complexe.",
      "sentence_en": "Poisson geometry unifies core concepts of symplectic and complex geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "poisson_geometry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子中继器通过纠缠交换扩展量子通信距离。",
      "sentence_pinyin": "Liàngzǐ zhōngjìqì tōngguò jiūchán jiāohuàn kuòzhǎn liàngzǐ tōngxìn jùlí.",
      "sentence_fr": "Les répéteurs quantiques étendent la distance de communication quantique par échange d'intrication.",
      "sentence_en": "Quantum repeaters extend quantum communication distance through entanglement swapping.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_repeaters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "知识声明是证明系统中关于证明者知识的陈述。",
      "sentence_pinyin": "Zhīshì shēngmíng shì zhèngmíng xìtǒng zhōng guānyú zhèngmíngzhě zhīshì de chénshù.",
      "sentence_fr": "Les déclarations de connaissance sont des énoncés sur les connaissances du prouveur dans les systèmes de preuve.",
      "sentence_en": "Knowledge statements are statements about prover knowledge in proof systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "knowledge_statements",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型安全证明形式化表明类型系统阻止运行时错误。",
      "sentence_pinyin": "Lèixíng ānquán zhèngmíng xíngshìhuà biǎomíng lèixíng xìtǒng zǔzhǐ yùnxíng shí cuòwù.",
      "sentence_fr": "Les preuves de sûreté de type formalisent que les systèmes de types préviennent les erreurs à l'exécution.",
      "sentence_en": "Type safety proofs formalize that type systems prevent runtime errors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_safety_proofs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数拓扑使用代数结构研究拓扑空间的不变量。",
      "sentence_pinyin": "Dàishù tuòpū shǐyòng dàishù jiégòu yánjiū tuòpū kōngjiān de bù biànliàng.",
      "sentence_fr": "La topologie algébrique utilise des structures algébriques pour étudier les invariants des espaces topologiques.",
      "sentence_en": "Algebraic topology uses algebraic structures to study invariants of topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_topology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
