{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "增强现实导航系统能够将数字指引信息叠加在现实世界视图上帮助用户导航。",
      "sentence_pinyin": "Zēngqiáng xiànshí dǎoháng xìtǒng nénggòu jiāng shùzì zhǐyǐn xìnxī diéjiā zài xiànshí shìjiè shìtú shàng bāngzhù yònghù dǎoháng.",
      "sentence_fr": "Les systèmes de navigation en réalité augmentée superposent des informations de guidage numériques sur la vue du monde réel pour aider les utilisateurs.",
      "sentence_en": "Augmented reality navigation systems overlay digital guidance information onto real-world views to help users navigate.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ar_navigation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全民健康覆盖的实现需要建立可持续的医疗筹资机制和公平的服务递送体系。",
      "sentence_pinyin": "Quánmín jiànkāng fùgài de shíxiàn xūyào jiànlì kě chíxù de yīliáo chóuzī jīzhì hé gōngpíng de fúwù dìsòng tǐxì.",
      "sentence_fr": "La réalisation de la couverture santé universelle nécessite la mise en place de mécanismes de financement durables et de systèmes de prestation de services équitables.",
      "sentence_en": "Achieving universal health coverage requires establishing sustainable healthcare financing mechanisms and equitable service delivery systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "universal_health_coverage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位作曲家的交响乐作品融合了电子音乐元素与传统管弦乐编制。",
      "sentence_pinyin": "Zhè wèi zuòqǔjiā de jiāoxiǎngyuè zuòpǐn rónghé le diànzǐ yīnyuè yuánsù yǔ chuántǒng guǎnxiányuè biānzhì.",
      "sentence_fr": "Les œuvres symphoniques de ce compositeur fusionnent des éléments de musique électronique avec une orchestration traditionnelle.",
      "sentence_en": "This composer's symphonic works fuse electronic music elements with traditional orchestral arrangement.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_composition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "机器人外骨骼设备帮助行动障碍者重新获得独立行走和活动的能力。",
      "sentence_pinyin": "Jīqìrén wàigǔgé shèbèi bāngzhù xíngdòng zhàng'àizhě chóngxīn huòdé dúlì xíngzǒu hé huódòng de nénglì.",
      "sentence_fr": "Les dispositifs d'exosquelette robotique aident les personnes à mobilité réduite à retrouver la capacité de marcher et de se déplacer de manière autonome.",
      "sentence_en": "Robotic exoskeleton devices help people with mobility impairments regain the ability to walk and move independently.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "robotic_exoskeletons",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心理资本的培养有助于员工在工作中保持积极心态和提高抗压能力。",
      "sentence_pinyin": "Xīnlǐ zīběn de péiyǎng yǒuzhù yú yuángōng zài gōngzuò zhōng bǎochí jījí xīntài hé tígāo kàngyā nénglì.",
      "sentence_fr": "Développer le capital psychologique aide les employés à maintenir une attitude positive au travail et à améliorer leur résistance au stress.",
      "sentence_en": "Cultivating psychological capital helps employees maintain a positive mindset at work and improve stress resistance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychological_capital",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海底光缆是国际互联网通信的关键基础设施,承载着全球大部分数据流量。",
      "sentence_pinyin": "Hǎidǐ guānglǎn shì guójì hùliánwǎng tōngxìn de guānjiàn jīchǔ shèshī, chéngzài zhe quánqiú dàbùfèn shùjù liúliàng.",
      "sentence_fr": "Les câbles sous-marins à fibre optique sont une infrastructure essentielle pour les communications Internet internationales, transportant la majeure partie du trafic de données mondial.",
      "sentence_en": "Undersea fiber optic cables are critical infrastructure for international internet communication, carrying most of the world's data traffic.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "submarine_cables",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "后殖民文学批评分析殖民历史遗产对当代文化认同和权力结构的影响。",
      "sentence_pinyin": "Hòu zhímín wénxué pīpíng fēnxī zhímín lìshǐ yíchǎn duì dāngdài wénhuà rèntóng hé quánlì jiégòu de yǐngxiǎng.",
      "sentence_fr": "La critique littéraire postcoloniale analyse l'impact de l'héritage de l'histoire coloniale sur l'identité culturelle contemporaine et les structures de pouvoir.",
      "sentence_en": "Postcolonial literary criticism analyzes the impact of colonial historical legacy on contemporary cultural identity and power structures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "postcolonial_criticism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "储能技术的发展对于解决可再生能源间歇性问题具有重要意义。",
      "sentence_pinyin": "Chǔnéng jìshù de fāzhǎn duìyú jiějué kě zàishēng néngyuán jiànxiēxìng wèntí jùyǒu zhòngyào yìyì.",
      "sentence_fr": "Le développement des technologies de stockage d'énergie est d'une grande importance pour résoudre le problème d'intermittence des énergies renouvelables.",
      "sentence_en": "The development of energy storage technology is of great significance for solving the intermittency problem of renewable energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "energy_storage",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "患者赋权运动强调患者在医疗决策中应拥有更多的知情权和参与权。",
      "sentence_pinyin": "Huànzhě fùquán yùndòng qiángdiào huànzhě zài yīliáo juécè zhōng yīng yǒngyǒu gèng duō de zhīqíngquán hé cānyùquán.",
      "sentence_fr": "Le mouvement d'autonomisation des patients souligne que les patients devraient avoir davantage de droit à l'information et de participation dans les décisions médicales.",
      "sentence_en": "The patient empowerment movement emphasizes that patients should have more informed consent and participation rights in medical decisions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "patient_empowerment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部实验性戏剧作品打破了传统舞台与观众席的物理界限。",
      "sentence_pinyin": "Zhè bù shíyànxìng xìjù zuòpǐn dǎpò le chuántǒng wǔtái yǔ guānzhòngxí de wùlǐ jièxiàn.",
      "sentence_fr": "Cette pièce de théâtre expérimentale brise les frontières physiques traditionnelles entre la scène et l'espace des spectateurs.",
      "sentence_en": "This experimental theater work breaks down traditional physical boundaries between stage and audience seating.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "experimental_theater",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "森林碳汇项目通过植树造林来抵消工业活动产生的温室气体排放。",
      "sentence_pinyin": "Sēnlín tànhuì xiàngmù tōngguò zhíshù zàolín lái dǐxiāo gōngyè huódòng chǎnshēng de wēnshì qìtǐ páifàng.",
      "sentence_fr": "Les projets de puits de carbone forestier compensent les émissions de gaz à effet de serre des activités industrielles par la plantation d'arbres.",
      "sentence_en": "Forest carbon sink projects offset greenhouse gas emissions from industrial activities through tree planting and afforestation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "forest_carbon_projects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "货币政策传导机制的有效性受到金融市场结构和银行体系效率的影响。",
      "sentence_pinyin": "Huòbì zhèngcè chuándǎo jīzhì de yǒuxiàoxìng shòudào jīnróng shìchǎng jiégòu hé yínháng tǐxì xiàolǜ de yǐngxiǎng.",
      "sentence_fr": "L'efficacité du mécanisme de transmission de la politique monétaire est influencée par la structure des marchés financiers et l'efficience du système bancaire.",
      "sentence_en": "The effectiveness of monetary policy transmission mechanisms is influenced by financial market structure and banking system efficiency.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "monetary_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物入侵物种的扩散对本地生态系统的平衡构成了严重威胁。",
      "sentence_pinyin": "Shēngwù rùqīn wùzhǒng de kuòsàn duì běndì shēngtài xìtǒng de pínghéng gòuchéng le yánzhòng wēixié.",
      "sentence_fr": "La propagation des espèces envahissantes constitue une menace sérieuse pour l'équilibre des écosystèmes locaux.",
      "sentence_en": "The spread of invasive species poses a serious threat to the balance of local ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "invasive_species",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项用户体验研究深入分析了人们与数字产品交互时的行为模式和痛点。",
      "sentence_pinyin": "Zhè xiàng yònghù tǐyàn yánjiū shēnrù fēnxī le rénmen yǔ shùzì chǎnpǐn jiāohù shí de xíngwéi móshì hé tòngdiǎn.",
      "sentence_fr": "Cette étude d'expérience utilisateur analyse en profondeur les schémas comportementaux et les points de friction des personnes lors de leur interaction avec les produits numériques.",
      "sentence_en": "This user experience study deeply analyzes people's behavioral patterns and pain points when interacting with digital products.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "user_experience_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳米医学利用纳米尺度的材料和设备来改进疾病诊断和药物递送。",
      "sentence_pinyin": "Nàmǐ yīxué lìyòng nàmǐ chǐdù de cáiliào hé shèbèi lái gǎijìn jíbìng zhěnduàn hé yàowù dìsòng.",
      "sentence_fr": "La nanomédecine utilise des matériaux et dispositifs à l'échelle nanométrique pour améliorer le diagnostic des maladies et l'administration des médicaments.",
      "sentence_en": "Nanomedicine uses nanoscale materials and devices to improve disease diagnosis and drug delivery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nanomedicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "正念减压训练已被证明可以有效降低焦虑水平和改善整体心理健康。",
      "sentence_pinyin": "Zhèngniàn jiǎnyā xùnliàn yǐ bèi zhèngmíng kěyǐ yǒuxiào jiàngdī jiāolǜ shuǐpíng hé gǎishàn zhěngtǐ xīnlǐ jiànkāng.",
      "sentence_fr": "La formation à la réduction du stress basée sur la pleine conscience s'est avérée efficace pour réduire les niveaux d'anxiété et améliorer la santé mentale globale.",
      "sentence_en": "Mindfulness-based stress reduction training has been proven effective in reducing anxiety levels and improving overall mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mindfulness_training",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "离岸风电场的大规模部署标志着海上可再生能源开发进入新阶段。",
      "sentence_pinyin": "Lí'àn fēngdiànchǎng de dà guīmó bùshǔ biāozhì zhe hǎishàng kě zàishēng néngyuán kāifā jìnrù xīn jiēduàn.",
      "sentence_fr": "Le déploiement à grande échelle de parcs éoliens offshore marque une nouvelle étape dans le développement des énergies renouvelables marines.",
      "sentence_en": "The large-scale deployment of offshore wind farms marks a new stage in offshore renewable energy development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "offshore_wind",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位历史学家的研究方法强调从多元视角重新解读历史事件和人物。",
      "sentence_pinyin": "Zhè wèi lìshǐxuéjiā de yánjiū fāngfǎ qiángdiào cóng duōyuán shìjiǎo chóngxīn jiědú lìshǐ shìjiàn hé rénwù.",
      "sentence_fr": "L'approche de recherche de cet historien met l'accent sur la réinterprétation des événements et personnages historiques sous des angles multiples.",
      "sentence_en": "This historian's research approach emphasizes reinterpreting historical events and figures from multiple perspectives.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "historical_methodology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电表技术使消费者能够实时监控和优化家庭能源消耗模式。",
      "sentence_pinyin": "Zhìnéng diànbiǎo jìshù shǐ xiāofèizhě nénggòu shíshí jiānkòng hé yōuhuà jiātíng néngyuán xiāohào móshì.",
      "sentence_fr": "La technologie des compteurs intelligents permet aux consommateurs de surveiller et d'optimiser en temps réel leurs modes de consommation d'énergie domestique.",
      "sentence_en": "Smart meter technology enables consumers to monitor and optimize home energy consumption patterns in real-time.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_metering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
