{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个应急救援队伍在自然灾害发生时迅速响应并展开救援行动。",
      "sentence_pinyin": "Zhège yìngjí jiùyuán duìwǔ zài zìrán zāihài fāshēng shí xùnsù xiǎngyìng bìng zhǎnkāi jiùyuán xíngdòng.",
      "sentence_fr": "Cette équipe de secours d'urgence répond rapidement et lance des opérations de sauvetage lors de catastrophes naturelles.",
      "sentence_en": "This emergency rescue team responds quickly and launches rescue operations when natural disasters occur.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "emergency_response",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的刺绣作品针法细腻，图案精美，具有很高的艺术价值。",
      "sentence_pinyin": "Tā de cìxiù zuòpǐn zhēnfǎ xìnì, tú'àn jīngměi, jùyǒu hěn gāo de yìshù jiàzhí.",
      "sentence_fr": "Ses œuvres de broderie ont des points délicats et des motifs exquis, possédant une grande valeur artistique.",
      "sentence_en": "Her embroidery works have delicate stitching and exquisite patterns, possessing high artistic value.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "embroidery",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能客服系统能够快速解答客户的常见问题。",
      "sentence_pinyin": "Zhège zhìnéng kèfú xìtǒng nénggòu kuàisù jiědá kèhù de chángjiàn wèntí.",
      "sentence_fr": "Ce système de service client intelligent peut répondre rapidement aux questions fréquentes des clients.",
      "sentence_en": "This intelligent customer service system can quickly answer customers' frequently asked questions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "customer_service",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在网球训练中磨练了意志力和竞技水平。",
      "sentence_pinyin": "Tā zài wǎngqiú xùnliàn zhōng móliànle yìzhìlì hé jìngjì shuǐpíng.",
      "sentence_fr": "Lors de l'entraînement au tennis, il a affiné sa volonté et son niveau de compétition.",
      "sentence_en": "During tennis training, he honed his willpower and competitive level.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tennis",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众筹平台为创意项目提供了资金募集和推广渠道。",
      "sentence_pinyin": "Zhège zhòngchóu píngtái wèi chuàngyì xiàngmù tígōngle zījīn mùjí hé tuīguǎng qúdào.",
      "sentence_fr": "Cette plateforme de financement participatif fournit des canaux de collecte de fonds et de promotion pour les projets créatifs.",
      "sentence_en": "This crowdfunding platform provides fundraising and promotion channels for creative projects.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crowdfunding",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在儿童文学创作中用生动的语言讲述了温暖感人的故事。",
      "sentence_pinyin": "Tā zài értóng wénxué chuàngzuò zhōng yòng shēngdòng de yǔyán jiǎngshùle wēnnuǎn gǎnrén de gùshi.",
      "sentence_fr": "Dans la création littéraire pour enfants, elle raconte des histoires chaleureuses et touchantes avec un langage vivant.",
      "sentence_en": "In children's literature creation, she tells warm and touching stories with vivid language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "childrens_literature",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个垃圾焚烧发电厂实现了废物资源化利用。",
      "sentence_pinyin": "Zhège lājī fénshāo fādiànchǎng shíxiànle fèiwù zīyuánhuà lìyòng.",
      "sentence_fr": "Cette usine d'incinération des déchets pour la production d'électricité a réalisé la valorisation des déchets en ressources.",
      "sentence_en": "This waste incineration power plant achieved waste-to-resource utilization.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waste_to_energy",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在相声表演中展现了深厚的语言功底和幽默感。",
      "sentence_pinyin": "Tā zài xiàngsheng biǎoyǎn zhōng zhǎnxiànle shēnhòu de yǔyán gōngdǐ hé yōumògǎn.",
      "sentence_fr": "Dans sa performance de crosstalk, il a démontré de solides bases linguistiques et un sens de l'humour.",
      "sentence_en": "In his crosstalk performance, he demonstrated solid linguistic foundation and sense of humor.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crosstalk",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个医疗器械公司研发了多款创新型诊疗设备。",
      "sentence_pinyin": "Zhège yīliáo qìxiè gōngsī yánfāle duō kuǎn chuàngxīnxíng zhěnliáo shèbèi.",
      "sentence_fr": "Cette entreprise d'équipements médicaux a développé plusieurs dispositifs de diagnostic et de traitement innovants.",
      "sentence_en": "This medical equipment company developed multiple innovative diagnostic and treatment devices.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_devices",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的雕塑作品将抽象表现和具象写实巧妙结合。",
      "sentence_pinyin": "Tā de diāosù zuòpǐn jiāng chōuxiàng biǎoxiàn hé jùxiàng xiěshí qiǎomiào jiéhé.",
      "sentence_fr": "Ses œuvres sculpturales combinent habilement expression abstraite et réalisme figuratif.",
      "sentence_en": "Her sculptural works skillfully combine abstract expression and figurative realism.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "contemporary_sculpture",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个养老保险制度为退休人员提供了基本的生活保障。",
      "sentence_pinyin": "Zhège yǎnglǎo bǎoxiǎn zhìdù wèi tuìxiū rényuán tígōngle jīběn de shēnghuó bǎozhàng.",
      "sentence_fr": "Ce système d'assurance retraite fournit une garantie de vie de base aux retraités.",
      "sentence_en": "This pension insurance system provides basic living guarantee for retirees.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pension_systems",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在潜水运动中探索了神秘的海底世界。",
      "sentence_pinyin": "Tā zài qiánshuǐ yùndòng zhōng tànsuǒle shénmì de hǎidǐ shìjiè.",
      "sentence_fr": "Dans la plongée sous-marine, il a exploré le monde mystérieux des fonds marins.",
      "sentence_en": "In scuba diving, he explored the mysterious underwater world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "scuba_diving",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个人才引进计划为企业吸引了大批高端专业人才。",
      "sentence_pinyin": "Zhège réncái yǐnjìn jìhuà wèi qǐyè xīyǐnle dà pī gāoduān zhuānyè réncái.",
      "sentence_fr": "Ce programme d'attraction de talents a attiré un grand nombre de professionnels de haut niveau pour l'entreprise.",
      "sentence_en": "This talent recruitment program attracted a large number of high-level professionals for the enterprise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "talent_recruitment",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的烘焙教室教授了从基础到进阶的各类烘焙技巧。",
      "sentence_pinyin": "Tā de hōngbèi jiàoshì jiàoshòule cóng jīchǔ dào jìnjiē de gè lèi hōngbèi jìqiǎo.",
      "sentence_fr": "Son atelier de pâtisserie enseigne diverses techniques de pâtisserie, des bases aux niveaux avancés.",
      "sentence_en": "Her baking classroom teaches various baking techniques from basic to advanced levels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "baking_classes",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个量子通信网络为信息安全提供了革命性的解决方案。",
      "sentence_pinyin": "Zhège liàngzǐ tōngxìn wǎngluò wèi xìnxī ānquán tígōngle gémìngxìng de jiějué fāng'àn.",
      "sentence_fr": "Ce réseau de communication quantique fournit une solution révolutionnaire pour la sécurité de l'information.",
      "sentence_en": "This quantum communication network provides a revolutionary solution for information security.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "quantum_communication",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在书法创作中追求笔墨的变化和意境的表达。",
      "sentence_pinyin": "Tā zài shūfǎ chuàngzuò zhōng zhuīqiú bǐmò de biànhuà hé yìjìng de biǎodá.",
      "sentence_fr": "Dans la création calligraphique, il recherche les variations du pinceau et de l'encre ainsi que l'expression de la signification artistique.",
      "sentence_en": "In calligraphy creation, he pursues variations in brush and ink and expression of artistic conception.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "calligraphy_art",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区服务中心为老年人提供日间照料和健康咨询。",
      "sentence_pinyin": "Zhège shèqū fúwù zhōngxīn wèi lǎoniánrén tígōng rìjiān zhàoliào hé jiànkāng zīxún.",
      "sentence_fr": "Ce centre de services communautaires fournit des soins de jour et des consultations de santé aux personnes âgées.",
      "sentence_en": "This community service center provides day care and health consultation for the elderly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "senior_services",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的配音作品声音富有表现力，完美诠释了角色性格。",
      "sentence_pinyin": "Tā de pèiyīn zuòpǐn shēngyīn fùyǒu biǎoxiànlì, wánměi quánshìle juésè xìnggé.",
      "sentence_fr": "Ses œuvres de doublage ont une voix très expressive, interprétant parfaitement la personnalité des personnages.",
      "sentence_en": "Her voice acting works have a very expressive voice, perfectly interpreting character personalities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "voice_acting",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个精准医疗项目根据患者基因特征制定个性化治疗方案。",
      "sentence_pinyin": "Zhège jīngzhǔn yīliáo xiàngmù gēnjù huànzhě jīyīn tèzhēng zhìdìng gèxìnghuà zhìliáo fāng'àn.",
      "sentence_fr": "Ce projet de médecine de précision élabore des plans de traitement personnalisés basés sur les caractéristiques génétiques des patients.",
      "sentence_en": "This precision medicine project develops personalized treatment plans based on patients' genetic characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "precision_medicine",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在射箭运动中培养了专注力和稳定性。",
      "sentence_pinyin": "Tā zài shèjiàn yùndòng zhōng péiyǎngle zhuānzhùlì hé wěndìngxìng.",
      "sentence_fr": "Dans le tir à l'arc, il a développé sa concentration et sa stabilité.",
      "sentence_en": "In archery, he developed his concentration and stability.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "archery",
      "created_at": "2025-11-20T18:45:00.000Z",
      "updated_at": "2025-11-20T18:45:00.000Z"
    }
  ]
}
