{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "超对称理论假设每个费米子都有一个玻色子超伴子对应。",
      "sentence_pinyin": "Chāo duìchèn lǐlùn jiǎshè měi gè fèimǐzǐ dōu yǒu yī gè bōsèzǐ chāo bànzǐ duìyìng.",
      "sentence_fr": "La théorie de la supersymétrie suppose que chaque fermion a un superpartenaire bosonique correspondant.",
      "sentence_en": "Supersymmetry theory hypothesizes that each fermion has a corresponding bosonic superpartner.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "supersymmetry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "属性基加密根据属性策略而非身份控制数据访问权限。",
      "sentence_pinyin": "Shǔxìng jī jiāmì gēnjù shǔxìng cèlüè ér fēi shēnfèn kòngzhì shùjù fǎngwèn quánxiàn.",
      "sentence_fr": "Le chiffrement basé sur les attributs contrôle les droits d'accès aux données selon des politiques d'attributs plutôt que l'identité.",
      "sentence_en": "Attribute-based encryption controls data access rights based on attribute policies rather than identity.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "attribute_based_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "线性逻辑追踪资源的使用限制每个假设只能使用一次。",
      "sentence_pinyin": "Xiànxìng luójí zhuīzōng zīyuán de shǐyòng xiànzhì měi gè jiǎshè zhǐ néng shǐyòng yī cì.",
      "sentence_fr": "La logique linéaire suit l'utilisation des ressources en limitant chaque hypothèse à une seule utilisation.",
      "sentence_en": "Linear logic tracks resource usage limiting each hypothesis to single use.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "linear_logic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "函子范畴论研究范畴之间保持结构的映射关系。",
      "sentence_pinyin": "Hánzǐ fànchóulùn yánjiū fànchóu zhījiān bǎochí jiégòu de yìngshè guānxì.",
      "sentence_fr": "La théorie des foncteurs étudie les relations de mappage préservant la structure entre les catégories.",
      "sentence_en": "Functor theory studies structure-preserving mapping relationships between categories.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "functor_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子模拟器使用可控量子系统研究难以直接分析的量子现象。",
      "sentence_pinyin": "Liàngzǐ mónǐqì shǐyòng kě kòng liàngzǐ xìtǒng yánjiū nán yǐ zhíjiē fēnxī de liàngzǐ xiànxiàng.",
      "sentence_fr": "Les simulateurs quantiques utilisent des systèmes quantiques contrôlables pour étudier des phénomènes quantiques difficiles à analyser directement.",
      "sentence_en": "Quantum simulators use controllable quantum systems to study quantum phenomena difficult to analyze directly.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_simulators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能加密允许解密特定函数的计算结果而非原始明文。",
      "sentence_pinyin": "Gōngnéng jiāmì yǔnxǔ jiěmì tèdìng hánshù de jìsuàn jiéguǒ ér fēi yuánshǐ míngwén.",
      "sentence_fr": "Le chiffrement fonctionnel permet de déchiffrer les résultats de calcul de fonctions spécifiques plutôt que le texte clair original.",
      "sentence_en": "Functional encryption allows decrypting computation results of specific functions rather than original plaintext.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "functional_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时序逻辑在形式验证中指定系统行为随时间演化的性质。",
      "sentence_pinyin": "Shíxù luójí zài xíngshì yànzhèng zhōng zhǐdìng xìtǒng xíngwéi suí shíjiān yǎnhuà de xìngzhì.",
      "sentence_fr": "La logique temporelle spécifie les propriétés de l'évolution du comportement du système dans le temps en vérification formelle.",
      "sentence_en": "Temporal logic specifies properties of system behavior evolution over time in formal verification.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "temporal_logic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "单子代数结构在函数式编程中管理副作用和状态变换。",
      "sentence_pinyin": "Dānzǐ dàishù jiégòu zài hánshùshì biānchéng zhōng guǎnlǐ fùzuòyòng hé zhuàngtài biànhuàn.",
      "sentence_fr": "Les structures algébriques de monades gèrent les effets de bord et les transformations d'état en programmation fonctionnelle.",
      "sentence_en": "Monad algebraic structures manage side effects and state transformations in functional programming.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "monad_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "额外维度理论假设存在超越四维时空的紧致化空间维度。",
      "sentence_pinyin": "Éwài wéidù lǐlùn jiǎshè cúnzài chāoyuè sì wéi shíkōng de jǐnzhìhuà kōngjiān wéidù.",
      "sentence_fr": "La théorie des dimensions supplémentaires suppose l'existence de dimensions spatiales compactifiées au-delà de l'espace-temps à quatre dimensions.",
      "sentence_en": "Extra dimension theory hypothesizes the existence of compactified spatial dimensions beyond four-dimensional spacetime.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "extra_dimensions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可搜索加密允许在加密数据上执行关键词搜索而不泄露内容。",
      "sentence_pinyin": "Kě sōusuǒ jiāmì yǔnxǔ zài jiāmì shùjù shàng zhíxíng guānjiàncí sōusuǒ ér bù xièlù nèiróng.",
      "sentence_fr": "Le chiffrement interrogeable permet d'effectuer des recherches par mots-clés sur des données chiffrées sans révéler le contenu.",
      "sentence_en": "Searchable encryption allows performing keyword searches on encrypted data without revealing content.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "searchable_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分离逻辑扩展霍尔逻辑以推理指针程序的堆内存操作。",
      "sentence_pinyin": "Fēnlí luójí kuòzhǎn Huò'ěr luójí yǐ tuīlǐ zhǐzhēn chéngxù de duī nèicún cāozuò.",
      "sentence_fr": "La logique de séparation étend la logique de Hoare pour raisonner sur les opérations de mémoire tas des programmes avec pointeurs.",
      "sentence_en": "Separation logic extends Hoare logic to reason about heap memory operations of pointer programs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "separation_logic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然变换在范畴论中描述函子之间的结构保持映射。",
      "sentence_pinyin": "Zìrán biànhuàn zài fànchóulùn zhōng miáoshù hánzǐ zhījiān de jiégòu bǎochí yìngshè.",
      "sentence_fr": "Les transformations naturelles décrivent les mappages préservant la structure entre foncteurs en théorie des catégories.",
      "sentence_en": "Natural transformations describe structure-preserving mappings between functors in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "natural_transformations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "M理论试图统一五种超弦理论为单一的十一维框架。",
      "sentence_pinyin": "M lǐlùn shìtú tǒngyī wǔ zhǒng chāo xián lǐlùn wéi dānyī de shíyī wéi kuàngjià.",
      "sentence_fr": "La théorie M tente d'unifier les cinq théories des supercordes en un seul cadre à onze dimensions.",
      "sentence_en": "M-theory attempts to unify five superstring theories into a single eleven-dimensional framework.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "m_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代理重加密允许第三方转换密文为另一接收者可解密的形式。",
      "sentence_pinyin": "Dàilǐ chóng jiāmì yǔnxǔ dì sān fāng zhuǎnhuàn mìwén wéi lìng yī jiēshōuzhě kě jiěmì de xíngshì.",
      "sentence_fr": "Le rechiffrement par proxy permet à un tiers de transformer un texte chiffré en une forme déchiffrable par un autre destinataire.",
      "sentence_en": "Proxy re-encryption allows third parties to transform ciphertext into a form decryptable by another recipient.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "proxy_reencryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精化类型在类型系统中表达值域约束和前后置条件。",
      "sentence_pinyin": "Jīnghuà lèixíng zài lèixíng xìtǒng zhōng biǎodá zhíyù yuēshù hé qián hòu zhì tiáojiàn.",
      "sentence_fr": "Les types raffinés expriment des contraintes de domaine de valeurs et des pré/post-conditions dans les systèmes de types.",
      "sentence_en": "Refinement types express value domain constraints and pre/post-conditions in type systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "refinement_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "伴随函子对在范畴论中体现了自由构造与遗忘函子的对偶性。",
      "sentence_pinyin": "Bànsuí hánzǐ duì zài fànchóulùn zhōng tǐxiàn le zìyóu gòuzào yǔ yíwàng hánzǐ de duìǒuxìng.",
      "sentence_fr": "Les paires de foncteurs adjoints incarnent la dualité entre constructions libres et foncteurs d'oubli en théorie des catégories.",
      "sentence_en": "Adjoint functor pairs embody the duality between free constructions and forgetful functors in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "adjoint_functors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "圈量子引力是一种背景无关的量子引力理论候选者。",
      "sentence_pinyin": "Quān liàngzǐ yǐnlì shì yī zhǒng bèijǐng wúguān de liàngzǐ yǐnlì lǐlùn hòuxuǎnzhě.",
      "sentence_fr": "La gravité quantique à boucles est un candidat pour une théorie de la gravité quantique indépendante du fond.",
      "sentence_en": "Loop quantum gravity is a background-independent quantum gravity theory candidate.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "loop_quantum_gravity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "盲签名协议允许用户获取签名而签名者不知道消息内容。",
      "sentence_pinyin": "Máng qiānmíng xiéyì yǔnxǔ yònghù huòqǔ qiānmíng ér qiānmíngzhě bù zhīdào xiāoxī nèiróng.",
      "sentence_fr": "Les protocoles de signature aveugle permettent aux utilisateurs d'obtenir des signatures sans que le signataire connaisse le contenu du message.",
      "sentence_en": "Blind signature protocols allow users to obtain signatures without the signer knowing message content.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "blind_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "霍尔逻辑使用前后置条件规约验证命令式程序的部分正确性。",
      "sentence_pinyin": "Huò'ěr luójí shǐyòng qián hòu zhì tiáojiàn guīyuē yànzhèng mìnglìngshì chéngxù de bùfèn zhèngquèxìng.",
      "sentence_fr": "La logique de Hoare utilise des spécifications de pré/post-conditions pour vérifier la correction partielle des programmes impératifs.",
      "sentence_en": "Hoare logic uses pre/post-condition specifications to verify partial correctness of imperative programs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hoare_logic",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "米田引理是范畴论中连接对象与函子的基本定理。",
      "sentence_pinyin": "Mǐtián yǐnlǐ shì fànchóulùn zhōng liánjiē duìxiàng yǔ hánzǐ de jīběn dìnglǐ.",
      "sentence_fr": "Le lemme de Yoneda est un théorème fondamental en théorie des catégories reliant les objets aux foncteurs.",
      "sentence_en": "The Yoneda lemma is a fundamental theorem in category theory connecting objects to functors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "yoneda_lemma",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
