{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这项关于睡眠障碍的临床研究为开发新型治疗药物奠定了理论基础。",
      "sentence_pinyin": "Zhè xiàng guānyú shuìmián zhàng'ài de línchuáng yánjiū wèi kāifā xīnxíng zhìliáo yàowù diàndìng le lǐlùn jīchǔ.",
      "sentence_fr": "Cette recherche clinique sur les troubles du sommeil a jeté les bases théoriques pour le développement de nouveaux médicaments.",
      "sentence_en": "This clinical research on sleep disorders has laid the theoretical foundation for developing new therapeutic drugs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sleep_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市热岛效应导致市中心温度比周边郊区高出好几度。",
      "sentence_pinyin": "Chéngshì rèdǎo xiàoyìng dǎozhì shì zhōngxīn wēndù bǐ zhōubiān jiāoqū gāo chū hǎojǐ dù.",
      "sentence_fr": "L'effet d'îlot de chaleur urbain fait que la température du centre-ville est plusieurs degrés plus élevée que celle des banlieues environnantes.",
      "sentence_en": "The urban heat island effect causes downtown temperatures to be several degrees higher than surrounding suburbs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_climate",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位历史学家的著作系统地梳理了近代中国社会转型的复杂历程。",
      "sentence_pinyin": "Zhè wèi lìshǐxuéjiā de zhùzuò xìtǒng de shūlǐ le jìndài Zhōngguó shèhuì zhuǎnxíng de fùzá lìchéng.",
      "sentence_fr": "L'ouvrage de cet historien retrace systématiquement le processus complexe de transformation sociale de la Chine moderne.",
      "sentence_en": "This historian's work systematically traces the complex process of social transformation in modern China.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "modern_chinese_history",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "虚拟现实技术在心理治疗领域的应用为恐惧症患者提供了安全的暴露疗法环境。",
      "sentence_pinyin": "Xūnǐ xiànshí jìshù zài xīnlǐ zhìliáo lǐngyù de yìngyòng wèi kǒngjùzhèng huànzhě tígōng le ānquán de bàolù liáofǎ huánjìng.",
      "sentence_fr": "L'application de la réalité virtuelle en psychothérapie offre aux patients phobiques un environnement sécurisé pour la thérapie d'exposition.",
      "sentence_en": "The application of virtual reality technology in psychotherapy provides phobia patients with a safe exposure therapy environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vr_psychotherapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业社会责任已从可选的慈善行为转变为现代商业战略的核心组成部分。",
      "sentence_pinyin": "Qǐyè shèhuì zérèn yǐ cóng kěxuǎn de císhàn xíngwéi zhuǎnbiàn wéi xiàndài shāngyè zhànlüè de héxīn zǔchéng bùfèn.",
      "sentence_fr": "La responsabilité sociale des entreprises est passée d'un acte de charité optionnel à un élément central de la stratégie commerciale moderne.",
      "sentence_en": "Corporate social responsibility has transformed from optional charitable behavior to a core component of modern business strategy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "corporate_social_responsibility",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语言习得的关键期假说认为儿童在特定年龄前学习语言更为容易。",
      "sentence_pinyin": "Yǔyán xídé de guānjiànqī jiǎshuō rènwéi értóng zài tèdìng niánlíng qián xuéxí yǔyán gèng wéi róngyì.",
      "sentence_fr": "L'hypothèse de la période critique d'acquisition du langage suggère que les enfants apprennent plus facilement une langue avant un certain âge.",
      "sentence_en": "The critical period hypothesis of language acquisition suggests that children learn language more easily before a certain age.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "language_acquisition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "碳交易市场的建立为企业减少温室气体排放提供了经济激励机制。",
      "sentence_pinyin": "Tàn jiāoyì shìchǎng de jiànlì wèi qǐyè jiǎnshǎo wēnshì qìtǐ páifàng tígōng le jīngjì jīlì jīzhì.",
      "sentence_fr": "L'établissement du marché du carbone fournit aux entreprises des incitations économiques pour réduire leurs émissions de gaz à effet de serre.",
      "sentence_en": "The establishment of carbon trading markets provides economic incentive mechanisms for companies to reduce greenhouse gas emissions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_trading",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这场当代艺术展览挑战了观众对传统审美标准和艺术定义的认知。",
      "sentence_pinyin": "Zhè chǎng dāngdài yìshù zhǎnlǎn tiǎozhàn le guānzhòng duì chuántǒng shěnměi biāozhǔn hé yìshù dìngyì de rènzhī.",
      "sentence_fr": "Cette exposition d'art contemporain remet en question la perception du public des normes esthétiques traditionnelles et de la définition de l'art.",
      "sentence_en": "This contemporary art exhibition challenges audiences' perceptions of traditional aesthetic standards and the definition of art.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_art",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基因检测技术的普及引发了关于遗传隐私和歧视风险的社会担忧。",
      "sentence_pinyin": "Jīyīn jiǎncè jìshù de pǔjí yǐnfā le guānyú yíchuán yǐnsī hé qíshì fēngxiǎn de shèhuì dānyōu.",
      "sentence_fr": "La popularisation des tests génétiques suscite des préoccupations sociales concernant la vie privée génétique et les risques de discrimination.",
      "sentence_en": "The popularity of genetic testing technology has raised social concerns about genetic privacy and discrimination risks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "genetic_privacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "新兴市场经济体在全球贸易格局中扮演着越来越重要的角色。",
      "sentence_pinyin": "Xīnxīng shìchǎng jīngjìtǐ zài quánqiú màoyì géjú zhōng bànyǎn zhe yuèláiyuè zhòngyào de juésè.",
      "sentence_fr": "Les économies de marché émergentes jouent un rôle de plus en plus important dans le paysage commercial mondial.",
      "sentence_en": "Emerging market economies are playing an increasingly important role in the global trade landscape.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emerging_markets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位哲学家的理论框架为理解人工智能的道德地位问题提供了新视角。",
      "sentence_pinyin": "Zhè wèi zhéxuéjiā de lǐlùn kuàngjià wèi lǐjiě réngōng zhìnéng de dàodé dìwèi wèntí tígōng le xīn shìjiǎo.",
      "sentence_fr": "Le cadre théorique de ce philosophe offre une nouvelle perspective pour comprendre la question du statut moral de l'intelligence artificielle.",
      "sentence_en": "This philosopher's theoretical framework provides a new perspective for understanding the moral status of artificial intelligence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ai_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物多样性的丧失不仅影响生态系统稳定性,还可能导致新型传染病的出现。",
      "sentence_pinyin": "Shēngwù duōyàngxìng de sàngshī bùjǐn yǐngxiǎng shēngtài xìtǒng wěndìngxìng, hái kěnéng dǎozhì xīnxíng chuánrǎnbìng de chūxiàn.",
      "sentence_fr": "La perte de biodiversité affecte non seulement la stabilité des écosystèmes, mais peut également conduire à l'émergence de nouvelles maladies infectieuses.",
      "sentence_en": "The loss of biodiversity not only affects ecosystem stability but may also lead to the emergence of new infectious diseases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biodiversity_health",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字货币的监管难题促使各国央行加快研发官方数字货币的步伐。",
      "sentence_pinyin": "Shùzì huòbì de jiānguǎn nántí cùshǐ gèguó yāngháng jiākuài yánfā guānfāng shùzì huòbì de bùfá.",
      "sentence_fr": "Les défis réglementaires des monnaies numériques poussent les banques centrales à accélérer le développement de leurs propres monnaies numériques officielles.",
      "sentence_en": "Regulatory challenges of digital currencies are prompting central banks to accelerate the development of official digital currencies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "central_bank_digital_currency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电影通过个人命运的叙述折射出时代变迁对普通人生活的深刻影响。",
      "sentence_pinyin": "Zhè bù diànyǐng tōngguò gèrén mìngyùn de xùshù zhéshè chū shídài biànqiān duì pǔtōngrén shēnghuó de shēnkè yǐngxiǎng.",
      "sentence_fr": "Ce film, à travers le récit de destins individuels, reflète l'impact profond des changements d'époque sur la vie des gens ordinaires.",
      "sentence_en": "This film reflects the profound impact of changing times on ordinary people's lives through the narrative of individual fates.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cinema_social_commentary",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循证医学的发展要求医疗决策必须建立在可靠的科学证据基础之上。",
      "sentence_pinyin": "Xúnzhèng yīxué de fāzhǎn yāoqiú yīliáo juécè bìxū jiànlì zài kěkào de kēxué zhèngjù jīchǔ zhī shàng.",
      "sentence_fr": "Le développement de la médecine fondée sur les preuves exige que les décisions médicales soient basées sur des preuves scientifiques fiables.",
      "sentence_en": "The development of evidence-based medicine requires that medical decisions be based on reliable scientific evidence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evidence_based_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨文化交流中的语言障碍可以通过培养文化敏感性和使用适当的沟通策略来克服。",
      "sentence_pinyin": "Kuà wénhuà jiāoliú zhōng de yǔyán zhàng'ài kěyǐ tōngguò péiyǎng wénhuà mǐngǎnxìng hé shǐyòng shìdàng de gōutōng cèlüè lái kèfú.",
      "sentence_fr": "Les barrières linguistiques dans la communication interculturelle peuvent être surmontées en développant une sensibilité culturelle et en utilisant des stratégies de communication appropriées.",
      "sentence_en": "Language barriers in cross-cultural communication can be overcome by cultivating cultural sensitivity and using appropriate communication strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intercultural_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "3D打印技术正在革新制造业,使定制化生产变得更加经济可行。",
      "sentence_pinyin": "3D dǎyìn jìshù zhèngzài géxīn zhìzàoyè, shǐ dìngzhìhuà shēngchǎn biàn de gèngjiā jīngjì kěxíng.",
      "sentence_fr": "La technologie d'impression 3D révolutionne l'industrie manufacturière, rendant la production personnalisée plus économiquement viable.",
      "sentence_en": "3D printing technology is revolutionizing manufacturing, making customized production more economically viable.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "3d_printing_manufacturing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项社会实验旨在研究人们在匿名情况下的道德行为决策模式。",
      "sentence_pinyin": "Zhè xiàng shèhuì shíyàn zhǐzài yánjiū rénmen zài nìmíng qíngkuàng xià de dàodé xíngwéi juécè móshì.",
      "sentence_fr": "Cette expérience sociale vise à étudier les modèles de prise de décision morale des personnes dans des situations d'anonymat.",
      "sentence_en": "This social experiment aims to study people's moral behavior decision-making patterns under anonymous conditions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_psychology_experiment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现代教育理念强调培养学生的批判性思维能力而非单纯的知识记忆。",
      "sentence_pinyin": "Xiàndài jiàoyù lǐniàn qiángdiào péiyǎng xuéshēng de pīpànxìng sīwéi nénglì ér fēi dānchún de zhīshi jìyì.",
      "sentence_fr": "La philosophie éducative moderne met l'accent sur le développement de la pensée critique des étudiants plutôt que sur la simple mémorisation des connaissances.",
      "sentence_en": "Modern educational philosophy emphasizes cultivating students' critical thinking abilities rather than mere knowledge memorization.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "educational_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
