{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子计算的最终目标是实现实用的量子优势应用。",
      "sentence_pinyin": "Liàngzǐ jìsuàn de zuìzhōng mùbiāo shì shíxiàn shíyòng de liàngzǐ yōushì yìngyòng.",
      "sentence_fr": "L'objectif ultime du calcul quantique est de réaliser des applications pratiques d'avantage quantique.",
      "sentence_en": "The ultimate goal of quantum computing is to achieve practical quantum advantage applications.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_computing_goals",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "通用可组合安全是密码协议安全性的最高标准。",
      "sentence_pinyin": "Tōngyòng kě zǔhé ānquán shì mìmǎ xiéyì ānquánxìng de zuìgāo biāozhǔn.",
      "sentence_fr": "La sécurité universellement composable est la norme la plus élevée pour la sécurité des protocoles cryptographiques.",
      "sentence_en": "Universal composability is the highest standard for cryptographic protocol security.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "uc_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "构造演算是同时具有多态和依赖类型的类型系统。",
      "sentence_pinyin": "Gòuzào yǎnsuàn shì tóngshí jùyǒu duōtài hé yīlài lèixíng de lèixíng xìtǒng.",
      "sentence_fr": "Le calcul des constructions est un système de types ayant à la fois le polymorphisme et les types dépendants.",
      "sentence_en": "Calculus of constructions is a type system with both polymorphism and dependent types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "calculus_of_constructions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "特征类是联系纤维丛拓扑性质的上同调类。",
      "sentence_pinyin": "Tèzhēng lèi shì liánxì xiānwéi cù tuòpū xìngzhì de shàng tóngdiào lèi.",
      "sentence_fr": "Les classes caractéristiques sont des classes de cohomologie reliant les propriétés topologiques des fibrés.",
      "sentence_en": "Characteristic classes are cohomology classes connecting topological properties of fiber bundles.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "characteristic_classes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子计算复杂度理论研究量子算法的计算资源需求。",
      "sentence_pinyin": "Liàngzǐ jìsuàn fùzádù lǐlùn yánjiū liàngzǐ suànfǎ de jìsuàn zīyuán xūqiú.",
      "sentence_fr": "La théorie de la complexité du calcul quantique étudie les besoins en ressources de calcul des algorithmes quantiques.",
      "sentence_en": "Quantum computational complexity theory studies computational resource requirements of quantum algorithms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_complexity_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "完美安全性在信息论意义上无条件保证密文不泄露信息。",
      "sentence_pinyin": "Wánměi ānquánxìng zài xìnxī lùn yìyì shàng wútiáojiàn bǎozhèng mìwén bù xièlòu xìnxī.",
      "sentence_fr": "La sécurité parfaite garantit inconditionnellement au sens de la théorie de l'information que le chiffré ne divulgue pas d'informations.",
      "sentence_en": "Perfect security unconditionally guarantees in information-theoretic sense that ciphertext reveals no information.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "perfect_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "证明助手软件帮助数学家验证复杂定理的形式化证明。",
      "sentence_pinyin": "Zhèngmíng zhùshǒu ruǎnjiàn bāngzhù shùxuéjiā yànzhèng fùzá dìnglǐ de xíngshìhuà zhèngmíng.",
      "sentence_fr": "Les assistants de preuve aident les mathématiciens à vérifier les preuves formelles de théorèmes complexes.",
      "sentence_en": "Proof assistants help mathematicians verify formal proofs of complex theorems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "proof_assistants",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "切丛是光滑流形上所有切向量的集合。",
      "sentence_pinyin": "Qiè cù shì guānghuá liúxíng shàng suǒyǒu qiè xiàngliàng de jíhé.",
      "sentence_fr": "Le fibré tangent est l'ensemble de tous les vecteurs tangents sur une variété lisse.",
      "sentence_en": "Tangent bundle is the collection of all tangent vectors on a smooth manifold.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "tangent_bundle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子信息科学融合了物理学、计算机科学和数学。",
      "sentence_pinyin": "Liàngzǐ xìnxī kēxué rónghé le wùlǐxué, jìsuànjī kēxué hé shùxué.",
      "sentence_fr": "La science de l'information quantique fusionne la physique, l'informatique et les mathématiques.",
      "sentence_en": "Quantum information science integrates physics, computer science, and mathematics.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_information_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可证明安全的密码学将安全保证建立在数学基础上。",
      "sentence_pinyin": "Kě zhèngmíng ānquán de mìmǎxué jiāng ānquán bǎozhèng jiànlì zài shùxué jīchǔ shàng.",
      "sentence_fr": "La cryptographie prouvablement sûre établit des garanties de sécurité sur des fondements mathématiques.",
      "sentence_en": "Provably secure cryptography establishes security guarantees on mathematical foundations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "provable_cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "形式化验证通过数学证明确保软件系统的正确性。",
      "sentence_pinyin": "Xíngshìhuà yànzhèng tōngguò shùxué zhèngmíng quèbǎo ruǎnjiàn xìtǒng de zhèngquèxìng.",
      "sentence_fr": "La vérification formelle assure la correction des systèmes logiciels par des preuves mathématiques.",
      "sentence_en": "Formal verification ensures software system correctness through mathematical proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "formal_verification",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "余切丛是切丛的对偶在辛几何中有重要应用。",
      "sentence_pinyin": "Yú qiè cù shì qiè cù de duìǒu zài xīn jǐhé zhōng yǒu zhòngyào yìngyòng.",
      "sentence_fr": "Le fibré cotangent, dual du fibré tangent, a des applications importantes en géométrie symplectique.",
      "sentence_en": "Cotangent bundle is the dual of tangent bundle with important applications in symplectic geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cotangent_bundle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子机器学习探索量子计算在人工智能中的应用前景。",
      "sentence_pinyin": "Liàngzǐ jīqì xuéxí tànsuǒ liàngzǐ jìsuàn zài réngōng zhìnéng zhōng de yìngyòng qiánjǐng.",
      "sentence_fr": "L'apprentissage automatique quantique explore les perspectives d'application du calcul quantique dans l'intelligence artificielle.",
      "sentence_en": "Quantum machine learning explores application prospects of quantum computing in artificial intelligence.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_machine_learning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现代密码学的安全性基于计算困难性假设。",
      "sentence_pinyin": "Xiàndài mìmǎxué de ānquánxìng jīyú jìsuàn kùnnánxìng jiǎshè.",
      "sentence_fr": "La sécurité de la cryptographie moderne repose sur des hypothèses de difficulté computationnelle.",
      "sentence_en": "Modern cryptography security is based on computational hardness assumptions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "computational_hardness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "依赖类型论为编程语言和数学证明提供统一框架。",
      "sentence_pinyin": "Yīlài lèixíng lùn wèi biānchéng yǔyán hé shùxué zhèngmíng tígōng tǒngyī kuàngjià.",
      "sentence_fr": "La théorie des types dépendants fournit un cadre unifié pour les langages de programmation et les preuves mathématiques.",
      "sentence_en": "Dependent type theory provides a unified framework for programming languages and mathematical proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "dependent_type_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "联络形式在微分几何中描述平行移动的局部表示。",
      "sentence_pinyin": "Liánluò xíngshì zài wēifēn jǐhé zhōng miáoshù píngxíng yídòng de júbù biǎoshì.",
      "sentence_fr": "Les formes de connexion décrivent la représentation locale du transport parallèle en géométrie différentielle.",
      "sentence_en": "Connection forms describe local representations of parallel transport in differential geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "connection_forms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子网络将多个量子节点连接实现远距离量子通信。",
      "sentence_pinyin": "Liàngzǐ wǎngluò jiāng duō gè liàngzǐ jiédiǎn liánjiē shíxiàn yuǎn jùlí liàngzǐ tōngxìn.",
      "sentence_fr": "Les réseaux quantiques connectent plusieurs nœuds quantiques pour réaliser des communications quantiques à longue distance.",
      "sentence_en": "Quantum networks connect multiple quantum nodes to achieve long-distance quantum communication.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_networks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密码学协议的形式化分析使用符号方法和计算方法。",
      "sentence_pinyin": "Mìmǎxué xiéyì de xíngshìhuà fēnxī shǐyòng fúhào fāngfǎ hé jìsuàn fāngfǎ.",
      "sentence_fr": "L'analyse formelle des protocoles cryptographiques utilise des méthodes symboliques et computationnelles.",
      "sentence_en": "Formal analysis of cryptographic protocols uses symbolic and computational methods.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "protocol_formal_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦类型论为数学基础提供了新的计算视角。",
      "sentence_pinyin": "Tónglún lèixíng lùn wèi shùxué jīchǔ tígōng le xīn de jìsuàn shìjiǎo.",
      "sentence_fr": "La théorie des types homotopiques fournit une nouvelle perspective computationnelle pour les fondements mathématiques.",
      "sentence_en": "Homotopy type theory provides a new computational perspective for mathematical foundations.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hott_foundations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "曲率张量完整描述黎曼流形的内蕴几何性质。",
      "sentence_pinyin": "Qūlǜ zhāngliàng wánzhěng miáoshù Límàn liúxíng de nèizài jǐhé xìngzhì.",
      "sentence_fr": "Le tenseur de courbure décrit complètement les propriétés géométriques intrinsèques des variétés riemanniennes.",
      "sentence_en": "Curvature tensor completely describes intrinsic geometric properties of Riemannian manifolds.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "curvature_tensor",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
