{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个流浪动物收容所每年救助数千只无家可归的猫狗。",
      "sentence_pinyin": "Zhège liúlàng dòngwù shōuróngsuǒ měinián jiùzhù shù qiān zhǐ wú jiā kě guī de māo gǒu.",
      "sentence_fr": "Ce refuge pour animaux errants sauve des milliers de chats et chiens sans abri chaque année.",
      "sentence_en": "This stray animal shelter rescues thousands of homeless cats and dogs every year.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "animal_shelters",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的水墨画作品意境深远，体现了中国传统绘画的韵味。",
      "sentence_pinyin": "Tā de shuǐmòhuà zuòpǐn yìjìng shēnyuǎn, tǐxiànle Zhōngguó chuántǒng huìhuà de yùnwèi.",
      "sentence_fr": "Ses peintures à l'encre de Chine ont une profonde signification artistique, reflétant le charme de la peinture traditionnelle chinoise.",
      "sentence_en": "Her ink paintings have profound artistic conception, reflecting the charm of traditional Chinese painting.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ink_painting",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线直播平台为创作者提供了多元化的变现渠道。",
      "sentence_pinyin": "Zhège zàixiàn zhíbō píngtái wèi chuàngzuòzhě tígōngle duōyuánhuà de biànxiàn qúdào.",
      "sentence_fr": "Cette plateforme de streaming en direct offre aux créateurs des canaux de monétisation diversifiés.",
      "sentence_en": "This live streaming platform provides creators with diversified monetization channels.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "live_streaming",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在考古发掘工作中发现了一批珍贵的历史文物。",
      "sentence_pinyin": "Tā zài kǎogǔ fājué gōngzuò zhōng fāxiànle yī pī zhēnguì de lìshǐ wénwù.",
      "sentence_fr": "Lors de travaux de fouilles archéologiques, il a découvert un lot de précieux artefacts historiques.",
      "sentence_en": "During archaeological excavation work, he discovered a batch of precious historical artifacts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "archaeology",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个语音助手能够识别自然语言并执行各种智能指令。",
      "sentence_pinyin": "Zhège yǔyīn zhùshǒu nénggòu shíbié zìrán yǔyán bìng zhíxíng gèzhǒng zhìnéng zhǐlìng.",
      "sentence_fr": "Cet assistant vocal peut reconnaître le langage naturel et exécuter diverses commandes intelligentes.",
      "sentence_en": "This voice assistant can recognize natural language and execute various smart commands.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "voice_assistants",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在企业培训中传授了实用的沟通技巧和管理方法。",
      "sentence_pinyin": "Tā zài qǐyè péixùn zhōng chuánshòule shíyòng de gōutōng jìqiǎo hé guǎnlǐ fāngfǎ.",
      "sentence_fr": "Dans la formation d'entreprise, elle a enseigné des compétences de communication pratiques et des méthodes de gestion.",
      "sentence_en": "In corporate training, she taught practical communication skills and management methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "corporate_training",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个有机农场坚持不使用化学农药和化肥。",
      "sentence_pinyin": "Zhège yǒujī nóngchǎng jiānchí bù shǐyòng huàxué nóngyào hé huàféi.",
      "sentence_fr": "Cette ferme biologique s'engage à ne pas utiliser de pesticides chimiques ni d'engrais.",
      "sentence_en": "This organic farm insists on not using chemical pesticides and fertilizers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "organic_farming",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在马术训练中培养了与马匹之间的默契和信任。",
      "sentence_pinyin": "Tā zài mǎshù xùnliàn zhōng péiyǎngle yǔ mǎpǐ zhījiān de mòqì hé xìnrèn.",
      "sentence_fr": "Lors de l'entraînement équestre, il a développé une compréhension tacite et une confiance avec les chevaux.",
      "sentence_en": "During equestrian training, he developed tacit understanding and trust with horses.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "equestrian",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个心理辅导热线为遇到困难的人提供及时的情感支持。",
      "sentence_pinyin": "Zhège xīnlǐ fǔdǎo rèxiàn wèi yùdào kùnnan de rén tígōng jíshí de qínggǎn zhīchí.",
      "sentence_fr": "Cette ligne d'assistance psychologique fournit un soutien émotionnel opportun aux personnes en difficulté.",
      "sentence_en": "This psychological counseling hotline provides timely emotional support to people in difficulty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crisis_hotlines",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的剪纸作品造型生动，刀工细腻，极具民间艺术特色。",
      "sentence_pinyin": "Tā de jiǎnzhǐ zuòpǐn zàoxíng shēngdòng, dāogōng xìnì, jí jù mínjiān yìshù tèsè.",
      "sentence_fr": "Ses œuvres de découpage de papier ont des formes vivantes, un travail au couteau délicat et des caractéristiques d'art populaire prononcées.",
      "sentence_en": "Her paper-cutting works have vivid forms, delicate knife work, and pronounced folk art characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "paper_cutting",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个跨境物流平台为全球贸易提供高效的货运服务。",
      "sentence_pinyin": "Zhège kuàjìng wùliú píngtái wèi quánqiú màoyì tígōng gāoxiào de huòyùn fúwù.",
      "sentence_fr": "Cette plateforme logistique transfrontalière fournit des services de fret efficaces pour le commerce mondial.",
      "sentence_en": "This cross-border logistics platform provides efficient freight services for global trade.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "international_logistics",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在纪录片拍摄中真实记录了传统手工艺人的匠心精神。",
      "sentence_pinyin": "Tā zài jìlùpiàn pāishè zhōng zhēnshí jìlùle chuántǒng shǒugōngyìrén de jiàngxīn jīngshén.",
      "sentence_fr": "Dans le tournage de documentaires, il a fidèlement enregistré l'esprit artisanal des artisans traditionnels.",
      "sentence_en": "In documentary filming, he authentically recorded the craftsmanship spirit of traditional artisans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "craftsmanship_documentaries",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个电子竞技俱乐部培养了多名职业选手参加国际赛事。",
      "sentence_pinyin": "Zhège diànzǐ jìngjì jùlèbù péiyǎngle duō míng zhíyè xuǎnshǒu cānjiā guójì sàishì.",
      "sentence_fr": "Ce club d'e-sport a formé plusieurs joueurs professionnels participant à des compétitions internationales.",
      "sentence_en": "This e-sports club trained multiple professional players participating in international competitions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "esports",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在社交礼仪培训中教授了得体的商务交往规范。",
      "sentence_pinyin": "Tā zài shèjiāo lǐyí péixùn zhōng jiàoshòule détǐ de shāngwù jiāowǎng guīfàn.",
      "sentence_fr": "Dans la formation en étiquette sociale, elle a enseigné les normes appropriées pour les interactions commerciales.",
      "sentence_en": "In social etiquette training, she taught appropriate business interaction norms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business_etiquette",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个废水处理系统采用了先进的生物净化技术。",
      "sentence_pinyin": "Zhège fèishuǐ chǔlǐ xìtǒng cǎiyòngle xiānjìn de shēngwù jìnghuà jìshù.",
      "sentence_fr": "Ce système de traitement des eaux usées utilise une technologie avancée de purification biologique.",
      "sentence_en": "This wastewater treatment system uses advanced biological purification technology.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wastewater_treatment",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在街舞比赛中以创新的编舞和精湛的技巧夺得冠军。",
      "sentence_pinyin": "Tā zài jiēwǔ bǐsài zhōng yǐ chuàngxīn de biānwǔ hé jīngzhàn de jìqiǎo duódé guànjūn.",
      "sentence_fr": "Il a remporté le championnat de street dance avec une chorégraphie innovante et une technique exquise.",
      "sentence_en": "He won the street dance championship with innovative choreography and exquisite technique.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "street_dance",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职业健康检查项目帮助员工及早发现潜在的健康风险。",
      "sentence_pinyin": "Zhège zhíyè jiànkāng jiǎnchá xiàngmù bāngzhù yuángōng jízǎo fāxiàn qiánzài de jiànkāng fēngxiǎn.",
      "sentence_fr": "Ce programme d'examen de santé professionnelle aide les employés à détecter rapidement les risques potentiels pour la santé.",
      "sentence_en": "This occupational health examination program helps employees detect potential health risks early.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "occupational_health",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的钢笔画作品线条流畅，细节刻画入微。",
      "sentence_pinyin": "Tā de gāngbǐhuà zuòpǐn xiàntiáo liúchàng, xìjié kèhuà rùwēi.",
      "sentence_fr": "Ses dessins au stylo ont des lignes fluides et des détails minutieusement représentés.",
      "sentence_en": "Her pen drawings have fluid lines and meticulously depicted details.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pen_drawing",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个创业孵化园区为初创企业提供办公场地和政策扶持。",
      "sentence_pinyin": "Zhège chuàngyè fūhuà yuánqū wèi chūchuàng qǐyè tígōng bàngōng chǎngdì hé zhèngcè fúchí.",
      "sentence_fr": "Ce parc d'incubation d'entreprises fournit des bureaux et un soutien politique aux startups.",
      "sentence_en": "This business incubation park provides office space and policy support to startups.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "incubation_parks",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在围棋教学中注重培养学生的大局观和计算能力。",
      "sentence_pinyin": "Tā zài wéiqí jiàoxué zhōng zhùzhòng péiyǎng xuésheng de dàjúguān hé jìsuàn nénglì.",
      "sentence_fr": "Dans l'enseignement du go, il met l'accent sur le développement de la vision globale et des capacités de calcul des étudiants.",
      "sentence_en": "In Go teaching, he emphasizes developing students' overall perspective and calculation abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "go_instruction",
      "created_at": "2025-11-20T18:35:00.000Z",
      "updated_at": "2025-11-20T18:35:00.000Z"
    }
  ]
}
