{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个绿色建筑采用了太阳能、雨水收集和自然通风等多种节能技术。",
      "sentence_pinyin": "Zhège lǜsè jiànzhú cǎiyòngle tàiyángnéng, yǔshuǐ shōují hé zìrán tōngfēng děng duō zhǒng jiénéng jìshù.",
      "sentence_fr": "Ce bâtiment vert adopte plusieurs technologies d'économie d'énergie telles que l'énergie solaire, la collecte des eaux de pluie et la ventilation naturelle.",
      "sentence_en": "This green building adopts multiple energy-saving technologies such as solar energy, rainwater collection, and natural ventilation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_buildings",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "巴乌是一种簧管乐器,音色柔美婉转,常用于独奏和重奏。",
      "sentence_pinyin": "Bāwū shì yī zhǒng huángguǎn yuèqì, yīnsè róuměi wǎnzhuǎn, cháng yòng yú dúzòu hé chóngzòu.",
      "sentence_fr": "Le bawu est un instrument à anche au son doux et mélodieux, souvent utilisé pour les solos et les duos.",
      "sentence_en": "The bawu is a reed instrument with a soft and melodious tone, often used for solos and duets.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bawu_music",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食品银行收集即将过期但仍安全的食品,免费分发给困难家庭。",
      "sentence_pinyin": "Zhège shípǐn yínháng shōují jíjiāng guòqī dàn réng ānquán de shípǐn, miǎnfèi fēnfā gěi kùnnán jiātíng.",
      "sentence_fr": "Cette banque alimentaire collecte des aliments sur le point d'expirer mais encore sûrs et les distribue gratuitement aux familles en difficulté.",
      "sentence_en": "This food bank collects food that is about to expire but still safe and distributes it free to families in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "food_banks",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "根雕艺术家善于发现树根的天然形态,巧妙地雕刻成艺术作品。",
      "sentence_pinyin": "Gēndiāo yìshùjiā shànyú fāxiàn shùgēn de tiānrán xíngtài, qiǎomiào de diāokè chéng yìshù zuòpǐn.",
      "sentence_fr": "Les artistes de la sculpture sur racines sont habiles à découvrir les formes naturelles des racines d'arbres et à les sculpter astucieusement en œuvres d'art.",
      "sentence_en": "Root carving artists are skilled at discovering the natural forms of tree roots and cleverly sculpting them into art works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "root_carving",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能门锁支持指纹、密码和手机远程开锁等多种方式。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng ménsuǒ zhīchí zhǐwén, mìmǎ hé shǒujī yuǎnchéng kāisuǒ děng duō zhǒng fāngshì.",
      "sentence_fr": "Cette serrure intelligente prend en charge plusieurs méthodes telles que l'empreinte digitale, le code PIN et le déverrouillage à distance par téléphone.",
      "sentence_en": "This smart lock supports multiple methods such as fingerprint, password, and remote phone unlocking.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_locks",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个湿地保护区为候鸟提供了重要的栖息地和中转站。",
      "sentence_pinyin": "Zhège shīdì bǎohùqū wèi hòuniǎo tígōngle zhòngyào de qīxīdì hé zhōngzhuǎnzhàn.",
      "sentence_fr": "Cette réserve de zones humides fournit un habitat important et une escale pour les oiseaux migrateurs.",
      "sentence_en": "This wetland reserve provides an important habitat and stopover for migratory birds.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wetland_conservation",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "箫的音色深沉哀婉,最适合表达幽静淡雅的意境。",
      "sentence_pinyin": "Xiāo de yīnsè shēnchén āiwǎn, zuì shìhé biǎodá yōujìng dànyǎ de yìjìng.",
      "sentence_fr": "Le xiao a un son profond et mélancolique, idéal pour exprimer une atmosphère tranquille et élégante.",
      "sentence_en": "The xiao has a deep and melancholic tone, most suitable for expressing quiet and elegant moods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xiao_music",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众包平台让企业能够快速找到各类专业人才完成项目任务。",
      "sentence_pinyin": "Zhège zhòngbāo píngtái ràng qǐyè nénggòu kuàisù zhǎodào gè lèi zhuānyè réncái wánchéng xiàngmù rènwù.",
      "sentence_fr": "Cette plateforme de crowdsourcing permet aux entreprises de trouver rapidement divers talents professionnels pour accomplir des tâches de projet.",
      "sentence_en": "This crowdsourcing platform enables companies to quickly find various professional talents to complete project tasks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "crowdsourcing_platforms",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "麦秆画利用麦秆的天然色泽和纹理,拼贴出精美的装饰画。",
      "sentence_pinyin": "Màigǎn huà lìyòng màigǎn de tiānrán sèzé hé wénlǐ, pīntiē chū jīngměi de zhuāngshì huà.",
      "sentence_fr": "La peinture sur paille de blé utilise les couleurs et textures naturelles de la paille pour créer de belles peintures décoratives par collage.",
      "sentence_en": "Wheat straw paintings use the natural colors and textures of wheat straw to create beautiful decorative paintings through collage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wheat_straw_art",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能冰箱可以自动识别食材,推荐合适的菜谱和烹饪方法。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng bīngxiāng kěyǐ zìdòng shíbié shícái, tuījiàn héshì de càipǔ hé pēngrèn fāngfǎ.",
      "sentence_fr": "Ce réfrigérateur intelligent peut identifier automatiquement les ingrédients et recommander des recettes et méthodes de cuisson appropriées.",
      "sentence_en": "This smart refrigerator can automatically identify ingredients and recommend suitable recipes and cooking methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_refrigerators",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个助残就业基地为残疾人提供了适合他们能力的工作岗位。",
      "sentence_pinyin": "Zhège zhùcán jiùyè jīdì wèi cánjírén tígōngle shìhé tāmen nénglì de gōngzuò gǎngwèi.",
      "sentence_fr": "Cette base d'emploi pour personnes handicapées offre des postes de travail adaptés à leurs capacités.",
      "sentence_en": "This disability employment base provides job positions suitable for the abilities of people with disabilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disability_employment",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "排箫由多支长短不一的竹管组成,能够演奏出空灵优美的旋律。",
      "sentence_pinyin": "Páixiāo yóu duō zhī chángduǎn bùyī de zhúguǎn zǔchéng, nénggòu yǎnzòu chū kōnglíng yōuměi de xuánlǜ.",
      "sentence_fr": "La flûte de Pan est composée de plusieurs tubes de bambou de longueurs différentes, capable de jouer des mélodies éthérées et belles.",
      "sentence_en": "The panpipe is composed of multiple bamboo tubes of varying lengths, capable of playing ethereal and beautiful melodies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "panpipe_music",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线法律咨询平台为普通民众提供了免费的法律援助服务。",
      "sentence_pinyin": "Zhège zàixiàn fǎlǜ zīxún píngtái wèi pǔtōng mínzhòng tígōngle miǎnfèi de fǎlǜ yuánzhù fúwù.",
      "sentence_fr": "Cette plateforme de consultation juridique en ligne offre des services d'aide juridique gratuits au grand public.",
      "sentence_en": "This online legal consultation platform provides free legal aid services to the general public.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "legal_aid_platforms",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "棕编工艺利用棕榈叶编织成扇子、草鞋等传统用品。",
      "sentence_pinyin": "Zōngbiān gōngyì lìyòng zōnglǘyè biānzhī chéng shànzi, cǎoxié děng chuántǒng yòngpǐn.",
      "sentence_fr": "L'artisanat du tressage de palmier utilise les feuilles de palmier pour tisser des éventails, des sandales de paille et autres articles traditionnels.",
      "sentence_en": "Palm weaving craftsmanship uses palm leaves to weave fans, straw sandals, and other traditional items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "palm_weaving",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能空气净化器能够实时监测室内空气质量,自动调节净化强度。",
      "sentence_pinyin": "Zhège zhìnéng kōngqì jìnghuàqì nénggòu shíshí jiāncè shìnèi kōngqì zhìliàng, zìdòng tiáojié jìnghuà qiángdù.",
      "sentence_fr": "Ce purificateur d'air intelligent peut surveiller en temps réel la qualité de l'air intérieur et ajuster automatiquement l'intensité de purification.",
      "sentence_en": "This smart air purifier can monitor indoor air quality in real-time and automatically adjust purification intensity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "air_purifiers",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个森林公园建立了生态教育基地,向公众普及环境保护知识。",
      "sentence_pinyin": "Zhège sēnlín gōngyuán jiànlìle shēngtài jiàoyù jīdì, xiàng gōngzhòng pǔjí huánjìng bǎohù zhīshi.",
      "sentence_fr": "Ce parc forestier a établi une base d'éducation écologique pour sensibiliser le public à la protection de l'environnement.",
      "sentence_en": "This forest park has established an ecological education base to educate the public about environmental protection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ecological_education",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "唢呐的音量大、穿透力强,在户外演出中能够很好地带动气氛。",
      "sentence_pinyin": "Suǒnà de yīnliàng dà, chuāntòulì qiáng, zài hùwài yǎnchū zhōng nénggòu hěn hǎo de dàidòng qìfēn.",
      "sentence_fr": "Le suona a un volume élevé et une forte pénétration, capable de bien animer l'atmosphère lors de spectacles en plein air.",
      "sentence_en": "The suona has high volume and strong penetrating power, able to effectively energize the atmosphere in outdoor performances.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "suona_music",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个共享办公空间为自由职业者和小型团队提供了灵活的办公环境。",
      "sentence_pinyin": "Zhège gòngxiǎng bàngōng kōngjiān wèi zìyóu zhíyèzhě hé xiǎoxíng tuánduì tígōngle línghuó de bàngōng huánjìng.",
      "sentence_fr": "Cet espace de coworking offre un environnement de travail flexible pour les travailleurs indépendants et les petites équipes.",
      "sentence_en": "This coworking space provides a flexible working environment for freelancers and small teams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "coworking_spaces",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "刺绣工艺中的苏绣以针法细腻、色彩雅致而闻名天下。",
      "sentence_pinyin": "Cìxiù gōngyì zhōng de Sūxiù yǐ zhēnfǎ xìnì, sècǎi yǎzhì ér wénmíng tiānxià.",
      "sentence_fr": "La broderie Su, dans l'artisanat de la broderie, est mondialement célèbre pour ses points délicats et ses couleurs élégantes.",
      "sentence_en": "Su embroidery in embroidery craftsmanship is world-renowned for its delicate stitches and elegant colors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "su_embroidery",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款健康监测设备可以持续追踪血糖、血压等重要生理指标。",
      "sentence_pinyin": "Zhè kuǎn jiànkāng jiāncè shèbèi kěyǐ chíxù zhuīzōng xuètáng, xuèyā děng zhòngyào shēnglǐ zhǐbiāo.",
      "sentence_fr": "Cet appareil de surveillance de la santé peut suivre en continu des indicateurs physiologiques importants tels que la glycémie et la tension artérielle.",
      "sentence_en": "This health monitoring device can continuously track important physiological indicators such as blood sugar and blood pressure.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_monitoring_devices",
      "created_at": "2025-11-20T21:00:00.000Z",
      "updated_at": "2025-11-20T21:00:00.000Z"
    }
  ]
}
