{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个量子计算研究项目在核心技术上取得了重要突破。",
      "sentence_pinyin": "Zhège liàngzǐ jìsuàn yánjiū xiàngmù zài héxīn jìshù shàng qǔdéle zhòngyào tūpò.",
      "sentence_fr": "Ce projet de recherche en informatique quantique a réalisé des percées importantes dans les technologies de base.",
      "sentence_en": "This quantum computing research project achieved important breakthroughs in core technologies.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "quantum_computing",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的手工皮具作品工艺精湛，深受收藏家的青睐。",
      "sentence_pinyin": "Tā de shǒugōng píjù zuòpǐn gōngyì jīngzhàn, shēn shòu shōucángjiā de qīnglài.",
      "sentence_fr": "Ses articles en cuir faits main sont d'un savoir-faire exquis, très appréciés des collectionneurs.",
      "sentence_en": "Her handmade leather goods are of exquisite craftsmanship, highly favored by collectors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "leather_crafts",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市规划展览馆展示了未来城市发展的愿景和蓝图。",
      "sentence_pinyin": "Zhège chéngshì guīhuà zhǎnlǎnguǎn zhǎnshìle wèilái chéngshì fāzhǎn de yuànjǐng hé lántú.",
      "sentence_fr": "Ce musée de planification urbaine présente la vision et le plan directeur du développement urbain futur.",
      "sentence_en": "This urban planning exhibition hall showcases the vision and blueprint for future urban development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_planning_exhibitions",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在篮球训练中掌握了扎实的基本功和战术配合能力。",
      "sentence_pinyin": "Tā zài lánqiú xùnliàn zhōng zhǎngwòle zhāshi de jīběngōng hé zhànshù pèihé nénglì.",
      "sentence_fr": "Lors de l'entraînement de basket-ball, il a maîtrisé des compétences de base solides et des capacités de coordination tactique.",
      "sentence_en": "In basketball training, he mastered solid fundamental skills and tactical coordination abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "basketball_training",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个慈善音乐会为贫困山区募集了大量教育资金。",
      "sentence_pinyin": "Zhège císhàn yīnyuèhuì wèi pínkùn shānqū mùjíle dàliàng jiàoyù zījīn.",
      "sentence_fr": "Ce concert de charité a collecté d'importants fonds éducatifs pour les régions montagneuses pauvres.",
      "sentence_en": "This charity concert raised substantial educational funds for poor mountainous areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity_concerts",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过参加各种文化沙龙活动拓展了社交圈和知识面。",
      "sentence_pinyin": "Tā tōngguò cānjiā gèzhǒng wénhuà shālóng huódòng tuòzhǎnle shèjiāo quān hé zhīshimiàn.",
      "sentence_fr": "En participant à diverses activités de salon culturel, elle a élargi son cercle social et ses connaissances.",
      "sentence_en": "By participating in various cultural salon activities, she expanded her social circle and knowledge.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_salons",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个电动汽车充电网络覆盖了主要城市和高速公路。",
      "sentence_pinyin": "Zhège diàndòng qìchē chōngdiàn wǎngluò fùgàile zhǔyào chéngshì hé gāosù gōnglù.",
      "sentence_fr": "Ce réseau de recharge pour véhicules électriques couvre les principales villes et autoroutes.",
      "sentence_en": "This electric vehicle charging network covers major cities and highways.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_infrastructure",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的园艺设计将自然景观和人工造景和谐统一。",
      "sentence_pinyin": "Tā de yuányì shèjì jiāng zìrán jǐngguān hé réngōng zàojǐng héxié tǒngyī.",
      "sentence_fr": "Sa conception paysagère harmonise le paysage naturel et les aménagements artificiels.",
      "sentence_en": "His garden design harmoniously unifies natural landscape and artificial landscaping.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "garden_design",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个语音识别系统能够准确识别多种方言和口音。",
      "sentence_pinyin": "Zhège yǔyīn shíbié xìtǒng nénggòu zhǔnquè shíbié duō zhǒng fāngyán hé kǒuyīn.",
      "sentence_fr": "Ce système de reconnaissance vocale peut identifier avec précision de nombreux dialectes et accents.",
      "sentence_en": "This voice recognition system can accurately identify multiple dialects and accents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "voice_recognition",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在节目主持中展现出亲和力和专业素养。",
      "sentence_pinyin": "Tā zài jiémù zhǔchí zhōng zhǎnxiàn chū qīnhélì hé zhuānyè sùyǎng.",
      "sentence_fr": "Dans l'animation d'émissions, elle démontre une grande affinité et un professionnalisme.",
      "sentence_en": "In program hosting, she demonstrates great affinity and professionalism.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "broadcasting",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个海洋主题公园集教育、娱乐和科研功能于一体。",
      "sentence_pinyin": "Zhège hǎiyáng zhǔtí gōngyuán jí jiàoyù, yúlè hé kēyán gōngnéng yú yītǐ.",
      "sentence_fr": "Ce parc à thème marin intègre des fonctions éducatives, de divertissement et de recherche scientifique.",
      "sentence_en": "This ocean theme park integrates educational, entertainment, and scientific research functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "theme_parks",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在学术著作中系统阐述了自己的理论观点和研究方法。",
      "sentence_pinyin": "Tā zài xuéshù zhùzuò zhōng xìtǒng chǎnshùle zìjǐ de lǐlùn guāndiǎn hé yánjiū fāngfǎ.",
      "sentence_fr": "Dans ses œuvres académiques, il expose systématiquement ses points de vue théoriques et ses méthodes de recherche.",
      "sentence_en": "In his academic works, he systematically expounds his theoretical viewpoints and research methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "academic_writing",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区医疗服务站为居民提供便捷的基础医疗保健。",
      "sentence_pinyin": "Zhège shèqū yīliáo fúwùzhàn wèi jūmín tígōng biànjié de jīchǔ yīliáo bǎojiàn.",
      "sentence_fr": "Ce centre de services médicaux communautaires fournit aux résidents des soins de santé de base pratiques.",
      "sentence_en": "This community medical service station provides residents with convenient basic healthcare.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_healthcare",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的油画作品色彩浓郁，笔触奔放，极具表现力。",
      "sentence_pinyin": "Tā de yóuhuà zuòpǐn sècǎi nóngyù, bǐchù bēnfàng, jí jù biǎoxiànlì.",
      "sentence_fr": "Ses peintures à l'huile ont des couleurs riches, des coups de pinceau audacieux et sont très expressives.",
      "sentence_en": "Her oil paintings have rich colors, bold brushstrokes, and are highly expressive.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "oil_painting",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个金融监管平台利用大数据技术防范金融风险。",
      "sentence_pinyin": "Zhège jīnróng jiānguǎn píngtái lìyòng dà shùjù jìshù fángfàn jīnróng fēngxiǎn.",
      "sentence_fr": "Cette plateforme de régulation financière utilise la technologie du big data pour prévenir les risques financiers.",
      "sentence_en": "This financial regulatory platform uses big data technology to prevent financial risks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "financial_regulation",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在团队建设中强调相互信任和开放沟通的重要性。",
      "sentence_pinyin": "Tā zài tuánduì jiànshè zhōng qiángdiào xiānghù xìnrèn hé kāifàng gōutōng de zhòngyàoxìng.",
      "sentence_fr": "Dans la construction d'équipe, il souligne l'importance de la confiance mutuelle et de la communication ouverte.",
      "sentence_en": "In team building, he emphasizes the importance of mutual trust and open communication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "team_building",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技博物馆通过互动展品让参观者体验科学的乐趣。",
      "sentence_pinyin": "Zhège kējì bówùguǎn tōngguò hùdòng zhǎnpǐn ràng cānguānzhě tǐyàn kēxué de lèqù.",
      "sentence_fr": "Ce musée des sciences permet aux visiteurs de découvrir le plaisir de la science grâce à des expositions interactives.",
      "sentence_en": "This science museum allows visitors to experience the joy of science through interactive exhibits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science_museums",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过瑜伽和冥想保持内心的平静和身体的柔韧。",
      "sentence_pinyin": "Tā tōngguò yújiā hé míngxiǎng bǎochí nèixīn de píngjìng hé shēntǐ de róurèn.",
      "sentence_fr": "Elle maintient la paix intérieure et la souplesse du corps grâce au yoga et à la méditation.",
      "sentence_en": "She maintains inner peace and body flexibility through yoga and meditation.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yoga_practice",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个国际贸易展会吸引了来自全球各地的采购商和供应商。",
      "sentence_pinyin": "Zhège guójì màoyì zhǎnhuì xīyǐnle láizì quánqiú gèdì de cǎigòushāng hé gōngyìngshāng.",
      "sentence_fr": "Cette foire commerciale internationale attire des acheteurs et fournisseurs du monde entier.",
      "sentence_en": "This international trade fair attracts buyers and suppliers from around the world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "trade_fairs",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的建筑理念追求人文关怀和生态可持续发展的平衡。",
      "sentence_pinyin": "Tā de jiànzhù lǐniàn zhuīqiú rénwén guānhuái hé shēngtài kě chíxù fāzhǎn de pínghéng.",
      "sentence_fr": "Sa philosophie architecturale recherche l'équilibre entre humanisme et développement écologique durable.",
      "sentence_en": "His architectural philosophy pursues a balance between humanistic care and ecological sustainable development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sustainable_architecture",
      "created_at": "2025-11-20T18:10:00.000Z",
      "updated_at": "2025-11-20T18:10:00.000Z"
    }
  ]
}
