{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "人脸识别技术在公共安全领域的广泛应用引发了关于隐私保护的激烈辩论。",
      "sentence_pinyin": "Rénliǎn shìbié jìshù zài gōnggòng ānquán lǐngyù de guǎngfàn yìngyòng yǐnfā le guānyú yǐnsī bǎohù de jīliè biànlùn.",
      "sentence_fr": "L'application généralisée de la reconnaissance faciale dans la sécurité publique a déclenché un débat intense sur la protection de la vie privée.",
      "sentence_en": "The widespread application of facial recognition technology in public safety has sparked intense debate about privacy protection.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "facial_recognition_privacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古籍数字化保护项目让珍贵的历史文献能够被更多人研究和欣赏。",
      "sentence_pinyin": "Gǔjí shùzìhuà bǎohù xiàngmù ràng zhēnguì de lìshǐ wénxiàn nénggòu bèi gèng duō rén yánjiū hé xīnshǎng.",
      "sentence_fr": "Les projets de numérisation des anciens livres permettent à davantage de personnes d'étudier et d'apprécier ces précieux documents historiques.",
      "sentence_en": "Ancient book digitization projects allow more people to study and appreciate precious historical documents.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ancient_text_digitization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业的环境社会治理绩效已成为机构投资者评估投资价值的重要指标。",
      "sentence_pinyin": "Qǐyè de huánjìng shèhuì zhìlǐ jīxiào yǐ chéngwéi jīgòu tóuzīzhě pínggū tóuzī jiàzhí de zhòngyào zhǐbiāo.",
      "sentence_fr": "La performance ESG des entreprises est devenue un indicateur important pour les investisseurs institutionnels dans l'évaluation de la valeur d'investissement.",
      "sentence_en": "Corporate ESG performance has become an important indicator for institutional investors in assessing investment value.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "esg_investing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "跨代际沟通障碍往往源于不同年龄群体价值观念和生活经历的差异。",
      "sentence_pinyin": "Kuà dàijì gōutōng zhàng'ài wǎngwǎng yuányú bùtóng niánlíng qúntǐ jiàzhíguānniàn hé shēnghuó jīnglì de chāyì.",
      "sentence_fr": "Les barrières de communication intergénérationnelle proviennent souvent des différences de valeurs et d'expériences de vie entre groupes d'âge.",
      "sentence_en": "Intergenerational communication barriers often stem from differences in values and life experiences among different age groups.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intergenerational_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "氢能源汽车的研发进展为交通领域的脱碳目标提供了可行的技术路径。",
      "sentence_pinyin": "Qīng néngyuán qìchē de yánfā jìnzhǎn wèi jiāotōng lǐngyù de tuōtàn mùbiāo tígōng le kěxíng de jìshù lùjìng.",
      "sentence_fr": "Les progrès dans le développement des véhicules à hydrogène offrent une voie technologique viable pour la décarbonation du secteur des transports.",
      "sentence_en": "Advances in hydrogen vehicle development provide a viable technological pathway for decarbonization goals in the transportation sector.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hydrogen_vehicles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位翻译家致力于将中国古典诗词的意境和韵味传达给西方读者。",
      "sentence_pinyin": "Zhè wèi fānyìjiā zhìlì yú jiāng Zhōngguó gǔdiǎn shīcí de yìjìng hé yùnwèi chuándá gěi xīfāng dúzhě.",
      "sentence_fr": "Ce traducteur s'efforce de transmettre l'atmosphère et le charme de la poésie classique chinoise aux lecteurs occidentaux.",
      "sentence_en": "This translator is dedicated to conveying the artistic conception and charm of Chinese classical poetry to Western readers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "literary_translation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市噪音污染对居民的身心健康产生的影响往往被低估和忽视。",
      "sentence_pinyin": "Chéngshì zàoyīn wūrǎn duì jūmín de shēnxīn jiànkāng chǎnshēng de yǐngxiǎng wǎngwǎng bèi dīgū hé hūshì.",
      "sentence_fr": "L'impact de la pollution sonore urbaine sur la santé physique et mentale des résidents est souvent sous-estimé et négligé.",
      "sentence_en": "The impact of urban noise pollution on residents' physical and mental health is often underestimated and overlooked.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "noise_pollution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "仿生学研究通过模仿自然界的设计原理来开发创新的工程解决方案。",
      "sentence_pinyin": "Fǎngshēngxué yánjiū tōngguò mófǎng zìránjiè de shèjì yuánlǐ lái kāifā chuàngxīn de gōngchéng jiějué fāng'àn.",
      "sentence_fr": "La recherche en biomimétisme développe des solutions d'ingénierie innovantes en imitant les principes de conception de la nature.",
      "sentence_en": "Biomimicry research develops innovative engineering solutions by imitating design principles from nature.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biomimicry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络文学的兴起改变了传统出版业的商业模式和读者的阅读习惯。",
      "sentence_pinyin": "Wǎngluò wénxué de xīngqǐ gǎibiàn le chuántǒng chūbǎnyè de shāngyè móshì hé dúzhě de yuèdú xíguàn.",
      "sentence_fr": "L'essor de la littérature en ligne a transformé le modèle commercial de l'édition traditionnelle et les habitudes de lecture.",
      "sentence_en": "The rise of online literature has changed the traditional publishing industry's business model and readers' reading habits.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "online_literature",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "器官移植等待名单过长的问题促进了人工器官和异种移植研究的发展。",
      "sentence_pinyin": "Qìguān yízhí děngdài míngdān guò cháng de wèntí cùjìn le réngōng qìguān hé yìzhǒng yízhí yánjiū de fāzhǎn.",
      "sentence_fr": "Le problème des longues listes d'attente pour les transplantations d'organes a stimulé la recherche sur les organes artificiels et la xénotransplantation.",
      "sentence_en": "The problem of long organ transplant waiting lists has promoted the development of artificial organ and xenotransplantation research.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organ_transplant_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文化创意产业的繁荣为年轻一代提供了多元化的就业机会和发展空间。",
      "sentence_pinyin": "Wénhuà chuàngyì chǎnyè de fánróng wèi niánqīng yīdài tígōng le duōyuánhuà de jiùyè jīhuì hé fāzhǎn kōngjiān.",
      "sentence_fr": "La prospérité de l'industrie créative et culturelle offre à la jeune génération des opportunités d'emploi diversifiées et un espace de développement.",
      "sentence_en": "The prosperity of the cultural and creative industry provides the younger generation with diversified employment opportunities and development space.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "creative_industry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "协作机器人的设计理念是让人与机器在同一工作空间内安全高效地互动。",
      "sentence_pinyin": "Xiézuò jīqìrén de shèjì lǐniàn shì ràng rén yǔ jīqì zài tóngyī gōngzuò kōngjiān nèi ānquán gāoxiào de hùdòng.",
      "sentence_fr": "Le concept des robots collaboratifs est de permettre aux humains et aux machines d'interagir de manière sûre et efficace dans le même espace de travail.",
      "sentence_en": "The design concept of collaborative robots is to enable humans and machines to interact safely and efficiently in the same workspace.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "collaborative_robots",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "营养学研究表明均衡的饮食结构对预防慢性疾病具有重要作用。",
      "sentence_pinyin": "Yíngyǎngxué yánjiū biǎomíng jūnhéng de yǐnshí jiégòu duì yùfáng mànxìng jíbìng jùyǒu zhòngyào zuòyòng.",
      "sentence_fr": "Les recherches en nutrition montrent qu'une alimentation équilibrée joue un rôle important dans la prévention des maladies chroniques.",
      "sentence_en": "Nutritional research shows that a balanced dietary structure plays an important role in preventing chronic diseases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nutrition_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家科技公司的专利战略旨在构建强大的知识产权护城河保护核心技术。",
      "sentence_pinyin": "Zhè jiā kējì gōngsī de zhuānlì zhànlüè zhǐzài gòujiàn qiángdà de zhīshì chǎnquán hùchénghé bǎohù héxīn jìshù.",
      "sentence_fr": "La stratégie de brevets de cette entreprise technologique vise à construire un solide fossé de propriété intellectuelle pour protéger ses technologies de base.",
      "sentence_en": "This tech company's patent strategy aims to build a strong intellectual property moat to protect core technologies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "patent_strategy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极地科考站的建设为研究全球气候变化提供了宝贵的观测数据。",
      "sentence_pinyin": "Jídì kēkǎozhàn de jiànshè wèi yánjiū quánqiú qìhòu biànhuà tígōng le bǎoguì de guāncè shùjù.",
      "sentence_fr": "La construction de stations de recherche polaire fournit des données d'observation précieuses pour l'étude du changement climatique mondial.",
      "sentence_en": "The construction of polar research stations provides valuable observation data for studying global climate change.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "polar_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电子竞技产业的专业化发展催生了选手培训、赛事运营等新兴职业。",
      "sentence_pinyin": "Diànzǐ jìngjì chǎnyè de zhuānyèhuà fāzhǎn cuīshēng le xuǎnshǒu péixùn, sàishì yùnyíng děng xīnxīng zhíyè.",
      "sentence_fr": "Le développement professionnel de l'industrie de l'e-sport a fait émerger de nouveaux métiers comme la formation de joueurs et l'organisation d'événements.",
      "sentence_en": "The professional development of the esports industry has given rise to emerging professions such as player training and event operations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "esports_industry",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "水资源短缺问题的解决需要技术创新、政策引导和公众参与的协同努力。",
      "sentence_pinyin": "Shuǐ zīyuán duǎnquē wèntí de jiějué xūyào jìshù chuàngxīn, zhèngcè yǐndǎo hé gōngzhòng cānyù de xiétóng nǔlì.",
      "sentence_fr": "La résolution des problèmes de pénurie d'eau nécessite les efforts coordonnés de l'innovation technologique, de l'orientation politique et de la participation du public.",
      "sentence_en": "Solving water scarcity problems requires the coordinated efforts of technological innovation, policy guidance, and public participation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "water_scarcity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部获奖影片对移民群体的身份认同困境进行了细腻入微的刻画。",
      "sentence_pinyin": "Zhè bù huòjiǎng yǐngpiàn duì yímín qúntǐ de shēnfèn rèntóng kùnjìng jìnxíng le xìnì rùwēi de kèhuà.",
      "sentence_fr": "Ce film primé dépeint avec finesse le dilemme identitaire des communautés immigrées.",
      "sentence_en": "This award-winning film provides a nuanced portrayal of the identity dilemma faced by immigrant communities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "immigrant_identity_film",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "光伏发电技术的效率提升和成本下降使太阳能成为越来越有竞争力的能源选择。",
      "sentence_pinyin": "Guāngfú fādiàn jìshù de xiàolǜ tíshēng hé chéngběn xiàjiàng shǐ tàiyángnéng chéngwéi yuèláiyuè yǒu jìngzhēnglì de néngyuán xuǎnzé.",
      "sentence_fr": "L'amélioration de l'efficacité et la baisse des coûts de la technologie photovoltaïque font de l'énergie solaire un choix énergétique de plus en plus compétitif.",
      "sentence_en": "Improved efficiency and reduced costs in photovoltaic technology are making solar energy an increasingly competitive energy choice.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_energy_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
