{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "老年心理学研究老化过程中的认知变化和心理适应问题。",
      "sentence_pinyin": "Lǎonián xīnlǐxué yánjiū lǎohuà guòchéng zhōng de rènzhī biànhuà hé xīnlǐ shìyìng wèntí.",
      "sentence_fr": "La psychologie du vieillissement étudie les changements cognitifs et les problèmes d'adaptation psychologique dans le processus de vieillissement.",
      "sentence_en": "Geropsychology studies cognitive changes and psychological adaptation issues in the aging process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "geropsychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子场论结合量子力学和狭义相对论来描述粒子相互作用。",
      "sentence_pinyin": "Liàngzǐ chǎng lùn jiéhé liàngzǐ lìxué hé xiáyì xiāngduìlùn lái miáoshù lìzǐ xiānghù zuòyòng.",
      "sentence_fr": "La théorie quantique des champs combine la mécanique quantique et la relativité restreinte pour décrire les interactions des particules.",
      "sentence_en": "Quantum field theory combines quantum mechanics and special relativity to describe particle interactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_field_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "企业估值方法用于确定公司的市场价值和投资价值。",
      "sentence_pinyin": "Qǐyè gūzhí fāngfǎ yòng yú quèdìng gōngsī de shìchǎng jiàzhí hé tóuzī jiàzhí.",
      "sentence_fr": "Les méthodes d'évaluation d'entreprise sont utilisées pour déterminer la valeur de marché et la valeur d'investissement d'une société.",
      "sentence_en": "Business valuation methods are used to determine a company's market value and investment value.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "business_valuation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全编排和自动响应技术加速安全事件的处理流程。",
      "sentence_pinyin": "Ānquán biānpái hé zìdòng xiǎngyìng jìshù jiāsù ānquán shìjiàn de chǔlǐ liúchéng.",
      "sentence_fr": "Les technologies d'orchestration et de réponse automatisée en matière de sécurité accélèrent le traitement des incidents de sécurité.",
      "sentence_en": "Security orchestration and automated response technology accelerates the handling of security incidents.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "soar_technology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "产前心理学研究胎儿发育和母婴关系的心理方面。",
      "sentence_pinyin": "Chǎnqián xīnlǐxué yánjiū tāi'ér fāyù hé mǔ yīng guānxì de xīnlǐ fāngmiàn.",
      "sentence_fr": "La psychologie prénatale étudie les aspects psychologiques du développement fœtal et de la relation mère-enfant.",
      "sentence_en": "Prenatal psychology studies the psychological aspects of fetal development and mother-infant relationships.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "prenatal_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "弦理论假设宇宙的基本组成是振动的一维弦而非点粒子。",
      "sentence_pinyin": "Xián lǐlùn jiǎshè yǔzhòu de jīběn zǔchéng shì zhèndòng de yī wéi xián ér fēi diǎn lìzǐ.",
      "sentence_fr": "La théorie des cordes suppose que les constituants fondamentaux de l'univers sont des cordes unidimensionnelles vibrantes plutôt que des particules ponctuelles.",
      "sentence_en": "String theory assumes the fundamental constituents of the universe are vibrating one-dimensional strings rather than point particles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "string_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "财务建模使用电子表格模拟公司的财务绩效和预测。",
      "sentence_pinyin": "Cáiwù jiànmó shǐyòng diànzǐ biǎogé mónǐ gōngsī de cáiwù jīxiào hé yùcè.",
      "sentence_fr": "La modélisation financière utilise des feuilles de calcul pour simuler la performance financière et les prévisions d'une entreprise.",
      "sentence_en": "Financial modeling uses spreadsheets to simulate a company's financial performance and forecasts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_modeling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "漏洞管理程序持续扫描、评估和修复系统安全缺陷。",
      "sentence_pinyin": "Lòudòng guǎnlǐ chéngxù chíxù sǎomiáo, pínggū hé xiūfù xìtǒng ānquán quēxiàn.",
      "sentence_fr": "Les programmes de gestion des vulnérabilités scannent, évaluent et corrigent continuellement les failles de sécurité des systèmes.",
      "sentence_en": "Vulnerability management programs continuously scan, assess, and remediate system security flaws.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "vulnerability_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超个人心理学探索灵性体验和意识扩展状态的心理学意义。",
      "sentence_pinyin": "Chāo gèrén xīnlǐxué tànsuǒ língxìng tǐyàn hé yìshí kuòzhǎn zhuàngtài de xīnlǐxué yìyì.",
      "sentence_fr": "La psychologie transpersonnelle explore la signification psychologique des expériences spirituelles et des états de conscience élargis.",
      "sentence_en": "Transpersonal psychology explores the psychological significance of spiritual experiences and expanded states of consciousness.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transpersonal_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "暗物质和暗能量研究宇宙中不可见但影响宇宙结构的成分。",
      "sentence_pinyin": "Àn wùzhì hé àn néngliàng yánjiū yǔzhòu zhōng bùkě jiàn dàn yǐngxiǎng yǔzhòu jiégòu de chéngfèn.",
      "sentence_fr": "La recherche sur la matière noire et l'énergie sombre étudie les composants invisibles de l'univers qui affectent sa structure.",
      "sentence_en": "Dark matter and dark energy research studies the invisible components of the universe that affect its structure.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dark_matter_energy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "国际财务报告准则促进全球财务报告的一致性和可比性。",
      "sentence_pinyin": "Guójì cáiwù bàogào zhǔnzé cùjìn quánqiú cáiwù bàogào de yīzhìxìng hé kě bǐxìng.",
      "sentence_fr": "Les normes internationales d'information financière favorisent la cohérence et la comparabilité des rapports financiers à l'échelle mondiale.",
      "sentence_en": "International financial reporting standards promote consistency and comparability of global financial reporting.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ifrs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "网络分段将网络划分为较小的区域以限制攻击的传播范围。",
      "sentence_pinyin": "Wǎngluò fēnduàn jiāng wǎngluò huàfēn wéi jiào xiǎo de qūyù yǐ xiànzhì gōngjī de chuánbō fànwéi.",
      "sentence_fr": "La segmentation du réseau divise le réseau en zones plus petites pour limiter la propagation des attaques.",
      "sentence_en": "Network segmentation divides the network into smaller zones to limit the spread of attacks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "network_segmentation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "存在主义心理学关注人类存在的意义、自由和责任等主题。",
      "sentence_pinyin": "Cúnzài zhǔyì xīnlǐxué guānzhù rénlèi cúnzài de yìyì, zìyóu hé zérèn děng zhǔtí.",
      "sentence_fr": "La psychologie existentielle se concentre sur des thèmes tels que le sens de l'existence humaine, la liberté et la responsabilité.",
      "sentence_en": "Existential psychology focuses on themes such as the meaning of human existence, freedom, and responsibility.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "existential_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "引力波天文学通过探测时空涟漪来研究宇宙中的剧烈事件。",
      "sentence_pinyin": "Yǐnlì bō tiānwénxué tōngguò tàncè shíkōng liányī lái yánjiū yǔzhòu zhōng de jùliè shìjiàn.",
      "sentence_fr": "L'astronomie des ondes gravitationnelles étudie les événements violents dans l'univers en détectant les ondulations de l'espace-temps.",
      "sentence_en": "Gravitational wave astronomy studies violent events in the universe by detecting space-time ripples.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gravitational_wave_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "管理会计为内部决策者提供计划和控制所需的财务信息。",
      "sentence_pinyin": "Guǎnlǐ kuàijì wèi nèibù juécè zhě tígōng jìhuà hé kòngzhì suǒ xū de cáiwù xìnxī.",
      "sentence_fr": "La comptabilité de gestion fournit aux décideurs internes les informations financières nécessaires à la planification et au contrôle.",
      "sentence_en": "Management accounting provides internal decision-makers with financial information needed for planning and control.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "management_accounting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密钥管理系统安全地生成、存储和轮换加密密钥。",
      "sentence_pinyin": "Mìyuè guǎnlǐ xìtǒng ānquán de shēngchéng, cúnchǔ hé lúnhuàn jiāmì mìyuè.",
      "sentence_fr": "Les systèmes de gestion des clés génèrent, stockent et font tourner les clés de chiffrement de manière sécurisée.",
      "sentence_en": "Key management systems securely generate, store, and rotate encryption keys.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "key_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人本主义心理学强调个人成长、自我实现和人的内在价值。",
      "sentence_pinyin": "Rénběn zhǔyì xīnlǐxué qiángdiào gèrén chéngzhǎng, zìwǒ shíxiàn hé rén de nèizài jiàzhí.",
      "sentence_fr": "La psychologie humaniste met l'accent sur la croissance personnelle, l'auto-réalisation et la valeur intrinsèque de l'être humain.",
      "sentence_en": "Humanistic psychology emphasizes personal growth, self-actualization, and the intrinsic value of human beings.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "humanistic_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "射电天文学利用射电望远镜观测宇宙中的无线电波辐射。",
      "sentence_pinyin": "Shèdiàn tiānwénxué lìyòng shèdiàn wàngyuǎnjìng guāncè yǔzhòu zhōng de wúxiàndiàn bō fúshè.",
      "sentence_fr": "La radioastronomie utilise des radiotélescopes pour observer le rayonnement radio de l'univers.",
      "sentence_en": "Radio astronomy uses radio telescopes to observe radio wave radiation in the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "radio_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "现金流管理确保企业有足够的现金来满足运营需求。",
      "sentence_pinyin": "Xiànjīn liú guǎnlǐ quèbǎo qǐyè yǒu zúgòu de xiànjīn lái mǎnzú yùnyíng xūqiú.",
      "sentence_fr": "La gestion des flux de trésorerie garantit que les entreprises disposent de suffisamment de liquidités pour répondre aux besoins opérationnels.",
      "sentence_en": "Cash flow management ensures businesses have sufficient cash to meet operational needs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cash_flow_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "特权访问管理控制对关键系统和敏感数据的高级访问权限。",
      "sentence_pinyin": "Tèquán fǎngwèn guǎnlǐ kòngzhì duì guānjiàn xìtǒng hé mǐngǎn shùjù de gāojí fǎngwèn quánxiàn.",
      "sentence_fr": "La gestion des accès privilégiés contrôle l'accès de haut niveau aux systèmes critiques et aux données sensibles.",
      "sentence_en": "Privileged access management controls high-level access to critical systems and sensitive data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "privileged_access_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
