{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个品牌的手表工艺精湛，是送礼的绝佳选择。",
      "sentence_pinyin": "Zhège pǐnpái de shǒubiǎo gōngyì jīngzhàn, shì sònglǐ de juéjiā xuǎnzé.",
      "sentence_fr": "Les montres de cette marque ont un artisanat exquis, c'est un excellent choix de cadeau.",
      "sentence_en": "The watches of this brand have exquisite craftsmanship and are an excellent gift choice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "shopping",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在课余时间创办了一个公益组织，帮助需要帮助的人。",
      "sentence_pinyin": "Tā zài kèyú shíjiān chuàngbànle yī ge gōngyì zǔzhī, bāngzhù xūyào bāngzhù de rén.",
      "sentence_fr": "Il a créé une organisation caritative pendant son temps libre pour aider ceux qui en ont besoin.",
      "sentence_en": "He founded a charity organization in his spare time to help people in need.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "charity",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家酒店的服务周到细致，让客人感到宾至如归。",
      "sentence_pinyin": "Zhè jiā jiǔdiàn de fúwù zhōudào xìzhì, ràng kèrén gǎndào bīn zhì rú guī.",
      "sentence_fr": "Le service de cet hôtel est attentionné et minutieux, faisant sentir les clients comme chez eux.",
      "sentence_en": "The service of this hotel is thoughtful and meticulous, making guests feel at home.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hospitality",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的演唱会门票在开售后几分钟内就被抢购一空。",
      "sentence_pinyin": "Tā de yǎnchànghuì ménpiào zài kāishòu hòu jǐ fēnzhōng nèi jiù bèi qiǎnggòu yīkōng.",
      "sentence_fr": "Les billets de son concert ont été vendus en quelques minutes après leur mise en vente.",
      "sentence_en": "Her concert tickets were sold out within minutes after going on sale.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线学习平台提供了丰富多样的课程资源。",
      "sentence_pinyin": "Zhège zàixiàn xuéxí píngtái tígōngle fēngfù duōyàng de kèchéng zīyuán.",
      "sentence_fr": "Cette plateforme d'apprentissage en ligne offre des ressources de cours riches et variées.",
      "sentence_en": "This online learning platform provides rich and diverse course resources.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们计划在明年初举办一场大型的产品发布会。",
      "sentence_pinyin": "Tāmen jìhuà zài míngnián chū jǔbàn yī chǎng dàxíng de chǎnpǐn fābùhuì.",
      "sentence_fr": "Ils prévoient d'organiser une grande conférence de lancement de produit au début de l'année prochaine.",
      "sentence_en": "They plan to hold a large product launch conference at the beginning of next year.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个节目通过生动有趣的方式普及科学知识。",
      "sentence_pinyin": "Zhège jiémù tōngguò shēngdòng yǒuqù de fāngshì pǔjí kēxué zhīshi.",
      "sentence_fr": "Ce programme vulgarise les connaissances scientifiques de manière vivante et intéressante.",
      "sentence_en": "This program popularizes scientific knowledge in a vivid and interesting way.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "media",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在工作中表现出色，得到了领导和同事的一致好评。",
      "sentence_pinyin": "Tā zài gōngzuò zhōng biǎoxiàn chūsè, dédàole lǐngdǎo hé tóngshì de yīzhì hǎopíng.",
      "sentence_fr": "Elle excelle dans son travail et reçoit des éloges unanimes de ses supérieurs et collègues.",
      "sentence_en": "She performs excellently at work and receives unanimous praise from leaders and colleagues.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座桥梁的设计融合了传统文化和现代科技元素。",
      "sentence_pinyin": "Zhè zuò qiáoliáng de shèjì rónghéle chuántǒng wénhuà hé xiàndài kējì yuánsù.",
      "sentence_fr": "La conception de ce pont intègre des éléments de culture traditionnelle et de technologie moderne.",
      "sentence_en": "The design of this bridge integrates traditional culture and modern technology elements.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "architecture",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在比赛前进行了充分的准备，最终取得了优异的成绩。",
      "sentence_pinyin": "Tā zài bǐsài qián jìnxíngle chōngfèn de zhǔnbèi, zuìzhōng qǔdéle yōuyì de chéngjì.",
      "sentence_fr": "Il s'est bien préparé avant la compétition et a finalement obtenu d'excellents résultats.",
      "sentence_en": "He made thorough preparations before the competition and finally achieved excellent results.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sports",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新开发的手机应用能够帮助用户更好地管理时间。",
      "sentence_pinyin": "Zhège xīn kāifā de shǒujī yìngyòng nénggòu bāngzhù yònghù gèng hǎo de guǎnlǐ shíjiān.",
      "sentence_fr": "Cette nouvelle application mobile peut aider les utilisateurs à mieux gérer leur temps.",
      "sentence_en": "This newly developed mobile app can help users better manage their time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的摄影作品在艺术展览会上获得了专业评委的高度评价。",
      "sentence_pinyin": "Tā de shèyǐng zuòpǐn zài yìshù zhǎnlǎnhuì shàng huòdéle zhuānyè píngwěi de gāodù píngjià.",
      "sentence_fr": "Ses œuvres photographiques ont reçu des éloges élevés des juges professionnels lors de l'exposition d'art.",
      "sentence_en": "Her photography works received high praise from professional judges at the art exhibition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个地区的特产是手工编织的竹制品，深受游客欢迎。",
      "sentence_pinyin": "Zhège dìqū de tèchǎn shì shǒugōng biānzhī de zhúzhìpǐn, shēn shòu yóukè huānyíng.",
      "sentence_fr": "La spécialité de cette région est les produits en bambou tissés à la main, très appréciés des touristes.",
      "sentence_en": "The specialty of this region is handwoven bamboo products, very popular with tourists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "local_products",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "医生建议他要改变不良的生活习惯，注意饮食健康。",
      "sentence_pinyin": "Yīshēng jiànyì tā yào gǎibiàn bùliáng de shēnghuó xíguàn, zhùyì yǐnshí jiànkāng.",
      "sentence_fr": "Le médecin lui conseille de changer ses mauvaises habitudes de vie et de faire attention à une alimentation saine.",
      "sentence_en": "The doctor advises him to change bad lifestyle habits and pay attention to healthy eating.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电视连续剧讲述了一个关于家庭和亲情的温暖故事。",
      "sentence_pinyin": "Zhè bù diànshì liánxùjù jiǎngshùle yī ge guānyú jiātíng hé qīnqíng de wēnnuǎn gùshi.",
      "sentence_fr": "Cette série télévisée raconte une histoire chaleureuse sur la famille et l'affection familiale.",
      "sentence_en": "This TV series tells a warm story about family and family affection.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在大学期间积极参与学生会工作，锻炼了组织能力。",
      "sentence_pinyin": "Tā zài dàxué qījiān jījí cānyù xuéshenghuì gōngzuò, duànliànle zǔzhī nénglì.",
      "sentence_fr": "Il a activement participé au travail du conseil étudiant pendant l'université, développant ses capacités organisationnelles.",
      "sentence_en": "He actively participated in student union work during university, developing his organizational abilities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个公园的景色宜人，是市民休闲娱乐的好去处。",
      "sentence_pinyin": "Zhège gōngyuán de jǐngsè yírén, shì shìmín xiūxián yúlè de hǎo qùchù.",
      "sentence_fr": "Le paysage de ce parc est agréable, c'est un excellent endroit pour les loisirs des citoyens.",
      "sentence_en": "The scenery of this park is pleasant, it's a great place for citizens' leisure and entertainment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "recreation",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她通过自己的努力获得了公司的晋升机会。",
      "sentence_pinyin": "Tā tōngguò zìjǐ de nǔlì huòdéle gōngsī de jìnshēng jīhuì.",
      "sentence_fr": "Elle a obtenu une opportunité de promotion dans l'entreprise grâce à ses propres efforts.",
      "sentence_en": "She obtained a promotion opportunity in the company through her own efforts.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "career",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个博物馆采用了虚拟现实技术，让参观者有身临其境的感觉。",
      "sentence_pinyin": "Zhège bówùguǎn cǎiyòngle xūnǐ xiànshí jìshù, ràng cānguānzhě yǒu shēnlínqíjìng de gǎnjué.",
      "sentence_fr": "Ce musée utilise la technologie de réalité virtuelle pour donner aux visiteurs un sentiment d'immersion.",
      "sentence_en": "This museum uses virtual reality technology to give visitors an immersive feeling.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家公司的企业文化强调创新精神和团队协作。",
      "sentence_pinyin": "Zhè jiā gōngsī de qǐyè wénhuà qiángdiào chuàngxīn jīngshén hé tuánduì xiézuò.",
      "sentence_fr": "La culture d'entreprise de cette société met l'accent sur l'esprit d'innovation et la collaboration en équipe.",
      "sentence_en": "This company's corporate culture emphasizes innovation spirit and teamwork.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:45:00.000Z",
      "updated_at": "2025-11-20T16:45:00.000Z"
    }
  ]
}
