{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子纠缠交换允许从未直接交互的粒子之间建立纠缠。",
      "sentence_pinyin": "Liàngzǐ jiūchán jiāohuàn yǔnxǔ cóngwèi zhíjiē jiāohù de lìzǐ zhījiān jiànlì jiūchán.",
      "sentence_fr": "L'échange d'intrication quantique permet d'établir une intrication entre des particules qui n'ont jamais interagi directement.",
      "sentence_en": "Quantum entanglement swapping allows establishing entanglement between particles that have never directly interacted.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_swapping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "证书透明度日志公开记录颁发的数字证书以防止滥用。",
      "sentence_pinyin": "Zhèngshū tòumíngdù rìzhì gōngkāi jìlù bānfā de shùzì zhèngshū yǐ fángzhǐ lànyòng.",
      "sentence_fr": "Les journaux de transparence des certificats enregistrent publiquement les certificats numériques émis pour prévenir les abus.",
      "sentence_en": "Certificate transparency logs publicly record issued digital certificates to prevent abuse.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "certificate_transparency",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柯里-霍华德同构揭示了逻辑证明与类型程序的对应关系。",
      "sentence_pinyin": "Kēlǐ-Huòhuádé tóngòu jiēshì le luójí zhèngmíng yǔ lèixíng chéngxù de duìyìng guānxì.",
      "sentence_fr": "L'isomorphisme de Curry-Howard révèle la correspondance entre les preuves logiques et les programmes typés.",
      "sentence_en": "The Curry-Howard isomorphism reveals the correspondence between logical proofs and typed programs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "curry_howard_isomorphism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无穷范畴理论将高阶同伦信息编码到范畴结构中。",
      "sentence_pinyin": "Wúqióng fànchóu lǐlùn jiāng gāo jiē tónglún xìnxī biānmǎ dào fànchóu jiégòu zhōng.",
      "sentence_fr": "La théorie des catégories infinies encode les informations d'homotopie d'ordre supérieur dans les structures catégorielles.",
      "sentence_en": "Infinity category theory encodes higher homotopy information into categorical structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "infinity_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠错表面码在二维晶格上实现容错量子存储。",
      "sentence_pinyin": "Liàngzǐ jiūcuò biǎomiàn mǎ zài èrwéi jīnggé shàng shíxiàn róngcuò liàngzǐ cúnchǔ.",
      "sentence_fr": "Les codes de surface de correction d'erreurs quantiques réalisent un stockage quantique tolérant aux fautes sur des réseaux bidimensionnels.",
      "sentence_en": "Quantum error-correcting surface codes implement fault-tolerant quantum storage on two-dimensional lattices.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "surface_codes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可搜索加密允许在加密数据上执行关键词搜索。",
      "sentence_pinyin": "Kě sōusuǒ jiāmì yǔnxǔ zài jiāmì shùjù shàng zhíxíng guānjiàncí sōusuǒ.",
      "sentence_fr": "Le chiffrement consultable permet d'effectuer des recherches par mots-clés sur des données chiffrées.",
      "sentence_en": "Searchable encryption allows performing keyword searches on encrypted data.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "searchable_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "精化类型通过谓词细化基础类型以表达更精确的约束。",
      "sentence_pinyin": "Jīnghuà lèixíng tōngguò wèicí xìhuà jīchǔ lèixíng yǐ biǎodá gèng jīngquè de yuēshù.",
      "sentence_fr": "Les types raffinés affinent les types de base par des prédicats pour exprimer des contraintes plus précises.",
      "sentence_en": "Refinement types refine base types with predicates to express more precise constraints.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "refinement_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "谱序列是计算复杂代数拓扑不变量的强大工具。",
      "sentence_pinyin": "Pǔ xùliè shì jìsuàn fùzá dàishù tuòpū bùbiànliàng de qiángdà gōngjù.",
      "sentence_fr": "Les suites spectrales sont des outils puissants pour calculer des invariants complexes de topologie algébrique.",
      "sentence_en": "Spectral sequences are powerful tools for computing complex algebraic topology invariants.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "spectral_sequences",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子密钥分发利用量子力学原理实现理论上安全的密钥交换。",
      "sentence_pinyin": "Liàngzǐ mìyào fēnfā lìyòng liàngzǐ lìxué yuánlǐ shíxiàn lǐlùn shàng ānquán de mìyào jiāohuàn.",
      "sentence_fr": "La distribution quantique de clés utilise les principes de la mécanique quantique pour réaliser un échange de clés théoriquement sécurisé.",
      "sentence_en": "Quantum key distribution uses quantum mechanical principles to achieve theoretically secure key exchange.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_key_distribution",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代理重加密允许代理将密文从一个密钥转换到另一个密钥。",
      "sentence_pinyin": "Dàilǐ chóng jiāmì yǔnxǔ dàilǐ jiāng mìwén cóng yī gè mìyào zhuǎnhuàn dào lìng yī gè mìyào.",
      "sentence_fr": "Le rechiffrement par proxy permet à un proxy de convertir un chiffré d'une clé à une autre.",
      "sentence_en": "Proxy re-encryption allows a proxy to transform ciphertext from one key to another.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "proxy_reencryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "会话类型形式化描述并发进程之间的通信协议。",
      "sentence_pinyin": "Huìhuà lèixíng xíngshìhuà miáoshù bìngfā jìnchéng zhījiān de tōngxìn xiéyì.",
      "sentence_fr": "Les types de session formalisent les protocoles de communication entre processus concurrents.",
      "sentence_en": "Session types formally describe communication protocols between concurrent processes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "session_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "动机上同调理论统一了代数几何中的各种上同调理论。",
      "sentence_pinyin": "Dòngjī shàng tóngdiào lǐlùn tǒngyī le dàishù jǐhé zhōng de gè zhǒng shàng tóngdiào lǐlùn.",
      "sentence_fr": "La théorie de la cohomologie motivique unifie diverses théories de cohomologie en géométrie algébrique.",
      "sentence_en": "Motivic cohomology theory unifies various cohomology theories in algebraic geometry.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "motivic_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子随机数发生器利用量子测量的固有随机性产生真随机数。",
      "sentence_pinyin": "Liàngzǐ suíjī shù fāshēng qì lìyòng liàngzǐ cèliáng de gùyǒu suíjīxìng chǎnshēng zhēn suíjī shù.",
      "sentence_fr": "Les générateurs de nombres aléatoires quantiques utilisent l'aléatoire inhérent des mesures quantiques pour produire de vrais nombres aléatoires.",
      "sentence_en": "Quantum random number generators use the inherent randomness of quantum measurements to produce true random numbers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_random_generators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间锁谜题要求计算一定时间后才能获得解决方案。",
      "sentence_pinyin": "Shíjiān suǒ míti yāoqiú jìsuàn yīdìng shíjiān hòu cáinéng huòdé jiějué fāng'àn.",
      "sentence_fr": "Les puzzles à verrouillage temporel nécessitent un certain temps de calcul avant d'obtenir la solution.",
      "sentence_en": "Time-lock puzzles require a certain amount of computation time before obtaining the solution.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "time_lock_puzzles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "证明相关类型将类型与其正确性证明绑定在一起。",
      "sentence_pinyin": "Zhèngmíng xiāngguān lèixíng jiāng lèixíng yǔ qí zhèngquèxìng zhèngmíng bǎngdìng zài yīqǐ.",
      "sentence_fr": "Les types dépendants de preuves lient les types à leurs preuves de correction.",
      "sentence_en": "Proof-relevant types bind types together with their correctness proofs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "proof_relevant_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "层论提供了在拓扑空间上局部定义和整体粘合数据的框架。",
      "sentence_pinyin": "Céng lùn tígōng le zài tuòpū kōngjiān shàng júbù dìngyì hé zhěngtǐ zhānjié shùjù de kuàngjià.",
      "sentence_fr": "La théorie des faisceaux fournit un cadre pour définir localement et recoller globalement des données sur des espaces topologiques.",
      "sentence_en": "Sheaf theory provides a framework for locally defining and globally gluing data on topological spaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "sheaf_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子纠缠蒸馏从多对弱纠缠态中提取高质量纠缠态。",
      "sentence_pinyin": "Liàngzǐ jiūchán zhēngliù cóng duō duì ruò jiūchán tài zhōng tíqǔ gāo zhìliàng jiūchán tài.",
      "sentence_fr": "La distillation d'intrication quantique extrait des états intriqués de haute qualité à partir de multiples paires faiblement intriquées.",
      "sentence_en": "Quantum entanglement distillation extracts high-quality entangled states from multiple weakly entangled pairs.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "entanglement_distillation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "遗忘传输允许接收者只获取多个数据项中的一个而不泄露选择。",
      "sentence_pinyin": "Yíwàng chuánshū yǔnxǔ jiēshōuzhě zhǐ huòqǔ duō gè shùjù xiàng zhōng de yī gè ér bù xièlòu xuǎnzé.",
      "sentence_fr": "Le transfert inconscient permet au récepteur d'obtenir un seul élément parmi plusieurs sans révéler son choix.",
      "sentence_en": "Oblivious transfer allows the receiver to obtain only one of multiple data items without revealing their choice.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "oblivious_transfer",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行类型允许记录类型具有可扩展的字段集合。",
      "sentence_pinyin": "Háng lèixíng yǔnxǔ jìlù lèixíng jùyǒu kě kuòzhǎn de zìduàn jíhé.",
      "sentence_fr": "Les types de rangée permettent aux types d'enregistrement d'avoir des ensembles de champs extensibles.",
      "sentence_en": "Row types allow record types to have extensible sets of fields.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "row_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "伽罗瓦上同调将域扩展与群上同调联系起来。",
      "sentence_pinyin": "Jiāluówǎ shàng tóngdiào jiāng yù kuòzhǎn yǔ qún shàng tóngdiào liánxì qǐlái.",
      "sentence_fr": "La cohomologie galoisienne relie les extensions de corps à la cohomologie des groupes.",
      "sentence_en": "Galois cohomology connects field extensions with group cohomology.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "galois_cohomology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
