{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "组织心理学研究工作场所中的员工动机、领导力和团队效能。",
      "sentence_pinyin": "Zǔzhī xīnlǐxué yánjiū gōngzuò chǎngsuǒ zhōng de yuángōng dòngjī, lǐngdǎolì hé tuánduì xiàonéng.",
      "sentence_fr": "La psychologie organisationnelle étudie la motivation des employés, le leadership et l'efficacité des équipes sur le lieu de travail.",
      "sentence_en": "Organizational psychology studies employee motivation, leadership, and team effectiveness in the workplace.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "organizational_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "虚拟化技术允许在单个物理服务器上运行多个虚拟机。",
      "sentence_pinyin": "Xūnǐhuà jìshù yǔnxǔ zài dāngè wùlǐ fúwùqì shàng yùnxíng duō gè xūnǐ jī.",
      "sentence_fr": "La technologie de virtualisation permet d'exécuter plusieurs machines virtuelles sur un seul serveur physique.",
      "sentence_en": "Virtualization technology allows running multiple virtual machines on a single physical server.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "virtualization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宇宙学研究宇宙的起源、结构、演化和最终命运。",
      "sentence_pinyin": "Yǔzhòuxué yánjiū yǔzhòu de qǐyuán, jiégòu, yǎnhuà hé zuìzhōng mìngyùn.",
      "sentence_fr": "La cosmologie étudie l'origine, la structure, l'évolution et le destin ultime de l'univers.",
      "sentence_en": "Cosmology studies the origin, structure, evolution, and ultimate fate of the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cosmology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "运营管理优化生产流程以提高效率并降低成本。",
      "sentence_pinyin": "Yùnyíng guǎnlǐ yōuhuà shēngchǎn liúchéng yǐ tígāo xiàolǜ bìng jiàngdī chéngběn.",
      "sentence_fr": "La gestion des opérations optimise les processus de production pour améliorer l'efficacité et réduire les coûts.",
      "sentence_en": "Operations management optimizes production processes to improve efficiency and reduce costs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "operations_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "分子生物学研究DNA、RNA和蛋白质在细胞功能中的作用。",
      "sentence_pinyin": "Fēnzǐ shēngwùxué yánjiū DNA, RNA hé dànbáizhì zài xìbāo gōngnéng zhōng de zuòyòng.",
      "sentence_fr": "La biologie moléculaire étudie le rôle de l'ADN, de l'ARN et des protéines dans les fonctions cellulaires.",
      "sentence_en": "Molecular biology studies the role of DNA, RNA, and proteins in cellular functions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "molecular_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据库事务确保一组操作要么全部成功要么全部回滚。",
      "sentence_pinyin": "Shùjùkù shìwù quèbǎo yī zǔ cāozuò yàome quánbù chénggōng yàome quánbù huígǔn.",
      "sentence_fr": "Les transactions de base de données garantissent qu'un groupe d'opérations réussit entièrement ou est entièrement annulé.",
      "sentence_en": "Database transactions ensure a group of operations either all succeed or all roll back.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "database_transactions",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会认知研究人们如何感知、记忆和判断他人的社会信息。",
      "sentence_pinyin": "Shèhuì rènzhī yánjiū rénmen rúhé gǎnzhī, jìyì hé pànduàn tārén de shèhuì xìnxī.",
      "sentence_fr": "La cognition sociale étudie comment les gens perçoivent, mémorisent et jugent les informations sociales sur les autres.",
      "sentence_en": "Social cognition studies how people perceive, remember, and judge social information about others.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_cognition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "粒子物理学研究构成物质和辐射的基本粒子及其相互作用。",
      "sentence_pinyin": "Lìzǐ wùlǐxué yánjiū gòuchéng wùzhì hé fúshè de jīběn lìzǐ jí qí xiānghù zuòyòng.",
      "sentence_fr": "La physique des particules étudie les particules fondamentales qui composent la matière et le rayonnement ainsi que leurs interactions.",
      "sentence_en": "Particle physics studies the fundamental particles that make up matter and radiation and their interactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "particle_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "项目管理协调资源、时间和预算以实现既定的项目目标。",
      "sentence_pinyin": "Xiàngmù guǎnlǐ xiétiáo zīyuán, shíjiān hé yùsuàn yǐ shíxiàn jìdìng de xiàngmù mùbiāo.",
      "sentence_fr": "La gestion de projet coordonne les ressources, le temps et le budget pour atteindre les objectifs du projet établis.",
      "sentence_en": "Project management coordinates resources, time, and budget to achieve established project goals.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "project_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全编程实践帮助开发人员避免常见的安全漏洞和攻击向量。",
      "sentence_pinyin": "Ānquán biānchéng shíjiàn bāngzhù kāifā rényuán bìmiǎn chángjiàn de ānquán lòudòng hé gōngjī xiàngliàng.",
      "sentence_fr": "Les pratiques de programmation sécurisée aident les développeurs à éviter les vulnérabilités de sécurité courantes et les vecteurs d'attaque.",
      "sentence_en": "Secure programming practices help developers avoid common security vulnerabilities and attack vectors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "secure_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "法律心理学研究法律制度中的心理过程和人类行为。",
      "sentence_pinyin": "Fǎlǜ xīnlǐxué yánjiū fǎlǜ zhìdù zhōng de xīnlǐ guòchéng hé rénlèi xíngwéi.",
      "sentence_fr": "La psychologie juridique étudie les processus psychologiques et le comportement humain dans le système juridique.",
      "sentence_en": "Legal psychology studies psychological processes and human behavior in the legal system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "legal_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "凝聚态物理学研究固体和液体中原子的集体行为。",
      "sentence_pinyin": "Níngjùtài wùlǐxué yánjiū gùtǐ hé yètǐ zhōng yuánzǐ de jítǐ xíngwéi.",
      "sentence_fr": "La physique de la matière condensée étudie le comportement collectif des atomes dans les solides et les liquides.",
      "sentence_en": "Condensed matter physics studies the collective behavior of atoms in solids and liquids.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "condensed_matter_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "供应链管理协调从原材料到最终产品交付的整个流程。",
      "sentence_pinyin": "Gōngyìng liàn guǎnlǐ xiétiáo cóng yuán cáiliào dào zuìzhōng chǎnpǐn jiāofù de zhěnggè liúchéng.",
      "sentence_fr": "La gestion de la chaîne d'approvisionnement coordonne l'ensemble du processus des matières premières à la livraison du produit final.",
      "sentence_en": "Supply chain management coordinates the entire process from raw materials to final product delivery.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "supply_chain_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "入侵检测系统监控网络流量以识别可疑的安全威胁。",
      "sentence_pinyin": "Rùqīn jiǎncè xìtǒng jiānkòng wǎngluò liúliàng yǐ shíbié kěyí de ānquán wēixié.",
      "sentence_fr": "Les systèmes de détection d'intrusion surveillent le trafic réseau pour identifier les menaces de sécurité suspectes.",
      "sentence_en": "Intrusion detection systems monitor network traffic to identify suspicious security threats.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intrusion_detection",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "注意力和意识研究探讨人类如何选择性地处理信息。",
      "sentence_pinyin": "Zhùyìlì hé yìshí yánjiū tàntǎo rénlèi rúhé xuǎnzéxìng de chǔlǐ xìnxī.",
      "sentence_fr": "La recherche sur l'attention et la conscience explore comment les humains traitent sélectivement l'information.",
      "sentence_en": "Attention and consciousness research explores how humans selectively process information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "attention_consciousness",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "核物理学研究原子核的结构、性质和核反应过程。",
      "sentence_pinyin": "Hé wùlǐxué yánjiū yuánzǐhé de jiégòu, xìngzhì hé hé fǎnyìng guòchéng.",
      "sentence_fr": "La physique nucléaire étudie la structure, les propriétés et les processus de réaction des noyaux atomiques.",
      "sentence_en": "Nuclear physics studies the structure, properties, and reaction processes of atomic nuclei.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "nuclear_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "质量管理确保产品和服务满足既定的标准和客户期望。",
      "sentence_pinyin": "Zhìliàng guǎnlǐ quèbǎo chǎnpǐn hé fúwù mǎnzú jìdìng de biāozhǔn hé kèhù qīwàng.",
      "sentence_fr": "La gestion de la qualité garantit que les produits et services répondent aux normes établies et aux attentes des clients.",
      "sentence_en": "Quality management ensures products and services meet established standards and customer expectations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quality_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "身份验证机制确保只有授权用户才能访问受保护的系统资源。",
      "sentence_pinyin": "Shēnfèn yànzhèng jīzhì quèbǎo zhǐyǒu shòuquán yònghù cáinéng fǎngwèn shòu bǎohù de xìtǒng zīyuán.",
      "sentence_fr": "Les mécanismes d'authentification garantissent que seuls les utilisateurs autorisés peuvent accéder aux ressources système protégées.",
      "sentence_en": "Authentication mechanisms ensure only authorized users can access protected system resources.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "authentication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情绪心理学研究情绪的产生、体验和表达的心理机制。",
      "sentence_pinyin": "Qíngxù xīnlǐxué yánjiū qíngxù de chǎnshēng, tǐyàn hé biǎodá de xīnlǐ jīzhì.",
      "sentence_fr": "La psychologie des émotions étudie les mécanismes psychologiques de la génération, de l'expérience et de l'expression des émotions.",
      "sentence_en": "Emotion psychology studies the psychological mechanisms of emotion generation, experience, and expression.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emotion_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "等离子物理学研究高度电离气体的性质和行为。",
      "sentence_pinyin": "Děnglízǐ wùlǐxué yánjiū gāodù diànlí qìtǐ de xìngzhì hé xíngwéi.",
      "sentence_fr": "La physique des plasmas étudie les propriétés et le comportement des gaz hautement ionisés.",
      "sentence_en": "Plasma physics studies the properties and behavior of highly ionized gases.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plasma_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
