{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子贝尔态是最大纠缠的双量子比特状态集合。",
      "sentence_pinyin": "Liàngzǐ Bèi'ěr tài shì zuìdà jiūchán de shuāng liàngzǐ bǐtè zhuàngtài jíhé.",
      "sentence_fr": "Les états de Bell quantiques sont l'ensemble des états à deux qubits maximalement intriqués.",
      "sentence_en": "Quantum Bell states are the set of maximally entangled two-qubit states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bell_states",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二次剩余假设是某些密码构造的安全基础。",
      "sentence_pinyin": "Èrcì shèngyú jiǎshè shì mǒuxiē mìmǎ gòuzào de ānquán jīchǔ.",
      "sentence_fr": "L'hypothèse des résidus quadratiques est le fondement de sécurité de certaines constructions cryptographiques.",
      "sentence_en": "Quadratic residuosity assumption is the security foundation of certain cryptographic constructions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quadratic_residuosity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "System F是具有参数多态性的类型化lambda演算。",
      "sentence_pinyin": "System F shì jùyǒu cānshù duōtàixìng de lèixínghuà lambda yǎnsuàn.",
      "sentence_fr": "System F est un lambda-calcul typé avec polymorphisme paramétrique.",
      "sentence_en": "System F is a typed lambda calculus with parametric polymorphism.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "system_f",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同伦等价是比同胚更弱但仍保持重要性质的等价关系。",
      "sentence_pinyin": "Tónglún děngjià shì bǐ tóngpēi gèng ruò dàn réng bǎochí zhòngyào xìngzhì de děngjià guānxì.",
      "sentence_fr": "L'équivalence d'homotopie est une relation d'équivalence plus faible que l'homéomorphisme mais préservant des propriétés importantes.",
      "sentence_en": "Homotopy equivalence is weaker than homeomorphism but still preserves important properties.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homotopy_equivalence",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子克劳斯算子完整描述量子信道的数学结构。",
      "sentence_pinyin": "Liàngzǐ Kèláosī suànzǐ wánzhěng miáoshù liàngzǐ xìndào de shùxué jiégòu.",
      "sentence_fr": "Les opérateurs de Kraus quantiques décrivent complètement la structure mathématique des canaux quantiques.",
      "sentence_en": "Quantum Kraus operators completely describe the mathematical structure of quantum channels.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "kraus_operators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "双线性迪菲-赫尔曼问题支持基于配对的密码协议。",
      "sentence_pinyin": "Shuāng xiànxìng Dífēi-Hè'ěrmàn wèntí zhīchí jīyú pèiduì de mìmǎ xiéyì.",
      "sentence_fr": "Le problème bilinéaire de Diffie-Hellman prend en charge les protocoles cryptographiques basés sur les appariements.",
      "sentence_en": "Bilinear Diffie-Hellman problem supports pairing-based cryptographic protocols.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bilinear_dh_problem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "归纳类型通过构造子递归地定义数据结构。",
      "sentence_pinyin": "Guīnà lèixíng tōngguò gòuzàozǐ dìguīde dìngyì shùjù jiégòu.",
      "sentence_fr": "Les types inductifs définissent récursivement les structures de données à travers des constructeurs.",
      "sentence_en": "Inductive types recursively define data structures through constructors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "inductive_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "映射度是描述连续映射拓扑性质的整数不变量。",
      "sentence_pinyin": "Yìngshè dù shì miáoshù liánxù yìngshè tuòpū xìngzhì de zhěngshù bùbiànliàng.",
      "sentence_fr": "Le degré d'application est un invariant entier décrivant les propriétés topologiques des applications continues.",
      "sentence_en": "Mapping degree is an integer invariant describing topological properties of continuous maps.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "mapping_degree",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子弛豫过程描述量子系统向平衡态演化的动力学。",
      "sentence_pinyin": "Liàngzǐ chíyù guòchéng miáoshù liàngzǐ xìtǒng xiàng pínghéng tài yǎnhuà de dònglìxué.",
      "sentence_fr": "Les processus de relaxation quantique décrivent la dynamique de l'évolution des systèmes quantiques vers l'état d'équilibre.",
      "sentence_en": "Quantum relaxation processes describe dynamics of quantum system evolution toward equilibrium states.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_relaxation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "子群决策问题判断元素是否属于给定子群。",
      "sentence_pinyin": "Zǐqún juécè wèntí pànduàn yuánsù shìfǒu shǔyú gěidìng zǐqún.",
      "sentence_fr": "Le problème de décision de sous-groupe détermine si un élément appartient à un sous-groupe donné.",
      "sentence_en": "Subgroup decision problem determines whether an element belongs to a given subgroup.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "subgroup_decision",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "余归纳类型定义潜在无限的数据结构如无限流。",
      "sentence_pinyin": "Yú guīnà lèixíng dìngyì qiánzài wúxiàn de shùjù jiégòu rú wúxiàn liú.",
      "sentence_fr": "Les types coinductifs définissent des structures de données potentiellement infinies comme les flux infinis.",
      "sentence_en": "Coinductive types define potentially infinite data structures like infinite streams.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "coinductive_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "布劳威尔不动点定理保证连续映射存在不动点。",
      "sentence_pinyin": "Bùláowēi'ěr bùdòngdiǎn dìnglǐ bǎozhèng liánxù yìngshè cúnzài bùdòngdiǎn.",
      "sentence_fr": "Le théorème du point fixe de Brouwer garantit l'existence de points fixes pour les applications continues.",
      "sentence_en": "Brouwer fixed point theorem guarantees continuous maps have fixed points.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "brouwer_fixed_point",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子比特操作通过旋转门实现任意单量子比特变换。",
      "sentence_pinyin": "Liàngzǐ bǐtè cāozuò tōngguò xuánzhuǎn mén shíxiàn rènyì dān liàngzǐ bǐtè biànhuàn.",
      "sentence_fr": "Les opérations de qubit réalisent des transformations arbitraires à un seul qubit via des portes de rotation.",
      "sentence_en": "Qubit operations implement arbitrary single-qubit transformations through rotation gates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "rotation_gates",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同态评估密钥允许在加密数据上执行特定计算。",
      "sentence_pinyin": "Tóngtài pínggū mìyào yǔnxǔ zài jiāmì shùjù shàng zhíxíng tèdìng jìsuàn.",
      "sentence_fr": "Les clés d'évaluation homomorphes permettent d'effectuer des calculs spécifiques sur des données chiffrées.",
      "sentence_en": "Homomorphic evaluation keys allow performing specific computations on encrypted data.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homomorphic_evaluation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "类型构造器将类型映射到新类型的类型级函数。",
      "sentence_pinyin": "Lèixíng gòuzàoqì jiāng lèixíng yìngshè dào xīn lèixíng de lèixíng jí hánshù.",
      "sentence_fr": "Les constructeurs de types sont des fonctions au niveau des types qui associent des types à de nouveaux types.",
      "sentence_en": "Type constructors are type-level functions mapping types to new types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "type_constructors",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同调交叉积将代数结构与拓扑结构联系起来。",
      "sentence_pinyin": "Tóngdiào jiāochā jī jiāng dàishù jiégòu yǔ tuòpū jiégòu liánxì qǐlái.",
      "sentence_fr": "Le produit croisé en homologie relie les structures algébriques aux structures topologiques.",
      "sentence_en": "Homology cross product connects algebraic structures with topological structures.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "homology_cross_product",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子门分解将复杂量子操作分解为基本门序列。",
      "sentence_pinyin": "Liàngzǐ mén fēnjiě jiāng fùzá liàngzǐ cāozuò fēnjiě wéi jīběn mén xùliè.",
      "sentence_fr": "La décomposition de portes quantiques décompose les opérations quantiques complexes en séquences de portes de base.",
      "sentence_en": "Quantum gate decomposition breaks complex quantum operations into sequences of basic gates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "gate_decomposition",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "循环群的离散对数问题是密码学的基本困难问题。",
      "sentence_pinyin": "Xúnhuán qún de lísàn duìshù wèntí shì mìmǎxué de jīběn kùnnán wèntí.",
      "sentence_fr": "Le problème du logarithme discret dans les groupes cycliques est un problème difficile fondamental en cryptographie.",
      "sentence_en": "Discrete logarithm problem in cyclic groups is a fundamental hard problem in cryptography.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "cyclic_group_dlog",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "递归类型方程的最小不动点定义归纳数据类型。",
      "sentence_pinyin": "Dìguī lèixíng fāngchéng de zuìxiǎo bùdòngdiǎn dìngyì guīnà shùjù lèixíng.",
      "sentence_fr": "Le plus petit point fixe des équations de types récursifs définit les types de données inductifs.",
      "sentence_en": "Least fixed points of recursive type equations define inductive data types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "least_fixed_points",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "莫比乌斯带是单面曲面的经典拓扑学示例。",
      "sentence_pinyin": "Mòbǐwūsī dài shì dānmiàn qūmiàn de jīngdiǎn tuòpūxué shìlì.",
      "sentence_fr": "Le ruban de Möbius est un exemple classique de topologie de surface à une face.",
      "sentence_en": "Möbius strip is a classic topology example of a one-sided surface.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "mobius_strip",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
