{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "碳中和目标的实现需要能源结构的根本性转型和全社会的共同努力。",
      "sentence_pinyin": "Tànzhōnghé mùbiāo de shíxiàn xūyào néngyuán jiégòu de gēnběnxìng zhuǎnxíng hé quán shèhuì de gòngtóng nǔlì.",
      "sentence_fr": "Atteindre la neutralité carbone nécessite une transformation fondamentale de la structure énergétique et l'effort collectif de toute la société.",
      "sentence_en": "Achieving carbon neutrality requires a fundamental transformation of the energy structure and the collective effort of the whole society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "carbon_neutrality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位社会学家的田野调查方法为研究边缘群体提供了独特的视角。",
      "sentence_pinyin": "Zhè wèi shèhuìxuéjiā de tiányě diàochá fāngfǎ wèi yánjiū biānyuán qúntǐ tígōng le dútè de shìjiǎo.",
      "sentence_fr": "Les méthodes d'enquête de terrain de ce sociologue offrent une perspective unique pour l'étude des groupes marginalisés.",
      "sentence_en": "This sociologist's field research methods provide a unique perspective for studying marginalized groups.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sociological_research_methods",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能制造系统能够实现生产过程的自动化监控和实时质量管理。",
      "sentence_pinyin": "Zhìnéng zhìzào xìtǒng nénggòu shíxiàn shēngchǎn guòchéng de zìdònghuà jiānkòng hé shíshí zhìliàng guǎnlǐ.",
      "sentence_fr": "Les systèmes de fabrication intelligente permettent une surveillance automatisée du processus de production et une gestion de la qualité en temps réel.",
      "sentence_en": "Smart manufacturing systems can achieve automated monitoring of production processes and real-time quality management.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_manufacturing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心理韧性的培养有助于个体更好地应对生活中的压力和逆境。",
      "sentence_pinyin": "Xīnlǐ rènxìng de péiyǎng yǒuzhù yú gètǐ gèng hǎo de yìngduì shēnghuó zhōng de yālì hé nìjìng.",
      "sentence_fr": "Développer la résilience psychologique aide les individus à mieux faire face au stress et à l'adversité de la vie.",
      "sentence_en": "Cultivating psychological resilience helps individuals better cope with stress and adversity in life.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "psychological_resilience",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古典音乐会的沉浸式体验能够缓解现代人紧张的工作压力。",
      "sentence_pinyin": "Gǔdiǎn yīnyuèhuì de chénjìnshì tǐyàn nénggòu huǎnjiě xiàndàirén jǐnzhāng de gōngzuò yālì.",
      "sentence_fr": "L'expérience immersive des concerts de musique classique peut soulager le stress professionnel intense des personnes modernes.",
      "sentence_en": "The immersive experience of classical concerts can relieve the intense work pressure of modern people.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "music_stress_relief",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这项针对罕见病的基因疗法研究取得了令人鼓舞的初步临床结果。",
      "sentence_pinyin": "Zhè xiàng zhēnduì hǎnjiànbìng de jīyīn liáofǎ yánjiū qǔdé le lìng rén gǔwǔ de chūbù línchuáng jiéguǒ.",
      "sentence_fr": "Cette recherche sur la thérapie génique pour les maladies rares a obtenu des résultats cliniques préliminaires encourageants.",
      "sentence_en": "This gene therapy research for rare diseases has achieved encouraging preliminary clinical results.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gene_therapy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府出台了一系列政策措施来扶持中小企业度过经济下行期。",
      "sentence_pinyin": "Zhèngfǔ chūtái le yī xìliè zhèngcè cuòshī lái fúchí zhōngxiǎo qǐyè dùguò jīngjì xiàxíngqī.",
      "sentence_fr": "Le gouvernement a introduit une série de mesures politiques pour aider les PME à traverser la période de ralentissement économique.",
      "sentence_en": "The government has introduced a series of policy measures to support small and medium enterprises through the economic downturn.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sme_support_policy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沙漠化防治需要科学规划与当地社区参与的有机结合。",
      "sentence_pinyin": "Shāmòhuà fángzhì xūyào kēxué guīhuà yǔ dāngdì shèqū cānyù de yǒujī jiéhé.",
      "sentence_fr": "La lutte contre la désertification nécessite une combinaison organique de planification scientifique et de participation des communautés locales.",
      "sentence_en": "Desertification control requires an organic combination of scientific planning and local community participation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "desertification_control",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位画家的作品在传统水墨画基础上融入了现代抽象艺术的元素。",
      "sentence_pinyin": "Zhè wèi huàjiā de zuòpǐn zài chuántǒng shuǐmòhuà jīchǔ shàng róngrù le xiàndài chōuxiàng yìshù de yuánsù.",
      "sentence_fr": "Les œuvres de ce peintre intègrent des éléments d'art abstrait moderne dans la peinture traditionnelle à l'encre.",
      "sentence_en": "This painter's works incorporate elements of modern abstract art into traditional ink painting.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "contemporary_ink_painting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "深空探测任务面临着极端温度和强辐射环境带来的技术挑战。",
      "sentence_pinyin": "Shēnkōng tàncè rènwù miànlín zhe jíduān wēndù hé qiáng fúshè huánjìng dàilái de jìshù tiǎozhàn.",
      "sentence_fr": "Les missions d'exploration de l'espace lointain font face à des défis techniques posés par des températures extrêmes et des environnements à forte radiation.",
      "sentence_en": "Deep space exploration missions face technical challenges posed by extreme temperatures and high radiation environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "deep_space_exploration",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字人民币的推广标志着中国央行数字货币进入实际应用阶段。",
      "sentence_pinyin": "Shùzì rénmínbì de tuīguǎng biāozhì zhe Zhōngguó yāngháng shùzì huòbì jìnrù shíjì yìngyòng jiēduàn.",
      "sentence_fr": "La promotion du yuan numérique marque l'entrée de la monnaie numérique de la banque centrale chinoise dans la phase d'application pratique.",
      "sentence_en": "The promotion of digital yuan marks China's central bank digital currency entering the practical application stage.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_yuan",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "肠道微生物群落的平衡状态与人体免疫系统功能密切相关。",
      "sentence_pinyin": "Chángdào wēishēngwù qúnluò de pínghéng zhuàngtài yǔ réntǐ miǎnyì xìtǒng gōngnéng mìqiè xiāngguān.",
      "sentence_fr": "L'équilibre du microbiome intestinal est étroitement lié au fonctionnement du système immunitaire humain.",
      "sentence_en": "The balanced state of gut microbiome is closely related to human immune system function.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gut_microbiome",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市更新项目在改善居住环境的同时也要保护历史街区的文化脉络。",
      "sentence_pinyin": "Chéngshì gēngxīn xiàngmù zài gǎishàn jūzhù huánjìng de tóngshí yě yào bǎohù lìshǐ jiēqū de wénhuà màiluò.",
      "sentence_fr": "Les projets de rénovation urbaine doivent protéger le tissu culturel des quartiers historiques tout en améliorant l'environnement résidentiel.",
      "sentence_en": "Urban renewal projects must protect the cultural context of historical neighborhoods while improving living environments.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "urban_renewal",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零工经济的兴起给传统劳动关系和社会保障体系带来了新的挑战。",
      "sentence_pinyin": "Línggōng jīngjì de xīngqǐ gěi chuántǒng láodòng guānxì hé shèhuì bǎozhàng tǐxì dàilái le xīn de tiǎozhàn.",
      "sentence_fr": "L'essor de l'économie des petits boulots pose de nouveaux défis aux relations de travail traditionnelles et aux systèmes de protection sociale.",
      "sentence_en": "The rise of the gig economy has brought new challenges to traditional labor relations and social security systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gig_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部戏剧作品通过荒诞派手法对现代社会的异化现象进行了深刻剖析。",
      "sentence_pinyin": "Zhè bù xìjù zuòpǐn tōngguò huāngdànpài shǒufǎ duì xiàndài shèhuì de yìhuà xiànxiàng jìnxíng le shēnkè pōuxī.",
      "sentence_fr": "Cette pièce de théâtre offre une analyse profonde du phénomène d'aliénation dans la société moderne à travers des techniques absurdistes.",
      "sentence_en": "This theatrical work provides a profound analysis of alienation in modern society through absurdist techniques.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "absurdist_theater",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极端天气事件频发促使保险行业重新评估自然灾害风险定价模型。",
      "sentence_pinyin": "Jíduān tiānqì shìjiàn pínfā cùshǐ bǎoxiǎn hángyè chóngxīn pínggū zìrán zāihài fēngxiǎn dìngjià móxíng.",
      "sentence_fr": "La fréquence accrue des événements météorologiques extrêmes pousse l'industrie de l'assurance à réévaluer ses modèles de tarification des risques de catastrophes naturelles.",
      "sentence_en": "The increased frequency of extreme weather events is prompting the insurance industry to reassess natural disaster risk pricing models.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "climate_insurance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "脑机接口技术的突破有望帮助瘫痪患者重新获得肢体控制能力。",
      "sentence_pinyin": "Nǎojī jiēkǒu jìshù de tūpò yǒuwàng bāngzhù tānhuàn huànzhě chóngxīn huòdé zhītǐ kòngzhì nénglì.",
      "sentence_fr": "Les percées dans la technologie des interfaces cerveau-machine pourraient aider les patients paralysés à retrouver le contrôle de leurs membres.",
      "sentence_en": "Breakthroughs in brain-computer interface technology are expected to help paralyzed patients regain limb control.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "brain_computer_interface",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高等教育国际化趋势正在推动跨国学术交流与合作研究项目的发展。",
      "sentence_pinyin": "Gāoděng jiàoyù guójìhuà qūshì zhèngzài tuīdòng kuàguó xuéshù jiāoliú yǔ hézuò yánjiū xiàngmù de fāzhǎn.",
      "sentence_fr": "La tendance à l'internationalisation de l'enseignement supérieur stimule le développement des échanges académiques transnationaux et des projets de recherche collaborative.",
      "sentence_en": "The trend of higher education internationalization is driving the development of transnational academic exchanges and collaborative research projects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "higher_education_internationalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电网技术能够优化电力分配并促进可再生能源的高效利用。",
      "sentence_pinyin": "Zhìnéng diànwǎng jìshù nénggòu yōuhuà diànlì fēnpèi bìng cùjìn kě zàishēng néngyuán de gāoxiào lìyòng.",
      "sentence_fr": "La technologie des réseaux électriques intelligents permet d'optimiser la distribution d'électricité et de promouvoir l'utilisation efficace des énergies renouvelables.",
      "sentence_en": "Smart grid technology can optimize power distribution and promote the efficient utilization of renewable energy.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_grid",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
