{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这座古镇保留了原汁原味的传统建筑风格和民俗文化。",
      "sentence_pinyin": "Zhè zuò gǔzhèn bǎoliúle yuánzhī yuánwèi de chuántǒng jiànzhù fēnggé hé mínsú wénhuà.",
      "sentence_fr": "Cette vieille ville a conservé son style architectural traditionnel authentique et sa culture folklorique.",
      "sentence_en": "This ancient town has preserved its authentic traditional architectural style and folk culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他通过不懈的努力和坚持，终于实现了自己的职业目标。",
      "sentence_pinyin": "Tā tōngguò bùxiè de nǔlì hé jiānchí, zhōngyú shíxiànle zìjǐ de zhíyè mùbiāo.",
      "sentence_fr": "Grâce à ses efforts incessants et à sa persévérance, il a finalement atteint ses objectifs professionnels.",
      "sentence_en": "Through unremitting efforts and persistence, he finally achieved his career goals.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "career",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个环保项目的实施有效减少了城市的碳排放量。",
      "sentence_pinyin": "Zhège huánbǎo xiàngmù de shíshī yǒuxiào jiǎnshǎole chéngshì de tàn páifàngliàng.",
      "sentence_fr": "La mise en œuvre de ce projet environnemental a efficacement réduit les émissions de carbone de la ville.",
      "sentence_en": "The implementation of this environmental project effectively reduced the city's carbon emissions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的教学方法生动有趣，深受学生们的欢迎和喜爱。",
      "sentence_pinyin": "Tā de jiàoxué fāngfǎ shēngdòng yǒuqù, shēn shòu xuéshengmen de huānyíng hé xǐ'ài.",
      "sentence_fr": "Ses méthodes d'enseignement sont vivantes et intéressantes, très appréciées et aimées des étudiants.",
      "sentence_en": "Her teaching methods are lively and interesting, very popular and loved by students.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家医院配备了专业的医疗团队和先进的治疗设备。",
      "sentence_pinyin": "Zhè jiā yīyuàn pèibèile zhuānyè de yīliáo tuánduì hé xiānjìn de zhìliáo shèbèi.",
      "sentence_fr": "Cet hôpital est équipé d'une équipe médicale professionnelle et d'équipements de traitement avancés.",
      "sentence_en": "This hospital is equipped with a professional medical team and advanced treatment equipment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "healthcare",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部纪录片客观真实地展现了野生动物的生存状态。",
      "sentence_pinyin": "Zhè bù jìlùpiàn kèguān zhēnshí de zhǎnxiànle yěshēng dòngwù de shēngcún zhuàngtài.",
      "sentence_fr": "Ce documentaire présente objectivement et fidèlement l'état de survie de la faune sauvage.",
      "sentence_en": "This documentary objectively and truthfully presents the survival state of wildlife.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wildlife",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在创业初期遇到了许多困难，但从未放弃过梦想。",
      "sentence_pinyin": "Tā zài chuàngyè chūqī yùdàole xǔduō kùnnan, dàn cóng wèi fàngqìguò mèngxiǎng.",
      "sentence_fr": "Il a rencontré de nombreuses difficultés au début de son entreprise, mais n'a jamais abandonné son rêve.",
      "sentence_en": "He encountered many difficulties in the early stages of starting his business, but never gave up on his dream.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个音乐会汇聚了国内外知名的音乐家和演奏团体。",
      "sentence_pinyin": "Zhège yīnyuèhuì huìjùle guónèiwài zhīmíng de yīnyuèjiā hé yǎnzòu tuántǐ.",
      "sentence_fr": "Ce concert rassemble des musiciens et des groupes de musiciens renommés nationaux et internationaux.",
      "sentence_en": "This concert brings together renowned musicians and performance groups from home and abroad.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她每周都会去图书馆借阅几本书，保持着阅读的习惯。",
      "sentence_pinyin": "Tā měi zhōu dōu huì qù túshūguǎn jièyuè jǐ běn shū, bǎochízhe yuèdú de xíguàn.",
      "sentence_fr": "Elle va à la bibliothèque chaque semaine pour emprunter quelques livres, maintenant son habitude de lecture.",
      "sentence_en": "She goes to the library every week to borrow a few books, maintaining her reading habit.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "reading",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个科技园区为创新企业提供了良好的发展平台和支持。",
      "sentence_pinyin": "Zhège kējì yuánqū wèi chuàngxīn qǐyè tígōngle liánghǎo de fāzhǎn píngtái hé zhīchí.",
      "sentence_fr": "Ce parc technologique offre une bonne plateforme de développement et un soutien aux entreprises innovantes.",
      "sentence_en": "This technology park provides a good development platform and support for innovative enterprises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business_parks",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个手工艺品市场吸引了众多游客前来选购纪念品。",
      "sentence_pinyin": "Zhège shǒugōngyìpǐn shìchǎng xīyǐnle zhòngduō yóukè qiánlái xuǎngòu jìniànpǐn.",
      "sentence_fr": "Ce marché d'artisanat attire de nombreux touristes venus acheter des souvenirs.",
      "sentence_en": "This handicraft market attracts many tourists coming to buy souvenirs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tourism",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在工作中注重细节，力求把每一件事情都做到最好。",
      "sentence_pinyin": "Tā zài gōngzuò zhōng zhùzhòng xìjié, lìqiú bǎ měi yī jiàn shìqing dōu zuòdào zuìhǎo.",
      "sentence_fr": "Il accorde une attention particulière aux détails dans son travail, s'efforçant de faire de son mieux dans tout.",
      "sentence_en": "He pays attention to details at work, striving to do his best in everything.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "work",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个瑜伽课程帮助学员放松身心，缓解工作压力。",
      "sentence_pinyin": "Zhège yújiā kèchéng bāngzhù xuéyuán fàngsōng shēnxīn, huǎnjiě gōngzuò yālì.",
      "sentence_fr": "Ce cours de yoga aide les participants à se détendre et à soulager le stress du travail.",
      "sentence_en": "This yoga class helps participants relax and relieve work stress.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "wellness",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家出版社专注于出版高质量的儿童读物和教育书籍。",
      "sentence_pinyin": "Zhè jiā chūbǎnshè zhuānzhù yú chūbǎn gāo zhìliàng de értóng dúwù hé jiàoyù shūjí.",
      "sentence_fr": "Cette maison d'édition se concentre sur la publication de livres pour enfants et d'ouvrages éducatifs de haute qualité.",
      "sentence_en": "This publishing house focuses on publishing high-quality children's books and educational works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "publishing",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的时间管理能力很强，总是能高效地完成各项任务。",
      "sentence_pinyin": "Tā de shíjiān guǎnlǐ nénglì hěn qiáng, zǒngshì néng gāoxiào de wánchéng gè xiàng rènwu.",
      "sentence_fr": "Ses compétences en gestion du temps sont excellentes, elle peut toujours accomplir efficacement diverses tâches.",
      "sentence_en": "Her time management skills are excellent, she can always efficiently complete various tasks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "productivity",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个博物馆的展品丰富多样，涵盖了不同历史时期的文物。",
      "sentence_pinyin": "Zhège bówùguǎn de zhǎnpǐn fēngfù duōyàng, hángàile bùtóng lìshǐ shíqī de wénwù.",
      "sentence_fr": "Les expositions de ce musée sont riches et variées, couvrant des artefacts de différentes périodes historiques.",
      "sentence_en": "The exhibits in this museum are rich and diverse, covering artifacts from different historical periods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "museums",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的研究成果为解决这个科学难题提供了重要的思路。",
      "sentence_pinyin": "Tā de yánjiū chéngguǒ wèi jiějué zhège kēxué nántí tígōngle zhòngyào de sīlù.",
      "sentence_fr": "Ses résultats de recherche ont fourni des pistes importantes pour résoudre ce problème scientifique.",
      "sentence_en": "His research results provided important ideas for solving this scientific problem.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "science",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社交平台的功能不断更新，用户体验越来越好。",
      "sentence_pinyin": "Zhège shèjiāo píngtái de gōngnéng bùduàn gēngxīn, yònghù tǐyàn yuè lái yuè hǎo.",
      "sentence_fr": "Les fonctionnalités de cette plateforme sociale sont constamment mises à jour, améliorant de plus en plus l'expérience utilisateur.",
      "sentence_en": "The features of this social platform are constantly updated, making the user experience better and better.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_media",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在演出前进行了充分的排练，确保每个动作都完美无误。",
      "sentence_pinyin": "Tā zài yǎnchū qián jìnxíngle chōngfèn de páiliàn, quèbǎo měi ge dòngzuò dōu wánměi wúwù.",
      "sentence_fr": "Elle a effectué des répétitions approfondies avant le spectacle pour s'assurer que chaque mouvement soit parfait.",
      "sentence_en": "She conducted thorough rehearsals before the performance to ensure every movement was perfect.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "performing_arts",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市规划项目注重绿色发展，打造宜居的生活环境。",
      "sentence_pinyin": "Zhège chéngshì guīhuà xiàngmù zhùzhòng lǜsè fāzhǎn, dǎzào yíjū de shēnghuó huánjìng.",
      "sentence_fr": "Ce projet d'urbanisme met l'accent sur le développement vert, créant un environnement de vie agréable.",
      "sentence_en": "This urban planning project emphasizes green development, creating a livable living environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "urban_planning",
      "created_at": "2025-11-20T17:15:00.000Z",
      "updated_at": "2025-11-20T17:15:00.000Z"
    }
  ]
}
