{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧校园平台整合了教学、管理和服务的各项功能。",
      "sentence_pinyin": "Zhège zhìhuì xiàoyuán píngtái zhěnghéle jiàoxué, guǎnlǐ hé fúwù de gè xiàng gōngnéng.",
      "sentence_fr": "Cette plateforme de campus intelligent intègre diverses fonctions d'enseignement, de gestion et de service.",
      "sentence_en": "This smart campus platform integrates various functions of teaching, management, and services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_campus",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在川剧表演中展现了变脸、喷火等独特的表演技艺。",
      "sentence_pinyin": "Tā zài chuānjù biǎoyǎn zhōng zhǎnxiànle biànliǎn, pēnhuǒ děng dútè de biǎoyǎn jìyì.",
      "sentence_fr": "Dans sa performance d'opéra du Sichuan, elle a démontré des techniques de jeu uniques comme le changement de masque et le crachement de feu.",
      "sentence_en": "In her Sichuan Opera performance, she demonstrated unique performance techniques such as face-changing and fire-breathing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sichuan_opera",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能水表系统实现了用水数据的远程抄表和分析。",
      "sentence_pinyin": "Zhège zhìnéng shuǐbiǎo xìtǒng shíxiànle yòngshuǐ shùjù de yuǎnchéng chāobiǎo hé fēnxī.",
      "sentence_fr": "Ce système de compteurs d'eau intelligents réalise la lecture et l'analyse à distance des données de consommation d'eau.",
      "sentence_en": "This smart water meter system achieves remote reading and analysis of water consumption data.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_meters",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在微型小说创作中用精炼的语言讲述了耐人寻味的故事。",
      "sentence_pinyin": "Tā zài wēixíng xiǎoshuō chuàngzuò zhōng yòng jīngliàn de yǔyán jiǎngshùle nàirénxúnwèi de gùshi.",
      "sentence_fr": "Dans la création de mini-nouvelles, il raconte des histoires intrigantes avec un langage concis.",
      "sentence_en": "In flash fiction creation, he tells intriguing stories with concise language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "flash_fiction",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个残疾人就业服务中心帮助残障人士实现就业和融入社会。",
      "sentence_pinyin": "Zhège cánjí rén jiùyè fúwù zhōngxīn bāngzhù cánzhàng rénshì shíxiàn jiùyè hé róngrù shèhuì.",
      "sentence_fr": "Ce centre de services d'emploi pour personnes handicapées aide les personnes handicapées à trouver un emploi et à s'intégrer dans la société.",
      "sentence_en": "This employment service center for people with disabilities helps disabled people achieve employment and social integration.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disability_employment",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的产品设计注重用户体验和人机交互的友好性。",
      "sentence_pinyin": "Tā de chǎnpǐn shèjì zhùzhòng yònghù tǐyàn hé rénjī jiāohù de yǒuhǎoxìng.",
      "sentence_fr": "Sa conception de produits met l'accent sur l'expérience utilisateur et la convivialité de l'interaction homme-machine.",
      "sentence_en": "Her product design emphasizes user experience and the friendliness of human-machine interaction.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "product_design",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个珍稀动物繁育基地成功繁殖了多种濒危野生动物。",
      "sentence_pinyin": "Zhège zhēnxī dòngwù fányù jīdì chénggōng fánzhíle duō zhǒng bīnwēi yěshēng dòngwù.",
      "sentence_fr": "Cette base d'élevage d'animaux rares a réussi à reproduire plusieurs espèces d'animaux sauvages en danger.",
      "sentence_en": "This rare animal breeding base successfully bred multiple endangered wild animal species.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "animal_breeding",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在手球比赛中展现了快速突破和精准射门的能力。",
      "sentence_pinyin": "Tā zài shǒuqiú bǐsài zhōng zhǎnxiànle kuàisù túpò hé jīngzhǔn shèmén de nénglì.",
      "sentence_fr": "Il a démontré des capacités de percée rapide et de tir précis lors du match de handball.",
      "sentence_en": "He demonstrated rapid breakthrough and precise shooting abilities in the handball match.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "handball",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区文化活动中心定期举办文艺演出和技能培训活动。",
      "sentence_pinyin": "Zhège shèqū wénhuà huódòng zhōngxīn dìngqī jǔbàn wényì yǎnchū hé jìnéng péixùn huódòng.",
      "sentence_fr": "Ce centre d'activités culturelles communautaires organise régulièrement des spectacles artistiques et des activités de formation aux compétences.",
      "sentence_en": "This community cultural activity center regularly holds artistic performances and skill training activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cultural_centers",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在草编工艺中编织出了精美的草帽、草席和装饰品。",
      "sentence_pinyin": "Tā zài cǎobiān gōngyì zhōng biānzhī chūle jīngměi de cǎomào, cǎoxí hé zhuāngshìpǐn.",
      "sentence_fr": "Dans l'artisanat de tressage d'herbe, elle a tissé de magnifiques chapeaux de paille, nattes et décorations.",
      "sentence_en": "In grass weaving craftsmanship, she wove exquisite straw hats, mats, and decorations.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grass_weaving",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能药盒提醒患者按时按量服药并记录用药情况。",
      "sentence_pinyin": "Zhège zhìnéng yàohé tíxǐng huànzhě ànshí ànliàng fúyào bìng jìlù yòngyào qíngkuàng.",
      "sentence_fr": "Cette boîte à médicaments intelligente rappelle aux patients de prendre leurs médicaments à temps et en quantité appropriée et enregistre l'historique de prise.",
      "sentence_en": "This smart pill box reminds patients to take medication on time and in appropriate amounts and records medication history.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_medication",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在柳琴演奏中展现了清脆明快的音色和活泼跳跃的旋律。",
      "sentence_pinyin": "Tā zài liǔqín yǎnzòu zhōng zhǎnxiànle qīngcuì míngkuài de yīnsè hé huópō tiàoyuè de xuánlǜ.",
      "sentence_fr": "Il a démontré un timbre clair et vif et des mélodies vives et sautillantes dans son jeu de liuqin.",
      "sentence_en": "He demonstrated a crisp and bright timbre and lively, bouncing melodies in his liuqin performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "liuqin_music",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个危险化学品储存仓库采用了严格的安全管理和监控措施。",
      "sentence_pinyin": "Zhège wēixiǎn huàxuépǐn chǔcún cāngkù cǎiyòngle yángé de ānquán guǎnlǐ hé jiānkòng cuòshī.",
      "sentence_fr": "Cet entrepôt de stockage de produits chimiques dangereux adopte des mesures strictes de gestion de la sécurité et de surveillance.",
      "sentence_en": "This hazardous chemical storage warehouse adopts strict safety management and monitoring measures.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hazmat_storage",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的大地艺术作品在自然环境中创造了震撼的视觉景观。",
      "sentence_pinyin": "Tā de dàdì yìshù zuòpǐn zài zìrán huánjìng zhōng chuàngzàole zhènhàn de shìjué jǐngguān.",
      "sentence_fr": "Ses œuvres de land art créent des paysages visuels impressionnants dans l'environnement naturel.",
      "sentence_en": "Her land art works create stunning visual landscapes in the natural environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "land_art",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个干旱预警系统监测降水量和土壤墒情变化趋势。",
      "sentence_pinyin": "Zhège gānhàn yùjǐng xìtǒng jiāncè jiàngshuǐliàng hé tǔrǎng shāngqíng biànhuà qūshì.",
      "sentence_fr": "Ce système d'alerte à la sécheresse surveille les tendances des précipitations et de l'humidité du sol.",
      "sentence_en": "This drought warning system monitors precipitation and soil moisture change trends.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "drought_monitoring",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在音乐编曲工作中融合了多种风格和乐器的音色。",
      "sentence_pinyin": "Tā zài yīnyuè biānqǔ gōngzuò zhōng rónghéle duō zhǒng fēnggé hé yuèqì de yīnsè.",
      "sentence_fr": "Dans son travail d'arrangement musical, il a fusionné divers styles et timbres d'instruments.",
      "sentence_en": "In his music arrangement work, he fused various styles and instrument timbres.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music_arrangement",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个长期护理保险制度为失能人员提供了护理费用保障。",
      "sentence_pinyin": "Zhège chángqí hùlǐ bǎoxiǎn zhìdù wèi shīnéng rényuán tígōngle hùlǐ fèiyòng bǎozhàng.",
      "sentence_fr": "Ce système d'assurance soins de longue durée fournit une garantie de couverture des frais de soins pour les personnes dépendantes.",
      "sentence_en": "This long-term care insurance system provides nursing cost coverage for dependent persons.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "long_term_care_insurance",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在滑板运动中掌握了各种技巧动作和空中翻转技术。",
      "sentence_pinyin": "Tā zài huábǎn yùndòng zhōng zhǎngwòle gèzhǒng jìqiǎo dòngzuò hé kōngzhōng fānzhuǎn jìshù.",
      "sentence_fr": "Dans le skateboard, elle a maîtrisé diverses figures techniques et techniques de retournement aérien.",
      "sentence_en": "In skateboarding, she mastered various technical tricks and aerial flip techniques.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "skateboarding",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众创空间为创业者搭建了资源对接和交流合作的平台。",
      "sentence_pinyin": "Zhège zhòngchuàng kōngjiān wèi chuàngyèzhě dājiànle zīyuán duìjiē hé jiāoliú hézuò de píngtái.",
      "sentence_fr": "Cet espace de création collective a construit une plateforme de mise en relation des ressources et d'échanges collaboratifs pour les entrepreneurs.",
      "sentence_en": "This mass innovation space built a platform for resource matching and collaborative exchanges for entrepreneurs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "makerspaces",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在内画鼻烟壶制作中用特制工具在壶内绘制精美图案。",
      "sentence_pinyin": "Tā zài nèihuà bíyān hú zhìzuò zhōng yòng tèzhì gōngjù zài hú nèi huìzhì jīngměi tú'àn.",
      "sentence_fr": "Dans la fabrication de tabatières à peinture intérieure, il utilise des outils spéciaux pour peindre de magnifiques motifs à l'intérieur des flacons.",
      "sentence_en": "In inside-painted snuff bottle making, he uses special tools to paint exquisite patterns inside the bottles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "snuff_bottles",
      "created_at": "2025-11-20T19:50:00.000Z",
      "updated_at": "2025-11-20T19:50:00.000Z"
    }
  ]
}
