{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能语音翻译机可以实时翻译数十种语言,方便国际交流。",
      "sentence_pinyin": "Zhège zhìnéng yǔyīn fānyìjī kěyǐ shíshí fānyì shùshí zhǒng yǔyán, fāngbiàn guójì jiāoliú.",
      "sentence_fr": "Ce traducteur vocal intelligent peut traduire des dizaines de langues en temps réel, facilitant la communication internationale.",
      "sentence_en": "This smart voice translator can translate dozens of languages in real-time, facilitating international communication.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_translators",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "珞巴族的刀舞是西藏地区独特的传统舞蹈艺术形式。",
      "sentence_pinyin": "Luòbāzú de dāowǔ shì Xīzàng dìqū dútè de chuántǒng wǔdǎo yìshù xíngshì.",
      "sentence_fr": "La danse du couteau de l'ethnie Lhoba est une forme d'art de danse traditionnelle unique de la région du Tibet.",
      "sentence_en": "The Lhoba ethnic group's knife dance is a unique traditional dance art form of the Tibet region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "lhoba_knife_dance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的智慧医疗系统实现了网上挂号和远程问诊等便民服务。",
      "sentence_pinyin": "Chéngshì de zhìhuì yīliáo xìtǒng shíxiàn le wǎngshàng guàhào hé yuǎnchéng wènzhěn děng biànmín fúwù.",
      "sentence_fr": "Le système médical intelligent urbain offre des services pratiques comme la prise de rendez-vous en ligne et la téléconsultation.",
      "sentence_en": "Urban smart medical systems have implemented convenient services like online registration and telemedicine.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_healthcare_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能户外音响具有防水防尘功能,适合各种户外活动使用。",
      "sentence_pinyin": "Zhìnéng hùwài yīnxiǎng jùyǒu fángshuǐ fángchén gōngnéng, shìhé gèzhǒng hùwài huódòng shǐyòng.",
      "sentence_fr": "L'enceinte extérieure intelligente est étanche à l'eau et à la poussière, adaptée à diverses activités de plein air.",
      "sentence_en": "The smart outdoor speaker has waterproof and dustproof functions, suitable for various outdoor activities.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_outdoor_speakers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的打腰鼓表演是陕北地区节庆活动中的特色节目。",
      "sentence_pinyin": "Zhōngguó chuántǒng de dǎ yāogǔ biǎoyǎn shì Shǎnběi dìqū jiéqìng huódòng zhōng de tèsè jiémù.",
      "sentence_fr": "Le spectacle traditionnel chinois du tambour de taille est un programme caractéristique lors des célébrations dans le nord du Shaanxi.",
      "sentence_en": "Traditional Chinese waist drum performance is a characteristic show during festive activities in northern Shaanxi.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "waist_drum_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能运动耳机可以监测心率,并在运动过程中提供语音指导。",
      "sentence_pinyin": "Zhìnéng yùndòng ěrjī kěyǐ jiāncè xīnlǜ, bìng zài yùndòng guòchéng zhōng tígōng yǔyīn zhǐdǎo.",
      "sentence_fr": "Les écouteurs de sport intelligents peuvent surveiller la fréquence cardiaque et fournir des conseils vocaux pendant l'exercice.",
      "sentence_en": "Smart sports earphones can monitor heart rate and provide voice guidance during exercise.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sports_earphones",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "门巴族的萨玛酒歌是西藏墨脱地区流传的传统民歌。",
      "sentence_pinyin": "Ménbāzú de Sàmǎ jiǔgē shì Xīzàng Mòtuō dìqū liúchuán de chuántǒng míngē.",
      "sentence_fr": "Les chansons à boire Sama de l'ethnie Menba sont des chants populaires traditionnels transmis dans la région de Motuo au Tibet.",
      "sentence_en": "The Menba ethnic group's Sama drinking songs are traditional folk songs passed down in Tibet's Motuo region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "menba_drinking_songs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府实施的新农合政策减轻了农民的医疗费用负担。",
      "sentence_pinyin": "Zhèngfǔ shíshī de xīn nónghé zhèngcè jiǎnqīng le nóngmín de yīliáo fèiyòng fùdān.",
      "sentence_fr": "La politique de nouvelle assurance médicale rurale mise en œuvre par le gouvernement a allégé le fardeau des frais médicaux des agriculteurs.",
      "sentence_en": "The government's new rural cooperative medical policy has reduced farmers' medical expense burden.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_medical_insurance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能吉他调音器可以自动检测音准并指导用户调节琴弦。",
      "sentence_pinyin": "Zhìnéng jítā tiáoyīnqì kěyǐ zìdòng jiǎncè yīnzhǔn bìng zhǐdǎo yònghù tiáojié qínxián.",
      "sentence_fr": "L'accordeur de guitare intelligent peut détecter automatiquement la justesse et guider l'utilisateur pour ajuster les cordes.",
      "sentence_en": "The smart guitar tuner can automatically detect pitch and guide users to adjust strings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_guitar_tuners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的跳大绳表演是民间体育活动中的群众性娱乐项目。",
      "sentence_pinyin": "Zhōngguó chuántǒng de tiào dàshéng biǎoyǎn shì mínjiān tǐyù huódòng zhōng de qúnzhòngxìng yúlè xiàngmù.",
      "sentence_fr": "Le saut à la corde collectif traditionnel chinois est une activité de divertissement populaire dans les sports folkloriques.",
      "sentence_en": "Traditional Chinese group rope jumping is a mass entertainment activity in folk sports.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "group_rope_jumping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能宠物自动投食机可以定时定量喂食,解放主人的时间。",
      "sentence_pinyin": "Zhìnéng chǒngwù zìdòng tóushíjī kěyǐ dìngshí dìngliàng wèishí, jiěfàng zhǔrén de shíjiān.",
      "sentence_fr": "Le distributeur automatique de nourriture pour animaux intelligent peut nourrir à heures fixes et en quantités précises, libérant le temps du propriétaire.",
      "sentence_en": "The smart automatic pet feeder can feed at set times and amounts, freeing up owners' time.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_auto_feeders",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基诺族的太阳鼓是云南西双版纳地区独特的传统乐器。",
      "sentence_pinyin": "Jīnuòzú de tàiyánggǔ shì Yúnnán Xīshuāngbǎnnà dìqū dútè de chuántǒng yuèqì.",
      "sentence_fr": "Le tambour du soleil de l'ethnie Jino est un instrument de musique traditionnel unique de la région de Xishuangbanna au Yunnan.",
      "sentence_en": "The Jino ethnic group's sun drum is a unique traditional instrument of Yunnan's Xishuangbanna region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "jino_sun_drum",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的智慧养老平台为老年人提供健康管理和紧急救助服务。",
      "sentence_pinyin": "Chéngshì de zhìhuì yǎnglǎo píngtái wèi lǎoniánrén tígōng jiànkāng guǎnlǐ hé jǐnjí jiùzhù fúwù.",
      "sentence_fr": "La plateforme de soins aux personnes âgées intelligente urbaine offre des services de gestion de la santé et d'aide d'urgence aux seniors.",
      "sentence_en": "Urban smart elderly care platforms provide health management and emergency assistance services for seniors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_elderly_platforms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能节拍器可以根据乐曲风格自动调节节奏和速度。",
      "sentence_pinyin": "Zhìnéng jiépāiqì kěyǐ gēnjù yuèqǔ fēnggé zìdòng tiáojié jiézòu hé sùdù.",
      "sentence_fr": "Le métronome intelligent peut ajuster automatiquement le rythme et le tempo selon le style de la musique.",
      "sentence_en": "The smart metronome can automatically adjust rhythm and tempo based on music style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_metronomes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的抖空竹表演展示了民间艺人高超的技艺。",
      "sentence_pinyin": "Zhōngguó chuántǒng de dǒu kōngzhú biǎoyǎn zhǎnshì le mínjiān yìrén gāochāo de jìyì.",
      "sentence_fr": "Le spectacle traditionnel chinois du diabolo démontre les compétences exceptionnelles des artistes folkloriques.",
      "sentence_en": "Traditional Chinese diabolo performance showcases folk artists' superb skills.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "diabolo_performance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能电子乐谱可以自动翻页,让演奏者专注于表演。",
      "sentence_pinyin": "Zhìnéng diànzǐ yuèpǔ kěyǐ zìdòng fānyè, ràng yǎnzòuzhě zhuānzhù yú biǎoyǎn.",
      "sentence_fr": "La partition électronique intelligente peut tourner automatiquement les pages, permettant aux musiciens de se concentrer sur leur performance.",
      "sentence_en": "The smart electronic sheet music can automatically turn pages, letting performers focus on their performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sheet_music",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "德昂族的水鼓是云南德宏地区独特的传统打击乐器。",
      "sentence_pinyin": "Dé'ángzú de shuǐgǔ shì Yúnnán Déhóng dìqū dútè de chuántǒng dǎjī yuèqì.",
      "sentence_fr": "Le tambour à eau de l'ethnie De'ang est un instrument à percussion traditionnel unique de la région de Dehong au Yunnan.",
      "sentence_en": "The De'ang ethnic group's water drum is a unique traditional percussion instrument of Yunnan's Dehong region.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "deang_water_drum",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区开展的免费体检活动帮助居民及早发现健康问题。",
      "sentence_pinyin": "Shèqū kāizhǎn de miǎnfèi tǐjiǎn huódòng bāngzhù jūmín jízǎo fāxiàn jiànkāng wèntí.",
      "sentence_fr": "Les examens médicaux gratuits organisés par la communauté aident les résidents à détecter précocement les problèmes de santé.",
      "sentence_en": "Community free health check activities help residents detect health problems early.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "free_health_checks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能跳绳可以自动计数并记录运动数据,方便追踪锻炼效果。",
      "sentence_pinyin": "Zhìnéng tiàoshéng kěyǐ zìdòng jìshù bìng jìlù yùndòng shùjù, fāngbiàn zhuīzōng duànliàn xiàoguǒ.",
      "sentence_fr": "La corde à sauter intelligente peut compter automatiquement et enregistrer les données d'exercice, facilitant le suivi des résultats.",
      "sentence_en": "The smart jump rope can automatically count and record exercise data, making it easy to track workout results.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_jump_ropes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的放风筝习俗是清明节期间的户外休闲活动之一。",
      "sentence_pinyin": "Zhōngguó chuántǒng de fàng fēngzhēng xísú shì Qīngmíngjié qījiān de hùwài xiūxián huódòng zhī yī.",
      "sentence_fr": "La coutume traditionnelle chinoise du cerf-volant est l'une des activités de plein air pendant la Fête Qingming.",
      "sentence_en": "Traditional Chinese kite flying custom is one of the outdoor leisure activities during Qingming Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kite_flying",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
