{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个虚拟博物馆利用三维建模技术,让观众可以在线参观世界各地的珍贵文物。",
      "sentence_pinyin": "Zhège xūnǐ bówùguǎn lìyòng sānwéi jiànmó jìshù, ràng guānzhòng kěyǐ zàixiàn cānguān shìjiè gèdì de zhēnguì wénwù.",
      "sentence_fr": "Ce musée virtuel utilise la technologie de modélisation 3D pour permettre au public de visiter en ligne des objets précieux du monde entier.",
      "sentence_en": "This virtual museum uses 3D modeling technology to allow audiences to visit precious artifacts from around the world online.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "virtual_museums",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "埙是中国最古老的吹奏乐器之一,音色浑厚朴实,极具感染力。",
      "sentence_pinyin": "Xūn shì Zhōngguó zuì gǔlǎo de chuīzòu yuèqì zhī yī, yīnsè húnhòu pǔshí, jí jù gǎnrǎnlì.",
      "sentence_fr": "Le xun est l'un des plus anciens instruments à vent chinois, avec un son riche et simple, très émouvant.",
      "sentence_en": "The xun is one of China's oldest wind instruments, with a rich and simple tone that is highly evocative.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "xun_music",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家企业开发的工业机器人能够完成焊接、喷涂和装配等复杂任务。",
      "sentence_pinyin": "Zhè jiā qǐyè kāifā de gōngyè jīqìrén nénggòu wánchéng hànjiē, pēntú hé zhuāngpèi děng fùzá rènwù.",
      "sentence_fr": "Les robots industriels développés par cette entreprise peuvent accomplir des tâches complexes telles que soudage, pulvérisation et assemblage.",
      "sentence_en": "The industrial robots developed by this company can complete complex tasks such as welding, spraying, and assembly.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "industrial_robots",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "藤编工艺将天然藤条编织成各种家具和装饰品,既环保又美观。",
      "sentence_pinyin": "Téngbiān gōngyì jiāng tiānrán téngtiáo biānzhī chéng gèzhǒng jiājù hé zhuāngshìpǐn, jì huánbǎo yòu měiguān.",
      "sentence_fr": "L'artisanat du rotin tisse des tiges de rotin naturelles en divers meubles et décorations, à la fois écologiques et esthétiques.",
      "sentence_en": "Rattan weaving craftsmanship weaves natural rattan into various furniture and decorations, both eco-friendly and aesthetically pleasing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rattan_weaving",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能停车场采用车牌识别和自动缴费系统,大大提高了停车效率。",
      "sentence_pinyin": "Zhège zhìnéng tíngchēchǎng cǎiyòng chēpái shíbié hé zìdòng jiǎofèi xìtǒng, dàdà tígāole tíngchē xiàolǜ.",
      "sentence_fr": "Ce parking intelligent adopte un système de reconnaissance de plaques et de paiement automatique, améliorant considérablement l'efficacité du stationnement.",
      "sentence_en": "This smart parking lot adopts license plate recognition and automatic payment systems, greatly improving parking efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_parking",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个扶贫项目通过发展特色产业,帮助整个村庄实现了脱贫致富。",
      "sentence_pinyin": "Zhège fúpín xiàngmù tōngguò fāzhǎn tèsè chǎnyè, bāngzhù zhěnggè cūnzhuāng shíxiànle tuōpín zhìfù.",
      "sentence_fr": "Ce projet de réduction de la pauvreté a aidé l'ensemble du village à sortir de la pauvreté et à s'enrichir en développant des industries spécialisées.",
      "sentence_en": "This poverty alleviation project has helped the entire village escape poverty and achieve prosperity by developing specialized industries.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "poverty_alleviation",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "管子是一种古老的双簧管乐器,音色高亢尖锐,穿透力强。",
      "sentence_pinyin": "Guǎnzi shì yī zhǒng gǔlǎo de shuānghuáng guǎn yuèqì, yīnsè gāokàng jiānruì, chuāntòulì qiáng.",
      "sentence_fr": "Le guanzi est un ancien instrument à anche double au son aigu et perçant, avec une forte pénétration.",
      "sentence_en": "The guanzi is an ancient double-reed instrument with a high-pitched and piercing sound and strong penetrating power.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guanzi_music",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款在线协作工具支持多人同时编辑文档,极大提升了团队工作效率。",
      "sentence_pinyin": "Zhè kuǎn zàixiàn xiézuò gōngjù zhīchí duō rén tóngshí biānjí wéndàng, jí dà tíshēngle tuánduì gōngzuò xiàolǜ.",
      "sentence_fr": "Cet outil de collaboration en ligne permet l'édition simultanée de documents par plusieurs personnes, améliorant considérablement l'efficacité du travail d'équipe.",
      "sentence_en": "This online collaboration tool supports simultaneous document editing by multiple people, greatly improving team work efficiency.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "collaboration_tools",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区配备了完善的无障碍设施,方便残疾人和老年人出行。",
      "sentence_pinyin": "Zhège shèqū pèibèile wánshàn de wúzhàng'ài shèshī, fāngbiàn cánjírén hé lǎoniánrén chūxíng.",
      "sentence_fr": "Cette communauté est équipée d'installations complètes sans obstacles pour faciliter les déplacements des personnes handicapées et âgées.",
      "sentence_en": "This community is equipped with comprehensive barrier-free facilities to facilitate the movement of disabled and elderly people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "accessibility_facilities",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沙画艺术通过手指在沙盘上作画,配合灯光投影展现出动态的视觉效果。",
      "sentence_pinyin": "Shāhuà yìshù tōngguò shǒuzhǐ zài shāpán shàng zuòhuà, pèihé dēngguāng tóuyǐng zhǎnxiàn chū dòngtài de shìjué xiàoguǒ.",
      "sentence_fr": "L'art du sable crée des effets visuels dynamiques en dessinant avec les doigts sur un plateau de sable, accompagné de projections lumineuses.",
      "sentence_en": "Sand art creates dynamic visual effects by drawing with fingers on a sand table, combined with light projections.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sand_art",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个数字图书馆拥有数百万册电子书籍和学术期刊,全部免费开放。",
      "sentence_pinyin": "Zhège shùzì túshūguǎn yōngyǒu shù bǎi wàn cè diànzǐ shūjí hé xuéshù qīkān, quánbù miǎnfèi kāifàng.",
      "sentence_fr": "Cette bibliothèque numérique possède des millions de livres électroniques et de revues académiques, tous en accès libre gratuit.",
      "sentence_en": "This digital library has millions of e-books and academic journals, all freely accessible.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "digital_libraries",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "筚篥是一种簧管乐器,在古代宫廷音乐和民间音乐中都占有重要地位。",
      "sentence_pinyin": "Bìlì shì yī zhǒng huángguǎn yuèqì, zài gǔdài gōngtíng yīnyuè hé mínjiān yīnyuè zhōng dōu zhànyǒu zhòngyào dìwèi.",
      "sentence_fr": "Le bili est un instrument à anche qui occupait une place importante dans la musique de cour ancienne et la musique folklorique.",
      "sentence_en": "The bili is a reed instrument that held an important place in both ancient court music and folk music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bili_music",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新能源汽车充电网络覆盖了主要城市和高速公路沿线。",
      "sentence_pinyin": "Zhège xīn néngyuán qìchē chōngdiàn wǎngluò fùgàile zhǔyào chéngshì hé gāosù gōnglù yánxiàn.",
      "sentence_fr": "Ce réseau de recharge pour véhicules à énergie nouvelle couvre les principales villes et les autoroutes.",
      "sentence_en": "This new energy vehicle charging network covers major cities and highways.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ev_charging_networks",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "柳编工艺利用柔软的柳条编织出各种实用的篮筐和储物容器。",
      "sentence_pinyin": "Liǔbiān gōngyì lìyòng róuruǎn de liǔtiáo biānzhī chū gèzhǒng shíyòng de lánkuāng hé chǔwù róngqì.",
      "sentence_fr": "L'artisanat du saule tresse des branches de saule souples en divers paniers pratiques et contenants de rangement.",
      "sentence_en": "Willow weaving craftsmanship uses flexible willow branches to weave various practical baskets and storage containers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "willow_weaving",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个心理咨询热线为青少年提供24小时免费的心理辅导服务。",
      "sentence_pinyin": "Zhège xīnlǐ zīxún rèxiàn wèi qīngshàonián tígōng èrshísì xiǎoshí miǎnfèi de xīnlǐ fǔdǎo fúwù.",
      "sentence_fr": "Cette ligne d'assistance psychologique offre un service de conseil psychologique gratuit 24 heures sur 24 aux adolescents.",
      "sentence_en": "This psychological counseling hotline provides 24-hour free psychological counseling services for adolescents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "youth_counseling",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙的音色清越悠长,能够吹奏和声,在民乐合奏中起着独特的作用。",
      "sentence_pinyin": "Shēng de yīnsè qīngyuè yōucháng, nénggòu chuīzòu héshēng, zài mínyuè hézòu zhōng qǐzhe dútè de zuòyòng.",
      "sentence_fr": "Le sheng a un son clair et prolongé, capable de jouer des harmonies, jouant un rôle unique dans les ensembles de musique traditionnelle.",
      "sentence_en": "The sheng has a clear and prolonged tone, capable of playing harmonies, playing a unique role in traditional music ensembles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_music",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能物流系统通过大数据分析优化配送路线,降低了运输成本。",
      "sentence_pinyin": "Zhège zhìnéng wùliú xìtǒng tōngguò dà shùjù fēnxī yōuhuà pèisòng lùxiàn, jiàngdīle yùnshū chéngběn.",
      "sentence_fr": "Ce système logistique intelligent optimise les itinéraires de livraison grâce à l'analyse des mégadonnées, réduisant les coûts de transport.",
      "sentence_en": "This intelligent logistics system optimizes delivery routes through big data analysis, reducing transportation costs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_logistics",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "草编工艺用稻草、麦秸等材料编织出帽子、坐垫等日常用品。",
      "sentence_pinyin": "Cǎobiān gōngyì yòng dàocǎo, màijiē děng cáiliào biānzhī chū màozi, zuòdiàn děng rìcháng yòngpǐn.",
      "sentence_fr": "L'artisanat du tressage d'herbe utilise des matériaux comme la paille de riz et de blé pour tisser des chapeaux, des coussins et autres articles quotidiens.",
      "sentence_en": "Grass weaving craftsmanship uses materials like rice straw and wheat straw to weave hats, cushions, and other daily items.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "grass_weaving",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个应用程序能够识别植物种类,并提供详细的养护指导。",
      "sentence_pinyin": "Zhège yìngyòng chéngxù nénggòu shíbié zhíwù zhǒnglèi, bìng tígōng xiángxì de yǎnghù zhǐdǎo.",
      "sentence_fr": "Cette application peut identifier les espèces végétales et fournir des conseils d'entretien détaillés.",
      "sentence_en": "This application can identify plant species and provide detailed care guidance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "plant_identification_apps",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家社会企业雇佣听障人士制作手工艺品,帮助他们实现自我价值。",
      "sentence_pinyin": "Zhè jiā shèhuì qǐyè gùyōng tīngzhàng rénshì zhìzuò shǒugōngyìpǐn, bāngzhù tāmen shíxiàn zìwǒ jiàzhí.",
      "sentence_fr": "Cette entreprise sociale emploie des personnes malentendantes pour fabriquer de l'artisanat, les aidant à réaliser leur valeur personnelle.",
      "sentence_en": "This social enterprise employs hearing-impaired people to make handicrafts, helping them realize their self-worth.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "social_enterprises",
      "created_at": "2025-11-20T20:55:00.000Z",
      "updated_at": "2025-11-20T20:55:00.000Z"
    }
  ]
}
