{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这本词典收录了大量的专业术语和例句。",
      "sentence_pinyin": "Zhè běn cídiǎn shōulùle dàliàng de zhuānyè shùyǔ hé lìjù.",
      "sentence_fr": "Ce dictionnaire contient de nombreux termes professionnels et phrases d'exemple.",
      "sentence_en": "This dictionary contains a large number of professional terms and example sentences.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "learning",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "为了保持身材，她每天早上都会去健身房锻炼一个小时。",
      "sentence_pinyin": "Wèile bǎochí shēncái, tā měitiān zǎoshang dōu huì qù jiànshēnfáng duànliàn yī ge xiǎoshí.",
      "sentence_fr": "Pour garder la forme, elle va à la salle de sport chaque matin pour s'entraîner pendant une heure.",
      "sentence_en": "To maintain her figure, she goes to the gym every morning to work out for an hour.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座桥梁的建筑设计获得了国际大奖，成为城市的标志性建筑。",
      "sentence_pinyin": "Zhè zuò qiáoliáng de jiànzhù shèjì huòdéle guójì dàjiǎng, chéngwéi chéngshì de biāozhìxìng jiànzhù.",
      "sentence_fr": "La conception architecturale de ce pont a remporté un prix international et est devenue un monument emblématique de la ville.",
      "sentence_en": "The architectural design of this bridge won an international award and became a landmark of the city.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "architecture",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "孩子们在游乐场玩得很开心，笑声传遍了整个公园。",
      "sentence_pinyin": "Háizimen zài yóulèchǎng wán de hěn kāixīn, xiàoshēng chuánbiànle zhěnggè gōngyuán.",
      "sentence_fr": "Les enfants s'amusent beaucoup dans l'aire de jeux et leurs rires résonnent dans tout le parc.",
      "sentence_en": "The children are having a great time at the playground, their laughter echoing throughout the park.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "children",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家银行提供多种储蓄和贷款服务，满足不同客户的需求。",
      "sentence_pinyin": "Zhè jiā yínháng tígōng duō zhǒng chǔxù hé dàikuǎn fúwù, mǎnzú bùtóng kèhù de xūqiú.",
      "sentence_fr": "Cette banque offre divers services d'épargne et de prêt pour répondre aux besoins de différents clients.",
      "sentence_en": "This bank offers various savings and loan services to meet the needs of different customers.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "finance",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "经过几个月的努力，他终于通过了驾驶考试。",
      "sentence_pinyin": "Jīngguò jǐ ge yuè de nǔlì, tā zhōngyú tōngguòle jiàshǐ kǎoshì.",
      "sentence_fr": "Après plusieurs mois d'efforts, il a finalement réussi l'examen de conduite.",
      "sentence_en": "After several months of effort, he finally passed the driving test.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "transportation",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个小镇保留了很多传统的建筑和民俗文化。",
      "sentence_pinyin": "Zhège xiǎo zhèn bǎoliúle hěn duō chuántǒng de jiànzhù hé mínsú wénhuà.",
      "sentence_fr": "Cette petite ville a conservé de nombreux bâtiments traditionnels et sa culture folklorique.",
      "sentence_en": "This small town has preserved many traditional buildings and folk culture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "culture",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "老师鼓励学生们要勇于提问，积极参与课堂讨论。",
      "sentence_pinyin": "Lǎoshī gǔlì xuéshengmen yào yǒngyú tíwèn, jījí cānyù kètáng tǎolùn.",
      "sentence_fr": "Le professeur encourage les élèves à poser des questions courageusement et à participer activement aux discussions en classe.",
      "sentence_en": "The teacher encourages students to ask questions bravely and actively participate in classroom discussions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他们的友谊从大学时代就开始了，一直延续到现在。",
      "sentence_pinyin": "Tāmen de yǒuyì cóng dàxué shídài jiù kāishǐ le, yīzhí yánxù dào xiànzài.",
      "sentence_fr": "Leur amitié a commencé à l'université et perdure jusqu'à aujourd'hui.",
      "sentence_en": "Their friendship started from university days and has continued until now.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "friendship",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个展览展示了当代艺术家的创新作品和独特视角。",
      "sentence_pinyin": "Zhège zhǎnlǎn zhǎnshìle dāngdài yìshùjiā de chuàngxīn zuòpǐn hé dútè shìjiǎo.",
      "sentence_fr": "Cette exposition présente les œuvres innovantes et les perspectives uniques d'artistes contemporains.",
      "sentence_en": "This exhibition showcases the innovative works and unique perspectives of contemporary artists.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府出台了一系列政策来扶持中小企业的发展。",
      "sentence_pinyin": "Zhèngfǔ chūtáile yī xìliè zhèngcè lái fúchí zhōngxiǎo qǐyè de fāzhǎn.",
      "sentence_fr": "Le gouvernement a introduit une série de politiques pour soutenir le développement des petites et moyennes entreprises.",
      "sentence_en": "The government has introduced a series of policies to support the development of small and medium-sized enterprises.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "economics",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个品牌以其优质的产品质量和完善的服务赢得了消费者的信赖。",
      "sentence_pinyin": "Zhège pǐnpái yǐ qí yōuzhì de chǎnpǐn zhìliàng hé wánshàn de fúwù yíngdéle xiāofèizhě de xìnlài.",
      "sentence_fr": "Cette marque a gagné la confiance des consommateurs grâce à ses produits de qualité et son service complet.",
      "sentence_en": "This brand has won consumers' trust with its high-quality products and comprehensive service.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "business",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "研究表明，适当的运动可以提高免疫力，预防疾病。",
      "sentence_pinyin": "Yánjiū biǎomíng, shìdàng de yùndòng kěyǐ tígāo miǎnyìlì, yùfáng jíbìng.",
      "sentence_fr": "Les recherches montrent qu'un exercice approprié peut renforcer l'immunité et prévenir les maladies.",
      "sentence_en": "Research shows that appropriate exercise can enhance immunity and prevent diseases.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这场音乐会汇集了国内外知名的音乐家和演奏家。",
      "sentence_pinyin": "Zhè chǎng yīnyuèhuì huìjíle guónèi wài zhīmíng de yīnyuèjiā hé yǎnzòujiā.",
      "sentence_fr": "Ce concert rassemble des musiciens et interprètes renommés nationaux et internationaux.",
      "sentence_en": "This concert brings together renowned musicians and performers from home and abroad.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "music",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在业余时间喜欢画画和写作，培养自己的艺术修养。",
      "sentence_pinyin": "Tā zài yèyú shíjiān xǐhuan huàhuà hé xiězuò, péiyǎng zìjǐ de yìshù xiūyǎng.",
      "sentence_fr": "Pendant son temps libre, elle aime peindre et écrire pour cultiver son sens artistique.",
      "sentence_en": "In her spare time, she likes to paint and write to cultivate her artistic sensibility.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hobbies",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个项目需要团队成员之间的密切配合和有效沟通。",
      "sentence_pinyin": "Zhège xiàngmù xūyào tuánduì chéngyuán zhī jiān de mìqiè pèihé hé yǒuxiào gōutōng.",
      "sentence_fr": "Ce projet nécessite une coopération étroite et une communication efficace entre les membres de l'équipe.",
      "sentence_en": "This project requires close cooperation and effective communication among team members.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "teamwork",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在面试中表现得很自信，给考官留下了深刻的印象。",
      "sentence_pinyin": "Tā zài miànshì zhōng biǎoxiàn de hěn zìxìn, gěi kǎoguān liúxiàle shēnkè de yìnxiàng.",
      "sentence_fr": "Il s'est montré très confiant lors de l'entretien et a laissé une impression profonde aux examinateurs.",
      "sentence_en": "He appeared very confident in the interview and left a deep impression on the examiners.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "job_hunting",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个新开发的药物在临床试验中取得了显著的效果。",
      "sentence_pinyin": "Zhège xīn kāifā de yàowù zài línchuáng shìyàn zhōng qǔdéle xiǎnzhù de xiàoguǒ.",
      "sentence_fr": "Ce nouveau médicament développé a obtenu des résultats remarquables lors des essais cliniques.",
      "sentence_en": "This newly developed drug has achieved remarkable results in clinical trials.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medicine",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "每逢佳节倍思亲，他总是特别想念远方的家人。",
      "sentence_pinyin": "Měi féng jiājié bèi sī qīn, tā zǒngshì tèbié xiǎngniàn yuǎnfāng de jiārén.",
      "sentence_fr": "Pendant les fêtes, il pense particulièrement à sa famille éloignée.",
      "sentence_en": "During festivals, he especially misses his family far away.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电视剧讲述了一个关于爱情和梦想的感人故事。",
      "sentence_pinyin": "Zhè bù diànshìjù jiǎngshùle yī ge guānyú àiqíng hé mèngxiǎng de gǎnrén gùshi.",
      "sentence_fr": "Cette série télévisée raconte une histoire émouvante sur l'amour et les rêves.",
      "sentence_en": "This TV series tells a touching story about love and dreams.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "entertainment",
      "created_at": "2025-11-20T16:20:00.000Z",
      "updated_at": "2025-11-20T16:20:00.000Z"
    }
  ]
}
