{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "认知科学综合心理学、语言学和人工智能来研究心智的本质。",
      "sentence_pinyin": "Rènzhī kēxué zōnghé xīnlǐxué, yǔyánxué hé réngōng zhìnéng lái yánjiū xīnzhì de běnzhì.",
      "sentence_fr": "Les sciences cognitives intègrent la psychologie, la linguistique et l'intelligence artificielle pour étudier la nature de l'esprit.",
      "sentence_en": "Cognitive science integrates psychology, linguistics, and artificial intelligence to study the nature of the mind.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cognitive_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "文件系统组织和管理计算机存储设备上的数据存储和检索。",
      "sentence_pinyin": "Wénjiàn xìtǒng zǔzhī hé guǎnlǐ jìsuànjī cúnchǔ shèbèi shàng de shùjù cúnchǔ hé jiǎnsuǒ.",
      "sentence_fr": "Les systèmes de fichiers organisent et gèrent le stockage et la récupération des données sur les périphériques de stockage informatique.",
      "sentence_en": "File systems organize and manage data storage and retrieval on computer storage devices.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "file_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "火山学研究火山活动、岩浆系统和火山喷发的机制。",
      "sentence_pinyin": "Huǒshānxué yánjiū huǒshān huódòng, yánjiāng xìtǒng hé huǒshān pēnfā de jīzhì.",
      "sentence_fr": "La volcanologie étudie l'activité volcanique, les systèmes magmatiques et les mécanismes des éruptions volcaniques.",
      "sentence_en": "Volcanology studies volcanic activity, magma systems, and the mechanisms of volcanic eruptions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "volcanology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "财务会计为外部利益相关者提供企业财务状况的标准化报告。",
      "sentence_pinyin": "Cáiwù kuàijì wèi wàibù lìyì xiāngguān zhě tígōng qǐyè cáiwù zhuàngkuàng de biāozhǔnhuà bàogào.",
      "sentence_fr": "La comptabilité financière fournit des rapports standardisés sur la situation financière des entreprises pour les parties prenantes externes.",
      "sentence_en": "Financial accounting provides standardized reports on corporate financial status for external stakeholders.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_accounting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "进化生物学研究物种如何通过自然选择和遗传变异而变化。",
      "sentence_pinyin": "Jìnhuà shēngwùxué yánjiū wùzhǒng rúhé tōngguò zìrán xuǎnzé hé yíchuán biànyì ér biànhuà.",
      "sentence_fr": "La biologie évolutive étudie comment les espèces changent par la sélection naturelle et la variation génétique.",
      "sentence_en": "Evolutionary biology studies how species change through natural selection and genetic variation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "evolutionary_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "算法复杂度分析评估程序执行所需的时间和空间资源。",
      "sentence_pinyin": "Suànfǎ fùzádù fēnxī pínggū chéngxù zhíxíng suǒ xū de shíjiān hé kōngjiān zīyuán.",
      "sentence_fr": "L'analyse de la complexité algorithmique évalue les ressources en temps et en espace nécessaires à l'exécution d'un programme.",
      "sentence_en": "Algorithm complexity analysis evaluates the time and space resources required for program execution.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "algorithm_complexity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "感觉和知觉心理学研究我们如何接收和解释感官信息。",
      "sentence_pinyin": "Gǎnjué hé zhījué xīnlǐxué yánjiū wǒmen rúhé jiēshōu hé jiěshì gǎnguān xìnxī.",
      "sentence_fr": "La psychologie de la sensation et de la perception étudie comment nous recevons et interprétons les informations sensorielles.",
      "sentence_en": "Sensation and perception psychology studies how we receive and interpret sensory information.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sensation_perception",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "构造地质学研究地壳变形和山脉形成的地质过程。",
      "sentence_pinyin": "Gòuzào dìzhìxué yánjiū dìqiào biànxíng hé shānmài xíngchéng de dìzhì guòchéng.",
      "sentence_fr": "La géologie structurale étudie les processus géologiques de déformation de la croûte terrestre et de formation des montagnes.",
      "sentence_en": "Structural geology studies the geological processes of crustal deformation and mountain formation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "structural_geology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人力资源管理涉及招聘、培训、绩效评估和员工发展。",
      "sentence_pinyin": "Rénlì zīyuán guǎnlǐ shèjí zhāopìn, péixùn, jīxiào pínggū hé yuángōng fāzhǎn.",
      "sentence_fr": "La gestion des ressources humaines implique le recrutement, la formation, l'évaluation des performances et le développement des employés.",
      "sentence_en": "Human resource management involves recruitment, training, performance evaluation, and employee development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "human_resource_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据结构的选择直接影响程序的效率和内存使用。",
      "sentence_pinyin": "Shùjù jiégòu de xuǎnzé zhíjiē yǐngxiǎng chéngxù de xiàolǜ hé nèicún shǐyòng.",
      "sentence_fr": "Le choix des structures de données affecte directement l'efficacité du programme et l'utilisation de la mémoire.",
      "sentence_en": "The choice of data structures directly affects program efficiency and memory usage.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_structures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学习与记忆心理学研究信息编码、存储和提取的认知过程。",
      "sentence_pinyin": "Xuéxí yǔ jìyì xīnlǐxué yánjiū xìnxī biānmǎ, cúnchǔ hé tíqǔ de rènzhī guòchéng.",
      "sentence_fr": "La psychologie de l'apprentissage et de la mémoire étudie les processus cognitifs d'encodage, de stockage et de récupération de l'information.",
      "sentence_en": "Learning and memory psychology studies the cognitive processes of information encoding, storage, and retrieval.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "learning_memory_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋学研究海洋的物理、化学、生物和地质特性。",
      "sentence_pinyin": "Hǎiyángxué yánjiū hǎiyáng de wùlǐ, huàxué, shēngwù hé dìzhì tèxìng.",
      "sentence_fr": "L'océanographie étudie les caractéristiques physiques, chimiques, biologiques et géologiques des océans.",
      "sentence_en": "Oceanography studies the physical, chemical, biological, and geological characteristics of the oceans.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "oceanography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "风险管理识别、评估和制定策略来减轻潜在的业务风险。",
      "sentence_pinyin": "Fēngxiǎn guǎnlǐ shíbié, pínggū hé zhìdìng cèlüè lái jiǎnqīng qiánzài de yèwù fēngxiǎn.",
      "sentence_fr": "La gestion des risques identifie, évalue et développe des stratégies pour atténuer les risques commerciaux potentiels.",
      "sentence_en": "Risk management identifies, evaluates, and develops strategies to mitigate potential business risks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "risk_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "面向对象编程通过封装、继承和多态性组织代码结构。",
      "sentence_pinyin": "Miàn xiàng duìxiàng biānchéng tōngguò fēngzhuāng, jìchéng hé duōtàixìng zǔzhī dàimǎ jiégòu.",
      "sentence_fr": "La programmation orientée objet organise la structure du code à travers l'encapsulation, l'héritage et le polymorphisme.",
      "sentence_en": "Object-oriented programming organizes code structure through encapsulation, inheritance, and polymorphism.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "object_oriented_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "异常心理学研究心理障碍的症状、病因和治疗方法。",
      "sentence_pinyin": "Yìcháng xīnlǐxué yánjiū xīnlǐ zhàng'ài de zhèngzhuàng, bìngyīn hé zhìliáo fāngfǎ.",
      "sentence_fr": "La psychologie anormale étudie les symptômes, les causes et les méthodes de traitement des troubles psychologiques.",
      "sentence_en": "Abnormal psychology studies the symptoms, causes, and treatment methods of psychological disorders.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "abnormal_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "沉积学研究沉积物的搬运、沉积和成岩作用过程。",
      "sentence_pinyin": "Chénjīxué yánjiū chénjī wù de bānyùn, chénjī hé chéngyán zuòyòng guòchéng.",
      "sentence_fr": "La sédimentologie étudie les processus de transport, de dépôt et de diagenèse des sédiments.",
      "sentence_en": "Sedimentology studies the processes of sediment transport, deposition, and diagenesis.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sedimentology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "市场营销研究消费者需求并制定产品推广和定价策略。",
      "sentence_pinyin": "Shìchǎng yíngxiāo yánjiū xiāofèi zhě xūqiú bìng zhìdìng chǎnpǐn tuīguǎng hé dìngjià cèlüè.",
      "sentence_fr": "Le marketing étudie les besoins des consommateurs et développe des stratégies de promotion et de tarification des produits.",
      "sentence_en": "Marketing studies consumer needs and develops product promotion and pricing strategies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marketing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "进程调度算法决定操作系统如何分配处理器时间给各任务。",
      "sentence_pinyin": "Jìnchéng diàodù suànfǎ juédìng cāozuò xìtǒng rúhé fēnpèi chǔlǐqì shíjiān gěi gè rènwù.",
      "sentence_fr": "Les algorithmes d'ordonnancement des processus déterminent comment le système d'exploitation alloue le temps processeur aux différentes tâches.",
      "sentence_en": "Process scheduling algorithms determine how the operating system allocates processor time to various tasks.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "process_scheduling",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "健康心理学研究心理因素如何影响身体健康和疾病行为。",
      "sentence_pinyin": "Jiànkāng xīnlǐxué yánjiū xīnlǐ yīnsù rúhé yǐngxiǎng shēntǐ jiànkāng hé jíbìng xíngwéi.",
      "sentence_fr": "La psychologie de la santé étudie comment les facteurs psychologiques affectent la santé physique et les comportements liés à la maladie.",
      "sentence_en": "Health psychology studies how psychological factors affect physical health and illness behaviors.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "health_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "天体物理学研究恒星、星系和宇宙的物理性质和演化。",
      "sentence_pinyin": "Tiāntǐ wùlǐxué yánjiū héngxīng, xīngxì hé yǔzhòu de wùlǐ xìngzhì hé yǎnhuà.",
      "sentence_fr": "L'astrophysique étudie les propriétés physiques et l'évolution des étoiles, des galaxies et de l'univers.",
      "sentence_en": "Astrophysics studies the physical properties and evolution of stars, galaxies, and the universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "astrophysics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
