{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智能空气净化器配有HEPA滤网,可以过滤99%的细微颗粒物。",
      "sentence_pinyin": "Zhège zhìnéng kōngqì jìnghuàqì pèiyǒu HEPA lǜwǎng, kěyǐ guòlǜ bǎifēnzhī jiǔshíjiǔ de xìwēi kēlìwù.",
      "sentence_fr": "Ce purificateur d'air intelligent est équipé d'un filtre HEPA qui peut filtrer 99% des particules fines.",
      "sentence_en": "This smart air purifier is equipped with a HEPA filter that can filter 99% of fine particles.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hepa_purifiers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "纳西族的东巴文是世界上仍在使用的象形文字之一。",
      "sentence_pinyin": "Nàxīzú de Dōngbāwén shì shìjiè shàng réng zài shǐyòng de xiàngxíng wénzì zhī yī.",
      "sentence_fr": "L'écriture Dongba de l'ethnie Naxi est l'une des écritures pictographiques encore utilisées dans le monde.",
      "sentence_en": "The Dongba script of the Naxi ethnic group is one of the pictographic scripts still in use in the world.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "dongba_script",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的公共卫生间改造项目提升了市民的如厕体验。",
      "sentence_pinyin": "Chéngshì de gōnggòng wèishēngjiān gǎizào xiàngmù tíshēng le shìmín de rúcè tǐyàn.",
      "sentence_fr": "Le projet de rénovation des toilettes publiques urbaines a amélioré l'expérience des usagers.",
      "sentence_en": "The city's public restroom renovation project has improved the restroom experience for residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_restrooms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能破壁机可以将食材打成细腻的糊状,便于营养吸收。",
      "sentence_pinyin": "Zhìnéng pòbìjī kěyǐ jiāng shícái dǎ chéng xìnì de hú zhuàng, biànyú yíngyǎng xīshōu.",
      "sentence_fr": "Le blender intelligent peut réduire les ingrédients en purée fine, facilitant l'absorption des nutriments.",
      "sentence_en": "The smart high-speed blender can blend ingredients into a fine paste, facilitating nutrient absorption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_blenders",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的粽子制作是端午节期间的重要习俗活动。",
      "sentence_pinyin": "Zhōngguó chuántǒng de zòngzi zhìzuò shì Duānwǔjié qījiān de zhòngyào xísú huódòng.",
      "sentence_fr": "La fabrication traditionnelle chinoise des zongzi est une coutume importante pendant la Fête des Bateaux-Dragons.",
      "sentence_en": "Traditional Chinese zongzi making is an important custom during the Dragon Boat Festival.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "zongzi_making",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能体温贴可以24小时持续监测体温,并在发热时发出警报。",
      "sentence_pinyin": "Zhìnéng tǐwēn tiē kěyǐ èrshísì xiǎoshí chíxù jiāncè tǐwēn, bìng zài fārè shí fāchū jǐngbào.",
      "sentence_fr": "Le patch thermomètre intelligent peut surveiller en continu la température pendant 24 heures et alerter en cas de fièvre.",
      "sentence_en": "The smart temperature patch can continuously monitor body temperature for 24 hours and alert when fever occurs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_temp_patches",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "黎族的织锦工艺是海南岛独特的非物质文化遗产。",
      "sentence_pinyin": "Lízú de zhījǐn gōngyì shì Hǎinándǎo dútè de fēi wùzhì wénhuà yíchǎn.",
      "sentence_fr": "L'artisanat du brocart de l'ethnie Li est un patrimoine culturel immatériel unique de l'île de Hainan.",
      "sentence_en": "The Li ethnic group's brocade weaving is a unique intangible cultural heritage of Hainan Island.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "li_brocade",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政府建设的农村污水处理设施改善了乡村的人居环境。",
      "sentence_pinyin": "Zhèngfǔ jiànshè de nóngcūn wūshuǐ chǔlǐ shèshī gǎishàn le xiāngcūn de rénjū huánjìng.",
      "sentence_fr": "Les installations de traitement des eaux usées rurales construites par le gouvernement ont amélioré l'environnement de vie des villages.",
      "sentence_en": "Government-built rural sewage treatment facilities have improved the living environment in villages.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "rural_sewage_treatment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能消毒柜可以用紫外线和臭氧双重消毒餐具和婴儿用品。",
      "sentence_pinyin": "Zhìnéng xiāodúguì kěyǐ yòng zǐwàixiàn hé chòuyǎng shuāngchóng xiāodú cānjù hé yīng'ér yòngpǐn.",
      "sentence_fr": "L'armoire de stérilisation intelligente peut désinfecter la vaisselle et les articles pour bébé avec UV et ozone.",
      "sentence_en": "The smart sterilizer cabinet can double-disinfect tableware and baby items with UV and ozone.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_sterilizers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的腊八粥制作是腊月初八的传统习俗。",
      "sentence_pinyin": "Zhōngguó chuántǒng de làbāzhōu zhìzuò shì làyuè chūbā de chuántǒng xísú.",
      "sentence_fr": "La préparation traditionnelle chinoise de la bouillie Laba est une coutume traditionnelle du 8e jour du 12e mois lunaire.",
      "sentence_en": "Traditional Chinese Laba porridge making is a traditional custom on the 8th day of the 12th lunar month.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "laba_porridge",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能扫窗机器人可以自动清洁高层建筑的玻璃幕墙。",
      "sentence_pinyin": "Zhìnéng sǎochuāng jīqìrén kěyǐ zìdòng qīngjié gāocéng jiànzhù de bōlí mùqiáng.",
      "sentence_fr": "Le robot nettoyeur de vitres intelligent peut nettoyer automatiquement les murs-rideaux en verre des immeubles.",
      "sentence_en": "The smart window cleaning robot can automatically clean glass curtain walls of high-rise buildings.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_window_cleaners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "畲族的山歌是福建和浙江畲族地区流传的民间音乐形式。",
      "sentence_pinyin": "Shēzú de shāngē shì Fújiàn hé Zhèjiāng Shēzú dìqū liúchuán de mínjiān yīnyuè xíngshì.",
      "sentence_fr": "Les chants de montagne de l'ethnie She sont une forme de musique folklorique transmise dans les régions She du Fujian et du Zhejiang.",
      "sentence_en": "She ethnic group's mountain songs are folk music forms passed down in the She regions of Fujian and Zhejiang.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "she_mountain_songs",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "城市的步行街改造项目打造了更加舒适的购物休闲环境。",
      "sentence_pinyin": "Chéngshì de bùxíngjiē gǎizào xiàngmù dǎzào le gèngjiā shūshì de gòuwù xiūxián huánjìng.",
      "sentence_fr": "Le projet de rénovation des rues piétonnes urbaines a créé un environnement de shopping et de loisirs plus confortable.",
      "sentence_en": "The city's pedestrian street renovation project has created a more comfortable shopping and leisure environment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pedestrian_streets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能奶瓶消毒器可以快速消毒奶瓶并保持干燥。",
      "sentence_pinyin": "Zhìnéng nǎipíng xiāodúqì kěyǐ kuàisù xiāodú nǎipíng bìng bǎochí gānzào.",
      "sentence_fr": "Le stérilisateur de biberons intelligent peut rapidement stériliser les biberons et les garder secs.",
      "sentence_en": "The smart baby bottle sterilizer can quickly sterilize bottles and keep them dry.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_bottle_sterilizers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的重阳节登高习俗寄托了人们对健康长寿的美好愿望。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Chóngyángjié dēnggāo xísú jìtuō le rénmen duì jiànkāng chángshòu de měihǎo yuànwàng.",
      "sentence_fr": "La coutume traditionnelle chinoise de gravir les montagnes pendant la Fête du Double Neuf exprime les vœux de santé et de longévité.",
      "sentence_en": "The traditional Chinese custom of climbing heights during Double Ninth Festival expresses wishes for health and longevity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "double_ninth_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能取暖器可以根据室温自动调节功率,节省能源。",
      "sentence_pinyin": "Zhìnéng qǔnuǎnqì kěyǐ gēnjù shìwēn zìdòng tiáojié gōnglǜ, jiéshěng néngyuán.",
      "sentence_fr": "Le radiateur intelligent peut ajuster automatiquement la puissance selon la température ambiante, économisant l'énergie.",
      "sentence_en": "The smart heater can automatically adjust power based on room temperature, saving energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_heaters",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高山族的歌舞是台湾原住民独特的文化艺术表现形式。",
      "sentence_pinyin": "Gāoshānzú de gēwǔ shì Táiwān yuánzhùmín dútè de wénhuà yìshù biǎoxiàn xíngshì.",
      "sentence_fr": "Les chants et danses des Gaoshan sont une forme d'expression artistique et culturelle unique des autochtones de Taiwan.",
      "sentence_en": "Gaoshan ethnic group's songs and dances are unique cultural and artistic expressions of Taiwan's indigenous people.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gaoshan_culture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社区设立的图书角为居民提供了便捷的阅读服务。",
      "sentence_pinyin": "Shèqū shèlì de túshūjiǎo wèi jūmín tígōng le biànjié de yuèdú fúwù.",
      "sentence_fr": "Les coins lecture installés par la communauté offrent aux résidents des services de lecture pratiques.",
      "sentence_en": "Community book corners provide residents with convenient reading services.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_book_corners",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能榨汁机可以保留水果的营养成分,制作新鲜健康的果汁。",
      "sentence_pinyin": "Zhìnéng zhàzhījī kěyǐ bǎoliú shuǐguǒ de yíngyǎng chéngfèn, zhìzuò xīnxiān jiànkāng de guǒzhī.",
      "sentence_fr": "Le presse-agrumes intelligent peut préserver les nutriments des fruits, préparant des jus frais et sains.",
      "sentence_en": "The smart juicer can preserve the nutrients of fruits, making fresh and healthy juice.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_juicers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中国传统的清明节扫墓习俗表达了对先人的缅怀和敬意。",
      "sentence_pinyin": "Zhōngguó chuántǒng de Qīngmíngjié sǎomù xísú biǎodá le duì xiānrén de miǎnhuái hé jìngyì.",
      "sentence_fr": "La coutume traditionnelle chinoise de visiter les tombes pendant la Fête Qingming exprime le souvenir et le respect des ancêtres.",
      "sentence_en": "The traditional Chinese custom of tomb sweeping during Qingming Festival expresses remembrance and respect for ancestors.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "qingming_festival",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
