{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "自我心理学研究自我概念、自尊和身份认同的心理发展。",
      "sentence_pinyin": "Zìwǒ xīnlǐxué yánjiū zìwǒ gàiniàn, zìzūn hé shēnfèn rèntóng de xīnlǐ fāzhǎn.",
      "sentence_fr": "La psychologie du soi étudie le développement psychologique du concept de soi, de l'estime de soi et de l'identité.",
      "sentence_en": "Self psychology studies the psychological development of self-concept, self-esteem, and identity.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "self_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子力学描述原子和亚原子粒子的行为和相互作用。",
      "sentence_pinyin": "Liàngzǐ lìxué miáoshù yuánzǐ hé yà yuánzǐ lìzǐ de xíngwéi hé xiānghù zuòyòng.",
      "sentence_fr": "La mécanique quantique décrit le comportement et les interactions des particules atomiques et subatomiques.",
      "sentence_en": "Quantum mechanics describes the behavior and interactions of atomic and subatomic particles.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "quantum_mechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "消费者行为研究分析购买决策和品牌忠诚度的影响因素。",
      "sentence_pinyin": "Xiāofèi zhě xíngwéi yánjiū fēnxī gòumǎi juécè hé pǐnpái zhōngchéngdù de yǐngxiǎng yīnsù.",
      "sentence_fr": "La recherche sur le comportement du consommateur analyse les facteurs influençant les décisions d'achat et la fidélité à la marque.",
      "sentence_en": "Consumer behavior research analyzes factors influencing purchase decisions and brand loyalty.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "consumer_behavior_research",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合规性框架确保组织遵守行业法规和数据保护法律。",
      "sentence_pinyin": "Héguīxìng kuàngjià quèbǎo zǔzhī zūnshǒu hángyè fǎguī hé shùjù bǎohù fǎlǜ.",
      "sentence_fr": "Les cadres de conformité garantissent que les organisations respectent les réglementations de l'industrie et les lois sur la protection des données.",
      "sentence_en": "Compliance frameworks ensure organizations comply with industry regulations and data protection laws.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "compliance_frameworks",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "压力和应对心理学研究人们如何管理生活中的挑战和困难。",
      "sentence_pinyin": "Yālì hé yìngduì xīnlǐxué yánjiū rénmen rúhé guǎnlǐ shēnghuó zhōng de tiǎozhàn hé kùnnán.",
      "sentence_fr": "La psychologie du stress et de l'adaptation étudie comment les gens gèrent les défis et les difficultés de la vie.",
      "sentence_en": "Stress and coping psychology studies how people manage life's challenges and difficulties.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stress_coping",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声学研究声音的产生、传播和接收的物理原理。",
      "sentence_pinyin": "Shēngxué yánjiū shēngyīn de chǎnshēng, chuánbō hé jiēshōu de wùlǐ yuánlǐ.",
      "sentence_fr": "L'acoustique étudie les principes physiques de la production, de la propagation et de la réception du son.",
      "sentence_en": "Acoustics studies the physical principles of sound production, propagation, and reception.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "acoustics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数字营销利用在线渠道和社交媒体来推广产品和服务。",
      "sentence_pinyin": "Shùzì yíngxiāo lìyòng zàixiàn qúdào hé shèjiāo méitǐ lái tuīguǎng chǎnpǐn hé fúwù.",
      "sentence_fr": "Le marketing numérique utilise les canaux en ligne et les médias sociaux pour promouvoir les produits et services.",
      "sentence_en": "Digital marketing uses online channels and social media to promote products and services.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "digital_marketing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全信息和事件管理系统集中监控和分析安全日志数据。",
      "sentence_pinyin": "Ānquán xìnxī hé shìjiàn guǎnlǐ xìtǒng jízhōng jiānkòng hé fēnxī ānquán rìzhì shùjù.",
      "sentence_fr": "Les systèmes de gestion des informations et des événements de sécurité centralisent la surveillance et l'analyse des données des journaux de sécurité.",
      "sentence_en": "Security information and event management systems centralize monitoring and analysis of security log data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "siem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "人际关系心理学研究亲密关系、友谊和社会联系的形成与维持。",
      "sentence_pinyin": "Rénjì guānxì xīnlǐxué yánjiū qīnmì guānxì, yǒuyì hé shèhuì liánxì de xíngchéng yǔ wéichí.",
      "sentence_fr": "La psychologie des relations interpersonnelles étudie la formation et le maintien des relations intimes, des amitiés et des liens sociaux.",
      "sentence_en": "Interpersonal relationship psychology studies the formation and maintenance of intimate relationships, friendships, and social connections.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "interpersonal_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "固体物理学研究晶体结构和固态材料的电子性质。",
      "sentence_pinyin": "Gùtǐ wùlǐxué yánjiū jīngtǐ jiégòu hé gùtài cáiliào de diànzǐ xìngzhì.",
      "sentence_fr": "La physique du solide étudie les structures cristallines et les propriétés électroniques des matériaux à l'état solide.",
      "sentence_en": "Solid state physics studies crystal structures and electronic properties of solid materials.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solid_state_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电子商务平台改变了消费者购物和企业销售的方式。",
      "sentence_pinyin": "Diànzǐ shāngwù píngtái gǎibiànle xiāofèi zhě gòuwù hé qǐyè xiāoshòu de fāngshì.",
      "sentence_fr": "Les plateformes de commerce électronique ont changé la façon dont les consommateurs achètent et dont les entreprises vendent.",
      "sentence_en": "E-commerce platforms have changed how consumers shop and businesses sell.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "e_commerce",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "安全运营中心全天候监控组织的网络安全态势。",
      "sentence_pinyin": "Ānquán yùnyíng zhōngxīn quántiānhòu jiānkòng zǔzhī de wǎngluò ānquán tàishì.",
      "sentence_fr": "Les centres d'opérations de sécurité surveillent la posture de cybersécurité de l'organisation 24 heures sur 24.",
      "sentence_en": "Security operations centers monitor the organization's cybersecurity posture around the clock.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "security_operations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "群体心理学研究人群行为和集体决策的动态过程。",
      "sentence_pinyin": "Qúntǐ xīnlǐxué yánjiū rénqún xíngwéi hé jítǐ juécè de dòngtài guòchéng.",
      "sentence_fr": "La psychologie de groupe étudie les processus dynamiques du comportement de la foule et de la prise de décision collective.",
      "sentence_en": "Group psychology studies the dynamic processes of crowd behavior and collective decision-making.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "group_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "半导体物理学研究半导体材料的电子行为和器件应用。",
      "sentence_pinyin": "Bàndǎotǐ wùlǐxué yánjiū bàndǎotǐ cáiliào de diànzǐ xíngwéi hé qìjiàn yìngyòng.",
      "sentence_fr": "La physique des semi-conducteurs étudie le comportement électronique des matériaux semi-conducteurs et leurs applications dans les dispositifs.",
      "sentence_en": "Semiconductor physics studies the electronic behavior of semiconductor materials and device applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "semiconductor_physics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "品牌管理建立和维护消费者对品牌的认知和情感联系。",
      "sentence_pinyin": "Pǐnpái guǎnlǐ jiànlì hé wéihù xiāofèi zhě duì pǐnpái de rènzhī hé qínggǎn liánxì.",
      "sentence_fr": "La gestion de marque établit et maintient la reconnaissance des consommateurs et leurs liens émotionnels avec la marque.",
      "sentence_en": "Brand management establishes and maintains consumer recognition and emotional connections with brands.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "brand_management",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "零信任安全模型假设网络内外的任何实体都不应自动信任。",
      "sentence_pinyin": "Líng xìnrèn ānquán móxíng jiǎshè wǎngluò nèiwài de rènhé shítǐ dōu bù yīng zìdòng xìnrèn.",
      "sentence_fr": "Le modèle de sécurité à confiance zéro suppose qu'aucune entité à l'intérieur ou à l'extérieur du réseau ne devrait être automatiquement approuvée.",
      "sentence_en": "The zero trust security model assumes no entity inside or outside the network should be automatically trusted.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "zero_trust_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环境心理学探讨自然和建筑环境对人类心理健康的影响。",
      "sentence_pinyin": "Huánjìng xīnlǐxué tàntǎo zìrán hé jiànzhù huánjìng duì rénlèi xīnlǐ jiànkāng de yǐngxiǎng.",
      "sentence_fr": "La psychologie environnementale explore l'impact des environnements naturels et bâtis sur la santé mentale humaine.",
      "sentence_en": "Environmental psychology explores the impact of natural and built environments on human mental health.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "environmental_psychology_health",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "超导体在低温下表现出零电阻和完全抗磁性的特性。",
      "sentence_pinyin": "Chāodǎotǐ zài dīwēn xià biǎoxiàn chū líng diànzǔ hé wánquán kàng cíxìng de tèxìng.",
      "sentence_fr": "Les supraconducteurs présentent une résistance électrique nulle et un diamagnétisme parfait à basse température.",
      "sentence_en": "Superconductors exhibit zero electrical resistance and perfect diamagnetism at low temperatures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "superconductivity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "客户关系管理系统帮助企业跟踪和管理客户互动历史。",
      "sentence_pinyin": "Kèhù guānxì guǎnlǐ xìtǒng bāngzhù qǐyè zhuīzōng hé guǎnlǐ kèhù hùdòng lìshǐ.",
      "sentence_fr": "Les systèmes de gestion de la relation client aident les entreprises à suivre et à gérer l'historique des interactions avec les clients.",
      "sentence_en": "Customer relationship management systems help businesses track and manage customer interaction history.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "crm_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "恶意软件分析研究病毒、木马和勒索软件的行为和防御方法。",
      "sentence_pinyin": "Èyì ruǎnjiàn fēnxī yánjiū bìngdú, mùmǎ hé lèsuǒ ruǎnjiàn de xíngwéi hé fángyù fāngfǎ.",
      "sentence_fr": "L'analyse des logiciels malveillants étudie le comportement des virus, des chevaux de Troie et des rançongiciels ainsi que les méthodes de défense.",
      "sentence_en": "Malware analysis studies the behavior of viruses, trojans, and ransomware and defense methods.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "malware_analysis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
