{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "柯伊伯带是海王星轨道外的小天体聚集区域。",
      "sentence_pinyin": "Kēyībó dài shì hǎiwángxīng guǐdào wài de xiǎo tiāntǐ jùjí qūyù.",
      "sentence_fr": "La ceinture de Kuiper est une région d'accumulation de petits objets célestes au-delà de l'orbite de Neptune.",
      "sentence_en": "The Kuiper Belt is a region of small celestial object accumulation beyond Neptune's orbit.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "kuiper_belt",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "资产证券化将非流动性资产转化为可交易的金融证券。",
      "sentence_pinyin": "Zīchǎn zhèngquànhuà jiāng fēi liúdòngxìng zīchǎn zhuǎnhuà wéi kě jiāoyì de jīnróng zhèngquàn.",
      "sentence_fr": "La titrisation transforme les actifs non liquides en titres financiers négociables.",
      "sentence_en": "Asset securitization transforms illiquid assets into tradable financial securities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "asset_securitization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "缓存策略通过存储常用数据来减少数据库查询延迟。",
      "sentence_pinyin": "Huǎncún cèlüè tōngguò cúnchǔ chángyòng shùjù lái jiǎnshǎo shùjùkù cháxún yánchí.",
      "sentence_fr": "Les stratégies de mise en cache réduisent la latence des requêtes de base de données en stockant les données fréquemment utilisées.",
      "sentence_en": "Caching strategies reduce database query latency by storing frequently used data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "caching_strategies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "感质问题探讨主观意识体验是否能被客观科学解释。",
      "sentence_pinyin": "Gǎnzhì wèntí tàntǎo zhǔguān yìshí tǐyàn shìfǒu néng bèi kèguān kēxué jiěshì.",
      "sentence_fr": "Le problème des qualia explore si l'expérience consciente subjective peut être expliquée par la science objective.",
      "sentence_en": "The qualia problem explores whether subjective conscious experience can be explained by objective science.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "qualia_problem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据库分片将大型数据集分布到多个服务器上存储。",
      "sentence_pinyin": "Shùjùkù fēnpiàn jiāng dàxíng shùjùjí fēnbù dào duō gè fúwùqì shàng cúnchǔ.",
      "sentence_fr": "Le sharding de base de données distribue de grands ensembles de données sur plusieurs serveurs pour le stockage.",
      "sentence_en": "Database sharding distributes large datasets across multiple servers for storage.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "database_sharding",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "奥尔特云是太阳系最外层的彗星储存库区域。",
      "sentence_pinyin": "Ào'ěrtè yún shì tàiyángxì zuì wàicéng de huìxīng chǔcúnkù qūyù.",
      "sentence_fr": "Le nuage d'Oort est la région de stockage des comètes la plus externe du système solaire.",
      "sentence_en": "The Oort Cloud is the outermost comet reservoir region of the solar system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "oort_cloud",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "金融去中心化利用区块链技术重构传统金融服务模式。",
      "sentence_pinyin": "Jīnróng qù zhōngxīnhuà lìyòng qūkuàiliàn jìshù chónggòu chuántǒng jīnróng fúwù móshì.",
      "sentence_fr": "La finance décentralisée utilise la technologie blockchain pour restructurer les modèles de services financiers traditionnels.",
      "sentence_en": "Decentralized finance uses blockchain technology to restructure traditional financial service models.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "decentralized_finance",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "消息队列系统实现分布式应用之间的异步通信解耦。",
      "sentence_pinyin": "Xiāoxī duìliè xìtǒng shíxiàn fēnbùshì yìngyòng zhījiān de yìbù tōngxìn jiěǒu.",
      "sentence_fr": "Les systèmes de files d'attente de messages permettent la communication asynchrone découplée entre applications distribuées.",
      "sentence_en": "Message queue systems enable asynchronous decoupled communication between distributed applications.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "message_queues",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "心身问题是理解意识与物质关系的核心哲学难题。",
      "sentence_pinyin": "Xīnshēn wèntí shì lǐjiě yìshí yǔ wùzhì guānxì de héxīn zhéxué nántí.",
      "sentence_fr": "Le problème corps-esprit est un problème philosophique central pour comprendre la relation entre conscience et matière.",
      "sentence_en": "The mind-body problem is a central philosophical puzzle for understanding the relationship between consciousness and matter.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mind_body_problem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "事件驱动架构通过发布订阅模式实现组件间的松耦合。",
      "sentence_pinyin": "Shìjiàn qūdòng jiàgòu tōngguò fābù dìngyuè móshì shíxiàn zǔjiàn jiān de sōng ǒuhé.",
      "sentence_fr": "L'architecture événementielle réalise un couplage faible entre composants via le modèle publication-abonnement.",
      "sentence_en": "Event-driven architecture achieves loose coupling between components through the publish-subscribe pattern.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "event_driven_architecture",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "小行星带位于火星和木星轨道之间包含数百万岩石天体。",
      "sentence_pinyin": "Xiǎoxíngxīng dài wèiyú huǒxīng hé mùxīng guǐdào zhījiān bāohán shù bǎi wàn yánshí tiāntǐ.",
      "sentence_fr": "La ceinture d'astéroïdes se situe entre les orbites de Mars et Jupiter et contient des millions de corps rocheux.",
      "sentence_en": "The asteroid belt lies between the orbits of Mars and Jupiter and contains millions of rocky bodies.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "asteroid_belt",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "智能合约自动执行预先编程的协议条款而无需中介。",
      "sentence_pinyin": "Zhìnéng héyuē zìdòng zhíxíng yùxiān biānchéng de xiéyì tiáokuǎn ér wúxū zhōngjiè.",
      "sentence_fr": "Les contrats intelligents exécutent automatiquement les termes d'un accord préprogrammé sans intermédiaire.",
      "sentence_en": "Smart contracts automatically execute pre-programmed agreement terms without intermediaries.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "smart_contracts",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "一致性算法确保分布式系统中多个节点的数据同步。",
      "sentence_pinyin": "Yīzhìxìng suànfǎ quèbǎo fēnbùshì xìtǒng zhōng duō gè jiédiǎn de shùjù tóngbù.",
      "sentence_fr": "Les algorithmes de consensus assurent la synchronisation des données entre plusieurs nœuds dans les systèmes distribués.",
      "sentence_en": "Consensus algorithms ensure data synchronization across multiple nodes in distributed systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "consensus_algorithms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "涌现性是指复杂系统表现出其组成部分不具备的新特性。",
      "sentence_pinyin": "Yǒngxiànxìng shì zhǐ fùzá xìtǒng biǎoxiàn chū qí zǔchéng bùfèn bù jùbèi de xīn tèxìng.",
      "sentence_fr": "L'émergence désigne les nouvelles propriétés qu'un système complexe manifeste et que ses composants ne possèdent pas.",
      "sentence_en": "Emergence refers to new properties that complex systems exhibit that their components do not possess.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "emergence_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "图数据库优化存储和查询实体之间复杂关系网络。",
      "sentence_pinyin": "Tú shùjùkù yōuhuà cúnchǔ hé cháxún shítǐ zhījiān fùzá guānxì wǎngluò.",
      "sentence_fr": "Les bases de données graphes optimisent le stockage et l'interrogation des réseaux de relations complexes entre entités.",
      "sentence_en": "Graph databases optimize storing and querying complex relationship networks between entities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "graph_databases",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "彗星是由冰和尘埃组成的小天体在靠近太阳时形成彗尾。",
      "sentence_pinyin": "Huìxīng shì yóu bīng hé chéntǔ zǔchéng de xiǎo tiāntǐ zài kàojìn tàiyáng shí xíngchéng huìwěi.",
      "sentence_fr": "Les comètes sont de petits corps célestes composés de glace et de poussière qui forment une queue en s'approchant du Soleil.",
      "sentence_en": "Comets are small celestial bodies composed of ice and dust that form tails when approaching the Sun.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "comet_astronomy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "稳定币通过与法定货币或资产挂钩来维持价格稳定。",
      "sentence_pinyin": "Wěndìngbì tōngguò yǔ fǎdìng huòbì huò zīchǎn guàgōu lái wéichí jiàgé wěndìng.",
      "sentence_fr": "Les stablecoins maintiennent la stabilité des prix en étant indexés sur des monnaies fiduciaires ou des actifs.",
      "sentence_en": "Stablecoins maintain price stability by being pegged to fiat currencies or assets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stablecoins",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "流处理系统实时分析连续数据流并即时生成洞察。",
      "sentence_pinyin": "Liú chǔlǐ xìtǒng shíshí fēnxī liánxù shùjù liú bìng jíshí shēngchéng dòngchá.",
      "sentence_fr": "Les systèmes de traitement de flux analysent les flux de données continus en temps réel et génèrent des insights instantanément.",
      "sentence_en": "Stream processing systems analyze continuous data flows in real-time and generate insights instantly.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stream_processing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "还原论试图通过分析基本组成部分来解释复杂现象。",
      "sentence_pinyin": "Huányuánlùn shìtú tōngguò fēnxī jīběn zǔchéng bùfèn lái jiěshì fùzá xiànxiàng.",
      "sentence_fr": "Le réductionnisme tente d'expliquer les phénomènes complexes en analysant leurs composants fondamentaux.",
      "sentence_en": "Reductionism attempts to explain complex phenomena by analyzing their fundamental components.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reductionism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "时间序列数据库专门优化存储和查询带时间戳的数据。",
      "sentence_pinyin": "Shíjiān xùliè shùjùkù zhuānmén yōuhuà cúnchǔ hé cháxún dài shíjiān chuō de shùjù.",
      "sentence_fr": "Les bases de données de séries temporelles sont spécialement optimisées pour stocker et interroger des données horodatées.",
      "sentence_en": "Time series databases are specifically optimized for storing and querying timestamped data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "time_series_databases",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
