{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "应用语言学将语言学理论应用于解决语言教学和翻译等实际问题。",
      "sentence_pinyin": "Yìngyòng yǔyánxué jiāng yǔyánxué lǐlùn yìngyòng yú jiějué yǔyán jiàoxué hé fānyì děng shíjì wèntí.",
      "sentence_fr": "La linguistique appliquée applique les théories linguistiques pour résoudre des problèmes pratiques tels que l'enseignement des langues et la traduction.",
      "sentence_en": "Applied linguistics applies linguistic theories to solve practical problems such as language teaching and translation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "applied_linguistics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "云原生架构充分利用云计算的弹性、可扩展性和自动化能力。",
      "sentence_pinyin": "Yún yuánshēng jiàgòu chōngfèn lìyòng yún jìsuàn de tánxìng, kě kuòzhǎn xìng hé zìdònghuà nénglì.",
      "sentence_fr": "L'architecture cloud-native exploite pleinement l'élasticité, l'évolutivité et les capacités d'automatisation du cloud computing.",
      "sentence_en": "Cloud-native architecture fully leverages the elasticity, scalability, and automation capabilities of cloud computing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cloud_native",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "保护生物学开发策略来保护濒危物种和恢复退化的栖息地。",
      "sentence_pinyin": "Bǎohù shēngwùxué kāifā cèlüè lái bǎohù bīnwēi wùzhǒng hé huīfù tuìhuà de qīxīdì.",
      "sentence_fr": "La biologie de la conservation développe des stratégies pour protéger les espèces menacées et restaurer les habitats dégradés.",
      "sentence_en": "Conservation biology develops strategies to protect endangered species and restore degraded habitats.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "conservation_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "公共选择理论将经济分析工具应用于研究政治决策过程。",
      "sentence_pinyin": "Gōnggòng xuǎnzé lǐlùn jiāng jīngjì fēnxī gōngjù yìngyòng yú yánjiū zhèngzhì juécè guòchéng.",
      "sentence_fr": "La théorie du choix public applique les outils d'analyse économique à l'étude des processus de décision politique.",
      "sentence_en": "Public choice theory applies economic analysis tools to study political decision-making processes.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "public_choice_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "生物力学分析人体运动和肌肉骨骼系统的力学原理。",
      "sentence_pinyin": "Shēngwù lìxué fēnxī réntǐ yùndòng hé jīròu gǔgé xìtǒng de lìxué yuánlǐ.",
      "sentence_fr": "La biomécanique analyse les principes mécaniques du mouvement humain et du système musculo-squelettique.",
      "sentence_en": "Biomechanics analyzes the mechanical principles of human movement and the musculoskeletal system.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "biomechanics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "机器翻译系统利用神经网络在不同语言之间自动转换文本。",
      "sentence_pinyin": "Jīqì fānyì xìtǒng lìyòng shénjīng wǎngluò zài bùtóng yǔyán zhījiān zìdòng zhuǎnhuàn wénběn.",
      "sentence_fr": "Les systèmes de traduction automatique utilisent des réseaux neuronaux pour convertir automatiquement du texte entre différentes langues.",
      "sentence_en": "Machine translation systems use neural networks to automatically convert text between different languages.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "machine_translation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "农业经济学研究农业生产、食品分配和农村发展的经济问题。",
      "sentence_pinyin": "Nóngyè jīngjìxué yánjiū nóngyè shēngchǎn, shípǐn fēnpèi hé nóngcūn fāzhǎn de jīngjì wèntí.",
      "sentence_fr": "L'économie agricole étudie les questions économiques de la production agricole, de la distribution alimentaire et du développement rural.",
      "sentence_en": "Agricultural economics studies economic issues of agricultural production, food distribution, and rural development.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "agricultural_economics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代码审查是确保软件质量和知识共享的重要开发实践。",
      "sentence_pinyin": "Dàimǎ shěnchá shì quèbǎo ruǎnjiàn zhìliàng hé zhīshi gòngxiǎng de zhòngyào kāifā shíjiàn.",
      "sentence_fr": "La révision de code est une pratique de développement importante pour assurer la qualité des logiciels et le partage des connaissances.",
      "sentence_en": "Code review is an important development practice for ensuring software quality and knowledge sharing.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "code_review",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "法医学应用医学和科学知识来协助法律调查和司法程序。",
      "sentence_pinyin": "Fǎyīxué yìngyòng yīxué hé kēxué zhīshi lái xiézhù fǎlǜ diàochá hé sīfǎ chéngxù.",
      "sentence_fr": "La médecine légale applique les connaissances médicales et scientifiques pour aider les enquêtes juridiques et les procédures judiciaires.",
      "sentence_en": "Forensic medicine applies medical and scientific knowledge to assist legal investigations and judicial proceedings.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "forensic_medicine",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "河流生态学研究河流生态系统的结构、功能和人类活动的影响。",
      "sentence_pinyin": "Héliú shēngtàixué yánjiū héliú shēngtài xìtǒng de jiégòu, gōngnéng hé rénlèi huódòng de yǐngxiǎng.",
      "sentence_fr": "L'écologie fluviale étudie la structure, la fonction des écosystèmes fluviaux et l'impact des activités humaines.",
      "sentence_en": "River ecology studies the structure, function of river ecosystems and the impact of human activities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "river_ecology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "儿童心理学研究从出生到青春期的认知、情感和社会发展。",
      "sentence_pinyin": "Értóng xīnlǐxué yánjiū cóng chūshēng dào qīngchūnqī de rènzhī, qínggǎn hé shèhuì fāzhǎn.",
      "sentence_fr": "La psychologie de l'enfant étudie le développement cognitif, émotionnel et social de la naissance à l'adolescence.",
      "sentence_en": "Child psychology studies cognitive, emotional, and social development from birth to adolescence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "child_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "反应式编程范式使应用程序能够更好地处理异步数据流。",
      "sentence_pinyin": "Fǎnyìngshì biānchéng fànshì shǐ yìngyòng chéngxù nénggòu gèng hǎo de chǔlǐ yìbù shùjù liú.",
      "sentence_fr": "Le paradigme de programmation réactive permet aux applications de mieux gérer les flux de données asynchrones.",
      "sentence_en": "The reactive programming paradigm enables applications to better handle asynchronous data streams.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "reactive_programming",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "科学哲学探讨科学方法、知识本质和科学进步的基本问题。",
      "sentence_pinyin": "Kēxué zhéxué tàntǎo kēxué fāngfǎ, zhīshi běnzhì hé kēxué jìnbù de jīběn wèntí.",
      "sentence_fr": "La philosophie des sciences explore les questions fondamentales de la méthode scientifique, de la nature de la connaissance et du progrès scientifique.",
      "sentence_en": "Philosophy of science explores fundamental questions about scientific method, the nature of knowledge, and scientific progress.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "philosophy_of_science",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "细胞生物学研究细胞的结构、功能、分裂和死亡的基本过程。",
      "sentence_pinyin": "Xìbāo shēngwùxué yánjiū xìbāo de jiégòu, gōngnéng, fēnliè hé sǐwáng de jīběn guòchéng.",
      "sentence_fr": "La biologie cellulaire étudie les processus fondamentaux de la structure, de la fonction, de la division et de la mort des cellules.",
      "sentence_en": "Cell biology studies the fundamental processes of cell structure, function, division, and death.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cell_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "技术债务概念描述了快速开发决策如何导致未来的维护成本增加。",
      "sentence_pinyin": "Jìshù zhàiwù gàiniàn miáoshùle kuàisù kāifā juécè rúhé dǎozhì wèilái de wéihù chéngběn zēngjiā.",
      "sentence_fr": "Le concept de dette technique décrit comment les décisions de développement rapide entraînent une augmentation des coûts de maintenance futurs.",
      "sentence_en": "The technical debt concept describes how rapid development decisions lead to increased future maintenance costs.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "technical_debt",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "经济社会学研究经济行为如何嵌入社会关系和制度背景之中。",
      "sentence_pinyin": "Jīngjì shèhuìxué yánjiū jīngjì xíngwéi rúhé qiànrù shèhuì guānxì hé zhìdù bèijǐng zhīzhōng.",
      "sentence_fr": "La sociologie économique étudie comment le comportement économique est ancré dans les relations sociales et le contexte institutionnel.",
      "sentence_en": "Economic sociology studies how economic behavior is embedded in social relations and institutional context.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "economic_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "植物生理学研究植物的光合作用、营养吸收和生长调控机制。",
      "sentence_pinyin": "Zhíwù shēnglǐxué yánjiū zhíwù de guānghé zuòyòng, yíngyǎng xīshōu hé shēngzhǎng tiáokòng jīzhì.",
      "sentence_fr": "La physiologie végétale étudie la photosynthèse, l'absorption des nutriments et les mécanismes de régulation de la croissance des plantes.",
      "sentence_en": "Plant physiology studies photosynthesis, nutrient absorption, and growth regulation mechanisms in plants.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "plant_physiology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "密码学为信息安全提供加密、认证和数字签名等核心技术。",
      "sentence_pinyin": "Mìmǎxué wèi xìnxī ānquán tígōng jiāmì, rènzhèng hé shùzì qiānmíng děng héxīn jìshù.",
      "sentence_fr": "La cryptographie fournit des technologies de base pour la sécurité de l'information telles que le chiffrement, l'authentification et les signatures numériques.",
      "sentence_en": "Cryptography provides core technologies for information security such as encryption, authentication, and digital signatures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cryptography",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "教育心理学研究学习过程和影响学生成就的认知和动机因素。",
      "sentence_pinyin": "Jiàoyù xīnlǐxué yánjiū xuéxí guòchéng hé yǐngxiǎng xuéshēng chéngjiù de rènzhī hé dòngjī yīnsù.",
      "sentence_fr": "La psychologie de l'éducation étudie les processus d'apprentissage et les facteurs cognitifs et motivationnels affectant la réussite des étudiants.",
      "sentence_en": "Educational psychology studies learning processes and cognitive and motivational factors affecting student achievement.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "educational_psychology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可持续发展目标为解决全球贫困、不平等和环境问题提供了框架。",
      "sentence_pinyin": "Kě chíxù fāzhǎn mùbiāo wèi jiějué quánqiú pínkùn, bù píngděng hé huánjìng wèntí tígōngle kuàngjià.",
      "sentence_fr": "Les objectifs de développement durable fournissent un cadre pour résoudre les problèmes mondiaux de pauvreté, d'inégalité et d'environnement.",
      "sentence_en": "Sustainable development goals provide a framework for addressing global poverty, inequality, and environmental issues.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sustainable_development_goals",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
