{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个产业扶贫基地通过订单农业模式帮助农民稳定增收。",
      "sentence_pinyin": "Zhège chǎnyè fúpín jīdì tōngguò dìngdān nóngyè móshì bāngzhù nóngmín wěndìng zēngshōu.",
      "sentence_fr": "Cette base de réduction de la pauvreté par l'industrie aide les agriculteurs à augmenter leurs revenus de manière stable grâce au modèle d'agriculture contractuelle.",
      "sentence_en": "This industrial poverty alleviation base helps farmers increase income stably through the contract farming model.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "industrial_poverty_relief",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在花鼓戏表演中展现了欢快活泼的地方戏曲风格。",
      "sentence_pinyin": "Tā zài huāgǔxì biǎoyǎn zhōng zhǎnxiànle huānkuài huópō de dìfāng xìqǔ fēnggé.",
      "sentence_fr": "Dans sa performance d'opéra Huagu, elle a démontré un style d'opéra local joyeux et vif.",
      "sentence_en": "In her Huagu Opera performance, she demonstrated a cheerful and lively local opera style.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "huagu_opera",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能热水器可以根据用水习惯自动预热并节约能源。",
      "sentence_pinyin": "Zhège zhìnéng rèshuǐqì kěyǐ gēnjù yòngshuǐ xíguàn zìdòng yùrè bìng jiéyuē néngyuán.",
      "sentence_fr": "Ce chauffe-eau intelligent peut automatiquement préchauffer selon les habitudes de consommation d'eau et économiser l'énergie.",
      "sentence_en": "This smart water heater can automatically preheat based on water usage habits and save energy.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_water_heaters",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在随笔写作中用朴实的文字记录了生活的点滴感动。",
      "sentence_pinyin": "Tā zài suíbǐ xiězuò zhōng yòng pǔshí de wénzì jìlùle shēnghuó de diǎndī gǎndòng.",
      "sentence_fr": "Dans l'écriture d'essais libres, il enregistre avec des mots simples les petits moments touchants de la vie.",
      "sentence_en": "In casual essay writing, he records the little touching moments of life with simple words.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "casual_essays",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个流浪乞讨人员救助站为困难人群提供临时住宿和返乡帮助。",
      "sentence_pinyin": "Zhège liúlàng qǐtǎo rényuán jiùzhù zhàn wèi kùnnan rénqún tígōng línshí zhùsù hé fǎnxiāng bāngzhù.",
      "sentence_fr": "Ce centre d'assistance pour les personnes sans-abri et mendiantes fournit un hébergement temporaire et une aide au retour pour les personnes en difficulté.",
      "sentence_en": "This aid station for homeless and begging persons provides temporary accommodation and return assistance for people in difficulty.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "homeless_assistance",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的插画设计为儿童图书增添了生动活泼的视觉效果。",
      "sentence_pinyin": "Tā de chāhuà shèjì wèi értóng túshū zēngtiānle shēngdòng huópō de shìjué xiàoguǒ.",
      "sentence_fr": "Sa conception d'illustrations ajoute des effets visuels vivants et animés aux livres pour enfants.",
      "sentence_en": "Her illustration design adds lively and animated visual effects to children's books.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "illustration_design",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个退耕还林工程将陡坡农田改造成了生态林地。",
      "sentence_pinyin": "Zhège tuìgēng huánlín gōngchéng jiāng dǒupō nóngtián gǎizào chéngle shēngtài líndì.",
      "sentence_fr": "Ce projet de reconversion des terres cultivées en forêts a transformé les terres agricoles en pente raide en terres forestières écologiques.",
      "sentence_en": "This grain-to-green project transformed steep slope farmland into ecological forestland.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "reforestation",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在定向越野比赛中展现了识图能力和野外生存技能。",
      "sentence_pinyin": "Tā zài dìngxiàng yuèyě bǐsài zhōng zhǎnxiànle shítú nénglì hé yěwài shēngcún jìnéng.",
      "sentence_fr": "Il a démontré des capacités de lecture de carte et des compétences de survie en plein air lors de la course d'orientation.",
      "sentence_en": "He demonstrated map reading ability and wilderness survival skills in the orienteering competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "orienteering",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个邻里中心为社区居民搭建了交流互助的平台。",
      "sentence_pinyin": "Zhège línlǐ zhōngxīn wèi shèqū jūmín dājiànle jiāoliú hùzhù de píngtái.",
      "sentence_fr": "Ce centre de voisinage a construit une plateforme d'échange et d'entraide pour les résidents de la communauté.",
      "sentence_en": "This neighborhood center built an exchange and mutual assistance platform for community residents.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "neighborhood_centers",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在草木染工艺中用天然植物染料染出了自然柔和的色彩。",
      "sentence_pinyin": "Tā zài cǎomù rǎn gōngyì zhōng yòng tiānrán zhíwù rǎnliào rǎn chūle zìrán róuhé de sècǎi.",
      "sentence_fr": "Dans l'artisanat de teinture végétale, elle a teint des couleurs naturelles et douces avec des colorants végétaux naturels.",
      "sentence_en": "In botanical dyeing craftsmanship, she dyed natural and soft colors with natural plant dyes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "botanical_dyeing",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能冰箱可以识别食材并推荐健康食谱。",
      "sentence_pinyin": "Zhège zhìnéng bīngxiāng kěyǐ shíbié shícái bìng tuījiàn jiànkāng shípǔ.",
      "sentence_fr": "Ce réfrigérateur intelligent peut identifier les ingrédients et recommander des recettes santé.",
      "sentence_en": "This smart refrigerator can identify ingredients and recommend healthy recipes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_refrigerators",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在箜篌演奏中探索了古乐器的现代表现可能性。",
      "sentence_pinyin": "Tā zài kōnghóu yǎnzòu zhōng tànsuǒle gǔ yuèqì de xiàndài biǎoxiàn kěnéngxìng.",
      "sentence_fr": "Il a exploré les possibilités d'expression modernes de cet instrument ancien dans son jeu de konghou.",
      "sentence_en": "He explored modern expression possibilities of the ancient instrument in his konghou performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "konghou_music",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个传染病监测网络实时追踪疫情动态并发布预警信息。",
      "sentence_pinyin": "Zhège chuánrǎnbìng jiāncè wǎngluò shíshí zhuīzōng yìqíng dòngtài bìng fābù yùjǐng xìnxī.",
      "sentence_fr": "Ce réseau de surveillance des maladies infectieuses suit en temps réel la dynamique épidémique et publie des informations d'alerte.",
      "sentence_en": "This infectious disease surveillance network tracks epidemic dynamics in real-time and releases warning information.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "disease_surveillance",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的行为艺术作品用身体语言表达了对当代社会的思考。",
      "sentence_pinyin": "Tā de xíngwéi yìshù zuòpǐn yòng shēntǐ yǔyán biǎodále duì dāngdài shèhuì de sīkǎo.",
      "sentence_fr": "Ses œuvres d'art performance expriment des réflexions sur la société contemporaine à travers le langage corporel.",
      "sentence_en": "Her performance art works express reflections on contemporary society through body language.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "performance_art",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个洪涝灾害预警系统监测降雨量并预测洪水风险。",
      "sentence_pinyin": "Zhège hóngláo zāihài yùjǐng xìtǒng jiāncè jiàngyǔliàng bìng yùcè hóngshuǐ fēngxiǎn.",
      "sentence_fr": "Ce système d'alerte aux inondations surveille les précipitations et prédit les risques d'inondation.",
      "sentence_en": "This flood disaster warning system monitors rainfall and predicts flood risks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "flood_warning",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在舞台美术设计中创造了符合剧情需要的视觉空间。",
      "sentence_pinyin": "Tā zài wǔtái měishù shèjì zhōng chuàngzàole fúhé jùqíng xūyào de shìjué kōngjiān.",
      "sentence_fr": "Dans la conception de scénographie, il a créé un espace visuel correspondant aux besoins de l'intrigue.",
      "sentence_en": "In stage design, he created visual spaces that meet the needs of the plot.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "stage_design",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个互助养老项目让老年人互相照顾并共享晚年生活。",
      "sentence_pinyin": "Zhège hùzhù yǎnglǎo xiàngmù ràng lǎoniánrén hùxiāng zhàogù bìng gòngxiǎng wǎnnián shēnghuó.",
      "sentence_fr": "Ce projet de soins mutuels pour personnes âgées permet aux personnes âgées de se soigner mutuellement et de partager leur vie dans leurs dernières années.",
      "sentence_en": "This mutual elderly care project allows senior citizens to care for each other and share their later years.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mutual_elderly_care",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在小轮车比赛中展现了高超的技巧和勇敢的精神。",
      "sentence_pinyin": "Tā zài xiǎolúnchē bǐsài zhōng zhǎnxiànle gāochāo de jìqiǎo hé yǒnggǎn de jīngshén.",
      "sentence_fr": "Elle a démontré des compétences supérieures et un esprit courageux lors de la compétition de BMX.",
      "sentence_en": "She demonstrated superior skills and courageous spirit in the BMX competition.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bmx",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个众创空间孵化了多个具有市场潜力的创新项目。",
      "sentence_pinyin": "Zhège zhòngchuàng kōngjiān fūhuàle duō gè jùyǒu shìchǎng qiánlì de chuàngxīn xiàngmù.",
      "sentence_fr": "Cet espace de création collective a incubé plusieurs projets innovants à fort potentiel de marché.",
      "sentence_en": "This mass innovation space incubated multiple innovative projects with market potential.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "innovation_spaces",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在锡器制作中锻造出了光泽柔和、质地细腻的工艺品。",
      "sentence_pinyin": "Tā zài xīqì zhìzuò zhōng duànzào chūle guāngzé róuhé, zhìdì xìnì de gōngyìpǐn.",
      "sentence_fr": "Dans la fabrication d'étain, il a forgé des objets artisanaux au lustre doux et à la texture délicate.",
      "sentence_en": "In pewter making, he forged handicrafts with soft luster and delicate texture.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pewter_crafts",
      "created_at": "2025-11-20T20:10:00.000Z",
      "updated_at": "2025-11-20T20:10:00.000Z"
    }
  ]
}
