{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个光伏农业大棚实现了棚上发电、棚下种植的立体利用。",
      "sentence_pinyin": "Zhège guāngfú nóngyè dàpéng shíxiànle péng shàng fādiàn, péng xià zhòngzhí de lìtǐ lìyòng.",
      "sentence_fr": "Cette serre agricole photovoltaïque réalise une utilisation en trois dimensions avec production d'électricité sur le toit et culture en dessous.",
      "sentence_en": "This photovoltaic agricultural greenhouse achieves three-dimensional utilization with power generation on top and cultivation below.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "photovoltaic_greenhouses",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在二人台表演中展现了质朴生动的民间艺术特色。",
      "sentence_pinyin": "Tā zài èrréntái biǎoyǎn zhōng zhǎnxiànle zhìpǔ shēngdòng de mínjiān yìshù tèsè.",
      "sentence_fr": "Dans sa performance d'Errentai, elle a démontré les caractéristiques d'art populaire rustiques et vivantes.",
      "sentence_en": "In her Errentai performance, she demonstrated rustic and vivid folk art characteristics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "errentai_opera",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能音响系统能够识别语音指令并播放音乐。",
      "sentence_pinyin": "Zhège zhìnéng yīnxiǎng xìtǒng nénggòu shíbié yǔyīn zhǐlìng bìng bōfàng yīnyuè.",
      "sentence_fr": "Ce système audio intelligent peut reconnaître les commandes vocales et jouer de la musique.",
      "sentence_en": "This smart audio system can recognize voice commands and play music.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_speakers",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在书评写作中客观评价了作品的思想内容和艺术价值。",
      "sentence_pinyin": "Tā zài shūpíng xiězuò zhōng kèguān píngjiale zuòpǐn de sīxiǎng nèiróng hé yìshù jiàzhí.",
      "sentence_fr": "Dans l'écriture de critiques de livres, il a objectivement évalué le contenu idéologique et la valeur artistique des œuvres.",
      "sentence_en": "In book review writing, he objectively evaluated the ideological content and artistic value of works.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "book_reviews",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个失独家庭关怀项目为失独老人提供精神慰藉和生活帮助。",
      "sentence_pinyin": "Zhège shīdú jiātíng guānhuái xiàngmù wèi shīdú lǎorén tígōng jīngshén wèijiè hé shēnghuó bāngzhù.",
      "sentence_fr": "Ce projet de soins pour familles ayant perdu leur enfant unique fournit un réconfort spirituel et une aide à la vie quotidienne aux personnes âgées ayant perdu leur enfant unique.",
      "sentence_en": "This care project for families who lost their only child provides spiritual comfort and life assistance to elderly people who lost their only child.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bereaved_parent_care",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的网页设计注重用户界面的美观性和交互体验的流畅性。",
      "sentence_pinyin": "Tā de wǎngyè shèjì zhùzhòng yònghù jièmiàn de měiguānxìng hé jiāohù tǐyàn de liúchàngxìng.",
      "sentence_fr": "Sa conception de pages web met l'accent sur l'esthétique de l'interface utilisateur et la fluidité de l'expérience interactive.",
      "sentence_en": "Her web design emphasizes the aesthetics of the user interface and the fluidity of the interactive experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "web_design",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个矿山生态修复项目恢复了采矿区的植被和生态功能。",
      "sentence_pinyin": "Zhège kuàngshān shēngtài xiūfù xiàngmù huīfùle cǎikuàng qū de zhíbèi hé shēngtài gōngnéng.",
      "sentence_fr": "Ce projet de restauration écologique de mines a restauré la végétation et les fonctions écologiques des zones minières.",
      "sentence_en": "This mine ecological restoration project restored the vegetation and ecological functions of mining areas.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "mine_restoration",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在攀冰运动中挑战了冰瀑和冰壁的极限攀登。",
      "sentence_pinyin": "Tā zài pānbīng yùndòng zhōng tiǎozhànle bīngpù hé bīngbì de jíxiàn pāndēng.",
      "sentence_fr": "Dans l'escalade sur glace, il a défié les limites de l'escalade de cascades de glace et de murs de glace.",
      "sentence_en": "In ice climbing, he challenged the limits of climbing ice falls and ice walls.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "ice_climbing",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个家庭综合服务中心整合了多项便民利民服务功能。",
      "sentence_pinyin": "Zhège jiātíng zōnghé fúwù zhōngxīn zhěnghéle duō xiàng biànmín lìmín fúwù gōngnéng.",
      "sentence_fr": "Ce centre de services intégrés aux familles intègre plusieurs fonctions de services pratiques et bénéfiques au public.",
      "sentence_en": "This family comprehensive service center integrates multiple convenient and beneficial public service functions.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "family_service_centers",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在扎染工艺中通过捆扎和浸染创造了独特的纹理图案。",
      "sentence_pinyin": "Tā zài zhārǎn gōngyì zhōng tōngguò kǔnzhā hé jìnrǎn chuàngzàole dútè de wénlǐ tú'àn.",
      "sentence_fr": "Dans l'artisanat de tie-dye, elle a créé des motifs texturés uniques par nouage et teinture par immersion.",
      "sentence_en": "In tie-dye craftsmanship, she created unique textured patterns through tying and dip dyeing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "tie_dye",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能洗衣机可以根据衣物材质自动选择洗涤程序。",
      "sentence_pinyin": "Zhège zhìnéng xǐyījī kěyǐ gēnjù yīwù cáizhì zìdòng xuǎnzé xǐdí chéngxù.",
      "sentence_fr": "Cette machine à laver intelligente peut automatiquement sélectionner le programme de lavage en fonction du matériau des vêtements.",
      "sentence_en": "This smart washing machine can automatically select the washing program based on garment material.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_washers",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在高胡演奏中展现了明亮清脆的音色和灵活多变的技巧。",
      "sentence_pinyin": "Tā zài gāohú yǎnzòu zhōng zhǎnxiànle míngliàng qīngcuì de yīnsè hé línghuó duōbiàn de jìqiǎo.",
      "sentence_fr": "Il a démontré un timbre clair et lumineux et des techniques flexibles et variées dans son jeu de gaohu.",
      "sentence_en": "He demonstrated a bright and crisp timbre and flexible and varied techniques in his gaohu performance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "gaohu_music",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个食源性疾病监测系统追踪食品安全事件和疾病暴发。",
      "sentence_pinyin": "Zhège shíyuánxìng jíbìng jiāncè xìtǒng zhuīzōng shípǐn ānquán shìjiàn hé jíbìng bàofā.",
      "sentence_fr": "Ce système de surveillance des maladies d'origine alimentaire suit les incidents de sécurité alimentaire et les épidémies de maladies.",
      "sentence_en": "This foodborne disease surveillance system tracks food safety incidents and disease outbreaks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "foodborne_surveillance",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的环境艺术作品呼吁人们关注生态保护和可持续发展。",
      "sentence_pinyin": "Tā de huánjìng yìshù zuòpǐn hūyù rénmen guānzhù shēngtài bǎohù hé kě chíxù fāzhǎn.",
      "sentence_fr": "Ses œuvres d'art environnemental appellent les gens à prêter attention à la protection écologique et au développement durable.",
      "sentence_en": "Her environmental art works call on people to pay attention to ecological protection and sustainable development.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environmental_art",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个冰雹预警系统监测对流云团并提前发布冰雹警报。",
      "sentence_pinyin": "Zhège bīngbáo yùjǐng xìtǒng jiāncè duìliú yúntuán bìng tíqián fābù bīngbáo jǐngbào.",
      "sentence_fr": "Ce système d'alerte à la grêle surveille les nuages convectifs et émet des alertes à la grêle à l'avance.",
      "sentence_en": "This hail warning system monitors convective clouds and issues hail alerts in advance.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hail_warning",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在游戏设计工作中创造了富有挑战性和趣味性的游戏玩法。",
      "sentence_pinyin": "Tā zài yóuxì shèjì gōngzuò zhōng chuàngzàole fùyǒu tiǎozhànxìng hé qùwèixìng de yóuxì wánfǎ.",
      "sentence_fr": "Dans son travail de conception de jeux, il a créé un gameplay à la fois stimulant et amusant.",
      "sentence_en": "In his game design work, he created challenging and entertaining gameplay.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "game_design",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智慧健康管理平台为用户提供个性化的健康指导方案。",
      "sentence_pinyin": "Zhège zhìhuì jiànkāng guǎnlǐ píngtái wèi yònghù tígōng gèxìnghuà de jiànkāng zhǐdǎo fāng'àn.",
      "sentence_fr": "Cette plateforme de gestion intelligente de la santé fournit aux utilisateurs des plans de guidance santé personnalisés.",
      "sentence_en": "This smart health management platform provides users with personalized health guidance plans.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "health_management_platforms",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在轮滑运动中展现了速度与技巧的完美结合。",
      "sentence_pinyin": "Tā zài lúnhuá yùndòng zhōng zhǎnxiànle sùdù yǔ jìqiǎo de wánměi jiéhé.",
      "sentence_fr": "Elle a démontré une combinaison parfaite de vitesse et de technique dans le roller.",
      "sentence_en": "She demonstrated a perfect combination of speed and technique in roller skating.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "roller_skating",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个协同创新中心汇聚了企业、高校和科研院所的创新资源。",
      "sentence_pinyin": "Zhège xiétóng chuàngxīn zhōngxīn huìjùle qǐyè, gāoxiào hé kēyán yuànsuǒ de chuàngxīn zīyuán.",
      "sentence_fr": "Ce centre d'innovation collaborative rassemble les ressources d'innovation des entreprises, des universités et des instituts de recherche.",
      "sentence_en": "This collaborative innovation center gathers innovation resources from enterprises, universities, and research institutes.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "innovation_centers",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在铜钱雕刻中将普通铜钱改造成了精美的微雕艺术品。",
      "sentence_pinyin": "Tā zài tóngqián diāokè zhōng jiāng pǔtōng tóngqián gǎizào chéngle jīngměi de wēidiāo yìshùpǐn.",
      "sentence_fr": "Dans la gravure de pièces de cuivre, il a transformé des pièces de cuivre ordinaires en œuvres d'art de micro-sculpture exquises.",
      "sentence_en": "In copper coin engraving, he transformed ordinary copper coins into exquisite micro-sculpture artworks.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "coin_engraving",
      "created_at": "2025-11-20T20:15:00.000Z",
      "updated_at": "2025-11-20T20:15:00.000Z"
    }
  ]
}
