{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个社区定期组织各种文化活动，丰富了居民的业余生活。",
      "sentence_pinyin": "Zhège shèqū dìngqī zǔzhī gèzhǒng wénhuà huódòng, fēngfùle jūmín de yèyú shēnghuó.",
      "sentence_fr": "Cette communauté organise régulièrement diverses activités culturelles, enrichissant la vie de loisirs des résidents.",
      "sentence_en": "This community regularly organizes various cultural activities, enriching residents' leisure life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的设计作品将传统工艺与现代审美完美结合。",
      "sentence_pinyin": "Tā de shèjì zuòpǐn jiāng chuántǒng gōngyì yǔ xiàndài shěnměi wánměi jiéhé.",
      "sentence_fr": "Ses œuvres de design combinent parfaitement l'artisanat traditionnel et l'esthétique moderne.",
      "sentence_en": "His design works perfectly combine traditional craftsmanship with modern aesthetics.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "design",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家咖啡馆的环境优雅安静，是读书和工作的理想场所。",
      "sentence_pinyin": "Zhè jiā kāfēiguǎn de huánjìng yōuyǎ ānjìng, shì dúshū hé gōngzuò de lǐxiǎng chǎngsuǒ.",
      "sentence_fr": "L'environnement de ce café est élégant et calme, c'est un endroit idéal pour lire et travailler.",
      "sentence_en": "The environment of this café is elegant and quiet, an ideal place for reading and working.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cafes",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她利用周末时间参加志愿者活动，帮助社区里的老年人。",
      "sentence_pinyin": "Tā lìyòng zhōumò shíjiān cānjiā zhìyuànzhě huódòng, bāngzhù shèqū lǐ de lǎoniánrén.",
      "sentence_fr": "Elle profite de son temps de week-end pour participer à des activités de bénévolat, aidant les personnes âgées de la communauté.",
      "sentence_en": "She uses her weekend time to participate in volunteer activities, helping the elderly in the community.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "volunteering",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能设备可以根据用户的习惯自动调节温度和湿度。",
      "sentence_pinyin": "Zhège zhìnéng shèbèi kěyǐ gēnjù yònghù de xíguàn zìdòng tiáojié wēndù hé shīdù.",
      "sentence_fr": "Cet appareil intelligent peut automatiquement ajuster la température et l'humidité selon les habitudes de l'utilisateur.",
      "sentence_en": "This smart device can automatically adjust temperature and humidity according to user habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_home",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这部电影的剧情跌宕起伏，让观众从头到尾都保持着紧张感。",
      "sentence_pinyin": "Zhè bù diànyǐng de jùqíng diēdàng qǐfú, ràng guānzhòng cóng tóu dào wěi dōu bǎochízhe jǐnzhānggǎn.",
      "sentence_fr": "L'intrigue de ce film est pleine de rebondissements, maintenant les spectateurs en suspense du début à la fin.",
      "sentence_en": "The plot of this film is full of twists and turns, keeping the audience in suspense from beginning to end.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "movies",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他每天坚持晨跑半小时，养成了良好的运动习惯。",
      "sentence_pinyin": "Tā měitiān jiānchí chénpǎo bàn xiǎoshí, yǎngchéngle liánghǎo de yùndòng xíguàn.",
      "sentence_fr": "Il court tous les matins pendant une demi-heure, développant ainsi de bonnes habitudes d'exercice.",
      "sentence_en": "He runs every morning for half an hour, developing good exercise habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "fitness",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个职业培训课程帮助失业人员掌握新的技能，重新就业。",
      "sentence_pinyin": "Zhège zhíyè péixùn kèchéng bāngzhù shīyè rényuán zhǎngwò xīn de jìnéng, chóngxīn jiùyè.",
      "sentence_fr": "Ce cours de formation professionnelle aide les chômeurs à acquérir de nouvelles compétences et à se réinsérer sur le marché du travail.",
      "sentence_en": "This vocational training course helps unemployed people acquire new skills and find employment again.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "employment",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的绘画风格独特，作品充满了想象力和创造力。",
      "sentence_pinyin": "Tā de huìhuà fēnggé dútè, zuòpǐn chōngmǎnle xiǎngxiànglì hé chuàngzàolì.",
      "sentence_fr": "Son style de peinture est unique, ses œuvres sont pleines d'imagination et de créativité.",
      "sentence_en": "Her painting style is unique, her works are full of imagination and creativity.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "art",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这座城市的公共交通系统发达，出行非常方便快捷。",
      "sentence_pinyin": "Zhè zuò chéngshì de gōnggòng jiāotōng xìtǒng fādá, chūxíng fēicháng fāngbiàn kuàijié.",
      "sentence_fr": "Le système de transport public de cette ville est développé, rendant les déplacements très pratiques et rapides.",
      "sentence_en": "The public transportation system of this city is well-developed, making travel very convenient and fast.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "transportation",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他的演讲内容丰富深刻，给听众留下了深刻的印象。",
      "sentence_pinyin": "Tā de yǎnjiǎng nèiróng fēngfù shēnkè, gěi tīngzhòng liú xiàle shēnkè de yìnxiàng.",
      "sentence_fr": "Le contenu de son discours est riche et profond, laissant une impression marquante sur le public.",
      "sentence_en": "The content of his speech is rich and profound, leaving a deep impression on the audience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "public_speaking",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这家公司推出了环保包装，减少了对环境的影响。",
      "sentence_pinyin": "Zhè jiā gōngsī tuīchūle huánbǎo bāozhuāng, jiǎnshǎole duì huánjìng de yǐngxiǎng.",
      "sentence_fr": "Cette entreprise a lancé des emballages écologiques, réduisant son impact sur l'environnement.",
      "sentence_en": "This company launched eco-friendly packaging, reducing its environmental impact.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "environment",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她在比赛中克服了重重困难，最终站在了领奖台上。",
      "sentence_pinyin": "Tā zài bǐsài zhōng kèfúle chóngchóng kùnnan, zuìzhōng zhàn zàile lǐngjiǎngtái shàng.",
      "sentence_fr": "Elle a surmonté de nombreuses difficultés lors de la compétition et s'est finalement retrouvée sur le podium.",
      "sentence_en": "She overcame numerous difficulties in the competition and finally stood on the podium.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sports",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个应用程序的用户界面设计人性化，深受用户好评。",
      "sentence_pinyin": "Zhège yìngyòng chéngxù de yònghù jièmiàn shèjì rénxìnghuà, shēn shòu yònghù hǎopíng.",
      "sentence_fr": "L'interface utilisateur de cette application est conçue de manière conviviale et très appréciée des utilisateurs.",
      "sentence_en": "The user interface of this application is designed user-friendly and highly praised by users.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "technology",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这位作家的新书一上市就登上了畅销书排行榜。",
      "sentence_pinyin": "Zhè wèi zuòjiā de xīn shū yī shàngshì jiù dēngshàngle chàngxiāoshū páihángbǎng.",
      "sentence_fr": "Le nouveau livre de cet auteur a immédiatement grimpé au sommet de la liste des best-sellers dès sa sortie.",
      "sentence_en": "This author's new book immediately climbed to the top of the bestseller list upon release.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "literature",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "学校开设了多门选修课，满足学生的不同兴趣和需求。",
      "sentence_pinyin": "Xuéxiào kāishèle duō mén xuǎnxiūkè, mǎnzú xuésheng de bùtóng xìngqù hé xūqiú.",
      "sentence_fr": "L'école a ouvert plusieurs cours optionnels pour répondre aux différents intérêts et besoins des étudiants.",
      "sentence_en": "The school opened multiple elective courses to meet students' different interests and needs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "education",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "他在退休后开始学习书法，找到了新的生活乐趣。",
      "sentence_pinyin": "Tā zài tuìxiū hòu kāishǐ xuéxí shūfǎ, zhǎodàole xīn de shēnghuó lèqù.",
      "sentence_fr": "Après sa retraite, il a commencé à apprendre la calligraphie et a trouvé un nouveau plaisir dans la vie.",
      "sentence_en": "After retirement, he began learning calligraphy and found new joy in life.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hobbies",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个研讨会邀请了行业内的专家学者进行经验分享。",
      "sentence_pinyin": "Zhège yántǎohuì yāoqǐngle hángyè nèi de zhuānjiā xuézhě jìnxíng jīngyàn fēnxiǎng.",
      "sentence_fr": "Ce séminaire a invité des experts et des universitaires du secteur à partager leur expérience.",
      "sentence_en": "This seminar invited industry experts and scholars to share their experience.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "conferences",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "她的烹饪技艺高超，做出的菜肴色香味俱全。",
      "sentence_pinyin": "Tā de pēngrèn jìyì gāochāo, zuò chū de càiyáo sè xiāng wèi jù quán.",
      "sentence_fr": "Ses compétences culinaires sont excellentes, ses plats sont parfaits en couleur, arôme et goût.",
      "sentence_en": "Her culinary skills are excellent, the dishes she makes are perfect in color, aroma, and taste.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "cooking",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线商城提供了便捷的购物体验和完善的售后服务。",
      "sentence_pinyin": "Zhège zàixiàn shāngchéng tígōngle biànjié de gòuwù tǐyàn hé wánshàn de shòuhòu fúwù.",
      "sentence_fr": "Cette boutique en ligne offre une expérience d'achat pratique et un service après-vente complet.",
      "sentence_en": "This online store provides a convenient shopping experience and comprehensive after-sales service.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "e_commerce",
      "created_at": "2025-11-20T17:10:00.000Z",
      "updated_at": "2025-11-20T17:10:00.000Z"
    }
  ]
}
