{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "生态足迹指标衡量人类活动对地球自然资源和生态系统的总体影响。",
      "sentence_pinyin": "Shēngtài zújì zhǐbiāo héngliáng rénlèi huódòng duì dìqiú zìrán zīyuán hé shēngtài xìtǒng de zǒngtǐ yǐngxiǎng.",
      "sentence_fr": "L'indicateur d'empreinte écologique mesure l'impact global des activités humaines sur les ressources naturelles et les écosystèmes de la Terre.",
      "sentence_en": "The ecological footprint indicator measures the overall impact of human activities on Earth's natural resources and ecosystems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ecological_footprint",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语法化理论研究词汇和短语如何随时间演变为语法成分。",
      "sentence_pinyin": "Yǔfǎ huà lǐlùn yánjiū cíhuì hé duǎnyǔ rúhé suí shíjiān yǎnbiàn wéi yǔfǎ chéngfèn.",
      "sentence_fr": "La théorie de la grammaticalisation étudie comment les mots et les expressions évoluent au fil du temps pour devenir des éléments grammaticaux.",
      "sentence_en": "Grammaticalization theory studies how words and phrases evolve over time into grammatical elements.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "grammaticalization",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "同态加密技术允许在不解密数据的情况下对加密数据进行计算操作。",
      "sentence_pinyin": "Tóngtài jiāmì jìshù yǔnxǔ zài bù jiěmì shùjù de qíngkuàng xià duì jiāmì shùjù jìnxíng jìsuàn cāozuò.",
      "sentence_fr": "La technologie de chiffrement homomorphe permet d'effectuer des opérations de calcul sur des données chiffrées sans les déchiffrer.",
      "sentence_en": "Homomorphic encryption technology allows computational operations on encrypted data without decrypting it.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "homomorphic_encryption",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "过渡期正义机制帮助社会在冲突结束后处理历史不公正并促进和解。",
      "sentence_pinyin": "Guòdù qī zhèngyì jīzhì bāngzhù shèhuì zài chōngtū jiéshù hòu chǔlǐ lìshǐ bù gōngzhèng bìng cùjìn héjiě.",
      "sentence_fr": "Les mécanismes de justice transitionnelle aident les sociétés à traiter les injustices historiques et à promouvoir la réconciliation après la fin des conflits.",
      "sentence_en": "Transitional justice mechanisms help societies address historical injustices and promote reconciliation after conflicts end.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "transitional_justice_mechanisms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "系统生物学整合多层面数据来构建生命系统运作的整体模型。",
      "sentence_pinyin": "Xìtǒng shēngwù xué zhěnghé duō céngmiàn shùjù lái jiàngòu shēngmìng xìtǒng yùnzuò de zhěngtǐ móxíng.",
      "sentence_fr": "La biologie des systèmes intègre des données à plusieurs niveaux pour construire des modèles globaux du fonctionnement des systèmes vivants.",
      "sentence_en": "Systems biology integrates multi-level data to construct holistic models of how living systems operate.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "systems_biology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "电动汽车充电基础设施的普及对于加速交通电气化至关重要。",
      "sentence_pinyin": "Diàndòng qìchē chōngdiàn jīchǔ shèshī de pǔjí duìyú jiāsù jiāotōng diànqì huà zhìguān zhòngyào.",
      "sentence_fr": "La généralisation des infrastructures de recharge pour véhicules électriques est cruciale pour accélérer l'électrification des transports.",
      "sentence_en": "The proliferation of electric vehicle charging infrastructure is crucial for accelerating transportation electrification.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "ev_charging_infrastructure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "情境感知计算系统根据用户当前环境和活动自动调整其行为。",
      "sentence_pinyin": "Qíngjìng gǎnzhī jìsuàn xìtǒng gēnjù yònghù dāngqián huánjìng hé huódòng zìdòng tiáozhěng qí xíngwéi.",
      "sentence_fr": "Les systèmes informatiques sensibles au contexte ajustent automatiquement leur comportement en fonction de l'environnement et des activités actuels de l'utilisateur.",
      "sentence_en": "Context-aware computing systems automatically adjust their behavior based on the user's current environment and activities.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "context_aware_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "亲社会行为研究探讨人们为什么以及如何帮助他人和贡献于社会。",
      "sentence_pinyin": "Qīn shèhuì xíngwéi yánjiū tàntǎo rénmen wèishéme yǐjí rúhé bāngzhù tārén hé gòngxiàn yú shèhuì.",
      "sentence_fr": "La recherche sur le comportement prosocial explore pourquoi et comment les gens aident les autres et contribuent à la société.",
      "sentence_en": "Prosocial behavior research explores why and how people help others and contribute to society.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "prosocial_behavior",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "声学超材料可以控制和操纵声波以实现隔音和声学隐身效果。",
      "sentence_pinyin": "Shēngxué chāo cáiliào kěyǐ kòngzhì hé cāozòng shēngbō yǐ shíxiàn géyīn hé shēngxué yǐnshēn xiàoguǒ.",
      "sentence_fr": "Les métamatériaux acoustiques peuvent contrôler et manipuler les ondes sonores pour obtenir des effets d'isolation phonique et d'invisibilité acoustique.",
      "sentence_en": "Acoustic metamaterials can control and manipulate sound waves to achieve soundproofing and acoustic cloaking effects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "acoustic_metamaterials",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "合作博弈论分析参与者如何通过联盟合作来实现共同利益最大化。",
      "sentence_pinyin": "Hézuò bóyì lùn fēnxī cānyù zhě rúhé tōngguò liánméng hézuò lái shíxiàn gòngtóng lìyì zuìdà huà.",
      "sentence_fr": "La théorie des jeux coopératifs analyse comment les participants maximisent les intérêts communs par le biais d'alliances et de coopération.",
      "sentence_en": "Cooperative game theory analyzes how participants maximize common interests through coalition and cooperation.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cooperative_game_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "饮食文化研究探索食物如何反映和塑造社会身份和文化价值观。",
      "sentence_pinyin": "Yǐnshí wénhuà yánjiū tànsuǒ shíwù rúhé fǎnyìng hé sùzào shèhuì shēnfèn hé wénhuà jiàzhí guān.",
      "sentence_fr": "Les études sur la culture alimentaire explorent comment la nourriture reflète et façonne l'identité sociale et les valeurs culturelles.",
      "sentence_en": "Food culture studies explore how food reflects and shapes social identity and cultural values.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "food_culture_studies",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "单细胞测序技术使研究人员能够分析个体细胞间的基因表达差异。",
      "sentence_pinyin": "Dān xìbāo cèxù jìshù shǐ yánjiū rényuán nénggòu fēnxī gètǐ xìbāo jiān de jīyīn biǎodá chāyì.",
      "sentence_fr": "La technologie de séquençage unicellulaire permet aux chercheurs d'analyser les différences d'expression génétique entre cellules individuelles.",
      "sentence_en": "Single-cell sequencing technology enables researchers to analyze gene expression differences between individual cells.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "single_cell_sequencing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可编程物质研究开发能够根据指令改变物理属性的智能材料系统。",
      "sentence_pinyin": "Kě biānchéng wùzhì yánjiū kāifā nénggòu gēnjù zhǐlìng gǎibiàn wùlǐ shǔxìng de zhìnéng cáiliào xìtǒng.",
      "sentence_fr": "La recherche sur la matière programmable développe des systèmes de matériaux intelligents capables de modifier leurs propriétés physiques selon les instructions.",
      "sentence_en": "Programmable matter research develops intelligent material systems that can change physical properties according to instructions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "programmable_matter",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "灾害社会学研究社会如何准备、应对和从自然和人为灾害中恢复。",
      "sentence_pinyin": "Zāihài shèhuì xué yánjiū shèhuì rúhé zhǔnbèi, yìngduì hé cóng zìrán hé rénwéi zāihài zhōng huīfù.",
      "sentence_fr": "La sociologie des catastrophes étudie comment les sociétés se préparent, répondent et se remettent des catastrophes naturelles et d'origine humaine.",
      "sentence_en": "Disaster sociology studies how societies prepare for, respond to, and recover from natural and human-made disasters.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "disaster_sociology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "注意力经济描述了在信息过载时代争夺用户注意力的商业模式。",
      "sentence_pinyin": "Zhùyì lì jīngjì miáoshù le zài xìnxī guòzài shídài zhēngduó yònghù zhùyì lì de shāngyè móshì.",
      "sentence_fr": "L'économie de l'attention décrit les modèles commerciaux qui rivalisent pour l'attention des utilisateurs à l'ère de la surcharge informationnelle.",
      "sentence_en": "Attention economy describes business models competing for user attention in the era of information overload.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "attention_economy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "表面工程技术通过改变材料表面特性来增强其功能和耐久性。",
      "sentence_pinyin": "Biǎomiàn gōngchéng jìshù tōngguò gǎibiàn cáiliào biǎomiàn tèxìng lái zēngqiáng qí gōngnéng hé nàijiǔ xìng.",
      "sentence_fr": "La technologie d'ingénierie de surface améliore la fonctionnalité et la durabilité des matériaux en modifiant leurs propriétés de surface.",
      "sentence_en": "Surface engineering technology enhances material functionality and durability by modifying surface properties.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "surface_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "政治传播研究分析政治信息如何通过各种媒体渠道传播和产生影响。",
      "sentence_pinyin": "Zhèngzhì chuánbō yánjiū fēnxī zhèngzhì xìnxī rúhé tōngguò gè zhǒng méitǐ qúdào chuánbō hé chǎnshēng yǐngxiǎng.",
      "sentence_fr": "La recherche en communication politique analyse comment l'information politique est diffusée et influence à travers divers canaux médiatiques.",
      "sentence_en": "Political communication research analyzes how political information spreads and creates impact through various media channels.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "political_communication",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能性磁性纳米粒子在药物靶向递送和医学成像中有广泛应用。",
      "sentence_pinyin": "Gōngnéng xìng cíxìng nàmǐ lìzǐ zài yàowù bǎoxiàng dìsòng hé yīxué chéngxiàng zhōng yǒu guǎngfàn yìngyòng.",
      "sentence_fr": "Les nanoparticules magnétiques fonctionnelles ont de larges applications dans la délivrance ciblée de médicaments et l'imagerie médicale.",
      "sentence_en": "Functional magnetic nanoparticles have widespread applications in targeted drug delivery and medical imaging.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "magnetic_nanoparticles",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据伦理框架为收集、分析和使用个人数据提供道德指导原则。",
      "sentence_pinyin": "Shùjù lúnlǐ kuàngjià wèi shōují, fēnxī hé shǐyòng gèrén shùjù tígōng dàodé zhǐdǎo yuánzé.",
      "sentence_fr": "Les cadres d'éthique des données fournissent des principes de guidance morale pour la collecte, l'analyse et l'utilisation des données personnelles.",
      "sentence_en": "Data ethics frameworks provide moral guidance principles for collecting, analyzing, and using personal data.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_ethics",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "海洋热波对珊瑚白化和海洋生态系统破坏具有毁灭性影响。",
      "sentence_pinyin": "Hǎiyáng rè bō duì shānhú báihuà hé hǎiyáng shēngtài xìtǒng pòhuài jùyǒu huǐmiè xìng yǐngxiǎng.",
      "sentence_fr": "Les vagues de chaleur marines ont des effets dévastateurs sur le blanchissement des coraux et la destruction des écosystèmes marins.",
      "sentence_en": "Marine heatwaves have devastating impacts on coral bleaching and marine ecosystem destruction.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "marine_heatwaves",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
