{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "这个智慧消防系统可以实时监测建筑物内的火灾隐患并自动报警。",
      "sentence_pinyin": "Zhège zhìhuì xiāofáng xìtǒng kěyǐ shíshí jiāncè jiànzhúwù nèi de huǒzāi yǐnhuàn bìng zìdòng bàojǐng.",
      "sentence_fr": "Ce système de lutte contre l'incendie intelligent peut surveiller en temps réel les risques d'incendie dans les bâtiments et déclencher automatiquement des alertes.",
      "sentence_en": "This smart fire protection system can monitor fire hazards in buildings in real-time and automatically trigger alarms.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_fire_systems",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "古筝曲《春江花月夜》描绘了月夜下江南水乡的秀美景色。",
      "sentence_pinyin": "Gǔzhēng qǔ 'Chūnjiāng huāyuè yè' miáohuìle yuèyè xià jiāngnán shuǐxiāng de xiùměi jǐngsè.",
      "sentence_fr": "La pièce de guzheng 'Nuit de fleurs au clair de lune sur le fleuve au printemps' dépeint les beaux paysages du pays d'eau du Jiangnan sous la lune.",
      "sentence_en": "The guzheng piece 'Spring River Flower Moon Night' depicts the beautiful scenery of Jiangnan water towns under the moonlight.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "guzheng_repertoire",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个城市的屋顶绿化项目有效降低了夏季室内温度,节省了空调能耗。",
      "sentence_pinyin": "Zhège chéngshì de wūdǐng lǜhuà xiàngmù yǒuxiào jiàngdīle xiàjì shìnèi wēndù, jiéshěngle kōngtiáo nénghào.",
      "sentence_fr": "Le projet de toitures végétalisées de cette ville a efficacement réduit la température intérieure en été et économisé la consommation d'énergie de climatisation.",
      "sentence_en": "This city's rooftop greening project has effectively lowered indoor temperatures in summer, saving air conditioning energy consumption.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "green_roofs",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "云锦是南京的传统丝织工艺,被誉为织锦工艺的巅峰之作。",
      "sentence_pinyin": "Yúnjǐn shì Nánjīng de chuántǒng sīzhī gōngyì, bèi yù wéi zhījǐn gōngyì de diānfēng zhī zuò.",
      "sentence_fr": "Le brocart Yunjin est un artisanat traditionnel de tissage de soie de Nanjing, considéré comme le sommet de l'art du brocart.",
      "sentence_en": "Yunjin is a traditional silk weaving craft of Nanjing, hailed as the pinnacle of brocade craftsmanship.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "yunjin_brocade",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能牙刷可以监测刷牙时间和力度,帮助用户养成正确的刷牙习惯。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yáshuā kěyǐ jiāncè shuāyá shíjiān hé lìdù, bāngzhù yònghù yǎngchéng zhèngquè de shuāyá xíguàn.",
      "sentence_fr": "Cette brosse à dents intelligente peut surveiller le temps et la pression de brossage pour aider les utilisateurs à développer de bonnes habitudes de brossage.",
      "sentence_en": "This smart toothbrush can monitor brushing time and pressure to help users develop correct brushing habits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_toothbrushes",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个社区便民服务中心整合了多种政务服务,实现了一站式办理。",
      "sentence_pinyin": "Zhège shèqū biànmín fúwù zhōngxīn zhěnghéle duō zhǒng zhèngwù fúwù, shíxiànle yīzhànshì bànlǐ.",
      "sentence_fr": "Ce centre de services communautaires intègre plusieurs services gouvernementaux, réalisant un guichet unique.",
      "sentence_en": "This community convenience service center integrates multiple government services, achieving one-stop processing.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "community_service_centers",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二胡演奏时的揉弦技巧能够使音色更加圆润动听。",
      "sentence_pinyin": "Èrhú yǎnzòu shí de róuxián jìqiǎo nénggòu shǐ yīnsè gèngjiā yuánrùn dòngtīng.",
      "sentence_fr": "La technique de vibrato lors du jeu de l'erhu peut rendre le son plus rond et agréable.",
      "sentence_en": "The vibrato technique when playing the erhu can make the tone more rounded and pleasant.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "erhu_techniques",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个在线医保结算系统让患者可以在医院直接完成医保报销。",
      "sentence_pinyin": "Zhège zàixiàn yībǎo jiésuàn xìtǒng ràng huànzhě kěyǐ zài yīyuàn zhíjiē wánchéng yībǎo bàoxiāo.",
      "sentence_fr": "Ce système de règlement d'assurance maladie en ligne permet aux patients de compléter directement le remboursement d'assurance à l'hôpital.",
      "sentence_en": "This online medical insurance settlement system allows patients to complete insurance reimbursement directly at the hospital.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "medical_insurance_systems",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "缂丝工艺通达经断纬的技法,织出的图案立体感强。",
      "sentence_pinyin": "Kèsī gōngyì tōngdá jīng duàn wěi de jìfǎ, zhī chū de tú'àn lìtǐgǎn qiáng.",
      "sentence_fr": "La technique du kesi utilise la méthode de trame coupée à travers la chaîne, créant des motifs avec un fort effet tridimensionnel.",
      "sentence_en": "Kesi craftsmanship uses the technique of cutting weft threads through warp, creating patterns with strong three-dimensional effect.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "kesi_weaving",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能眼罩可以通过热敷和按摩缓解眼部疲劳。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng yǎnzhào kěyǐ tōngguò rèfū hé ànmó huǎnjiě yǎnbù píláo.",
      "sentence_fr": "Ce masque pour les yeux intelligent peut soulager la fatigue oculaire grâce à la thérapie thermique et au massage.",
      "sentence_en": "This smart eye mask can relieve eye fatigue through heat therapy and massage.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_eye_masks",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个河道治理项目通过生态修复手段恢复了河流的自然生态系统。",
      "sentence_pinyin": "Zhège hédào zhìlǐ xiàngmù tōngguò shēngtài xiūfù shǒuduàn huīfùle héliú de zìrán shēngtài xìtǒng.",
      "sentence_fr": "Ce projet de gestion des cours d'eau a restauré l'écosystème naturel de la rivière grâce à des méthodes de restauration écologique.",
      "sentence_en": "This river management project restored the river's natural ecosystem through ecological restoration methods.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "river_management",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "琵琶的品和相决定了它能够演奏的音域范围。",
      "sentence_pinyin": "Pípá de pǐn hé xiàng juédìngle tā nénggòu yǎnzòu de yīnyù fànwéi.",
      "sentence_fr": "Les frettes et les positions du pipa déterminent la gamme de notes qu'il peut jouer.",
      "sentence_en": "The pipa's frets and positions determine the range of notes it can play.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "pipa_construction",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能物业管理系统实现了报修、缴费和投诉的在线办理。",
      "sentence_pinyin": "Zhège zhìnéng wùyè guǎnlǐ xìtǒng shíxiànle bàoxiū, jiǎofèi hé tóusù de zàixiàn bànlǐ.",
      "sentence_fr": "Ce système de gestion immobilière intelligent permet les demandes de réparation, les paiements et les réclamations en ligne.",
      "sentence_en": "This smart property management system enables online processing of repairs, payments, and complaints.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_property_management",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "竹刻艺术在竹子表面雕刻出各种精美的图案和文字。",
      "sentence_pinyin": "Zhúkè yìshù zài zhúzi biǎomiàn diāokè chū gèzhǒng jīngměi de tú'àn hé wénzì.",
      "sentence_fr": "L'art de la gravure sur bambou sculpte divers motifs et caractères exquis sur la surface du bambou.",
      "sentence_en": "Bamboo carving art engraves various exquisite patterns and characters on the bamboo surface.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "bamboo_carving",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能颈椎按摩仪可以模拟真人按摩手法缓解颈部不适。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng jǐngzhuī ànmóyí kěyǐ mónǐ zhēnrén ànmó shǒufǎ huǎnjiě jǐngbù bùshì.",
      "sentence_fr": "Ce masseur cervical intelligent peut simuler des techniques de massage humain pour soulager l'inconfort du cou.",
      "sentence_en": "This smart cervical massager can simulate real massage techniques to relieve neck discomfort.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_massagers",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个妇女创业扶持项目为女性创业者提供了培训和资金支持。",
      "sentence_pinyin": "Zhège fùnǚ chuàngyè fúchí xiàngmù wèi nǚxìng chuàngyèzhě tígōngle péixùn hé zījīn zhīchí.",
      "sentence_fr": "Ce projet de soutien à l'entrepreneuriat féminin offre formation et soutien financier aux femmes entrepreneurs.",
      "sentence_en": "This women's entrepreneurship support project provides training and financial support for female entrepreneurs.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "women_entrepreneurship",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "笙可以同时吹奏多个音符,是中国传统乐器中少有的和声乐器。",
      "sentence_pinyin": "Shēng kěyǐ tóngshí chuīzòu duō gè yīnfú, shì Zhōngguó chuántǒng yuèqì zhōng shǎoyǒu de héshēng yuèqì.",
      "sentence_fr": "Le sheng peut jouer plusieurs notes simultanément, c'est l'un des rares instruments harmoniques parmi les instruments traditionnels chinois.",
      "sentence_en": "The sheng can play multiple notes simultaneously, making it one of the few harmonic instruments among traditional Chinese instruments.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "sheng_harmony",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这个智能农业大棚利用传感器和自动化设备实现了精准种植。",
      "sentence_pinyin": "Zhège zhìnéng nóngyè dàpéng lìyòng chuángǎnqì hé zìdònghuà shèbèi shíxiànle jīngzhǔn zhòngzhí.",
      "sentence_fr": "Cette serre agricole intelligente réalise une agriculture de précision grâce à des capteurs et des équipements automatisés.",
      "sentence_en": "This smart agricultural greenhouse achieves precision planting using sensors and automated equipment.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_greenhouses",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "发绣是用人的头发作为绣线,绣出细腻逼真的人物肖像。",
      "sentence_pinyin": "Fàxiù shì yòng rén de tóufa zuòwéi xiùxiàn, xiù chū xìnì bīzhēn de rénwù xiàoxiàng.",
      "sentence_fr": "La broderie de cheveux utilise des cheveux humains comme fil de broderie pour créer des portraits délicats et réalistes.",
      "sentence_en": "Hair embroidery uses human hair as embroidery thread to create delicate and realistic portraits.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "hair_embroidery",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "这款智能体脂秤可以通过手机应用追踪身体成分的长期变化趋势。",
      "sentence_pinyin": "Zhè kuǎn zhìnéng tǐzhīchèng kěyǐ tōngguò shǒujī yìngyòng zhuīzōng shēntǐ chéngfèn de chángqī biànhuà qūshì.",
      "sentence_fr": "Cette balance de composition corporelle intelligente peut suivre les tendances à long terme des changements de composition corporelle via une application mobile.",
      "sentence_en": "This smart body composition scale can track long-term trends in body composition changes through a mobile app.",
      "audio_url_male": null,
      "difficulty": "beginner",
      "category": "smart_scales",
      "created_at": "2025-11-20T21:55:00.000Z",
      "updated_at": "2025-11-20T21:55:00.000Z"
    }
  ]
}
