{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "量子绝热定理保证缓慢变化的系统保持在瞬时本征态。",
      "sentence_pinyin": "Liàngzǐ juérè dìnglǐ bǎozhèng huǎnmàn biànhuà de xìtǒng bǎochí zài shùnshí běnzhēng tài.",
      "sentence_fr": "Le théorème adiabatique quantique garantit que les systèmes à variation lente restent dans l'état propre instantané.",
      "sentence_en": "The quantum adiabatic theorem guarantees slowly varying systems remain in instantaneous eigenstates.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "adiabatic_theorem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "强不可伪造性要求即使对已签名消息也不能生成新签名。",
      "sentence_pinyin": "Qiáng bùkě wěizàoxìng yāoqiú jíshǐ duì yǐ qiānmíng xiāoxī yě bùnéng shēngchéng xīn qiānmíng.",
      "sentence_fr": "La forte impossibilité de falsification exige qu'aucune nouvelle signature ne puisse être générée même pour des messages déjà signés.",
      "sentence_en": "Strong unforgeability requires no new signature can be generated even for already signed messages.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "strong_unforgeability",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "双态类型系统使用类型状态机追踪资源生命周期。",
      "sentence_pinyin": "Shuāng tài lèixíng xìtǒng shǐyòng lèixíng zhuàngtài jī zhuīzōng zīyuán shēngmìng zhōuqī.",
      "sentence_fr": "Les systèmes de types à états doubles utilisent des machines à états de type pour suivre le cycle de vie des ressources.",
      "sentence_en": "Typestate systems use type state machines to track resource lifecycles.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "typestate_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "复流形理论研究具有复结构的微分流形。",
      "sentence_pinyin": "Fù liúxíng lǐlùn yánjiū jùyǒu fù jiégòu de wēifēn liúxíng.",
      "sentence_fr": "La théorie des variétés complexes étudie les variétés différentielles avec une structure complexe.",
      "sentence_en": "Complex manifold theory studies differential manifolds with complex structure.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "complex_manifolds",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子通信复杂度研究量子通信在计算任务中的效率。",
      "sentence_pinyin": "Liàngzǐ tōngxìn fùzádù yánjiū liàngzǐ tōngxìn zài jìsuàn rènwù zhōng de xiàolǜ.",
      "sentence_fr": "La complexité de communication quantique étudie l'efficacité de la communication quantique dans les tâches de calcul.",
      "sentence_en": "Quantum communication complexity studies the efficiency of quantum communication in computational tasks.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_communication_complexity",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "差分隐私为统计查询提供数学上可证明的隐私保护。",
      "sentence_pinyin": "Chāfēn yǐnsī wèi tǒngjì cháxún tígōng shùxué shàng kě zhèngmíng de yǐnsī bǎohù.",
      "sentence_fr": "La confidentialité différentielle fournit une protection de la vie privée mathématiquement prouvable pour les requêtes statistiques.",
      "sentence_en": "Differential privacy provides mathematically provable privacy protection for statistical queries.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "differential_privacy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "所有权类型确保资源在任意时刻只有一个所有者。",
      "sentence_pinyin": "Suǒyǒuquán lèixíng quèbǎo zīyuán zài rènyì shíkè zhǐyǒu yī gè suǒyǒuzhě.",
      "sentence_fr": "Les types de propriété garantissent que les ressources n'ont qu'un seul propriétaire à tout moment.",
      "sentence_en": "Ownership types ensure resources have only one owner at any given time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ownership_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "希尔伯特空间是量子力学状态空间的数学模型。",
      "sentence_pinyin": "Xī'ěrbótè kōngjiān shì liàngzǐ lìxué zhuàngtài kōngjiān de shùxué móxíng.",
      "sentence_fr": "L'espace de Hilbert est le modèle mathématique de l'espace des états en mécanique quantique.",
      "sentence_en": "Hilbert space is the mathematical model for quantum mechanics state space.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "hilbert_space",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "克利福德门集合可以在经典计算机上高效模拟。",
      "sentence_pinyin": "Kèlìfúdé mén jíhé kěyǐ zài jīngdiǎn jìsuànjī shàng gāoxiào mónǐ.",
      "sentence_fr": "L'ensemble des portes de Clifford peut être simulé efficacement sur des ordinateurs classiques.",
      "sentence_en": "The Clifford gate set can be efficiently simulated on classical computers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "clifford_gates",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可区分性混淆是密码学中最强的程序保护技术。",
      "sentence_pinyin": "Bùkě qūfēnxìng hùnxiáo shì mìmǎxué zhōng zuì qiáng de chéngxù bǎohù jìshù.",
      "sentence_fr": "L'obfuscation par indistinguabilité est la technique de protection de programme la plus forte en cryptographie.",
      "sentence_en": "Indistinguishability obfuscation is the strongest program protection technique in cryptography.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "program_obfuscation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "借用检查器在编译时验证引用的有效性和生命周期。",
      "sentence_pinyin": "Jièyòng jiǎnchá qì zài biānyì shí yànzhèng yǐnyòng de yǒuxiàoxìng hé shēngmìng zhōuqī.",
      "sentence_fr": "Le vérificateur d'emprunt valide la validité et la durée de vie des références à la compilation.",
      "sentence_en": "The borrow checker validates reference validity and lifetimes at compile time.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "borrow_checker",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "酉变换保持量子态的范数不变是量子演化的基本要求。",
      "sentence_pinyin": "Yǒu biànhuàn bǎochí liàngzǐ tài de fàn shù bù biàn shì liàngzǐ yǎnhuà de jīběn yāoqiú.",
      "sentence_fr": "Les transformations unitaires préservant la norme des états quantiques sont une exigence fondamentale de l'évolution quantique.",
      "sentence_en": "Unitary transformations preserving quantum state norms are a fundamental requirement of quantum evolution.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "unitary_transformations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可提取承诺允许从承诺值中提取原始消息。",
      "sentence_pinyin": "Kě tíqǔ chéngnuò yǔnxǔ cóng chéngnuò zhí zhōng tíqǔ yuánshǐ xiāoxī.",
      "sentence_fr": "Les engagements extractibles permettent d'extraire le message original de la valeur d'engagement.",
      "sentence_en": "Extractable commitments allow extracting the original message from the commitment value.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "extractable_commitments",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "终端对象和始对象在范畴论中是对偶概念。",
      "sentence_pinyin": "Zhōngduān duìxiàng hé shǐ duìxiàng zài fànchóu lùn zhōng shì duìǒu gàiniàn.",
      "sentence_fr": "Les objets terminaux et initiaux sont des concepts duaux en théorie des catégories.",
      "sentence_en": "Terminal objects and initial objects are dual concepts in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "terminal_initial_objects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "泰勒门与克利福德门组合形成通用量子门集。",
      "sentence_pinyin": "Tàilè mén yǔ Kèlìfúdé mén zǔhé xíngchéng tōngyòng liàngzǐ mén jí.",
      "sentence_fr": "Les portes T combinées aux portes de Clifford forment un ensemble de portes quantiques universelles.",
      "sentence_en": "T gates combined with Clifford gates form a universal quantum gate set.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "universal_gate_set",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "非适应性腐败模型假设攻击者在协议开始前选择腐败方。",
      "sentence_pinyin": "Fēi shìyìngxìng fǔbài móxíng jiǎshè gōngjīzhě zài xiéyì kāishǐ qián xuǎnzé fǔbài fāng.",
      "sentence_fr": "Le modèle de corruption non adaptative suppose que l'attaquant choisit les parties corrompues avant le début du protocole.",
      "sentence_en": "Non-adaptive corruption model assumes attacker chooses corrupted parties before protocol begins.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "corruption_models",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "抽象代数研究群环域等代数结构的一般性质。",
      "sentence_pinyin": "Chōuxiàng dàishù yánjiū qún huán yù děng dàishù jiégòu de yībān xìngzhì.",
      "sentence_fr": "L'algèbre abstraite étudie les propriétés générales des structures algébriques comme les groupes, anneaux et corps.",
      "sentence_en": "Abstract algebra studies general properties of algebraic structures like groups, rings, and fields.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "abstract_algebra",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子霍尔效应展示了拓扑物态的独特量子化性质。",
      "sentence_pinyin": "Liàngzǐ Huò'ěr xiàoyìng zhǎnshì le tuòpū wù tài de dútè liàngzǐhuà xìngzhì.",
      "sentence_fr": "L'effet Hall quantique démontre les propriétés de quantification uniques des états topologiques de la matière.",
      "sentence_en": "The quantum Hall effect demonstrates unique quantization properties of topological states of matter.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "quantum_hall_effect",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "可组合安全性保证协议在更大系统中安全运行。",
      "sentence_pinyin": "Kě zǔhé ānquánxìng bǎozhèng xiéyì zài gèng dà xìtǒng zhōng ānquán yùnxíng.",
      "sentence_fr": "La sécurité composable garantit que les protocoles fonctionnent en toute sécurité dans des systèmes plus grands.",
      "sentence_en": "Composable security guarantees protocols run securely within larger systems.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "composable_security",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "自然变换提供了函子之间的结构保持映射。",
      "sentence_pinyin": "Zìrán biànhuàn tígōng le hánzǐ zhījiān de jiégòu bǎochí yìngshè.",
      "sentence_fr": "Les transformations naturelles fournissent des applications préservant la structure entre foncteurs.",
      "sentence_en": "Natural transformations provide structure-preserving mappings between functors.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "natural_transformations",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
