{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "宇宙大尺度结构呈现纤维状网络和巨大空洞的分布。",
      "sentence_pinyin": "Yǔzhòu dà chǐdù jiégòu chéngxiàn xiānwéi zhuàng wǎngluò hé jùdà kōngdòng de fēnbù.",
      "sentence_fr": "La structure à grande échelle de l'univers présente une distribution de réseaux filamenteux et d'immenses vides.",
      "sentence_en": "The large-scale structure of the universe displays a distribution of filamentary networks and vast voids.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cosmic_large_scale_structure",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代币销毁机制通过减少流通供应来增加稀缺性。",
      "sentence_pinyin": "Dàibì xiāohuǐ jīzhì tōngguò jiǎnshǎo liútōng gōngyìng lái zēngjiā xīquēxìng.",
      "sentence_fr": "Les mécanismes de brûlage de jetons augmentent la rareté en réduisant l'offre en circulation.",
      "sentence_en": "Token burn mechanisms increase scarcity by reducing circulating supply.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "token_burning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "反压机制防止快速生产者压垮慢速消费者。",
      "sentence_pinyin": "Fǎnyā jīzhì fángzhǐ kuàisù shēngchǎnzhě yākuǎ mànsù xiāofèizhě.",
      "sentence_fr": "Les mécanismes de contre-pression empêchent les producteurs rapides de submerger les consommateurs lents.",
      "sentence_en": "Backpressure mechanisms prevent fast producers from overwhelming slow consumers.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "backpressure_mechanisms",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "盖梯尔问题表明传统知识定义存在根本性缺陷。",
      "sentence_pinyin": "Gàitī'ěr wèntí biǎomíng chuántǒng zhīshì dìngyì cúnzài gēnběnxìng quēxiàn.",
      "sentence_fr": "Le problème de Gettier montre que la définition traditionnelle de la connaissance présente des défauts fondamentaux.",
      "sentence_en": "The Gettier problem shows that the traditional definition of knowledge has fundamental flaws.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "gettier_problem",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "数据编目系统帮助用户发现和理解可用的数据资产。",
      "sentence_pinyin": "Shùjù biānmù xìtǒng bāngzhù yònghù fāxiàn hé lǐjiě kěyòng de shùjù zīchǎn.",
      "sentence_fr": "Les systèmes de catalogage de données aident les utilisateurs à découvrir et à comprendre les actifs de données disponibles.",
      "sentence_en": "Data catalog systems help users discover and understand available data assets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "data_cataloging",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "宇宙暴涨理论解释早期宇宙的指数级快速膨胀。",
      "sentence_pinyin": "Yǔzhòu bàozhǎng lǐlùn jiěshì zǎoqī yǔzhòu de zhǐshù jí kuàisù péngzhàng.",
      "sentence_fr": "La théorie de l'inflation cosmique explique l'expansion rapide exponentielle de l'univers primitif.",
      "sentence_en": "Cosmic inflation theory explains the exponentially rapid expansion of the early universe.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cosmic_inflation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "铸造函数创建新代币并将其分配给指定账户。",
      "sentence_pinyin": "Zhùzào hánshù chuàngjiàn xīn dàibì bìng jiāng qí fēnpèi gěi zhǐdìng zhànghù.",
      "sentence_fr": "Les fonctions de frappe créent de nouveaux jetons et les attribuent aux comptes spécifiés.",
      "sentence_en": "Minting functions create new tokens and assign them to specified accounts.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "token_minting",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "重试退避策略在连续失败时逐渐增加等待时间。",
      "sentence_pinyin": "Chóngshì tuìbì cèlüè zài liánxù shībài shí zhújiàn zēngjiā děngdài shíjiān.",
      "sentence_fr": "Les stratégies de backoff de réessai augmentent progressivement le temps d'attente lors d'échecs consécutifs.",
      "sentence_en": "Retry backoff strategies gradually increase wait time during consecutive failures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "retry_backoff",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "语境主义认为知识归属的标准随语境变化而不同。",
      "sentence_pinyin": "Yǔjìng zhǔyì rènwéi zhīshì guīshǔ de biāozhǔn suí yǔjìng biànhuà ér bùtóng.",
      "sentence_fr": "Le contextualisme soutient que les critères d'attribution de la connaissance varient selon le contexte.",
      "sentence_en": "Contextualism holds that standards for knowledge attribution vary with context.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "epistemic_contextualism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "特征存储集中管理机器学习模型使用的特征数据。",
      "sentence_pinyin": "Tèzhēng cúnchǔ jízhōng guǎnlǐ jīqì xuéxí móxíng shǐyòng de tèzhēng shùjù.",
      "sentence_fr": "Les feature stores gèrent de manière centralisée les données de caractéristiques utilisées par les modèles d'apprentissage automatique.",
      "sentence_en": "Feature stores centrally manage feature data used by machine learning models.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "feature_stores",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "红移测量揭示遥远星系正在远离我们的速度。",
      "sentence_pinyin": "Hóng yí cèliáng jiēshì yáoyuǎn xīngxì zhèngzài yuǎnlí wǒmen de sùdù.",
      "sentence_fr": "Les mesures du décalage vers le rouge révèlent la vitesse à laquelle les galaxies lointaines s'éloignent de nous.",
      "sentence_en": "Redshift measurements reveal the speed at which distant galaxies are receding from us.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "cosmological_redshift",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代币许可模式简化了授权和支付的两步交易流程。",
      "sentence_pinyin": "Dàibì xǔkě móshì jiǎnhuà le shòuquán hé zhīfù de liǎng bù jiāoyì liúchéng.",
      "sentence_fr": "Le modèle de permis de jeton simplifie le processus de transaction en deux étapes d'autorisation et de paiement.",
      "sentence_en": "Token permit patterns simplify the two-step authorization and payment transaction process.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "token_permits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "死信队列收集无法正常处理的消息以便后续分析。",
      "sentence_pinyin": "Sǐxìn duìliè shōují wúfǎ zhèngcháng chǔlǐ de xiāoxī yǐbiàn hòuxù fēnxī.",
      "sentence_fr": "Les files d'attente de lettres mortes collectent les messages non traitables pour une analyse ultérieure.",
      "sentence_en": "Dead letter queues collect messages that cannot be processed normally for later analysis.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "dead_letter_queues",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "德性知识论强调智识美德在获取知识中的重要作用。",
      "sentence_pinyin": "Déxìng zhīshìlùn qiángdiào zhìshì měidé zài huòqǔ zhīshì zhōng de zhòngyào zuòyòng.",
      "sentence_fr": "L'épistémologie des vertus souligne le rôle important des vertus intellectuelles dans l'acquisition de la connaissance.",
      "sentence_en": "Virtue epistemology emphasizes the important role of intellectual virtues in knowledge acquisition.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "virtue_epistemology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "模型版本控制追踪机器学习模型的训练历史和性能。",
      "sentence_pinyin": "Móxíng bǎnběn kòngzhì zhuīzōng jīqì xuéxí móxíng de xùnliàn lìshǐ hé xìngnéng.",
      "sentence_fr": "Le contrôle de version des modèles suit l'historique d'entraînement et les performances des modèles d'apprentissage automatique.",
      "sentence_en": "Model version control tracks machine learning model training history and performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "model_versioning",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "哈勃定律描述星系退行速度与距离之间的线性关系。",
      "sentence_pinyin": "Hābó dìnglǜ miáoshù xīngxì tuìxíng sùdù yǔ jùlí zhījiān de xiànxìng guānxì.",
      "sentence_fr": "La loi de Hubble décrit la relation linéaire entre la vitesse de récession des galaxies et leur distance.",
      "sentence_en": "Hubble's law describes the linear relationship between galaxy recession velocity and distance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "hubbles_law",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "多签名钱包要求多方授权才能执行交易。",
      "sentence_pinyin": "Duō qiānmíng qiánbāo yāoqiú duō fāng shòuquán cáinéng zhíxíng jiāoyì.",
      "sentence_fr": "Les portefeuilles multi-signatures nécessitent l'autorisation de plusieurs parties pour exécuter des transactions.",
      "sentence_en": "Multi-signature wallets require authorization from multiple parties to execute transactions.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "multisig_wallets",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "幂等消费者确保重复消息不会导致重复处理效果。",
      "sentence_pinyin": "Mìděng xiāofèizhě quèbǎo chóngfù xiāoxī bù huì dǎozhì chóngfù chǔlǐ xiàoguǒ.",
      "sentence_fr": "Les consommateurs idempotents garantissent que les messages en double ne causent pas d'effets de traitement répétés.",
      "sentence_en": "Idempotent consumers ensure duplicate messages do not cause repeated processing effects.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "idempotent_consumers",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "社会知识论研究社会因素如何影响知识的产生和传播。",
      "sentence_pinyin": "Shèhuì zhīshìlùn yánjiū shèhuì yīnsù rúhé yǐngxiǎng zhīshì de chǎnshēng hé chuánbò.",
      "sentence_fr": "L'épistémologie sociale étudie comment les facteurs sociaux influencent la production et la diffusion de la connaissance.",
      "sentence_en": "Social epistemology studies how social factors influence knowledge production and dissemination.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "social_epistemology",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "实验追踪系统记录模型训练的超参数和结果指标。",
      "sentence_pinyin": "Shíyàn zhuīzōng xìtǒng jìlù móxíng xùnliàn de chāo cānshù hé jiéguǒ zhǐbiāo.",
      "sentence_fr": "Les systèmes de suivi des expériences enregistrent les hyperparamètres et les métriques de résultats de l'entraînement des modèles.",
      "sentence_en": "Experiment tracking systems record hyperparameters and result metrics from model training.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "experiment_tracking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
