{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "恒星核合成过程在恒星内部产生比氦更重的元素。",
      "sentence_pinyin": "Héngxīng hé héchéng guòchéng zài héngxīng nèibù chǎnshēng bǐ hài gèng zhòng de yuánsù.",
      "sentence_fr": "Le processus de nucléosynthèse stellaire produit des éléments plus lourds que l'hélium à l'intérieur des étoiles.",
      "sentence_en": "The stellar nucleosynthesis process produces elements heavier than helium inside stars.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "stellar_nucleosynthesis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "中央银行通过公开市场操作调节货币供应量和利率。",
      "sentence_pinyin": "Zhōngyāng yínháng tōngguò gōngkāi shìchǎng cāozuò tiáojié huòbì gōngyìngliàng hé lìlǜ.",
      "sentence_fr": "Les banques centrales régulent la masse monétaire et les taux d'intérêt par des opérations d'open market.",
      "sentence_en": "Central banks regulate the money supply and interest rates through open market operations.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "central_banking",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "基础设施即代码将系统配置自动化并实现版本控制。",
      "sentence_pinyin": "Jīchǔ shèshī jí dàimǎ jiāng xìtǒng pèizhì zìdònghuà bìng shíxiàn bǎnběn kòngzhì.",
      "sentence_fr": "L'infrastructure en tant que code automatise la configuration des systèmes et permet le contrôle de version.",
      "sentence_en": "Infrastructure as code automates system configuration and enables version control.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "infrastructure_as_code",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "二元论主张心灵和身体是两种不同本质的实体。",
      "sentence_pinyin": "Èryuánlùn zhǔzhāng xīnlíng hé shēntǐ shì liǎng zhǒng bùtóng běnzhì de shítǐ.",
      "sentence_fr": "Le dualisme soutient que l'esprit et le corps sont deux entités de nature différente.",
      "sentence_en": "Dualism maintains that mind and body are two entities of different natures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "mind_body_dualism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无服务器计算让开发者专注于代码而无需管理基础设施。",
      "sentence_pinyin": "Wú fúwùqì jìsuàn ràng kāifāzhě zhuānzhù yú dàimǎ ér wúxū guǎnlǐ jīchǔ shèshī.",
      "sentence_fr": "L'informatique sans serveur permet aux développeurs de se concentrer sur le code sans gérer l'infrastructure.",
      "sentence_en": "Serverless computing allows developers to focus on code without managing infrastructure.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "serverless_computing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "行星形成理论解释原行星盘中尘埃和气体如何聚集成行星。",
      "sentence_pinyin": "Xíngxīng xíngchéng lǐlùn jiěshì yuán xíngxīng pán zhōng chéntǔ hé qìtǐ rúhé jùjí chéng xíngxīng.",
      "sentence_fr": "La théorie de la formation planétaire explique comment la poussière et le gaz dans le disque protoplanétaire s'agrègent pour former des planètes.",
      "sentence_en": "Planetary formation theory explains how dust and gas in the protoplanetary disk aggregate into planets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "planetary_formation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "巴塞尔协议为国际银行业建立了统一的资本监管标准。",
      "sentence_pinyin": "Bāsài'ěr xiéyì wèi guójì yínhángyè jiànlì le tǒngyī de zīběn jiānguǎn biāozhǔn.",
      "sentence_fr": "Les accords de Bâle établissent des normes réglementaires de capital uniformes pour le secteur bancaire international.",
      "sentence_en": "The Basel Accords establish uniform capital regulatory standards for international banking.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "basel_accords",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "持续部署自动化将经过测试的代码变更推送到生产环境。",
      "sentence_pinyin": "Chíxù bùshǔ zìdònghuà jiāng jīngguò cèshì de dàimǎ biàngēng tuīsòng dào shēngchǎn huánjìng.",
      "sentence_fr": "Le déploiement continu automatisé pousse les modifications de code testées vers l'environnement de production.",
      "sentence_en": "Continuous deployment automatically pushes tested code changes to the production environment.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "continuous_deployment",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "功能主义将心理状态定义为其因果作用而非内在本质。",
      "sentence_pinyin": "Gōngnéng zhǔyì jiāng xīnlǐ zhuàngtài dìngyì wéi qí yīnguǒ zuòyòng ér fēi nèizài běnzhì.",
      "sentence_fr": "Le fonctionnalisme définit les états mentaux par leurs rôles causaux plutôt que par leur nature intrinsèque.",
      "sentence_en": "Functionalism defines mental states by their causal roles rather than their intrinsic nature.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "functionalism_philosophy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "应用程序性能监控追踪软件系统的响应时间和资源消耗。",
      "sentence_pinyin": "Yìngyòng chéngxù xìngnéng jiānkòng zhuīzōng ruǎnjiàn xìtǒng de xiǎngyìng shíjiān hé zīyuán xiāohào.",
      "sentence_fr": "La surveillance des performances applicatives suit les temps de réponse et la consommation de ressources des systèmes logiciels.",
      "sentence_en": "Application performance monitoring tracks software system response times and resource consumption.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "application_monitoring",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "潮汐加热是木星卫星地质活动的主要能量来源之一。",
      "sentence_pinyin": "Cháoxī jiārè shì mùxīng wèixīng dìzhì huódòng de zhǔyào néngliàng láiyuán zhī yī.",
      "sentence_fr": "Le chauffage par effet de marée est l'une des principales sources d'énergie de l'activité géologique des lunes de Jupiter.",
      "sentence_en": "Tidal heating is one of the main energy sources for geological activity of Jupiter's moons.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "tidal_heating",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "金融传染效应描述危机如何从一个市场蔓延到其他市场。",
      "sentence_pinyin": "Jīnróng chuánrǎn xiàoyìng miáoshù wéijī rúhé cóng yī gè shìchǎng mànyán dào qítā shìchǎng.",
      "sentence_fr": "L'effet de contagion financière décrit comment les crises se propagent d'un marché à d'autres marchés.",
      "sentence_en": "Financial contagion effects describe how crises spread from one market to other markets.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "financial_contagion",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "混沌工程通过主动引入故障来测试系统的弹性和恢复能力。",
      "sentence_pinyin": "Hùndùn gōngchéng tōngguò zhǔdòng yǐnrù gùzhàng lái cèshì xìtǒng de tánxìng hé huīfù nénglì.",
      "sentence_fr": "L'ingénierie du chaos teste la résilience et la capacité de récupération des systèmes en introduisant activement des pannes.",
      "sentence_en": "Chaos engineering tests system resilience and recovery capabilities by actively introducing failures.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "chaos_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "消除主义认为常识心理学概念最终将被神经科学取代。",
      "sentence_pinyin": "Xiāochú zhǔyì rènwéi chángshì xīnlǐxué gàiniàn zuìzhōng jiāng bèi shénjīng kēxué qǔdài.",
      "sentence_fr": "L'éliminativisme soutient que les concepts de la psychologie populaire seront finalement remplacés par les neurosciences.",
      "sentence_en": "Eliminativism holds that folk psychology concepts will eventually be replaced by neuroscience.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "eliminative_materialism",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "站点可靠性工程将软件工程方法应用于运维问题解决。",
      "sentence_pinyin": "Zhàndiǎn kěkàoxìng gōngchéng jiāng ruǎnjiàn gōngchéng fāngfǎ yìngyòng yú yùnwéi wèntí jiějué.",
      "sentence_fr": "L'ingénierie de la fiabilité des sites applique les méthodes d'ingénierie logicielle à la résolution des problèmes opérationnels.",
      "sentence_en": "Site reliability engineering applies software engineering methods to operations problem-solving.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "site_reliability_engineering",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "太阳系形成于约四十六亿年前的分子云坍缩过程。",
      "sentence_pinyin": "Tàiyángxì xíngchéng yú yuē sìshíliù yì nián qián de fēnzǐyún tāntā guòchéng.",
      "sentence_fr": "Le système solaire s'est formé lors de l'effondrement d'un nuage moléculaire il y a environ 4,6 milliards d'années.",
      "sentence_en": "The solar system formed from the collapse of a molecular cloud about 4.6 billion years ago.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "solar_system_formation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "主权债务危机可能引发政府违约和国际金融市场动荡。",
      "sentence_pinyin": "Zhǔquán zhàiwù wéijī kěnéng yǐnfā zhèngfǔ wéiyuē hé guójì jīnróng shìchǎng dòngdàng.",
      "sentence_fr": "Les crises de dette souveraine peuvent déclencher des défauts gouvernementaux et des turbulences sur les marchés financiers internationaux.",
      "sentence_en": "Sovereign debt crises can trigger government defaults and international financial market turbulence.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "sovereign_debt_crisis",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "日志聚合平台集中收集分析来自多个系统的日志数据。",
      "sentence_pinyin": "Rìzhì jùhé píngtái jízhōng shōují fēnxī láizì duō gè xìtǒng de rìzhì shùjù.",
      "sentence_fr": "Les plateformes d'agrégation de journaux centralisent la collecte et l'analyse des données de journal provenant de plusieurs systèmes.",
      "sentence_en": "Log aggregation platforms centrally collect and analyze log data from multiple systems.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "log_aggregation",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "意向性是指心理状态指向或关于某物的特性。",
      "sentence_pinyin": "Yìxiàngxìng shì zhǐ xīnlǐ zhuàngtài zhǐxiàng huò guānyú mǒu wù de tèxìng.",
      "sentence_fr": "L'intentionnalité fait référence à la propriété des états mentaux d'être dirigés vers ou au sujet de quelque chose.",
      "sentence_en": "Intentionality refers to the property of mental states being directed at or about something.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "intentionality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "负载均衡器将网络流量分配到多个服务器以优化性能。",
      "sentence_pinyin": "Fùzài jūnhéngqì jiāng wǎngluò liúliàng fēnpèi dào duō gè fúwùqì yǐ yōuhuà xìngnéng.",
      "sentence_fr": "Les équilibreurs de charge distribuent le trafic réseau sur plusieurs serveurs pour optimiser les performances.",
      "sentence_en": "Load balancers distribute network traffic across multiple servers to optimize performance.",
      "audio_url_male": null,
      "difficulty": "intermediate",
      "category": "load_balancing",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
