{
  "sentences_examples": [
    {
      "id": "",
      "sentence_zh": "全息原理表明三维空间的信息可以编码在二维边界上。",
      "sentence_pinyin": "Quánxī yuánlǐ biǎomíng sān wéi kōngjiān de xìnxī kěyǐ biānmǎ zài èr wéi biānjiè shàng.",
      "sentence_fr": "Le principe holographique indique que l'information d'un espace tridimensionnel peut être encodée sur une frontière bidimensionnelle.",
      "sentence_en": "The holographic principle indicates that information in three-dimensional space can be encoded on a two-dimensional boundary.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "holographic_principle",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "群签名允许组成员代表群体匿名签署消息。",
      "sentence_pinyin": "Qún qiānmíng yǔnxǔ zǔ chéngyuán dàibiǎo qúntǐ nìmíng qiānshǔ xiāoxī.",
      "sentence_fr": "Les signatures de groupe permettent aux membres d'un groupe de signer des messages de manière anonyme au nom du groupe.",
      "sentence_en": "Group signatures allow group members to anonymously sign messages on behalf of the group.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "group_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高阶类型允许类型构造器本身作为参数传递和返回。",
      "sentence_pinyin": "Gāojiē lèixíng yǔnxǔ lèixíng gòuzàoqì běnshēn zuòwéi cānshù chuándì hé fǎnhuí.",
      "sentence_fr": "Les types d'ordre supérieur permettent aux constructeurs de types eux-mêmes d'être passés et retournés comme arguments.",
      "sentence_en": "Higher-kinded types allow type constructors themselves to be passed and returned as arguments.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "higher_kinded_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "极限和余极限是范畴论中构造通用对象的基本工具。",
      "sentence_pinyin": "Jíxiàn hé yú jíxiàn shì fànchóulùn zhōng gòuzào tōngyòng duìxiàng de jīběn gōngjù.",
      "sentence_fr": "Les limites et colimites sont des outils fondamentaux pour construire des objets universels en théorie des catégories.",
      "sentence_en": "Limits and colimits are fundamental tools for constructing universal objects in category theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "limits_colimits",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "量子比特纠缠态是量子通信和量子计算的核心资源。",
      "sentence_pinyin": "Liàngzǐ bǐtè jiūchán tài shì liàngzǐ tōngxìn hé liàngzǐ jìsuàn de héxīn zīyuán.",
      "sentence_fr": "Les états intriqués de qubits sont des ressources essentielles pour la communication et l'informatique quantiques.",
      "sentence_en": "Entangled qubit states are core resources for quantum communication and quantum computing.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "qubit_entanglement",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "环签名使签名者能够在一组可能签名者中保持匿名。",
      "sentence_pinyin": "Huán qiānmíng shǐ qiānmíngzhě nénggòu zài yī zǔ kěnéng qiānmíngzhě zhōng bǎochí nìmíng.",
      "sentence_fr": "Les signatures en anneau permettent au signataire de rester anonyme parmi un ensemble de signataires possibles.",
      "sentence_en": "Ring signatures enable signers to remain anonymous among a set of possible signers.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ring_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "效果系统在类型层面追踪程序可能产生的计算效果。",
      "sentence_pinyin": "Xiàoguǒ xìtǒng zài lèixíng céngmiàn zhuīzōng chéngxù kěnéng chǎnshēng de jìsuàn xiàoguǒ.",
      "sentence_fr": "Les systèmes d'effets suivent au niveau des types les effets de calcul qu'un programme peut produire.",
      "sentence_en": "Effect systems track at the type level the computational effects a program may produce.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "effect_systems",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "层叠范畴论在更高抽象层次研究范畴之间的范畴。",
      "sentence_pinyin": "Céngdié fànchóulùn zài gèng gāo chōuxiàng céngcì yánjiū fànchóu zhījiān de fànchóu.",
      "sentence_fr": "La théorie des catégories enrichies étudie les catégories entre catégories à un niveau d'abstraction plus élevé.",
      "sentence_en": "Enriched category theory studies categories of categories at a higher level of abstraction.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "enriched_category_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "AdS/CFT对偶将反德西特空间的引力理论与共形场论联系起来。",
      "sentence_pinyin": "AdS/CFT duìǒu jiāng fǎn Désīdé kōngjiān de yǐnlì lǐlùn yǔ gòngxíng chǎnglùn liánxì qǐlái.",
      "sentence_fr": "La dualité AdS/CFT relie les théories gravitationnelles dans l'espace anti-de Sitter aux théories conformes des champs.",
      "sentence_en": "AdS/CFT duality connects gravitational theories in anti-de Sitter space with conformal field theories.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "ads_cft_duality",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "阈值签名要求预定数量的参与者合作才能生成有效签名。",
      "sentence_pinyin": "Yùzhí qiānmíng yāoqiú yùdìng shùliàng de cānyùzhě hézuò cáinéng shēngchéng yǒuxiào qiānmíng.",
      "sentence_fr": "Les signatures à seuil exigent qu'un nombre prédéfini de participants coopèrent pour générer une signature valide.",
      "sentence_en": "Threshold signatures require a predetermined number of participants to cooperate to generate a valid signature.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "threshold_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "代数效果提供了一种模块化处理程序副作用的理论框架。",
      "sentence_pinyin": "Dàishù xiàoguǒ tígōng le yī zhǒng mókuàihuà chǔlǐ chéngxù fùzuòyòng de lǐlùn kuàngjià.",
      "sentence_fr": "Les effets algébriques fournissent un cadre théorique modulaire pour traiter les effets de bord des programmes.",
      "sentence_en": "Algebraic effects provide a modular theoretical framework for handling program side effects.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "algebraic_effects",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "拓扑斯理论统一了逻辑几何和集合论的范畴论观点。",
      "sentence_pinyin": "Tuòpūsī lǐlùn tǒngyī le luójí jǐhé hé jíhélùn de fànchóulùn guāndiǎn.",
      "sentence_fr": "La théorie des topos unifie les perspectives catégorielles de la logique, de la géométrie et de la théorie des ensembles.",
      "sentence_en": "Topos theory unifies categorical perspectives of logic, geometry, and set theory.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "topos_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "彭罗斯过程理论描述从旋转黑洞提取能量的机制。",
      "sentence_pinyin": "Péngluòsī guòchéng lǐlùn miáoshù cóng xuánzhuǎn hēidòng tíqǔ néngliàng de jīzhì.",
      "sentence_fr": "Le processus de Penrose décrit le mécanisme d'extraction d'énergie des trous noirs en rotation.",
      "sentence_en": "The Penrose process describes the mechanism of extracting energy from rotating black holes.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "penrose_process",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "不可否认签名允许签名者在争议时证明或否认签名的有效性。",
      "sentence_pinyin": "Bùkě fǒurèn qiānmíng yǔnxǔ qiānmíngzhě zài zhēngyì shí zhèngmíng huò fǒurèn qiānmíng de yǒuxiàoxìng.",
      "sentence_fr": "Les signatures non répudiables permettent au signataire de prouver ou nier la validité d'une signature en cas de litige.",
      "sentence_en": "Undeniable signatures allow signers to prove or deny signature validity in case of dispute.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "undeniable_signatures",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "存在类型允许封装实现细节同时暴露抽象接口。",
      "sentence_pinyin": "Cúnzài lèixíng yǔnxǔ fēngzhuāng shíxiàn xìjié tóngshí bàolù chōuxiàng jiēkǒu.",
      "sentence_fr": "Les types existentiels permettent d'encapsuler les détails d'implémentation tout en exposant des interfaces abstraites.",
      "sentence_en": "Existential types allow encapsulating implementation details while exposing abstract interfaces.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "existential_types",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "无穷范畴论将范畴推广到具有高阶态射的结构。",
      "sentence_pinyin": "Wúqióng fànchóulùn jiāng fànchóu tuīguǎng dào jùyǒu gāojiē tàishè de jiégòu.",
      "sentence_fr": "La théorie des catégories infinies généralise les catégories aux structures avec des morphismes d'ordre supérieur.",
      "sentence_en": "Infinity category theory generalizes categories to structures with higher-order morphisms.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "infinity_categories",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "霍金贝肯斯坦熵将黑洞熵与视界面积成正比联系起来。",
      "sentence_pinyin": "Huòjīn Bèikěnsītǎn shāng jiāng hēidòng shāng yǔ shìjiè miànjī chéng zhèngbǐ liánxì qǐlái.",
      "sentence_fr": "L'entropie de Bekenstein-Hawking relie l'entropie des trous noirs proportionnellement à l'aire de l'horizon.",
      "sentence_en": "Bekenstein-Hawking entropy relates black hole entropy proportionally to horizon area.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "bekenstein_hawking_entropy",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "承诺方案允许提交一个值同时保持其隐藏直到稍后揭示。",
      "sentence_pinyin": "Chéngnuò fāng'àn yǔnxǔ tíjiāo yī gè zhí tóngshí bǎochí qí yǐncáng zhídào shāo hòu jiēshì.",
      "sentence_fr": "Les schémas d'engagement permettent de soumettre une valeur tout en la gardant cachée jusqu'à sa révélation ultérieure.",
      "sentence_en": "Commitment schemes allow submitting a value while keeping it hidden until later revelation.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "commitment_schemes",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "全称类型和存在类型分别对应于依赖乘积和依赖和类型。",
      "sentence_pinyin": "Quánchēng lèixíng hé cúnzài lèixíng fēnbié duìyìng yú yīlài chéngji hé yīlài hé lèixíng.",
      "sentence_fr": "Les types universels et existentiels correspondent respectivement aux types de produit dépendant et de somme dépendante.",
      "sentence_en": "Universal and existential types correspond respectively to dependent product and dependent sum types.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "dependent_type_theory",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    },
    {
      "id": "",
      "sentence_zh": "高维代数研究多个方向上具有态射的代数结构。",
      "sentence_pinyin": "Gāo wéi dàishù yánjiū duō gè fāngxiàng shàng jùyǒu tàishè de dàishù jiégòu.",
      "sentence_fr": "L'algèbre supérieure étudie les structures algébriques avec des morphismes dans plusieurs directions.",
      "sentence_en": "Higher algebra studies algebraic structures with morphisms in multiple directions.",
      "audio_url_male": null,
      "difficulty": "advanced",
      "category": "higher_algebra",
      "created_at": "2025-11-21T10:00:00.000Z",
      "updated_at": "2025-11-21T10:00:00.000Z"
    }
  ]
}
